{"imDbId":"tt0099685","title":"Goodfellas","fullTitle":"Goodfellas (1990)","type":"Movie","year":"1990","items":[{"username":"TheLittleSongbird","userUrl":"https://www.imdb.com/user/ur20552756","reviewLink":"https://www.imdb.com/review/rw2366500","warningSpoilers":false,"date":"9 January 2011","rate":"10","helpful":"30 out of 41 found this helpful.","title":"A great director at the peak of his talents","content":"It is hard to describe the brilliance that is Goodfellas. As good as Raging Bull and Taxi Driver are, I think Goodfellas is Martin Scorsese's best film and is a textbook example of a great director at the peak of his talents. The film crackles with raw energy and enthusiasm, the film is superbly directed and the final sequence is nothing short of stunning. The script is also excellent with memorable quotes, the story is never less than compelling and the pop and rock soundtrack is winning. The cinematography and detail is immaculate, and the ensemble cast is one of film's finest. Joe Pesci won an Oscar for his performance, and as good as he was, he is perfectly matched by Robert DeNiro and Ray Liotta. All in all, it is a brilliant film and an instant classic no matter what time, day, week or year. 10/10 Bethany Cox"},{"username":"bkoganbing","userUrl":"https://www.imdb.com/user/ur2483625","reviewLink":"https://www.imdb.com/review/rw1599619","warningSpoilers":false,"date":"15 February 2007","rate":"9","helpful":"10 out of 14 found this helpful.","title":"The Criminal Mindset","content":"The gangster film has been redefined so many times in cinema history it will be interesting to see how it is redefined once again. Goodfellas is a milestone film in that regard because just as Public Enemy and Little Caesar defined it in the Thirties, The Godfather trilogy in the seventies and eighties, Goodfellas set the standard that all other films including Martin Scorsese similar Casino try to meet. The interesting thing is that Martin Scorsese is young enough to redefine it again with another work.With Ray Liotta narrating his own life in crime in a flashback as real life criminal Henry Hill, Martin Scorsese offers us one fascinating glimpse of the criminal life in the Eisenhower to Reagan era. Henry Hill even as a child got sucked into the criminal life as a kid, as he said all he ever wanted to be was a gangster. Tutored by both Robert DeNiro and Paul Sorvino, Liotta takes part in one of the biggest heists of all time of Lufthansa Airlines at JFK Airport during the seventies. Goodfellas is the story of the events from Henry Hill's perspective leading up to the heist and the aftermath.For myself I've never seen the gangster mentality better expressed on screen except maybe by Sean Connery in Family Business. Liotta and Connery operate from the same mindset. If you work hard and hope it pays off in success, you're a dope. If you want something, just take it. When you come right down to it, that's how criminals think, it's the rest of us who are fools.Goodfellas was nominated for several Oscars, but came away with only one winner, Joe Pesci in the role of crazy Tommy DeVito. He's another criminal type, one who's driven by a terrible inferiority complex due to his short stature and does terrible things even to his own peers. And those peers don't forget as you see what happens to Pesci in Goodfellas. This turned out to be a career role for Pesci. He's a multi-talented man who's got an incredible range and can play everything from the Home Alone comedies to stone killers like here in Goodfellas or in Casino.There's usually a contest in which Scorsese fans argue whether Casino or Goodfellas is better. I happen to like Casino, but without the success of Goodfellas, Casino would not have been made.For a fascinating look at the criminal mindset, Goodfellas is an absolute must."},{"username":"Leofwine_draca","userUrl":"https://www.imdb.com/user/ur0482513","reviewLink":"https://www.imdb.com/review/rw3510741","warningSpoilers":true,"date":"24 July 2016","rate":"10","helpful":"8 out of 11 found this helpful.","title":"Scorsese's masterpiece stands the test of time","content":"Martin Scorsese's unflinching portrayal of life in the mafia is a rightly acclaimed epic, at times funny, depressing but most of all frightening, all the more so because it's based on a true story. Basically it's the story of Ray Liotta's character's rise and fall in the mafia, and the way his relationships change with the various figures there as times come and go.The acting is what makes this film so engaging, and Ray Liotta excels as the bright young man who eventually becomes a drug addict. His transformation is brilliant as he ages thirty years and the acting choice couldn't have been better. Robert De Niro is on hand to deliver some real class to the proceedings too, and he's as good as he ever was as the seemingly nice but deadly Jimmy. However Joe Pesci steals the overacting awards with his portrayal of the foul-mouthed psychotic Tommy, who spends the film shooting and beating those who offend him. Pesci is both funny and frightening as a maniac who doesn't think twice about killing people, and his kinetic performance bursts off the screen in a blaze of fury. The rest of the cast, including Liotta's wife and Paul Sorvino, also put in well-judged and realistic performances.While some people may be put off by the long running length, this is engrossing viewing, as the film charts the various gruesome demises of unfortunate characters (the opening body in the boot being a standout in sheer brutality), Liotta's growing paranoia (the helicopter scenes are memorable) and eventual capture, and the characters' changing loyalties. GOODFELLAS was really the final word about gangster life, at least until CASINO came along."},{"username":"Michael_Elliott","userUrl":"https://www.imdb.com/user/ur13134536","reviewLink":"https://www.imdb.com/review/rw1834962","warningSpoilers":false,"date":"7 March 2008","rate":"","helpful":"16 out of 26 found this helpful.","title":"A Masterpiece That Gets Better With Each New Viewing","content":"Goodfellas (1990) **** (out of 4) Martin Scorsese's masterpiece about Henry Hill (Ray Liotta), a man who grew up hoping to be in the mob and he got his but crime does not pay as the old saying goes. GOODFELLAS has been called one of the greatest mob movies ever made and it's been called the best film of the 90s as well as one of the greatest films ever made. It certainly goes on my list as one of the greatest movies ever made and each time I view the thing I can't help but be amazed at the brilliance on screen. It's really does seem as if this isn't a movie because the thing is so perfect in every way that it's almost hard to believe that it's real. Even though everything in this movie is great there's no doubt that every ounce of credit belongs to Scorsese.There have been wonderful crime pictures going all the way back to the silent days so the director was behind the eight ball but instead of just delivering a great movie he instead goes all out and really creates a film unlike anything we've ever seen before. The way he films the violence, shows the good times and the bad times. Everything is so flawless that you really do forget that you're watching a movie because it comes off like you're a fly on the wall witnessing all of this stuff first hand. There's the now legendary camera shot going through the restaurant, there's the terrific music score and of course the violence that really shakes you. One could argue that we've seen this type of story countless times but it's so fresh here that you can't help but feel as if you're seeing it for the first time.There are so many brilliant moments here but special credit has to go to the final twenty-minutes or so when Hill finally starts to crack due to all the drugs. The fast-paced nature of this sequence is among the most perfect filming you're ever going to see because by the time it's over you're going to think that you too are high on drugs. Another amazing thing that Scorsese does is get you into the events in these people's lives. The good times early on are so much fun that you can see why someone would select to be in the lifestyle. The camera doesn't shy away from capturing these moments including the high times in the nightclubs with the women and the money. However, Scorsese also nails the downside when everything starts to crumble and the violence is so shocking and brutal that you then realize that this lifestyle only ends one way and you're thankful that you're not involved in it.Another major plus are of course the performances. Liotta is perfect in the role of Hill and especially when you consider he must carry the film over the more famous actors. I thought Liotta perfectly nailed not only the young, energetic Hill but he really pulled off the drug-crazed maniac. DeNiro, as usual, is also terrific in his part as he brings so much fire and energy to the character and can cause you to fear him with just a look. Joe Pesci deserves his Best Supporting Actor Oscar as there's no doubt that he delivers one of the finest villain roles in the history of film. Lorraine Bracco and Paul Sorvino are also impressive as are the rest of the supporting players even down to the bit parts.GOODFELLAS is without question one of the greatest films ever made and like all classics it's a movie that keeps getting better each passing year. Scorsese has made many great films in his career and this here is certainly among his best."},{"username":"SnoopyStyle","userUrl":"https://www.imdb.com/user/ur2898520","reviewLink":"https://www.imdb.com/review/rw2930719","warningSpoilers":false,"date":"29 December 2013","rate":"10","helpful":"5 out of 8 found this helpful.","title":"This is an American Classic","content":"Henry Hill (Ray Liotta) worked for Italian mobsters as a kid. He would climb the ladder as he becomes a big time gangster with his friends Tommy DeVito (Joe Pesci) and James Conway (Robert De Niro). Director Martin Scorsese brings the Nicholas Pileggi book 'Wiseguy' alive.For an American gangster movie, there is none better than the great acting in this classic. There is no more iconic performance than Joe Pesci. \"What do you mean I'm funny?\" Robert De Niro is only the third most outrageous performer. Even the constant Ray Liotta narration worked perfectly, and I'm not usually a fan of narrations. Scorsese is a true master. The steady cam entry into Copacabana is first rate. (I know they made a big loop around the kitchen.) And this movie starts a bang, literally."},{"username":"Hitchcoc","userUrl":"https://www.imdb.com/user/ur0278527","reviewLink":"https://www.imdb.com/review/rw2242971","warningSpoilers":false,"date":"30 April 2010","rate":"10","helpful":"6 out of 9 found this helpful.","title":"A Real Portrayal of All That Is Bad","content":"I generally back away from gangster films. It's not my favorite genre. I have trouble with the aggrandizement of this amoral subcult. This, however, is a masterpiece. It's almost documentary in its portrayal of this society of evil. Martin Scorsese has assembled the cream of the crop of actors who have cut their teeth on the successors of the Godfather. I can't begin to do justice to all the actors in this film. What I can attest to is the danger that lurks in every scene. In one scene the hard wired character played by Joe Pesci (marvelous and crazy) shoot a guy named \"Spider\" for not getting him the right drink. The rest of the men must sit there, without compassion, because this is a normal day, with \"normal\" events. There is also the second group. The wives and the families who are stuck in the middle of all this, pretending their husbands work nine-to-five jobs, while they are out hitting people. Ultimately, there is Robert de Niro who is the craziest of all. Played with subtle control, he dominates every scene. This is a true masterpiece that's hard to watch."},{"username":"bob the moo","userUrl":"https://www.imdb.com/user/ur1002035","reviewLink":"https://www.imdb.com/review/rw0282420","warningSpoilers":false,"date":"30 January 2002","rate":"","helpful":"23 out of 37 found this helpful.","title":"Classic modern day gangster film","content":"Starting with the 1950's, we follow Henry Hill from a teen who tries to realise his dream of `always wanting to be a gangster'. He goes from running errands for Paulie Cicero to become a trusted man within his organisation. Working with James Conway and Tommy De Vito, Henry navigates his violent lifestyle where death is never more than a few steps away.For my generation this was one of our first introductions to Scorsese doing a real tour-de-force of a film - I was too young to appreciate Raging Bull and his 70's work when it first came out and the eighties were a quiet period (except the brilliant king of comedy). So here was a great introduction to a fanatastic director. The plot is spread over such a long time (in terms of story years) that it's hard to get beneath the surface events, but this is a very minor problem given that it's such a great ride. The focus is on events and the culture rather than a deep story and as such Scorsese works with set pieces and events rather than too much characterisation. However the story moves so effectively through the action - Scorsese uses long tracking shots, pumping soundtracks and scenes of building tension and sudden violence to create a masterful experience.The weakness with lack of depth is really put to the back of your mind by the action, the direction and the performances. The story is well held together by Hill's narrative and the shallowness is easily over looked. Liotta is excellent as the aspiring gangster and is full of self seeking menace. De Niro does what he does best in terms of the Irish gangster role but the standout is Pesci. Pesci gives a strong role as the vicious Tommy and deserved his Oscar. The rest of the cast are all excellent whether it's major roles (Paul Sorvino, Lorraine Bracco) or minor characters (Frank Vincent, Sivero).The real star here is Scorsese - he uses the camera and the soundtrack to great effect and gets great performances from his cast. A modern gangster feast."},{"username":"kosmasp","userUrl":"https://www.imdb.com/user/ur5876717","reviewLink":"https://www.imdb.com/review/rw5767138","warningSpoilers":false,"date":"24 May 2020","rate":"10","helpful":"4 out of 5 found this helpful.","title":"Bad Fellas","content":"I re-watched this right before I watched the Irishman, kind of made this a double bill. And while I was aware of how great this is, it is always worth revisiting. What a great movie (based on true events and characters - not a bad thing) this is! Awesome performances all around and a story that is quite engaging. Crime does not pay in the end ... could be one of the messages.It is mesmerizing and you can understand why people are fascinated by it of course. But we get to see quite the brutal and violent face of it. Joe Pesci and his very (in)famous \"You think I'm funny\" scene is something to behold. Dangerous and funny - if you'll excuse the pun.Ray Liotta and De Niro doing their thing and reeling the audience in. I thought I was out, and they get me back in, to paraphrase another famous actor not involved in this. As crime movies go, you can argue this being the best. If not quite up there though ... and the message is clear, even if heightened."},{"username":"classicsoncall","userUrl":"https://www.imdb.com/user/ur2707735","reviewLink":"https://www.imdb.com/review/rw2483508","warningSpoilers":true,"date":"3 September 2011","rate":"9","helpful":"5 out of 9 found this helpful.","title":"\"The way I saw it, everybody takes a beating sometime\".","content":"The first time I saw \"Goodfellas\", I didn't realize it was based on the Nichlas Pileggi book 'Wiseguy'. A lot of stuff seemed so familiar, and of course, the name Henry Hill was the tip-off, a non-Italian in the world of Mafioso high rollers and hit men. I read the book shortly after it came out, and the movie seemed to come out very quickly after. I don't remember a whole lot about the book now, but some of the things that stand out are the Air France job, the Lufthansa heist, and that bit about feeding a guy to a lion. Oh yeah, and the burial, exhumation and reburial of Billy Batts. You have to admit, \"Goodfellas\" has the best ba-da-bing opening of all time when Tommy (Joe Pesci) goes berserk on Batts in the car trunk and just keeps wailing.I've read a few of the other comments in the reviews section for this picture, and can only chuckle at a few of the naive posters who think that what happens on screen here is forced and not very believable. I can only surmise that they didn't grow up in New York or it's suburb environs, because mob rub-outs were a staple on the front pages of the New York Daily News and The Post throughout the Sixties. Usually they more closely resembled Michael Corleone's first hit in the Italian restaurant in \"The Godfather\", but nevertheless, this kind of brutality did occur. Although I have to say, the way Tommy whacked Michael Imperioli was a little over the top.I guess the most memorable scene in the movie for me was Pesci giving Ray Liotta the business in that 'who's funny' routine. For first time viewers, you're not really sure where Tommy's going to take things because he's such a loose cannon. Then suddenly, Pesci calls himself on it, and you know full well he was playing around with the new kid. The character Pesci was portraying, real life mobster Tommy DeSimone, was in fact a young aspiring gangster with psychopathic tendencies specializing in truck hijacking and stolen goods.So for those who think \"Goodfellas\" is the best gangster flick ever, fair enough, but putting it up against the first two 'Godfathers' is a little bit of a stretch for my money. I also prefer the Coen Brothers' take on crime in \"Miller's Crossing\". But this one's based on a true story, and you can't get more real than some of the outrageous things that happened in the life of wise guy Henry Hill. For an outsider, he could be a real goombah."},{"username":"lee_eisenberg","userUrl":"https://www.imdb.com/user/ur4888011","reviewLink":"https://www.imdb.com/review/rw1182724","warningSpoilers":false,"date":"29 September 2005","rate":"10","helpful":"4 out of 7 found this helpful.","title":"How is Joe Pesci funny? Probably for the same reason that this is a masterpiece.","content":"Watching \"Goodfellas\", you certainly get the feeling that Martin Scorsese had wanted to make this movie for a long time. Thank God that he finally got to; it was probably his best movie up to that time. It shows the mafia world through the eyes of up-and-comer Henry Hill (Ray Liotta). Jimmy Conway (Robert DeNiro) is Henry's main entry point into the mafia, but Tommy DeVito (Joe Pesci) is also something else. Needless to say, there is a LOT of violence (well duh; this movie's about crime), but none of it gratuitous.You may have heard of Joe Pesci's \"How am I funny?\" speech. Let's just say that you have to see it to believe it. In fact, you have to see the whole movie to believe it. And to get a feeling of Martin Scorsese at his best."},{"username":"gavin6942","userUrl":"https://www.imdb.com/user/ur1234929","reviewLink":"https://www.imdb.com/review/rw2845510","warningSpoilers":false,"date":"6 August 2013","rate":"9","helpful":"1 out of 3 found this helpful.","title":"The Quintessential Gangster Film?","content":"Henry Hill (Ray Liotta) is a small time gangster, who takes part in a robbery with Jimmy Conway and Tommy De Vito, two other gangsters who have set their sights a bit higher. His two partners kill off everyone else involved in the robbery, and slowly start to climb up through the hierarchy of the Mob.I am impressed with how closely the film follows the book, with some lines seemingly coming across exactly. If Pileggi's book is accurate, this film is also accurate. (As an organized crime historian, I can confidently say that Pileggi's book is among the best-written accounts of mob life ever put to paper.) Some say this is Scorsese's best film. I tend to prefer \"Gangs of New York\", but this could go either way."},{"username":"jboothmillard","userUrl":"https://www.imdb.com/user/ur4248714","reviewLink":"https://www.imdb.com/review/rw1167325","warningSpoilers":true,"date":"7 September 2005","rate":"8","helpful":"1 out of 14 found this helpful.","title":"GoodFellas","content":"Certainly it deserves five out of five stars, and certainly it is probably the most popular film from BAFTA winning, and Oscar and Golden Globe nominated director Martin Scorsese. Based on a true story, Henry Hill (Ray Liotta) admits (with narration) he always wanted to be a gangster ever since he could remember, so he started hanging out with the crime family gangsters in his Italian neighbourhood to try and get somewhere. Soon enough the boss Paul 'Paulie' Cicero, based on Lucchese mobster Paul Cicero (Paul Sorvino) lets him help his close associate James 'Jimmy' Conway (Robert De Niro) along with young Tommy DeVito (Oscar winning Joe Pesci). As they get older they have become the most well known and ruthless gangsters with billions of dollars of cargo passing through the airport, and many heists. Because Henry and Jimmy are both Irish they cannot become a \"made man\", but Tommy can. Henry's friends become increasingly daring and dangerous, with Jimmy hijacking trucks, and Tommy with an explosive temper and psychotic violent nature. Henry in the story also meets, falls for and marries Karen (Lorraine Bracco). There are many other things I could mention in the whole story, but that'll take ages, so I'll just say that Henry and Jimmy are caught and imprisoned at one point, Tommy murders \"made man\" Stacks Edwards (a very brief Samuel L. Jackson), and when he is made one is quite quickly murdered, and in the end of the film Henry drops his gangster identity and becomes a normal \"schmuck\". Also starring Frank Sivero as Frankie Carbone, Tony Darrow as Sonny Bunz, Dumb and Dumber's Mike Starr as Frenchy, Frank Vincent as Billy Batts, Chuck Low as Morris 'Morrie' Kessler, Catherine Scorsese (Martin's real mother) as Tommy's Mother, Frank DiLeo as Tuddy Cicero, comedian Henny Youngman as himself, Gina Mastrogiacomo as Janice Rossi, Charles Scorsese (Martin's real father) as Vinnie, Suzanne Shepherd as Karen's Mother, Debi Mazar as Sandy and Michael Imperioli as Spider. Pesci is the perfect and deserved Oscar winner for his brutal, psychotics and very convincing role, De Niro and Liotta are also very good in their roles, a very good film (seeing it again)! It was nominated the Oscars for Best Film Editing, Best Writing, Screenplay Based on Material from Another Medium and Best Picture, it won the BAFTA for Best Costume Design, Best Editing, Best Adapted Screenplay and Best Film, and it was nominated for Best Cinematography, and it was nominated the Golden Globes for Best Motion Picture - Drama and Best Screenplay. Robert De Niro number 2 on The 100 Greatest Movie Stars, he was also number 50 on The 100 Greatest Pop Culture Icons, and he was number 5 (along with Al Pacino) on The World's Greatest Actor, the film was number 55 on The 100 Greatest Scary Moments for the brilliant scene where Pesci seems to be getting madder at Liotta saying \"How am I funny? (it's scary because you don't know where it's going, till Liotta realises it's a joke of course), and it was number 10 on The 100 Greatest Films. Very good!"},{"username":"rmax304823","userUrl":"https://www.imdb.com/user/ur0819382","reviewLink":"https://www.imdb.com/review/rw2649371","warningSpoilers":true,"date":"26 July 2012","rate":"8","helpful":"3 out of 5 found this helpful.","title":"Innocent To Goodfella To Schnook.","content":"A fine tribal study of modern gangsterism in New York City. There are one or two allusions to being a \"made man\" but the words \"Mafia\" and \"Cosa Nostra\" never appear, though all the main figures are Italian, observe Italian moral codes, and occasionally lapse into the language of the Old Country. If you really want to be a member of the Goodfellas, it's not enough to be simply part Italian. You need to be ALL Italian, with traceable ancestry to the motherland, preferably Sicily.Everyone except some Federal Agents are corrupt. The wives know what's going on and are often complicit, though they have little to say about business decisions. They're satisfied with the solidarity of the larger family, the special parking places, the secret entrances to the Copacabana, the respect shown themselves and their well-groomed husbands, and the general opulence of their life styles. The girl friends enjoy many of the same privileges but are mainly the subject of jokes, which wives and children are not. Well, some are Madonnas and some are whores.The cops are partners in crime, whether the gangsters are on the streets or in prison. They become your major domos for a few cartons of cigarettes and an occasional big bill tucked into a shirt pocket. Your first jail term turns into a rite of passage, and you're given a celebration before you're packed off. The men clap and cry out \"Your cherry is broke now.\" Prison itself is not a bad place if you're a wise guy. No one would dream of trying to rape you. You live with friends and share elaborate dinners and good wines with them.There are only two problems; one is interactional, the other moral and economic.As for the interactional problem, you can never really tell whether someone will become a \"rat,\" not even if you've known him all your life. From the point of view of a protagonist like Henry Hill, whose story this is, it's very bad to be a rat instead of a stand-up guy. On the other hand, it's much better to be a rat instead of a dead guy. Severe beatings are common, even for men who are no more than irritating or even for innocents like mailmen. And when an important deal is at stake, whacking is necessary.Whacking is also applied to men who unwisely insult others, because this is a culture of honor. It's like the Old West without Wyatt Earp. \"When you call me that, smile.\" And sometimes smiling isn't enough. The derision must be clearly couched. Half a couch may not do. Personal affronts call for a passionate butchery, but business transactions are cold blooded and maximally effective.This social system is real enough. In certain bars in New York and New Jersey I was unwise enough to make some joke about Mafia hangouts and received warnings. And in Little Charlie's Restaurant on Kenmare Street in Little Italy, two tables were always kept empty in case some local businessmen decided to drop in unannounced.The movie is told from Henry Hill's (Ray Liotta's) point of view and he narrates most of it. Hill was half Irish and married a Jewish girl but was accepted, within certain limitations. That brings up the moral questions built into the film. These guys are friendly and generous to each other. But who pay for all that reckless spending? You and I. The gang isn't a charitable organization. Every time we buy something or rent an apartment, it costs a little more because of them, and they contribute nothing except mutual support.It's an immoral subculture in which the goals of society -- respect, wealth, material satisfaction, friendship -- are accepted, but society's means of achieving those goals -- following the rules, upholding the law, respecting the rights of strangers -- are rejected. The sociologist Robert K. Merton called them \"innovators\" and that's what they are. They invent and follow illegal rules for achieving society's goals. From an ethical perspective, it's a much better story than Francis Ford Coppola's \"The Godfather\" series, which was an apologia for the Mafia, portrayed as a neighborhood organization that simply fills certain control functions that the regular police will or can not. No one was killed in \"The Godfather\" unless he was a coward and a traitor and deserved it. In \"Goodfellas\", a kid gets shot through the foot for being slow in delivering drinks to a table, and the incident is treated as a stupid joke. No one even TRIES justifying the act. When the same kid is later slaughtered for a resentful remark, the dead body is treated as a nuisance.The acting is unimpeachable, and so is the production design. You can almost smell the cigars, the perfume, the marinara sauce cooking in the large pot on the stove. (Everybody eats a lot in this movie.) You should definitely see it if you haven't already. It's naturalism is convincing and there is no Marlon Brando to sympathize with."},{"username":"ccthemovieman-1","userUrl":"https://www.imdb.com/user/ur4445210","reviewLink":"https://www.imdb.com/review/rw1571068","warningSpoilers":false,"date":"12 January 2007","rate":"9","helpful":"17 out of 35 found this helpful.","title":"Can A Sick Film Be A Good One, too? I Guess So.","content":"Sad to say, almost everyone I know - at least, the males - who has seen this movie likes it very much. I enjoy it, too. I say \"sad\" because it's a sick film in many ways. Also, when you have 240-plus f-words in a movie, I mean, come on! In that respect alone, I'm embarrassed to say this movie is part of my collection. That's simply because it's a fascinating story, for the full 145 minutes.This is a rough film, to say the least. It's not just the language; there are some brutally- violent parts. Joe Pesci's \"Tommy DeVito\" seems to be involved with some of the worst of that violence Supposedly, the movie is a based on a true story but how much of this is true, who knows? It certainly provides a vivid portrait of Mafia life in New York City. I really loved the narration by Ray Liotta - who doesn't? - and enjoyed the music in here. Most people comment about the music; it's a good soundtrack. Pesci, Liotta, Robert De Niro and Paul Sorvino all make for extremely interesting gangster characters. With all the language, which includes at least 15 usages of the Lord's name in vain and some subtle religious cheap shots (not surprising considering who directed the film), the gory spots this film gets a little too rough-edged at times. I've watched thousands of crime movies, and this gets to be a little much here and there but if none of the above offends you, you're in for a treat with an intense crime story that is very watchable."},{"username":"Tweekums","userUrl":"https://www.imdb.com/user/ur13977076","reviewLink":"https://www.imdb.com/review/rw5041243","warningSpoilers":false,"date":"5 August 2019","rate":"10","helpful":"4 out of 6 found this helpful.","title":"One of the great mob movies","content":"This film tells the story of Irish/Italian mobster Henry Hill; from the early days when he worked for mobsters as a teenager in the 1950s, through the sixties and seventies to his arrest in the eighties. We see the ease with which he slips into this world; the rewards and dangers it brings. During this time he works with fellow mobsters James Conway and the psychotic Tommy DeVito; he also marries Karen. While Henry isn't a killer he isn't unaware of the violent side of their business.This is often described as the greatest mob movie; I can't say that but only because there are other very well-known mob movies that I have yet to see. The story is gripping from start to finish; there are moments of humour which frequently turn to extreme danger in the blink of an eye; this is usually due to Tommy's hair-trigger temper. The violence is usually sudden and bloody; as a character points out they don't waste time talking before they waste somebody. The cast is brilliant; Joe Pesci stands out as Tommy, it is hardly surprising that he picked up an Oscar. Ray Liotta and Robert De Niro are great as Henry and James; also particularly notable are Lorraine Bracco as Karen Hill and Paul Sorvino as \"Paulie\" Cicero, the mobster Henry works for. Overall I'd say that this film is a must see for fans of the genre."},{"username":"ma-cortes","userUrl":"https://www.imdb.com/user/ur3270789","reviewLink":"https://www.imdb.com/review/rw6822000","warningSpoilers":false,"date":"17 April 2021","rate":"7","helpful":"2 out of 5 found this helpful.","title":"Violent and overlong quintaessential mobster movie competently made by Scorsese","content":"A young man, Henry Hill : Ray Liotta , grows up in the mob , he dreams only of being one , as he works hard to advance himself throughout the ranks , and enjoys the life of the rich and violent , oblivious the terror of which he is part . As he joins other powerful and violent gangsters : Robert De Niro , Paul Sorvino and Joe Pesci , the latter a frightening unpredictable hitman who only stop talking for long enough to shoot someone over often imagined insult . Meanwhile, Henry is easily cheating his wife : Lorraine Bracco with a lover : Debi Mazar . Cocaine addiction and many wiseguys misteps with maniac fits of fury resulting in death of far-reaching consequences , and ultimately unravel his climb to the top and bitter fall .This quintaessential Mafia saga about wiseguys or goodfellas at turns funny and violent , as the familiar elements of the genre are all strongly and gratingly in place . Being based on facts , in fact starring is really Henry Hill , ex-gangster now in the Witness Protection Program. Interesting and twisted screenplay , being adapted from the book written by Nicholas Pileggi . Cared pacing , well photographed and adequate musical score accompany the moving action , adding amazing , senseless bursts of grisly violence . Magnificent and fast-talking interpretations , particularly Ray Liotta , Lorraine Bracco ,Robert De Niro , Paul Sorvino , and Joe Pesci pitching in in around the corners and whose deliberately one-key acting makes his role seems to be the most dangerous .Great secondary cast , such as : Michael Imperioli , Mike Starr, Beau Starr, Samuel L Jackson , Frank Vincent , Debi Mazar , Peter Onorati, Ileana Douglas, Frank Silvero and and look for Scorsese' mom as Pesci's mom , Catherine Scorsese . Colorful and visionary cinematography by Michael Ballhaus. The motion picture was compellingly directed by Martin Scorsese, though certanly too long . This master filmmaker has a prestigious career , making a lot of excellent films, such as : \"Mean Streets , After Hours , Boxcar Bertha , Alice doesn't lives here anymore, King of Comedy, Taxi Driver , New York New York, Raging Bull , Casino , Cape Fear , The Age of Innocemce , Shutter Island , Silence , The Irishman and of course this Goodfellas\" . Rating : 7.5/10 , above average . Worthwhile seeing for Robert De Niro, Ray Liotta fans . Essential and indispensable watching ."},{"username":"BA_Harrison","userUrl":"https://www.imdb.com/user/ur0945066","reviewLink":"https://www.imdb.com/review/rw3578449","warningSpoilers":false,"date":"11 November 2016","rate":"9","helpful":"3 out of 5 found this helpful.","title":"One of the best Mafia films ever made.","content":"As far back as I can remember, I've never wanted to be a gangster. I'd crack under the pressure and would probably wind up getting whacked (I've not a drop of Sicilian blood in me either, so would never be a 'made' man). I'm far safer sat here at my Mac typing film reviews.Real life mobster Henry Hill (portrayed by Ray Liotta), on the other hand, had always wanted to be a 'wiseguy', and lived the dream to the full, making all the right connections and bags of cash in the process, at least until his greed got him into trouble with mob bosses and he was forced to turn state's evidence to save his skin.As directed by Martin Scorsese, this account of Hill's exploits is extremely gripping stuff, with great period detail, a superb soundtrack, and a standout cast (including Robert De Niro, Paul Sorvino and Joe Pesci) all putting in great performances, Pesci in particular giving it all as loose cannon Tommy DeVito, one of the scariest characters ever committed to film (his classic 'funny like a clown?' scene is unbearably tense). The film is also incredibly violent, showing the harsh reality of the 'business' in unflinching detail, opening as it means to go on with the brutal stabbing and shooting of some poor sap in the trunk of a car.Nope a life of crime is definitely not for me. Now what shall I review next?"},{"username":"moonspinner55","userUrl":"https://www.imdb.com/user/ur0989035","reviewLink":"https://www.imdb.com/review/rw1371528","warningSpoilers":false,"date":"19 May 2006","rate":"6","helpful":"12 out of 28 found this helpful.","title":"Wiseguy mayhem, an artistic triumph but occasionally off-putting","content":"Martin Scorsese-directed modern-day mobster drama adapted from Nicholas Pileggi's book \"Wiseguy\" by Scorsese and Pileggi involves Brooklyn youth in 1955 who gets drawn into the gangster lifestyle, first as their gopher, later as a major player. Joe Pesci is frightening as a psychotic ball-buster and won a Supporting Actor Oscar, yet Ray Liotta is even better in the central role, and Lorraine Bracco is excellent as Liotta's wife. Exceptionally well-made film is gratuitous in its usage of a certain expletive and cannot overcome one major obstacle: despite its attempts to show the ugliness of Mafia life, the movie is constantly undermined by a distinct romanticism of its own violence. The infrequent narration by both Liotta and Bracco is a distraction, as we are often being told exactly what we're seeing on the screen, but the creeping paranoia is palpable and the drama played out is disturbing and gripping. **1/2 from ****"},{"username":"TxMike","userUrl":"https://www.imdb.com/user/ur0438066","reviewLink":"https://www.imdb.com/review/rw3039383","warningSpoilers":true,"date":"25 June 2014","rate":"","helpful":"0 out of 2 found this helpful.","title":"Gangster life, the \"goodfellas\" as related by Henry Hill.","content":"For some reason I had missed seeing this movie for all these years, but recently found it on BluRay at my local public library. The picture and sound are first-rate and has several very interesting extras. Perhaps the most interesting one is Henry Hill himself talking about his former life as a gangster and stating that this movie is at least 95%, no 99%, realistic and true. Crime reporter Nicholas Pileggi helped Hill write the book Wiseguy, published in 1986. This movie is based on that book. He died the day after he turned 69, in 2012.Many consider this Martin Scorsese's masterpiece. It isn't my favorite genre, it contains lots of violence and gore, plus lots of graphic cursing. But for its type, yes it is a masterpiece.Among the gangsters we have Robert De Niro as James Conway, Ray Liotta plays Henry Hill who also narrates, so we know he will survive. Joe Pesci is devastatingly good as the despicable Tommy DeVito who will shoot anyone outside the \"family\" if he gets mad at them. Paul Sorvino is Paul Cicero.So what we have is a portrait over a couple of decades of these men who look at their life of crime as their business. They see an opportunity, they arrange a heist, that is their life. But it is a dangerous life with a short cycle, they will each soon be in prison or be killed.In the end when Hill sensed that he was being set up for an execution, he and his wife tried to run only to be caught by the Feds. He ended up being the star witness to put the others away, in exchange for his freedom.As an aside of sorts, some of the scenes are set at the Copacabana club, and in one we get to see Jerry Vale singing, while in another Bobby Vinton's son is shown lip-syncing an original Bobby Vinton song. Nice touches!"},{"username":"Quinoa1984","userUrl":"https://www.imdb.com/user/ur0453068","reviewLink":"https://www.imdb.com/review/rw0282272","warningSpoilers":false,"date":"12 January 2000","rate":"10","helpful":"4 out of 9 found this helpful.","title":"my favorite film","content":"\"I'm an average nobody...I get to live the rest of my life like a shnook.\" So says Henry Hill, in one of the truly amazing denouements in film history. Here's a man who could've been easily killed off- at first by his wife, then by his own crew- and evaded it by sneaking out the 'easy' route. Yet Hill hasn't changed. He'll always complain about not having the good life anymore. The wrap-up makes totally clear what this saga is: the American dream realized as a given, and in the form of a corrupted mind-set.Goodfellas is the \"if-you-put-a-gun-to-my-head\" favorite movie for me, and by that token appropriate as there are many a gun pointed at a head during the film, and sometimes with a big result (the most shocking when I first saw it, and still brutal on a big screen, is seeing Sam Jackson's brains splattered all across the room like it's some ritualistic slaughter). It's true bravura storytelling, without a single shot or moment that needs to be excised or missed. To say it's a 'perfect' movie might be overstating it; what is 'perfect', after all? Scorsese does strive for- and arguably succeeds- a kind of perfection in balancing comedy and drama, like a tightrope walker going above a bed of hot coals with a rambunctious Pesci threatening with scissors like the Oklahoma Kid. You're almost afraid to laugh, and a good many times (especially if you've seen the film dozens of times like myself) you almost feel apart of the group of guys laughing about stuff that *shouldn't* be funny. But then there's what could be the greatest shot of the film, where we see a first-person of all the small-time hoods introducing themselves (\"what's up guy?\" \"I'm gonna get the papers, get the papers\"), where it's like we as the audience are let into the clubhouse, following them along into the back-room as they unload coats...wait, he needed suits, not coats.It's endlessly watchable as a kind of raucous, dangerous pop entertainment, and it feels as though it's gone by in much briefer time than has actually passed in 146 minutes. Maybe as part of a subjective thing I can kind of relate to many of the characters, not so much because of what they do in their criminal deeds or Hill's mistress or feeding people to lions and whatnot, but the little ticks of behavior (a little note like when Hill rushes out of his coked-up girlfriend's apartment, laughing maniacally, is like any given day with my brother).But a personal connection can only be so much to recommend this motion picture like no other. As one of the benchmarks of cinema of my generation it's got everything that many somewhat-to-big-time-sophisticated moviegoers look for: over-done classic scenes (\"Am I a clown\" is the \"You're talking' to me\" of the movie, and probably not even as great until the \"last week this prick asked me to Christen his kid\" line), iconoclastic techniques with the camera and editing (everything from the freeze frames to the music and narration to the shots that have the intensity of coke or full on rage and adrenaline in beating a guy's face in with a gun), and performances that should be considered essential to see for anyone becoming an actor years and years from now.If there was ever an American film that could absorb, entertain, enthrall, and interest me on all fronts of style and substance as much as Goodfellas does on every viewing."},{"username":"tavm","userUrl":"https://www.imdb.com/user/ur11228318","reviewLink":"https://www.imdb.com/review/rw1806500","warningSpoilers":false,"date":"24 January 2008","rate":"8","helpful":"2 out of 3 found this helpful.","title":"Goodfellas is a very good, if not great, Martin Scorsese picture","content":"While I had previously seen this Martin Scorsese picture before, it was on network television which meant I didn't hear the profanity and the violent scenes were trimmed. Despite that, I remember enjoying the movie very much. Now that I've seen it uncensored and on HD DVD, it doesn't impress me as much as before perhaps because in jumping several years in various segments, you half wonder what happened during those in-between times. Still, Ray Liotta, Robert De Niro, Joe Pesci, and Larraine Bracco impress with their performances with Paul Sorvino lending gravity with his appearances throughout and nice cameos by up-and-coming newcomers like Illeana Douglas, Debi Mazar, Samuel L. Jackson, and Michael Imperioli. Also amusing were cameos by the director's parents, Catherine and Charles, especially Catherine's as Pesci's mother. Pesci may be the most impressive of the bunch in his Oscar-winning role as Tommy who turns from highly amused to very angry at a dime. Perhaps not one for the mainstream crowd who wants at least one likable character to identify with but a mostly compelling account of the true story of what mob life really was like for someone who lived through it."},{"username":"michaelRokeefe","userUrl":"https://www.imdb.com/user/ur0449021","reviewLink":"https://www.imdb.com/review/rw1763474","warningSpoilers":true,"date":"14 November 2007","rate":"9","helpful":"1 out of 6 found this helpful.","title":"Masterful. Potent. Scorsese triumph.","content":"Director Martin Scorsese more than puts Nicoas Pileggi's Wiseguy on the screen...GOODFELLAS is a high octane crime drama based on the life of Henry Hill. Henry as a young boy, half-Irish, half-Sicilian and half-Jewish if need be, wanted nothing more than being like the \"wise guys\" in business across the street from his home in Brooklyn. Although the neighborhood was impoverished, money flowed like water around the mobsters that Henry idolized. Henry(Ray Liotta) is taken under the wing of Paul Cicero(Paul Sorvino)and would distinguish himself as he rose through the ranks of the \"crime family\". Henry was the golden boy until a reckless deal threaten the security of the family. Knowing he was a marked man, Hill turned informant and New York crime families fell like dominoes.Scorsese and Pileggi collaborated on the screenplay which was greatly enhanced with Scorsese's masterful use of soundtrack music to complement the extraordinary story line. Just a few featured in the soundtrack are: Tony Bennett, Jerry Vale, The Moonglows, The Crystals, Dean Martin, Bobby Darin, the Ronettes, Cream and The Rolling Stones.Giving the movie much authenticity is a wonderful cast that includes: Robert De Niro, Joe Pesci, Lorraine Bracco, Frank Sivero, Chuck Low, Gina Mastrogiacomo and Frank DiLeo."},{"username":"dougdoepke","userUrl":"https://www.imdb.com/user/ur10348034","reviewLink":"https://www.imdb.com/review/rw2941450","warningSpoilers":false,"date":"13 January 2014","rate":"","helpful":"2 out of 4 found this helpful.","title":"Just a Bunch of Neighborhood Guys","content":"If The Godfather (1972) is grand opera, Goodfellas is Grand Guignol. The violence is sudden and brutal, with no effort at cosmetics. This is a blue-collar crime ring Hill (Liotta) belongs to, with connections to the Mafia. They've got just enough juice to act with impunity. Shoot a kid waiter— don't worry about the law; after all, that's what the payoffs are for. Want to impress your girl with a table up front at the Copa— don't worry they'll make one. These are criminal entrepreneurs, looking to make a buck anywhere, except dealing dope (too risky, I guess), that is, until Hill fatefully succumbs. It's an exciting life, as long as you stay on the right side of the unwritten rules. So, even the underworld operates by a standard of justice, namely their own. As to the rest of the world—that's made up of 9 to 5 schnooks.Liotta turns in a fine controlled performance in the central role of Henry Hill. Ditto, DeNiro as the dangerous Jimmy. But, Pesci is all out psychotic as Tommy. It's hard to see how the gang could put up with a nutty loose cannon like him even if he does furnish the movie with its edgy appeal. Scorcese directs with down-home gusto, focusing almost as much on family life as the criminal. Still, the 160-minute result could easily have been trimmed back. That would have tightened the impact. Nonetheless, the movie is a fascinating look at urban crime, proletarian style."},{"username":"tedg","userUrl":"https://www.imdb.com/user/ur0643062","reviewLink":"https://www.imdb.com/review/rw0282531","warningSpoilers":true,"date":"22 May 2002","rate":"","helpful":"48 out of 93 found this helpful.","title":"Italian Storytelling","content":"Spoilers herein.Competent filmmakers are rare -- there is no doubt that Scorsese is competent and should be celebrated on that score alone.But his films are empty. They take you into a gangsterland (even `Temptation,' even `Innocence') and snap along until they end and then you leave. But you leave with nothing, and I expect more from a competent filmmaker.The problem -- I speculate -- is the degree to which Scorsese is locked in the Italian tradition of storytelling and its 60's incarnation in neo-realistic films. This is a matter of performance, where the force of the story is all in the force of the storyteller. The performer here is Scorsese. His screen persona is epitomized in the Pesci character: driving, driving the group by pressing on. By speaking over others. By showing the threat of violence.There's power here. It grabs your attention like Pesci grabs that of the fellas. I can see Scorsese constantly saying to himself that he'd be nuts to live any other way. But aside from some storytelling mechanics, there are no ideas here, no ambiguities, no interesting characters, no plot maturity, no symmetries, nothing to wonder about and discuss on your way home.But we should salute some of the decisions. Scorsese chooses to frame the film as a story told by the Liotta character. (He plays an Irishman, but looks and acts Italian.) Narrative voiceovers. A clever framing device with us locked in the car at midway through and mirrored in the beginning. The end with Liotta looking directly and speaking into the camera and shooting us.And the camera. Much has been said of the camera. The long, tracking shots, especially the much-copied entrance through the kitchen. The pullback-zoom toward the end when Liotta and DeNiro meet. The occasional corner ceiling shot. Normally I would love this, especially since it is in the framework of a consistent notion of the eye. What bothers me is what that eye is: it is dependent on the characters. The characters drive this movie and pull the camera. Consider the kitchen entry scene: the camera is on a string behind Liotta. We follow, always follow, just as the fellas at Pesci's table have to follow his prattling. Compare that to dePalma's similar long tracking shot of Bruce Willis at the start of `Bonfire of the Vanities.' DePalma's camera isn't dragged along behind by the force of Willis. It floats to the front, the side, swooping around, independently curious. We the viewers are masters of the story. It's the difference between the northern and southern European storytelling traditions.Seeing how little deference the camera gives us really grates when the payoff is so slight. It makes DeNiro pretty hard to take. Yes, we all get impressed by the power of his performance. But it is always clear that it is a performance: we are not seeing a character but a `serious actor,' employed as a tractor to pull us along.Is this a great film? Well, it did not change my life, give my dreams new form, or provide the basis for any meaningful discussion with my wife. It didn't help me define myself or my world. It provided no new perspectives on the things I struggle with. (And many, many films do one or more of these things.) So for me no.What a waste."},{"username":"hitchcockthelegend","userUrl":"https://www.imdb.com/user/ur16161013","reviewLink":"https://www.imdb.com/review/rw3125236","warningSpoilers":false,"date":"16 November 2014","rate":"9","helpful":"2 out of 3 found this helpful.","title":"In a world that's powered by violence, on the streets where the violent have power, a new generation carries on an old tradition.","content":"Martin Scorsese's Goodfellas is without question one of the finest gangster movies ever made, a benchmark even. It's that rare occasion for a genre film of this type where everything artistically comes together as one. Direction, script, editing, photography, driving soundtrack and crucially an ensemble cast firing on all cylinders. It's grade \"A\" film making that marked a return to form for Scorsese whilst simultaneously showing the director at the summit of his directing abilities.The story itself, based on Nicholas Pileggi's non-fiction book Wiseguy, pulls absolutely no punches in its stark realisation of the Mafia lifestyle. It's often brutal, yet funny, unflinching yet stylish, but ultimately from first frame to last it holds the attention, toying with all the human emotions during the journey, tingling the senses of those who were by 1990 fed up of popcorn movie fodder.It's not romanticism here, if anything it's a debunking of the Mafia myth, but even as the blood flows and the dialogue crackles with electricity, it always remains icy cool, brought to us by a man who had is eyes and ears open while growing up in Queens, New York in the 40s and 50s. Eccellente! 9/10"}],"errorMessage":""}