{"imDbId":"tt0064116","title":"Once Upon a Time in the West","fullTitle":"Once Upon a Time in the West (1968)","type":"Movie","year":"1968","items":[{"username":"MartinHafer","userUrl":"https://www.imdb.com/user/ur2467618","reviewLink":"https://www.imdb.com/review/rw1460081","warningSpoilers":true,"date":"27 August 2006","rate":"8","helpful":"30 out of 54 found this helpful.","title":"Before you have a stroke, please read WHY I was not entirely impressed by this film (then, you can hate me)","content":"I have absolutely loved the Sergio Leone \"Spaghetti Westerns\" that he made before ONCE UPON A TIME IN THE WEST. So, given that I have given very positive reviews for FISTFUL OF DOLLARS, FOR A FEW DOLLARS MORE and THE GOOD THE BAD AND THE UGLY, my being far from impressed with this film isn't because I dislike the genre or have it out for Mr. Leone! No, I have some legitimate reasons why I think the film is overrated--certainly very few of the IMDb users can honestly think this movie is one of the best 25 movies of all-time (despite its high IMDb score).The biggest problem is the terribly slow pacing. While none of his films of the genre are fast-paced, they are deliberately paced and hold your interest. However, this film could easily have had 45 to 60 minutes chopped out of it without a major negative impact on the movie. The buildup is just way too long and drawn out to allow this to be a great film. Self-indulgent in its pacing, yes, but not great. I don't want to watch Jack Elam blowing a fly off his face again and again and again. I don't want to see closeups of the actors eyes again and again and again. And I certainly do not want to have a scene take three times longer than it would in any other Western! The second biggest problem is that although the film seems like a meticulous labor of love in some places, a few other ones it is just plain sloppy. The absolute worst is the actor who seems to play a younger version of Charles Bronson. Not only does it look almost nothing like him, but the eye color doesn't even match--and considering all the closeups of eyes, this is just sloppy (Bronson's are bright blue-gray and the other has dark brown eyes). Also, in a few other places it looks like scenes were missing as the movie just jumped from one scene to another--and I DID watch the extended version of the movie, not the edited version. And finally, how Jason Robards was able to carry on the entire final portion of the movie--apparently fine--only to keel over dead in the very end just seemed ridiculous and sloppy.Now as far as what I liked (and boy did I want to like this film). I loved having nice-guy Henry Fonda play a cold-blooded creep. This was great. And, although I generally hated the long, slow pace, the opening scene was worth the very long wait. The music, while not Ennio Marricone's very best, was still excellent and haunting. My advice is see these other Leone Westerns and then compare them. Even THE GOOD THE BAD AND THE UGLY (a very, very long movie as well) is much faster paced than this film."},{"username":"TheLittleSongbird","userUrl":"https://www.imdb.com/user/ur20552756","reviewLink":"https://www.imdb.com/review/rw2366482","warningSpoilers":false,"date":"9 January 2011","rate":"10","helpful":"11 out of 21 found this helpful.","title":"One of the biggest and boldest westerns you will ever see","content":""},{"username":"bkoganbing","userUrl":"https://www.imdb.com/user/ur2483625","reviewLink":"https://www.imdb.com/review/rw1860361","warningSpoilers":false,"date":"19 April 2008","rate":"6","helpful":"14 out of 70 found this helpful.","title":"Some American Meatballs In A Spaghetti Western","content":""},{"username":"Leofwine_draca","userUrl":"https://www.imdb.com/user/ur0482513","reviewLink":"https://www.imdb.com/review/rw3548882","warningSpoilers":true,"date":"22 September 2016","rate":"9","helpful":"6 out of 12 found this helpful.","title":"In a word, masterful","content":"A lyrical, thoughtful spaghetti western from Sergio Leone which is considered by many to be one of the best westerns ever made - with good reason. Although the pacing is deliberately slow, each scene is lovingly crafted in a unique stylish way which makes it a film like no other. The plot, concerning the development of a new railway line which cuts through the old western homes and towns, is a thinly-disguised metaphor of the end of the Old West and the ushering in of a new era, and the film is appropriately respectful and maudlin in tone.Ennio Morricone contributes possibly one of the best scores of his career, and great use is made of sound effects (especially unnatural silence) as well as the breathtaking images of deserts and mountains. The acting is, of course, of the highest order, from a well-familiar cast. Charles Bronson gives one of his best turns as the enigmatic loner dedicated to fighting the bad; his harmonica riff just adds to the character. Henry Fonda makes a cold, ruthless villain, while Jason Robards has the sympathetic role of an ex-criminal turned good. Claudia Cardinale proves herself to be a force to be reckoned with, as well as beautiful, and there are wonderful bit parts from Woody Strode and Jack Elam as hit-man.With an interesting script from the later maestro of horror, Dario Argento, and expert direction from one of Italy's most famous directors, everything about this movie is a classic. It has been proclaimed - rightly so - as one of the best (if not the best) westerns of all time. A true epic."},{"username":"SnoopyStyle","userUrl":"https://www.imdb.com/user/ur2898520","reviewLink":"https://www.imdb.com/review/rw3284039","warningSpoilers":false,"date":"25 July 2015","rate":"9","helpful":"8 out of 11 found this helpful.","title":"symphonic style","content":"The man with a Harmonica (Charles Bronson) arrives at a desolate train station. He's met by three gunmen sent by Frank (Henry Fonda) and he promptly kills them. Jill (Claudia Cardinale) is a new young bride from New Orleans. She arrives to live with her husband Brett McBain and his family in an isolated desert homestead he calls Sweatwater. She finds the whole McBain family massacred. Cheyenne (Jason Robards) is the prime suspect but he joins her along with Harmonica to seek revenge on the real killers, Frank and his men who are working for the railroad.This is a western dripping with the Sergio Leone style. The story is simple. It's a lot of attitude. The movie starts with the great Harmonica arrival scene. Woody Strode and Jack Elam are so great that I wish they survived to stay in the movie. A minor problem is that the opening scene is so great that the rest of the movie struggles at times to return to that level."},{"username":"Kirpianuscus","userUrl":"https://www.imdb.com/user/ur61197531","reviewLink":"https://www.imdb.com/review/rw5352790","warningSpoilers":false,"date":"25 December 2019","rate":"","helpful":"4 out of 6 found this helpful.","title":"admirable","content":"I am not a fan of western genre. But this film is real splendid. First, for the surprising, for me, performance of Henry Fonda. For the music of Ennio Moriccone. And, sure, for the recipe of Sergio Leone, working impecable. A beautiful revenge film and inspired portrait of the birth of a town."},{"username":"Horst_In_Translation","userUrl":"https://www.imdb.com/user/ur3914439","reviewLink":"https://www.imdb.com/review/rw5038790","warningSpoilers":true,"date":"4 August 2019","rate":"6","helpful":"5 out of 17 found this helpful.","title":"The good, the bad and the.... err. good (again)? Gritty? Take your pick.","content":"\"C'era una volta il West\" or \"Once Upon a Time in the West\" is an Italian/American co-production from 1968, so this one had its 50th anniversary last year and that sadly also means that most of the people working on it are long gone, which includes director Leone and his two co-writers Bertolucci and Argento (what a line-up) as well as the three male actors at the center of the movie. Still central female actress Cardinale and composer Morricone are still alive. But we can also be grateful for what all of them left us. I can somehat see why this western here is still so much later appreciated by so many as it sits comfortably in the imdb top 250, top50 even. Many maybe consider it the second best western ever made behind Good, Bad and Ugly, but maybe it is not too good to compare these two because while there are parallels, there are also significant differences. The other was set against Civil War with honestly this war not having too much of an impact on the movie and the protagonists. Here the setting is the expansion of the railroad through America and how greedy railroad tycoons and their henchmen are not scared of blackmail, extortion and murder in order to get what they want, even if honestly the guy with the crudges is just a leech and his motivation to see the Pacific Ocean is not entirely vile. But Frank's is. Still I felt he was a bit weak to be the main antagonist, even if Henry Fonda is a talented actor without a doubt. But come on he needed saving by Harmonica from his own men, he did not show up to the early meeting, he knows nothing about the power of money and of course there would be no way he could survive a gunfight against our hero. Speaking of the latter, the actor is Charles Bronson and while I have not seen him in anything else there is no denying the great screen presence he has here. His first two scenes when he plays the harmonica felt a bit strange, so I needed a bit to get used to it, but eventually I appreciated it. It also worked really nice as the soundtrack for the film which was great anyway (Morricone!), so the soundtrack was part of the film itself. Smart move there. And the final explanation scene why specifically a harmonica in the flashback to his youth was really nice too with him giving the harmonica back in the now then to the guy who killed his father. Although I think the age difference between Harmonica and Frank was maybe a bit too big in the flashback. Bronson looked older than he was anyway. But also how he quotes the names of the killed when asked for his name was nice as if he was some revenge angel to them.Now another character I did not mention yet is played by the stunning Claudia Cardinale in her late 20s here I think. She looks so much better with dark hair in my opinion. I think she was a really nice inclusion. It sure isn't easy to come up with a strong female character in a so very male-dominated western, but they did a pretty good job for sure. Cheyenne summarizes her really nicely and though it may sound vulgar to the untrained ear, he means it the most respectful way you could think of. Actually the comment about ass-grabbing and the actual act towards the end will be scenes that hopeless gender equality warriors these days will certainly not like very much. Oh well, times were different back then, mind over matter you could say. If you don't mind, it doesn't matter. Or if Cardinale, for that matter. Now eventually there is no way I can continue this review without mentioning Jason Robards. I also remember liking his performance the most when I watched this movie for the first time and nothing has changed. His introduction with all the gunshooting going on outside and him coming out alive and unharmed was really funny when he enters the saloon, like Tuco's really brief introduction in the other movie I mentioned early on. And Cheyenne (Robards) just does so much for me here, the epitome of an outstanding supporting character. Shame this film did not get any award/Oscar recognition at all basically. I will not really go into detail about Cheyenne's best scenes, but Robards has such amazing screen presence which made it mesmerizing for me to watch (him). I would love to see more from him for sure soon. And I will! I really hated that they killed him off out of nowhere in the end, probably only in an unnecessary attempt to show us Harmonica is the most badass and he is the only one from the guys coming out alive, especially because Cheyenne's death was so out of nowhere. I mean okay it made sense with the scene we saw including the railroad baron being hurt and desperately going for the water, but come on really, this toad is the one who kills Cheyenne? Struggling with that. Now away from him, this film will not make you laugh as much as Good, Bad and Ugly, especially in the second half it is all serious drama and western action basically, but I still want to mention a few moments that were pretty funny (also from the cool perspective). First would be when Harmonica says \"you brought two too many\" and the faces by the crooks. By the way that introduction sequence was reeeeeeallllly long. But it worked without a doubt thanks to Leone's great attention to detail. Okay the second funny moment is when the barkeeper at the saloon continues talking to the lady after the gun action is over as if nothing happened. That was certainly funny. And wait there was another moment right before that I remember. Let me think. Yes it was the one where he says inside the men there were three bullets. That was actually maybe the most laugh-out-loud moment of the entire film.Okay so overall, it is not one of my very favorite westerns, but again it works nicely for the most part and had me curious about what would happen next. It is worth seeing for the characters alone, some of them truly memorable, the acting, almost not a single false note and of course also for Morricone's music. I was lucky enough to see this one here in Berlin as part of a retrospective on Morricone's gigantic body of work and I sure enjoyed doing so. Yes this is a really long movie at over 2.5 hours, but it is also rewarding. I am not sure if it is necessary for me to give a recommendation though. I mean everybody who is just one bit into western films will truly like this one, but those who aren't will maybe also not be won over by this one unfortunately. So their loss then I suppose. I hope you are among the former because then you are in for soemthing great here, but lets be honest: You really have seen this film by now anyway haven't you? It's considered a classic with more than just a few memorable moments. I can't say I know much about the cast honestly beyond the key players. Well wait I have come across Woody Strode I believe, but he is gone quickly anyway, so yeah. Oh and another reason to watch this film here is Claudia Cardinale, who is really the prime example of how to make a female character in maybe the most male-oriented genre interesting and deep and not just include her for her admittedly stunning looks. I can see why Frank couldn't resist either. In contrast to the two good guys, that is. She was still a bit in mourning over her husband, so it is all good they did not include a forced love story, even if probably it would have worked if she had accompanied Harmonica in the end on horseback. Oh well, he is still a loner. Always has been always will be, but like he says who knows if he ever returns. I probably will return to this movie and give it another watch one day, but not right away. That much it did not win me over. Until then, I give this one a thumbs-up and very much recommend you to check it out if you haven't already."},{"username":"Prismark10","userUrl":"https://www.imdb.com/user/ur4569900","reviewLink":"https://www.imdb.com/review/rw3085835","warningSpoilers":false,"date":"13 September 2014","rate":"8","helpful":"3 out of 6 found this helpful.","title":"The harmonica player","content":""},{"username":"claudio_carvalho","userUrl":"https://www.imdb.com/user/ur2488512","reviewLink":"https://www.imdb.com/review/rw0106516","warningSpoilers":false,"date":"30 November 2003","rate":"10","helpful":"11 out of 28 found this helpful.","title":"One of the Best Cowboy Movies (or Maybe the Best) Ever Made \u0096 A Masterpiece","content":""},{"username":"bob the moo","userUrl":"https://www.imdb.com/user/ur1002035","reviewLink":"https://www.imdb.com/review/rw0106497","warningSpoilers":false,"date":"21 September 2003","rate":"","helpful":"15 out of 27 found this helpful.","title":"An epic western \u0096 with all the pros and cons that come with that","content":""},{"username":"classicsoncall","userUrl":"https://www.imdb.com/user/ur2707735","reviewLink":"https://www.imdb.com/review/rw1734837","warningSpoilers":true,"date":"23 September 2007","rate":"9","helpful":"2 out of 4 found this helpful.","title":"\"I have a feelin' when he stops whittlin', somethin's gonna happen.\"","content":"When composer Ennio Morricone first got the script for \"Once Upon A Time In The West\", he was so impressed with the story that he began writing the music for it immediately. The entire movie was scored before even a single frame was shot, and Sergio Leone liked it so much that he had portions played for the actors while rehearsing to get them to 'flow' with the music. One could go so far as to say that a good part of the picture was filmed to the score! It took me a long time to get around to this film, but it was certainly worth the wait. Any movie that opens with Jack Elam and Woody Strode has got to get your attention, but when their characters didn't survive the opening sequence, I knew this was going to be something special. Actually, having seen Elam in countless movies and TV Western episodes, I can safely say that this is the best performance I've ever seen him in. His sparring with the fly to the omnipresent creak of the windmill was an inspired piece of work, and if you didn't know anything about the story going in, you would think that these players would have a major role in the story to come. And then Bronson appears! And then Henry Fonda appears. Curiously, his character's name was Frank. It didn't take until the end of the movie to make the connection to Frank James, brother of outlaw Jesse, and the character Fonda portrayed in two much earlier movies - 1939's \"Jesse James\", and the sequel, 1940's \"The Return of Frank James\". It made me wonder if Sergio Leone's original script named the character Frank, or if it was a result of getting Fonda for the part. It's no secret that Leone had been after Fonda to appear in one of his Westerns for a few years, with Fonda declining because every script he ever read was in Leone's fractured English. Fonda eventually relied on friend Eli Wallach's (Tuco/The Ugly in \"The Good, The Bad and The Ugly) advice, who said he would have the time of his life.More than most, this is a Western that in turn, defines and is defined by the music. Even Bronson's character is called Harmonica, and his tunes are played to haunting effect. They mask a much deadlier nature to the quiet stranger - \"He not only plays, he can shoot too\".It took me a bit into the story to figure out it was Jason Robards under the beard of Cheyenne. I think it was interesting the way his character was written, leaving it ambiguous whether he was a lawman or an outlaw. The bigger surprise though had to do with a female character in the lead role, capably performed by Claudia Cardinale. She manages to arc through a wide range of characterizations throughout the story as situations call for, holding her own well against each of the male principals.This is certainly a film I'll have to watch a few more times for some of the points noted above. In particular, the single scene I could watch over and over, one that is inextricably linked with it's musical score, is Fonda's death scene set to the strain of Morricone's dying harmonica. Not only creative, but as effective as any finale in a Western I can think of.As a final thought, I was considering how Sergio Leone could have used the title \"The Good, The Bad and The Ugly\" for this movie if it hadn't already been taken by another one of his legendary classics. But then again, Robards wasn't that ugly."},{"username":"lee_eisenberg","userUrl":"https://www.imdb.com/user/ur4888011","reviewLink":"https://www.imdb.com/review/rw1286435","warningSpoilers":true,"date":"7 February 2006","rate":"9","helpful":"1 out of 5 found this helpful.","title":"it all came together","content":"\"C'era una volta il West\" (called \"Once Upon a Time in the West\" in English) truly feels like the culmination of Sergio Leone's artistic desires. This convoluted story of two men (Charles Bronson and Jason Robards) joining forces to protect heiress Jill McBain (Claudia Cardinale) from a thug (Henry Fonda) is a treat in every way. First, there's the opening scene: it really blows your mind when you see that the villain is Henry Fonda. Bronson and Robards play their roles as cool, but giving the impression that there's something beneath that suave exterior. And Claudia Cardinale is...well, you probably know that virtually all European actresses back in the '60s were hot babes, but this one makes the audience feel that there's more to her to than just good looks.All in all, this is a movie for everyone. It's weird to think that Dario Argento - now a horror director - was involved in the making, but it's true. Really cool."},{"username":"gavin6942","userUrl":"https://www.imdb.com/user/ur1234929","reviewLink":"https://www.imdb.com/review/rw2411245","warningSpoilers":false,"date":"9 April 2011","rate":"9","helpful":"1 out of 8 found this helpful.","title":"The Best Western I Ever Saw","content":""},{"username":"jboothmillard","userUrl":"https://www.imdb.com/user/ur4248714","reviewLink":"https://www.imdb.com/review/rw2278464","warningSpoilers":true,"date":"13 July 2010","rate":"7","helpful":"1 out of 24 found this helpful.","title":"One upon a Time in the West","content":"I will admit I didn't really get the sense that there was a plot in this western at all, but it didn't spoil anything, I was going to watch it regardless, from director Sergio Leone (The Good, the Bad and the Ugly). Basically the railways are being placed all over America, even the far west, in particular a small border town full of guns and crime. It opens with an inspired sequence seeing men sitting around doing not much, one guy traps a fly in his gun barrel, they are waiting for the train to arrive. Anyway, Arriving into this town is Jill McBain (Claudia Cardinale), who is shocked to find her new husband Brett (Frank Wolff) and family slaughtered, and the prime suspect is coffee loving Cheyenne (Jason Robards). The real killer however is gang leader Frank (Henry Fonda) who is trying to get his own way with the ownership of the railroad, along with the mysterious man known only for playing his Harmonica (Charles Bronson). Also staring Gabriele Ferzetti as Morton, Keenan Wynn as Sheriff, Paolo Stoppa as Sam and Marco Zuanelli as Wobbles. As I said, I didn't really get the plot, I just enjoyed the actors being cool and quite often quiet to effect, the violence and gun play, and some good music by Ennio Morricone. The critics describe it as some kind of operatic thing with the little dialogue, I suppose I'd agree with that, it is about fifteen minutes short of three hours, but it is certainly a different kind of western to see. Very good!"},{"username":"ccthemovieman-1","userUrl":"https://www.imdb.com/user/ur4445210","reviewLink":"https://www.imdb.com/review/rw1404973","warningSpoilers":false,"date":"28 June 2006","rate":"7","helpful":"23 out of 43 found this helpful.","title":"Excruciating Slow Or Fascinating: Your Choice","content":""},{"username":"rmax304823","userUrl":"https://www.imdb.com/user/ur0819382","reviewLink":"https://www.imdb.com/review/rw2291160","warningSpoilers":true,"date":"5 August 2010","rate":"4","helpful":"15 out of 36 found this helpful.","title":"Hank the Hubristic.","content":"You have never seen such an array of tan, greasy faces, darkened by make up to a point that's positively Polynesian. It sets off the glistening white teeth we see during the infrequent grins but we don't see many grins. The default facial expression is the meaningful scowl. The most amusing display of meaningful scowls in at the very beginning, when three grimy dudes in long flapping dusters, including Western icons Jack Elam and Woody Strode, gather at the railroad station, waiting to kill the good guy, Charles Bronson. (Fat chance.) The director, Sergio Leone, gives us a long sequence in which Elam has a duel of wits with a fly that insists on landing on his chin or his lip. He manages to capture the dim-witted fly in the barrel of his Colt, caps the muzzle with a finger tip, and listens with delight as the fly buzzes angrily about inside the pistol.Another good scene. A henchman is sitting alongside the open window of a moving train. A cowboy boot descends from above. The henchman gapes at it. The toe of the boot turns towards the henchman's face and explodes. There is a pistol inside and the bullet forms a neat hole in the astonished miscreant's head.These and most other important scenes are wordless, surprising in that Bernardo Bertolucci was one of the writers.There are some impressive shots of Monument Valley. The production design is evocative and the set dressing impeccable. Leone has a distinctive way of framing his shots. Somebody's boots may be in the foreground, while in the distance another figure slowly draws back the flaps of his jacket to uncover his holsters.That's about it. I've tried to like this thing for years because Sergio Leone is admired by some friends whose opinions I respect. No can do. I don't find it funny. I don't find it involving. I really never cared much about who was or was not killed, which is always a bad sign. The movie seemed like a parody of a Western, with all the conventions drawn with absurd precision. And although Bertolucci wrote it, it isn't until AFTER the final face off between good guy Bronson and bad guy Fonda that we find out Bronson's motive for nattering Fonda. The motive, and the event that generates it, pops out of nowhere, flapping its wings like a stage magician's dove. It has nothing to do with the rest of the plot.However, don't let this stop you from watching it. I gather my opinion is a minority one, as is so often the case."},{"username":"Tweekums","userUrl":"https://www.imdb.com/user/ur13977076","reviewLink":"https://www.imdb.com/review/rw2109297","warningSpoilers":true,"date":"10 August 2009","rate":"10","helpful":"1 out of 6 found this helpful.","title":"Sergio Leone's requiem to the West.","content":"This is one of the best Westerns ever made, Leone was a master of the genre and this is probably his best film. It lacks the obvious humour of the dollar trilogy but makes up for it with a genuine sense of menace. There is almost a constant sense that violence may erupt at any moment.The opening is a classic, three men turn up at a remote station and with barely a word wait for the train to arrive. On paper the idea of spending the first ten minutes watching three men doing almost nothing sounds boring, but here there is the sense that this is the calm before the storm. When the train arrives it seems that nothing is about to happen but as it departs we hear the sound of a harmonica, the three men turn to see Charles Bronson, after a brief exchange the three men are lying dead. The next scene sees a man and his son return home after shooting some birds for dinner, the man talks to his teenage daughter as they prepare for a party; the man's wife is due to arrive that day. As the man gets water from the well a shot rings out and the girl falls to the ground more shots and the man and his elder son are dead too. The young son comes out of the house and is met by a group of men, led by Henry Fonda. Shockingly he guns down the child.That is two of the four protagonists introduced, the next is Claudia Cardinale, the widow of the man who's family we'd just seen die. Not knowing what has happened she heads to her new home, stopping off on the way at a bar. While she is inside we hear gunfire outside and the Jason Robards enters, his arms in chains. He confronts a man in the bar... the harmonica playing Bronson.What follows is a constant sense of danger interspersed with moments of violence. Why did railroad employee Frank murder an entire family? Why does Bronson play the harmonica and why is he so interested in Frank? Leone's direction is excellent, the film is long and for long periods nothing much is happening but I never felt bored watching because he created such great atmosphere. He is assisted by a fantastic score by Ennio Morricone. Henry Fonda put in a great performance, playing against type, as the murderous Frank and Bronson is ideally cast as the mysterious \"Harmonica\" putting in the best performance I've seen from him. That isn't to say there is anything wrong with the other actors, they all did a good job.I'd recommend this film to anybody, especially those who are fans of westerns. The only people I wouldn't recommend this to are fans of Henry Fonda who don't wish to see him as a bad guy."},{"username":"ma-cortes","userUrl":"https://www.imdb.com/user/ur3270789","reviewLink":"https://www.imdb.com/review/rw6666605","warningSpoilers":false,"date":"6 March 2021","rate":"8","helpful":"1 out of 2 found this helpful.","title":"Unforgettable and breathtaking Western with a big budget, masterfully made by the great Sergio Leone","content":""},{"username":"BA_Harrison","userUrl":"https://www.imdb.com/user/ur0945066","reviewLink":"https://www.imdb.com/review/rw3243943","warningSpoilers":false,"date":"23 May 2015","rate":"5","helpful":"8 out of 20 found this helpful.","title":"Leone overdoes it.","content":""},{"username":"moonspinner55","userUrl":"https://www.imdb.com/user/ur0989035","reviewLink":"https://www.imdb.com/review/rw1271718","warningSpoilers":false,"date":"21 January 2006","rate":"6","helpful":"10 out of 38 found this helpful.","title":"Elegant, but lugubrious Leone western...","content":"Italian-US co-production from Italian director Sergio Leone, who takes the spaghetti western to an elegiac (and, at times, elegant) plateau, although the picture is hurt by overlength and is carefully (some may slowly) paced. Claudia Cardinale stars as a beautiful widow trying to hold onto her hot piece of real estate in the booming Old West, trailed by a cold-hearted hit-man. As photographed by Tonino Delli Colli, the picture looks splendid, though this screenplay from Leone and Sergio Donati (working from an original treatment by Leone, Dario Argento and Bernardo Bertolucci) is thin, and Leone ultimately relies on the sweep and the scope to propel his story, which covers familiar territory. Henry Fonda is surprisingly icy as the villain; Cardinale is indeed gorgeous but is mainly used for decoration, despite being at the center of the action (it seems to happen around her). Ennio Morricone composed the stirring music. **1/2 from ****"},{"username":"TxMike","userUrl":"https://www.imdb.com/user/ur0438066","reviewLink":"https://www.imdb.com/review/rw5347505","warningSpoilers":false,"date":"23 December 2019","rate":"","helpful":"4 out of 8 found this helpful.","title":"Who are you, anyway?","content":""},{"username":"Quinoa1984","userUrl":"https://www.imdb.com/user/ur0453068","reviewLink":"https://www.imdb.com/review/rw0106537","warningSpoilers":false,"date":"6 February 2004","rate":"10","helpful":"4 out of 11 found this helpful.","title":"Maybe Leone's second best behind GB&U- sophisticated weaving of techniques from past westerns into an near-mythic treatment...","content":""},{"username":"tavm","userUrl":"https://www.imdb.com/user/ur11228318","reviewLink":"https://www.imdb.com/review/rw2443779","warningSpoilers":false,"date":"14 June 2011","rate":"10","helpful":"1 out of 7 found this helpful.","title":"Sergio Leone's Once Upon a Time in the West is one of the most compellingly dramatic Westerns of all time","content":""},{"username":"Coventry","userUrl":"https://www.imdb.com/user/ur2020269","reviewLink":"https://www.imdb.com/review/rw1070464","warningSpoilers":true,"date":"30 April 2005","rate":"10","helpful":"6 out of 15 found this helpful.","title":"A feast for eyes and ears! Leone's film is a timeless masterpiece!","content":"THIS is perhaps the greatest film ever made. A passionately penned down portrait revolving on the downfall of the West-era. Brilliantly filmed, with careful attention for the smallest detail and performed by gifted actors and actresses in not so obvious roles. Straight from the slow and clammy opening credits sequence, you notice that this is an epic that will require your full attention and one that'll automatically provoke great feelings of respect and admiration. A cowboy's struggle with a fly is portrayed like it is a devastating battle, guided by unnatural noises on the background that put an extra emphasis on the unbearably tropic climate. This is the merciless West and you need your eyes and ears focused at all times to avoid trouble with someone more powerful than you. I have seen this masterpiece of film-making numberless times now and I still get mesmerized instantly when I behold the atmospheric set-pieces and the ominous characters. A truly magnificent opening to what will become a powerful movie experience and yet nothing of the actual storyline has been revealed yet!\"Once upon a time in the West\" is a collaboration between titans...For the flawless screenplay, Leone (already a master-writer himself) received assistance from no less than Bernardo Bertolucci and Dario Argento (this latter is a personal God of mine). These icons, who already deserve statues for the work they did separately, combine their talents and deliver a genuine western story that involves organized crime, blackmail, revenge and even human emotions. Separate story lines that only come together neatly in the end, after a series of fascinating sequences filled with suspense and dazzling action. Leone grabs every chance to innovate with both hands and this results in unexpected shock moments (the slaughter of the Irish family) and even completely unimaginable anti-castings (Henry Fonda as a relentless gangster?). The main story lines are very diverse but Leone takes his time to slowly clarify them all. Tough guys are hired secure the construction of a railroad while a notorious gangster escapes from jail, only to find out that someone abused his trademarks to get their dirty work done. A beautiful woman has been widowed without knowing it and she stands alone in an abandoned, dangerous land. And then there's a lonely cowboy patiently waiting to fight a personal battle of which no one knows the details. If you've chosen to watch \"Once upon a time in the West\", get ready to be overwhelmed by fascination and involvement...expect yourself to sit on the edge of your seat, exploring all the corners of the TV-screen as you want to make sure you're not missing a thing! Leone could count on the perfect cast, with the already mentioned Henry Fonda in an unusual but fitting role and Claudia Cardinale who embodies every male creature's dream. Charles Bronson and Jason Robards complete the great cast, both in the finest roles of their overall brilliant careers.The previously summed up elements already indicate that this is an unmissable cinema event and then I haven't even spoken of the music yet! For many fans the ultimate reason to point out \"Once upon a time in the West\" as the greatest film ever made and they're right! Ennio Morricone's score is so marvelous, so perfect that it began to lead its own life outside the film. The constantly repeated tunes \"Man with the Harmonica\" and \"Goodbye to Cheyenne\" cause a chemical reaction inside your body every time and they provide the story with extra depth and atmosphere. The images on the screen and the music you hear form a wholesome that can never be topped in cinema. This is the best, period! We should only use superlatives when talking about this film: the BEST and the most UNIQUE In case I haven't made myself clear thus far: \"Once upon a time in the West\" is a motion picture that belongs in every DVD-collection. With my most sincere apologies to Sam Peckinpah, John Ford and Howard Hawks but this is simply put the best western ever!"},{"username":"sunwarrior13","userUrl":"https://www.imdb.com/user/ur5291991","reviewLink":"https://www.imdb.com/review/rw2572568","warningSpoilers":true,"date":"27 February 2012","rate":"10","helpful":"5 out of 9 found this helpful.","title":"A Landmark Spaghetti Western","content":"Once Upon a Time in the West is an Italian epic spaghetti western film directed by Sergio Leone for Paramount Pictures. It stars Henry Fonda cast against type as the villain, Charles Bronson as his nemesis, Jason Robards as a bandit, and Claudia Cardinale as a newly widowed homesteader with a past as a prostitute. The screenplay was written by Leone and Sergio Donati, from a story devised by Leone, Bernardo Bertolucci, and Dario Argento. The widescreen cinematography was by Tonino Delli Colli, and Ennio Morricone provided the film score.In this epic Western, shot partly in Monument Valley, a revenge story becomes an epic contemplation of the Western past. To get his hands on prime railroad land in Sweetwater, crippled railroad baron Morton hires killers, led by blue-eyed sadist Frank, who wipe out property owner Brett McBain and his family. McBain's newly arrived bride, Jill, however, inherits it instead. Both outlaw Cheyenne and lethally mysterious Harmonica take it upon themselves to look after Jill and thwart Frank's plans to seize her land. As alliances and betrayals mutate, it soon becomes clear that Harmonica wants to get Frank for another reason -- it has \"something to do with death.\" As in his \"Dollars\" trilogy, Leone transforms the standard Western plot through the visual impact of widescreen landscapes and the figures therein. At its full length, Once Upon a Time in the West is Leone's operatic masterwork, worthy of its legend-making title.If only the first 10 minutes of this movie still existed, this most hyperbolic of oat operas would still be acknowledged as one of the genre's greatest exhumations.Overall,it is a a landmark Leone spaghetti western masterpiece featuring a classic Morricone score."}],"errorMessage":""}