{"imDbId":"tt0021749","title":"City Lights","fullTitle":"City Lights (1931)","type":"Movie","year":"1931","items":[{"username":"MartinHafer","userUrl":"https://www.imdb.com/user/ur2467618","reviewLink":"https://www.imdb.com/review/rw1322978","warningSpoilers":false,"date":"23 March 2006","rate":"10","helpful":"7 out of 18 found this helpful.","title":"I must be missing something,...","content":"This movie is artistically beautiful--with nice cinematography, music, etc. Some of this can be attributed to this being a sound-era movie (hence better equipment) but I've gotta admit Chaplin had a great eye--the film is quite pretty and exquisitely made. There were some cute little skits and laughs spread throughout the film. During the boxing match, I barely laughed (though it was well done) and my wife almost fell on the floor laughing. However the film was able to provide a decent number of laughs---even though the story was also brimming with pathos. And wow...it will definitely bring tears to your eyes. I could say more, but I think it's best you just see it for yourself. It's not my favorite Chaplin film but it is amazingly good.One final observation about this film as well as Modern Times: While these films are firmly stuck in the past (silent movies well into the sound era), it was a smart decision on Chaplin's part to do this as well as to only make a few films he could really devote his energy into. Lloyd and especially Keaton strongly embraced the sound era and churned out quite a few films in the late 20s-early 30s--and some of them stunk when compared to their silent films. If I were watching any of these three comedians in a film from the sound era, it would definitely be Chaplin, as he didn't try to change the basic formula. Unfortunately with Keaton in particular, as MGM paired him with the very very very talkative and pushy Jimmy Durante and completely tossed out what had been great about Keaton's earlier films, his film quality plummeted."},{"username":"TheLittleSongbird","userUrl":"https://www.imdb.com/user/ur20552756","reviewLink":"https://www.imdb.com/review/rw2295186","warningSpoilers":false,"date":"14 August 2010","rate":"10","helpful":"7 out of 8 found this helpful.","title":"In my honest opinion, this is Charlie Chaplin's masterpiece","content":"As much as I loved The Kid, The Gold Rush, Modern Times and The Great Dictator, City Lights is the film I consider Charlie Chaplin's masterpiece. And there are several reasons why this is so for me.I love how City Lights is filmed, once again the cinematography is stunning as are the costumes and sets. The music is also a delight(though my favourite soundtrack in a Chaplin movie is the one for Modern Times) with plenty of themes that stuck in my head, while the sound effects are wonderfully incorporated and the subtitles easy to understand. The comedy is brilliantly done, the scene in the boxing ring is not only one of my favourite scenes in a Chaplin movie(along with the final sequence and the dance of the bread rolls of The Gold Rush, the final scene of The Kid and the speech from The Great Dictator) but ever in a comedy, while there is a very touching love story between the Tramp and the little blind girl(played touchingly by Virginia Cherrill) he falls in love with. And I also found the close-up climax achingly poignant because of its beauty and ambiguity. Chaplin is superb, his pantomime skills and physical humour are extremely well judged and he is acts beautifully with Cherrill.Overall, yet another Chaplin masterpiece, yet for me this is the best of them all. 10/10 Bethany Cox"},{"username":"Michael_Elliott","userUrl":"https://www.imdb.com/user/ur13134536","reviewLink":"https://www.imdb.com/review/rw1827794","warningSpoilers":false,"date":"26 February 2008","rate":"","helpful":"10 out of 11 found this helpful.","title":"Masterpiece","content":"City Lights (1931) **** (out of 4)Charlie Chaplin returns as The Tramp and this time he falls in love with a blind girl (Virginia Cherrill) and sets out to help her. The Tramp eventually meets a suicidal drunk (Harry Myers) and their friendship leads to what might eventually help the girl he loves.Chaplin made great films before and after CITY LIGHTS but for my money this here is his greatest film as well as one of the greatest films ever made. Not only is it one of the funniest movies ever made but I'd also argue that it's one of the greatest love stories, if not the greatest. It really says a lot when a movie can conqueror two genres at one time but CITY LIGHTS is simply one of the greatest movies ever made.I think it says a lot that you get one classic scene after another and there's really not a weak spot to be found here. Being 1931 it took some real guts for Chaplin to deliver a silent film and I think he knew that he had to deliver something special because people had moved onto sound. He certainly delivered something special as this here was easily the funniest film he had made up to this point. The opening sequence with the introduction of The Tramp was priceless and we got one hilarious scene after another from that point. The scenes with the drunk are downright hilarious as is another scene where The Tramp is trying to eat but without much success. The cigar sequence is a masterpiece as is the by the water. In fact, the story between The Tramp and the drunk would have made a terrific movie on its own. Just like the stuff with The Tramp and the blind girl would have made a perfect film. What's so special is that you get both stories wrapped up in one and it really delivers.Chaplin played The Tramp countless times but he was never better than he is here. Just check out the timing in countless scenes including the boxing match and you can't help but be impressed with the actor. Myers also deserves a lot of credit as the drunk as his timing has to match that of Chaplin throughout and the two men do a wonderful job together. Then you've got Cherrill who wasn't a professional actor but the director makes her shine throughout.CITY LIGHTS contains one great scene after another and all of the laughs lead up to one of the most powerful endings in film history. There's really not enough great things that can be said about this film as it continues to get better with each passing year."},{"username":"SnoopyStyle","userUrl":"https://www.imdb.com/user/ur2898520","reviewLink":"https://www.imdb.com/review/rw2966362","warningSpoilers":true,"date":"22 February 2014","rate":"9","helpful":"3 out of 3 found this helpful.","title":"Iconic","content":"The lovable tramp (Charles Chaplin) loves the blind flower girl (Virginia Cherrill). However through a series of misunderstandings, she thinks that he's actually a wealthy gentleman. He never dissuade her of the misconception. One night, he encounters a drunken wealthy gentleman (Harry Myers) who is about to commit suicide. The tramp rescues the drunk, and befriends him. However every time the rich drunk sobers up, he forgets about his tramp friend. When the blind girl needs $22 for rent, the tramp struggles to come up with the money. He even goes into a boxing match. Nothing works until he runs into the rich drunk once again. The drunk gives him $1000, but a misunderstanding makes the tramp a fugitive suspected of stealing the money. The tramp escapes and gives the blind guy all the money to pay the rent as well as fix her eyes. Later he is caught by the police and sent to jail. When he finally leaves the jail, he is in an even worst shape. The blind girl had her eyes fixed, and in a touching moment, she recognizes the tramp by feeling his hand.There are two great scenes in this movie. The first is the boxing match. It is a movie classic that needs to be seen by all movie lovers. It's funny to see the wires attach to Chaplin and the glove. And the slapstick humor is absolutely hilarious. It is still gut busting funny even today. The other is the final scene where the blind girl recognizes the tramp. It is the conclusion of an emotionally rich story of sacrifice."},{"username":"Hitchcoc","userUrl":"https://www.imdb.com/user/ur0278527","reviewLink":"https://www.imdb.com/review/rw3624957","warningSpoilers":false,"date":"22 January 2017","rate":"10","helpful":"2 out of 2 found this helpful.","title":"The Epitome of Chaplin","content":"In this film we have an overriding story. It is the story of a blind flower girl who is approached by a little tramp and who accepts him as a worthwhile human being, because she can't see his tattered clothes and sad being. He is compassionate and loving and giving to others, and yet he is despised by the haves. He is under constant attack from kids in the street, and the law won't leave him alone. When he prevents the suicide of a rich man, he is taken in, but because the man is a drunk, when sober he doesn't even recognize the little tramp. Charlie is on a revolving door with this guy, doing great physical comedy with grace and an ethereal loveliness. He manages, at great sacrifice, to get money for the girl so she can have surgery. The final scene is one that cannot help but bring a tear to the eyes of the viewer. Beautiful."},{"username":"Kirpianuscus","userUrl":"https://www.imdb.com/user/ur61197531","reviewLink":"https://www.imdb.com/review/rw3288930","warningSpoilers":false,"date":"1 August 2015","rate":"","helpful":"2 out of 2 found this helpful.","title":"admirable","content":"an ordinary story. few gags. a love story. and the Tramp. a film who preserves the spirit of a form of cinema who use carefully the emotions of the viewer. because not the great themes are the key but the manner to translate each in a delicate way. the gags, the confusions, the last scene, the box match are embroideries of a special project who not use only the social message or the comedy's solutions but a profound humanitarian message. a film about the other as part of yourself. more profound than other Chaplins. more precise than other Chaplins. because it is an admirable remember about the emotions who defines us. and the great homage to human race."},{"username":"Horst_In_Translation","userUrl":"https://www.imdb.com/user/ur3914439","reviewLink":"https://www.imdb.com/review/rw5385640","warningSpoilers":true,"date":"6 January 2020","rate":"6","helpful":"0 out of 6 found this helpful.","title":"Fairly entertaining, but not one of the best","content":"\"City Lights\" is an American silent film from 1931, so this one is almost 90 years old now, although \"silent\" is a bit relative in this scenario because there is a defined soundtrack by Chaplin and he said he does not want this film shown with different kind of music, but yeah as for talking and sound effects, it is of course a silent movie. Unlike other Chaplin films this one does not seem to have many different versions (according to imdb at least) and it runs for slightly under 90 minutes. Of course it is in black-and-white. And this is once again 100% about Chaplin, but let me still say a few words on the supporting cast. His female lead, i.e. love interest, is played by Virginia Cherrill who was still very young when this was made and retired from the film industry before her 30th birthday, but led a long life afterwards. The actress who palyed her mother, however, did not get this old and died less than 5 years after this was made, way before WWII. This is a Chaplin movie that does not play way back in the past, like the days of the Gold Rush for example. It is set in the city approximately during the time when it was made as we can easily see when watching this film. And while I do think that this is all about Chaplin at the center of the film/action, I still think he is best when he interacts with people that he really only shares pretty much one scene with most of the time, like the guy whose bald head he mistakes for food. Or the dude who is making a sandwich and Chaplin mistakes one ingredient for soap. Or of course the boxing fight now that was hilarious with the referee constantly in the way between them. It never got old despite how long they used this running gag. Well with how fast they were moving, it was really a running gag and Chaplin (forgive me for saying his name instead of \"the Tramp\") sure knew how to make the most of it. He may not have had the strength, but he had the quickness. And still he lost the fight in the end, which as the expected outcome for the bookmakers probably, but not for the audience in my theater, who was clearly surprised that our hero came short. But it is a nice inclusion of realism I must say. What was also fun were the scenes before the fight when Chaplin using another guy's lucky charm to its full extent, but when he saw that guy got quite a beating he really tries to get all the lucky charm away from him because clearly it wasn't working.Well, this was a movie in which it could have been really easy to feel for the guy, like how he is mistaken for the person who robbed the guy who is constantly drunk by the police and in the end even has to go to jail for it, but all he really wanted was get some money to help the girl he is in love with to have eye surgery, so that she can see again. And the guy willingly gave him the money after he saved him from commiting suicide earlier in the film. This was a strange inclusion though. I mean the subject of depression or whatever caused him to go for it was never part of the film later on. So yeah like I said, it was rather these individual, almost independent, scenes that made this film work for me than the key plot involving the friendship story with the drunkard or the key plot involving the romance with the girl. But this is to some extent also subjective because this time I was not crushing together with Charlie on her, which would have helped to maybe see this as more of an emotional movie. The ending was also a bit unusual. I have seen Chaplin films in which he gets the girl and I have seen Chaplin films in which he helps the girl get married to another guy, even if he liked her too. But this is somewhat open. The girl remembers him again, but then the closing credits roll in. Still I somehow feel we perceive this film very differently than the people did back then. So I somewhat think they did see it as a happy ending back then because she cared so much for him and she was so grateful towards him that there was no way she would refuse him right now, even if he was not the big hunk maybe she would have liked him to be. But it's just speculation anyway. Everybody will probably perceive this ending differently. I watched this film as part of a series on Chaplin in my local theater and it was shown at midnight and even if there was no fee (zero a.m. zero euros), I found it baffling that there were easily over 200 people in my showing and the room was packed. Shows how big Chaplin still is such a long time after his death. I would not call myself a big fan of him, but I like some of his works. This is one of them, even if it is not really among my favorites. I listed reasons for that earlier. So I am a bit surprised that this is really ranked so high here on imdb and has such a marvellous rating average. That I would not agree with. The only thing in this movie that maybe came close to an 8.5 out of 10 was the revelation of Chaplin under the cover on the statue. And how he is stuck there and how the anthem interrupts their routine was indeed really hilarious. So it is a good film to watch and I am glad I saw it. Give it a thumbs-up and if you also get a chance to check it out in a big theater and not at home on a small television screen, then I think you should go for it, maybe also if you have not seen anything else from him before that."},{"username":"bob the moo","userUrl":"https://www.imdb.com/user/ur1002035","reviewLink":"https://www.imdb.com/review/rw1897291","warningSpoilers":false,"date":"22 June 2008","rate":"","helpful":"7 out of 7 found this helpful.","title":"Wonderful set-pieces make the film","content":"As always the little tramp is fleeing the long arm of the law when he is mistaken for a wealthy man by a blind girl selling flowers by the roadside. While he longs to help her the tramp knows he cannot. However when he is at his lowest he stumbles upon a drunken man who he helps out who may be able to help him in turn \u0096 if the two of them can sober up long enough.In response to seeing some modern trash posing as \"comedies\" recently (Little Man, Norbit, Pluto Nash \u0096 I'm looking at you) I decided to check out some comedies that have stood the test of time \u0096 a few Chaplin films being among them. City Lights is one of those film that you will think you have seen even when you have not. I knew I had never actually seen it but the wonderful opening scene on the statue and the scenario of the blind girl by the side of the road were very familiar to me and I was right into it from the start. As was often the case, this film has a thin narrative but one that allows for several scenarios for Chaplin to work his magic. And so he does with some classic sequences across the whole film.The statue scene is memorable for how he makes so much out of so little but the brilliant choreography of the boxing match had me rolling with laughter as it moved so beautifully and imaginatively around the ring. Chaplin is a master and this is just one of many films that shows it as he creates a great little clown that we care about but can also laugh at. His support do no more than that \u0096 support him \u0096 but yet they are also roundly good. Cherrill provides attractive heart despite her simple character, while Myers, Garcia, Mann and a few others do good physical work alongside Chaplin.City Lights is a really great film that is all the more impressive for still feeling fresh and funny more than seventy years after it was made. The simple narrative is the frame but it is the wonderful and frequent set-pieces that tickle and also stick in the mind. So tonight you might be looking at your film queue with lots of modern comedies but it is worth bumping this classic to the top of the list instead."},{"username":"classicsoncall","userUrl":"https://www.imdb.com/user/ur2707735","reviewLink":"https://www.imdb.com/review/rw2400910","warningSpoilers":true,"date":"19 March 2011","rate":"8","helpful":"3 out of 3 found this helpful.","title":"\"Tomorrow the birds will sing\".","content":"To say that Charlie Chaplin was a perfectionist would be an understatement. The meeting of the flower girl in \"City Lights\" took over three hundred takes before it met Chaplin's approval; one of the many fascinating bits of history offered on the DVD extras I enjoyed today. Virginia Cherrill was a twenty year old, recently divorced socialite who didn't share Chaplin's work ethic and might have been replaced in the picture by Georgia Hale (\"The Gold Rush\") if so much of the picture hadn't already been filmed. Knowing that, and re-watching some of the more poignant scenes in \"City Lights\", makes it seem all the more incredible for knowing that Chaplin and Cherrill didn't really like each other.This is the story of love between two lost souls in the big city, a theme dear to Chaplin as the silent era in pictures was coming to an end. Movie fans, entranced by Al Jolson's \"The Jazz Singer\", were newly hooked on talking pictures, so Chaplin's decision to keep this film a silent was a controversial, if not an economically dangerous one. However the fans reacted wonderfully to the story, the final scene conveyed in a manner to bring tears to one's eyes and a melancholy lump to the throat. Few closing scenes in a movie can match it for impact, and it remains memorable even after eighty years of film making.For my part, I always get a kick out of the little things in a picture. This one had me hitting the rewind button to catch The Tramp's reaction to the newspaper boys near the beginning of the story. After that little dust up when one of the boys pulls the finger off Chaplin's glove, you can catch the quick flip of the bird he gives to the boy on the left. It's done very deftly and without hesitation, and you'll wonder to yourself - 'Did I just see that'?I haven't watched a lot of Chaplin's work up to this point, but with every film of importance I see, I'm led to others that will give me an even greater appreciation of the talent and hard work that went into the making of cinema's best. Chaplin's on the list now, and I'll be searching out his other noted pictures in short order."},{"username":"lee_eisenberg","userUrl":"https://www.imdb.com/user/ur4888011","reviewLink":"https://www.imdb.com/review/rw1109143","warningSpoilers":false,"date":"22 June 2005","rate":"10","helpful":"5 out of 10 found this helpful.","title":"a \"Lights\" in the darkness","content":"Charlie Chaplin always made great movies, and \"City Lights\" is no exception. He plays the Tramp, befriending a blind woman (Virginia Cherrill) and helping her out in her life. He also befriends an eccentric millionaire. Unfortunately, the millionaire only recognizes him when he is drunk; whenever he is sober, he considers the Trump some kind of intruder. The Tramp spends much time in jail, basically as punishment for being homeless.Once again, Chaplin has used humor to show the plight of the disenfranchised. A particularly funny scene is when he is helping the blind woman make yarn (you'll never guess what the yarn is). Either way, this is a movie that everyone should see."},{"username":"gavin6942","userUrl":"https://www.imdb.com/user/ur1234929","reviewLink":"https://www.imdb.com/review/rw2195852","warningSpoilers":false,"date":"23 January 2010","rate":"8","helpful":"2 out of 3 found this helpful.","title":"Chaplin At His Best?","content":"A poor man (Charlie Chaplin) falls for a blind girl (Virginia Cherrill) who mistakenly thinks he is wealthy. After rescuing a man from a drunken suicide attempt, the tramp befriends him and soon he finds himself able to help the girl get eye surgery. The catch? The rich man forgets the poor man's existence every time he sobers up.Upon my first viewing, I had no strong background in Charlie Chaplin films. Aside from \"Modern Times\", I cannot recall really seeing all that many before. And I freely admit I had a bias towards Buster Keaton, the earlier, \"better\" silent comedian. But their comedy is somewhat different: Buster is more physical, whereas Charlie seems to be more of as prop artist.Upon further review, Chaplin's work is better appreciated. We see in this film that he mocks the motion picture industry as a whole, which has now embraced the talkies; the only \"dialogue\" here is a stream of squawks, and Chaplin noted that \"dialogue is superfluous noise\". Of course, he eventually gave in, but this film proved that silents could compete -- and sometimes exceed -- the talking films. (Just as today black and white is not common, but can still have its powerful impact.)The bulk of the comedy here, besides falling down, could be called \"bait and switch\" routines. The tramp is presented with an item, and then it switches to something else (such as pasta turning into confetti). It is funny, and you have to give the film credit for keeping audiences entertained when they cannot verbally tell jokes.One of the greatest things about the film is the casting of Virginia Cherrill. Prior to this film, she was a complete unknown, and through Chaplin she was launched into the stars. Not that her name is well-known today, but she was married to Cary Grant and later George Francis Child Villiers, 9th Earl of Jersey. That has to count for something for a Chicago native!If you have not seen much Chaplin, see this one. Almost all critics agree that it is one of his best, and this was also Chaplin's favorite of his own work. Jeffrey Vance believes it to be his \"most perfect film\"."},{"username":"jboothmillard","userUrl":"https://www.imdb.com/user/ur4248714","reviewLink":"https://www.imdb.com/review/rw2341850","warningSpoilers":true,"date":"21 November 2010","rate":"9","helpful":"3 out of 3 found this helpful.","title":"City Lights","content":"Sound was quickly taking over the film industry, and there was a lot of worry as to whether the star of such great silent classics like The Gold Rush and Modern Times could still make people sit through it, of course the answer was yes. Basically the Tramp (Sir Charlie Chaplin, also directing), broke and homeless, stops a drunk and Eccentric Millionaire (Harry Myers) committing suicide, and they become friends, well, at least until he sobers up. The two of them go drinking and partying together, the Millionaire even gives the Tramp his Rolls Royce, and one day walking the streets he meets a poor blind Flower Girl (Virginia Cherrill), and she believes him to be a millionaire, so he just goes along with this. To earn some money and help out his new love interest pay her overdue rent money, or face eviction from her apartment, the Tramp gets a job sweeping the streets, which he quickly loses. He is then approached by a man who offers him a high sum if he can beat another man in a boxing match, which of course the Tramp fails to win, and it looks like the poor Girl is to be evicted. However, the Tramp meets up with the Millionaire who cheerfully gives him a $1000, which can pay for both the rent, and an advertised eye operation for the Girl to gain her sight back. He is accused of stealing this money from the Millionaire and goes to jail, and months later when he released he searches for the Girl, who is looking for the Millioanire who has been so good to her. In the end the pair find each other, the Girl with her eye sight restored runs a flower shop with her Grandmother (Florence Lee), and seeing him she knows the Tramp isn't rich, but it doesn't matter, it is a happy ending as they both hold back tears. Also starring Allan 'Al' Ernest Garcia as the Butler and Hank Mann as A Prizefighter. Chaplin is still wonderful as the lovable Tramp with his slapstick comedy moments, great facial expressions and the famous waddle walk, and Cherrill makes a marvellous love interest. It is a beautifully told story with both very funny moments, but also surprisingly emotional scenes involving the tragic blindness using depths of pathos, a magnificent silent comedy romance. Sir Charlie Chaplin was number 50 on The 100 Greatest Movie Stars, he was number 24 on The 50 Greatest British Actors, he was number 10 on 100 Years, 100 Stars - Men, he was number 38 on The World's Greatest Actor, and he was number 67 on The 100 Greatest Pop Culture Icons, the film was number 76 on 100 Years, 100 Movies, it was number 38 on 100 Years, 100 Laughs, and it was number 10 on 100 Years, 100 Passions. Very good!"},{"username":"rmax304823","userUrl":"https://www.imdb.com/user/ur0819382","reviewLink":"https://www.imdb.com/review/rw2055054","warningSpoilers":true,"date":"19 April 2009","rate":"8","helpful":"6 out of 7 found this helpful.","title":"Charlo at the top of his game.","content":"Charlie Chaplin made some extremely funny shorts but of his longer films, this is one of the best, along with \"The Gold Rush\" and \"Modern Times.\" Two stories are woven together. One is Charlie's on-again off-again friendship with a wealthy drunk. The guy has a case of multiple personality. When drunk he showers Charlie with friendship and gifts. When he's sober he doesn't recognize Charlie at all.The second story involves a pretty, blind flower girl who, given certain distances, angles, and lighting, resembles Uma Thurman. Charlie falls for her and accepts a thousand dollars from the drunken rich guy in order to pay for the operation that will refurbish her eyeballs.Charlie is accused of stealing the thousand bucks but when he appeals to the rich guy, he's sober and won't support Charlie's story. Charlie manages to get the money to the girl anyway but then is picked up by the police and spends some time in jail. When he emerges from the Crowbar Hotel, broke and bitter, he bumps into the now sighted girl and she recognizes him by his voice and the feel of his hands. The happy ending.There's sentimentality in the story of course. There often is in Chaplin's later films. But, as usual, it's somehow tempered. Here, it's undercut by irony.When Charlie meets the wealthy toff, the guy is about to kill himself because his wife left him. He ties a noose around his neck and a big rock to the other end of the rope. He's about to hurl himself and the rock into the river when Charlie intervenes, gives him a pep talk, and changes his mind. His spirit revived, the rich guy spread his arms to the sky, dropping the boulder that falls on Charlie's foot.And when Chaplin meets the blind flower girl, she's enthralled by his gentleness. Unseen by her, the smitten Charlie tip toes behind her to the nearby water fountain where she fills a pail. Her expression is dreamy and far away as the pail fills. Charlie is sitting on a bench next to the fountain, himself enraptured. Then she empties the pail by throwing the water in Charlie's face. Well, it's not the blind Mr. Muckle busting all the light bulbs in W. C. Fields' general store, but what is? A note. There have been some comic prize fights recorded on film, not counting the Dempsey-Tunney debacle, but I don't think any are as funny as the one Chaplin has choreographed here.It's hard to imagine the kind of talent that could pull off a story like this in a medium like this. Black and white, and silent. Applause, please."},{"username":"ccthemovieman-1","userUrl":"https://www.imdb.com/user/ur4445210","reviewLink":"https://www.imdb.com/review/rw1693812","warningSpoilers":false,"date":"15 July 2007","rate":"9","helpful":"52 out of 62 found this helpful.","title":"One Of Chaplin''s Best & Most Endearing Films","content":"I always thought this was one of Charlie Chaplin's nicest, most under-appreciated silent movie gems. Then I discovered it really wasn't underrated; it's rated very high on most critics' lists. It may be that I usually hear about some of his other movies than I do this one.Part of the reason I think so highly of this is simply that I'm a sentimentalist and story in this film is a very touching one. It's a romance between Charlie's tramp character (no name) and a blind girl, who also had no name in this film. Virginia Cherill, who played the blind woman and had a wholesome, pretty face which I found very attractive.I'm not always a huge fan of pantomime except for some great comedians of the era like Chaplin, Harold Lloyd and Buster Keaton, but Chaplin was so good at it and this is one of the last of dying breed as \"talkies\" were out in full force by 1931. Chaplin was at his best in silent movies, anyway, and his comedy routines are legendary. He gave me a lot of laughs in this film, as always, and I particularly laughed (I love slapstick) at the boxing scene. Kudos, too, to Harry Myers as the \"eccentric millionaire.\"There's a lot of drama as well as humor in this 86-minute gem as the Tramp tries to aid a blind girl, raising money so she can get an operation to restore her sight.Comedy, romance, drama (with suffering) all combine to make this an extraordinary piece of entertainment. It's hard to believe this movie was not up for one, single Academy Award."},{"username":"Quinoa1984","userUrl":"https://www.imdb.com/user/ur0453068","reviewLink":"https://www.imdb.com/review/rw0007532","warningSpoilers":false,"date":"12 September 2004","rate":"10","helpful":"149 out of 167 found this helpful.","title":"Lady and the Tramp, before animation and at the start of talkies- one of the most wonderful films ever conceived and executed","content":"If there is one Charlie Chaplin film to recommend, as others have pointed to in the past, City Lights is the one. Though Chaplin played his Tramp character superbly in other movies, like Modern Times and The Gold Rush, City Lights displays the Tramp at his funniest, his bravest, his most romantic, and his most sympathetic. It's tough for filmmakers in recent days to bring the audience so close emotionally with the characters, but it's pulled off. The film centers on three characters- the Tramp, the quintessential, funny homeless man who blends into the crowd, but gets caught in predicaments. He helps a drunken businessman (Myers, a fine performance in his own right) from suicide, and becomes his on and off again friend (that is, when it suits him and doesn't notice his 'friend's' state). The other person in the Tramp's life is the Blind Flower Girl (Virginia Cherrill, one of the most absorbing, beautiful, and key female performances in silent film), who are quite fond of each other despite the lack of total perception. The emotional centerpiece comes in obtaining rent and eye surgery money, which leads to a (how else can I put it) magical boxing match where it's basically a 180 from the brutality and viscerality of a match in say Raging Bull. Though there is no dialog, the film achieves a timelessness- it's essentially a tale of two loners who find each other, lose each other, and find each other again (the last scene, widely discussed by critics for decades, is moving if not tear-inducing). And it's never, ever boring- once you get along with the Tramp, you find the little things about him, the reaction shots, the little things he does after the usual big gag (look to the ballroom scene for examples of this, or when he gets a bottle of wine poured down his pants without the other guy noticing). Truth be told, if this film makes you indifferent, never watch Chaplin again. But if you give yourself to the film, you may find it's one of the most charming from the era, or perhaps any era."},{"username":"tedg","userUrl":"https://www.imdb.com/user/ur0643062","reviewLink":"https://www.imdb.com/review/rw0007499","warningSpoilers":true,"date":"30 April 2002","rate":"","helpful":"22 out of 27 found this helpful.","title":"Seeing and Being Seen","content":"Spoilers herein.For me, this film falls not into the category of favorite films (I'm a Marx brothers kind of guy) but earns instead a place on a very short list of most important movies.That's because it has two features that I truly appreciate.It is as pure a vision of its creator as is possible. Nearly all other films are engineered from prior work. Not so with a small list of projects from Welles, Kurosawa, Eisenstein, ... and this one project of Chaplin's. They are wholly original, springing from some nether world.But the other element is the one that impresses the most. This film is about itself, about the art of visual narrative. Chaplin was intelligent enough to know that what he was doing was new. The issues are centered on what the audience `sees,' so while he struggles with what and how the audience sees, he builds that into the fabric of the story.The primary framing is about the blind girl who falls in love with him by `seeing' him in her own way. Then `sees' him at the end in a different way. The rich man recognizes the tramp when drunk but does not when he is not. Nearly all the jokes, indeed every element of the film is about this same dynamic: the elevator which is not seen but then was, the burglars the same, the Tramp on the statue, on the barrel. Even seeing the cigar before the bum does. Even us seeing the soap and the foreman not.The `seeing' is carried over to `hearing' with the politician and whistle jokes. And then even further as Charlie turns his back on the new technology of giving us speech and instead `shows' us something else: he writes and conducts an amazing score instead. This is truly amazing (and one reason to take Mike Figgis seriously).No wonder Orson Welles considered this the most important film ever made. But as to the best to watch? Because film is so derivative, my own gold standard for the Tramp is Robert Downey's (and to some extent Depp's). Comic timing is something that evolves, and those men make a more effective Tramp for my modern ability to see.Trivia: Chaplin found the `blind' girl in a group of spectators at a fight and was struck with how her expressions reflected what she saw. She's pretty as well of course, but certainly not the prettiest Chaplin knew. See how Chaplin separately works in both the fight (a performance) and her reaction to his performance in the film."},{"username":"zardoz-13","userUrl":"https://www.imdb.com/user/ur2079400","reviewLink":"https://www.imdb.com/review/rw1831287","warningSpoilers":true,"date":"1 March 2008","rate":"10","helpful":"3 out of 4 found this helpful.","title":"Chaplin's Crowning Masterpiece of Silent Cinema!","content":"The transition from silent films to talkies proved devastating for many movie stars. Some with thick European accents, like Teutonic actor Emil Jannings who won the first Best Acting Oscar, did not weather the conversion and returned to Germany. The silent clowns who practiced the art of pantomime became one group adversely affected by the advent of sound. Buster Keaton and Harold Lloyd emerged as the first casualties of the talkies. Meanwhile, Chaplin had nothing but contempt for sound films. \"Motion pictures need dialogue as much as Beethoven symphonies need lyrics,\" he said. Indeed, Chaplin saw few advantages to sound, despite the sensation that the new technology created for the industry. Warner Brothers introduced sound pictures in 1927 with its quasi-talkie The Jazz Singer, and sound propelled Warners into the big leagues with exalted studios like MGM and Paramount. Chaplin did not rush to climb aboard the sound movie bandwagon. Instead, he hoped that City Lights would revive silent movies. As the popularity of sound waxed, Chaplin grew more anxious about sound. Nevertheless, he produced his greatest silent movie comedy City Lights in 1931. He took into account, however, the impact of sound and added a synchronized soundtrack as well as his own post-production musical score. Chaplin remained reluctant to convert to sound. When he made his next classic comedy Modern Times (1936), he made it as a silent. Eventually, Chaplin converted to sound with his classic anti-Hitler film The Great Dictator in 1940. Chaplin's dismissal of sound grew out of his success as a mime. The former English music hall pantomimist created his life-long comic persona--the 'little tramp'--for the 1914 silent comedy The Kid Auto Races at Venice. Chaplin rose through the ranks at various studios until his success with the little tramp enabled him to finance his own studio. Chaplin's mute tramp appealed to everybody everywhere because body language constituted an international language. Asian audiences appreciated Chaplin's comic body language as much as Scandinavians. \"My own pictures will always be silent,\" he assured his audiences. Although he added a synchronized sound track, Chaplin ridiculed talkies in City Lights. In the opening scene, when dignitaries dedicate a monument to 'Peace and Prosperity,' Chaplin pokes fun at these pretentious people with his use of squawky sound effects. \"City Lights\" qualifies as a sweetly sentimental saga about Chaplin's trademark 'little tramp' character in his tattered evening clothes and a hat falling hopeless in love with a beautiful but blind flower girl played by Virginia Cherrill. Meanwhile, when the Tramp isn't buying flowers from the heroine and escorting her back to where she lives with her grandmother, he strikes up an on-and-off friendship with a real millionaire. According to the credits, mustached Harry Myers of \"Getting Gertie's Garter\" (1927) plays an 'eccentric millionaire.' He is eccentric because he lives alone without his wife and has only his butler to care for him. Unhappy, the millionaire either tries to commit suicide or gets plastered and goes from one party to another, even hosting them at his mansion. The Tramp runs into him late one evening when the Millionaire tries to commit suicide by drowning himself. The Tramp gets soaked for saving his new found friend and the friend reciprocates and becomes the Tramp's long-lost friend\u0097that is\u0097until he sobers up and has no memory of their friendship.In any case, the Tramp learns about a treatment that a foreign doctor has used to help some blind people recover their sight and he sets out to earn the money so that the blind girl can see again. The Tramp tries to earn the money the old-fashioned way by joining the ranks as a city sanitation engineer. In other words, he scoops up animal droppings and hauls them away. In one amusing scene, he tries to avoid a street strewn with animals, only to have a couple of circus elephants stomp up out of nowhere. Eventually, he gets fired for being late back to work after his lunch break. Next door, at a gym, he agrees to box for a share of the purse and his opponent agrees to share. Things take a turn for the worse, when the guy has to leave unexpectedly. It seems that the police are after him. The guy who replaces the fleeing boxer is a dour tough guy who is a little afraid of the Tramp's efforts to ingratiate himself to him. Further, the new guy refuses to share the prize money. In one of the funniest scenes ever, we see the Tramp strenuously avoid blows with the rival boxer. The Tramp keeps the referee between them at times or gets behind the other boxer. This confusion is sheer side-splitting fun. Sadly, the Tramp loses, but he keeps trying to get the girl her money.Charlie Chaplin does a flawless job directing this sappy love story. He alternates his love story with the friendship with the rich man. The way that he meets the blind flower girl is brilliant. The Tramp is walking along when he spots a cop (cops always scare him) and he ducks into a limo parked in the street. When he comes out the door on the other side, he sets foot on the sidewalk in front of the blind girl. The Tramp falls madly in love at first sight and the limo cruises away with the girl believing that she has sold a flower to a wealthy gentleman instead of a homeless transient. There is a pretty funny dance hall number with the Tramp setting fire to a woman's chair and then her dress. However, the crowning achievement of \"City Lights\" is its weepy ending. The Tramp has survived a sentence in stir and he meets the blind girl again, but things are definitely changed. Like the short story about the woman in the arena in Rome, \"City Lights\" asks you to decide for yourself if it has a happy ending or a cynical ending."},{"username":"grantss","userUrl":"https://www.imdb.com/user/ur2860723","reviewLink":"https://www.imdb.com/review/rw3110634","warningSpoilers":false,"date":"25 October 2014","rate":"9","helpful":"3 out of 3 found this helpful.","title":"A Chaplin classic","content":"A Charlie Chaplin classic. But then, many of his movies are classics, and rightfully so. Has the usual Chaplin traits: fantastic, ingenious, ultra-creative visual comedy, plus a great emotional angle. The comedy is brilliant. Some of the scenes are iconic, and have been copied by many great movie makers.Where this differs from his previous movies is that the drama side gets more weight than before. After the almost-continuous comedy of The Circus, his previous movie, the lulls in comedy found in City Lights to advance the plot and develop the characters come as a bit of a shock. Even a let-down. But they are worth it, as the movie builds up to an incredibly emotional final scene. Plus the breaks from the comedy make the comedic scenes even more impactful.An absolute must-see."},{"username":"Boba_Fett1138","userUrl":"https://www.imdb.com/user/ur1416505","reviewLink":"https://www.imdb.com/review/rw1807274","warningSpoilers":false,"date":"25 January 2008","rate":"10","helpful":"4 out of 4 found this helpful.","title":"Blink once and you'll miss something funny!","content":"The jokes and comical moments are all performed in such an incredible high pace and very well timed and choreographed. The comical moments follow each other very rapidly. Big over-the-top hilarious situations as well as small subtle ones. You have no time to think about the one joke, since the next one is already occurring at that very moment. The movie is that fast going. Blink once and you'll miss something funny. This is slapstick film-making at its very best.Charles Chaplin performs his role with great charisma and agility, It's a quite psychical movie for him. The movie features jumping, falling and climbing, as you would obviously expect from a '30's slapstick movie.I must admit that a few of the Chaplin movies don't live up to their reputations but this one on the other hand really does. It's certainly one of the best comedies of the '30's and of all time. A true timeless comedy classic!But as you would expect from a Chaplin movie, it also is a movie with lots of heart and humanity. No matter how crazy the movie gets in parts, the movie never loses any of its credibility when it comes down to its drama and pureness. The movie is also made in a more realistic style, rather than a comical one that clearly and also predictably builds up toward a comical situations. This makes the movie all the more hilarious and strengthens the comical moments.The movie just doesn't only rely on its jokes and Chaplin antics but also has a great and compelling story of its own. It's a quite well written story, that moves over to a lot of different places and locations throughout and is therefore also loaded with lots of characters and situations. It makes the movie also very original.An absolute delightful movie!10/10http://bobafett1138.blogspot.com/"},{"username":"bombersflyup","userUrl":"https://www.imdb.com/user/ur25775215","reviewLink":"https://www.imdb.com/review/rw4481609","warningSpoilers":true,"date":"27 November 2018","rate":"4","helpful":"4 out of 20 found this helpful.","title":"Destined to be the villain.","content":"City Lights held my attention, it's by no means profound. Somewhat feeble and childish in many ways.Is it forbidden to write something negative about it? Seems like. The characters have very little to offer and Charlie's all over the place. The ending's unresolved as Charlie's where he begun. The comedy's hit and miss, though the segment in the boxing ring's all laughs."},{"username":"evanston_dad","userUrl":"https://www.imdb.com/user/ur4532636","reviewLink":"https://www.imdb.com/review/rw1244132","warningSpoilers":false,"date":"21 December 2005","rate":"9","helpful":"3 out of 3 found this helpful.","title":"Unashamedly Sentimental---Works for Me","content":"I had the pleasure of seeing a screening of this film (silent, though it came out well into the sound era) with live music accompaniment by the Chicago Symphony Orchestra. As you can imagine, this added a tremendous amount to the overall effect of the movie, which I had seen once before on video. This is Chaplin at his most unabashedly sentimental, but darn it if it doesn't work like a charm. This feels the most dramatic of the Chaplin films I've seen, with the most \"plot,\" but that doesn't mean there aren't wildly funny bits, like Chaplin's brief stint as a boxer. I don't cry especially easily at movies, so the ending didn't have me in tears, but you're excused if it has that effect on you, and you might want to have a handkerchief handy just in case.Grade: A"},{"username":"anaconda-40658","userUrl":"https://www.imdb.com/user/ur60028700","reviewLink":"https://www.imdb.com/review/rw3232297","warningSpoilers":true,"date":"4 May 2015","rate":"10","helpful":"3 out of 3 found this helpful.","title":"Chaplin's Bright Lights.","content":"City Lights (1931): Dir: Charlie Chaplin / Dir: Charlie Chaplin, Virginia Cherrill, Harry Myers, Florence Lee, Al Ernest Garcia: A masterpiece in silent film expression of love, passion and the desire to merge forward through everyday corruption. Charlie Chaplin plays his trademark tramp who is sneered at by anyone who isn't blind or intoxicated. Virginia Cherrill plays a blind woman who sells flowers on the corner. Smitten, Chaplin purchases a flower. Harry Myers plays a drunken millionaire on the verge of suicide until Chaplin prevents it in his usual hilarious slapstick fashion. Thankful, he invites Chaplin to his mansion for partying. Unfortunately when sober he doesn't recall his new friend. This frustrates Chaplin who attempts odd jobs in order to help the blind woman with her rent as well as an expensive eye surgery that would gain her sight. This leads to more hijinks particularly when he makes a failed attempt at boxing. Chaplin plays off a desire to please despite the fact that the blind woman believes him to be rich. Cherrill as the blind woman proves to have a heart of gold. Florence Lee plays her concern grandmother who help her with the flowers arrangements. Myers plays off the recklessness of alcohol. Al Ernest Garcia plays the stern and often confused butler. Chaplin's best work presents a theme of putting the needs of others first as well as give the words of a touching closing line, \"I can see now.\" Score: 10 / 10"},{"username":"Vincentiu","userUrl":"https://www.imdb.com/user/ur13017201","reviewLink":"https://www.imdb.com/review/rw3017567","warningSpoilers":false,"date":"17 May 2014","rate":"","helpful":"2 out of 2 found this helpful.","title":"pure gem","content":"a magic movie. for its precise mixture between sensitivity and humor, for its high humanism, delicacy , force of detail and for a story like a clock. it is the pure Chaplin signature/work in deep measure and this fact makes many sequences from it anthological. it is a film about metamorphose of city and nuances , subtle, gentle and seductive, of light. the story of friendship and love, hope and joy rules in magnificent manner. and the trapper is the keeper of magic for every sparkle. for me, City Lights is the best expression of Chaplin genius. not as actor/ director but as extraordinary narrator. a gem. in pure form."},{"username":"Pjtaylor-96-138044","userUrl":"https://www.imdb.com/user/ur26820801","reviewLink":"https://www.imdb.com/review/rw4081935","warningSpoilers":false,"date":"5 March 2018","rate":"6","helpful":"1 out of 4 found this helpful.","title":"Not Chaplin's best, but still a charming and entertaining silent cinema staple.","content":"This silent cinema staple doesn't quite have the heart of 'The Kid (1921)' or anything quite as brilliantly entertaining as the final slapstick set-piece from 'The Gold Rush (1925)', but it does have its lion's share of memorably mute moments proving that Chaplin really is the king of this kind of comedy. 'City Lights (1931)' is enjoyable throughout and tells its story deftly, but there are several slow segments - perhaps somewhat expected from a film of this age but not excused, considering that the era and talent have produced pieces superior in this regard - ultimately making this a fun watch which often represents uproarious cinematic entertainment in its purest form but isn't the best of the bunch. 6/10"},{"username":"llltdesq","userUrl":"https://www.imdb.com/user/ur0583640","reviewLink":"https://www.imdb.com/review/rw0007491","warningSpoilers":false,"date":"15 November 2001","rate":"10","helpful":"2 out of 2 found this helpful.","title":"The best film of 1931","content":"This is one of the best film of all time and yet it is arguably only the third best film Charlie Chaplin made, after Modern Times and The Gold Rush. Some of his most memorable bits are in here, most of them revolving around his comic (and sad) attempts to help a blind flower seller, played by Virginia Cherrill. Chaplin's sense of timing was wonderful, as always. Wholeheartedly recommended."}],"errorMessage":""}