{"imDbId":"tt0054215","title":"Psycho","fullTitle":"Psycho (1960)","type":"Movie","year":"1960","items":[{"username":"TheLittleSongbird","userUrl":"https://www.imdb.com/user/ur20552756","reviewLink":"https://www.imdb.com/review/rw2171117","warningSpoilers":false,"date":"9 December 2009","rate":"10","helpful":"28 out of 35 found this helpful.","title":"A film that you see once, and never forget...","content":"I am a huge fan of Hitchcock, and have really liked all of the movies of his I have seen so far. My top 5 favourites are Vertigo, North By Northwest, Rear Window, Rebecca and this masterpiece. Before I saw this, I considered Vertigo as his masterpiece. After seeing this movie, I think Psycho outshines Vertigo.Psycho is a film that you see once and never forget, and one of the few movies out there that has left me traumatised. The infamous shower scene is without doubt one of the most terrifying murder scenes in any film. When I first saw that scene on the 100 Greatest American Films, I was so terrified and I admit it I have never recovered. I had a similar experience watching the Disney film Sleeping Beauty with Maleficent enticing Aurora to the spinning wheel, and Mrs Gulch turning into the Wicked Witch in the Wizard of Oz.The shower scene isn't the only effective or chilling scene in the film- in the events leading up to that scene I was biting my nails. The scene with the old woman in the chair also made me jump out of my skin. The whole of Psycho is terrifying, suspenseful and shocking. Two elements made this so. One was Hitchock's direction. The great director proves how truly great he is by directing Psycho in a masterful way, and manages to deliver the shocks when needed. The other is Bernard Hermann's music. What a creepy score! I loved his score for Vertigo and Miklos Rozsa's for Spellbound, but the high violin motif in the shower scene is the main reason why that scene in particular is so effective. I admit it, when I hear that motif, I start screaming. There is just something about it that makes your blood run cold.Other pros are a good plot, a well constructed screenplay and beautiful black and white cinematography that is perfect in conveying the creepy mood. And the ending did surprise me. The acting though was exemplary, with Janet Leigh giving one of the deservedly most memorable female performances in a Hitchcock movie, and Vera Miles also giving a stellar performance. Stealing the film is Antony Perkins as Norman Bates, he didn't just play creepy, he WAS creepy, his face, his voice, his mannerisms.. in short it is one of the most chilling performances of all time. All in all, a Hitchcock masterpiece! 10/10 Bethany Cox"},{"username":"bkoganbing","userUrl":"https://www.imdb.com/user/ur2483625","reviewLink":"https://www.imdb.com/review/rw1500745","warningSpoilers":false,"date":"18 October 2006","rate":"9","helpful":"12 out of 18 found this helpful.","title":"Cleaning Up After Mom","content":"During the Mid Eighties I attended a science fiction convention in Manhattan and the feature attraction there was Anthony Perkins. There was Mr. Perkins, the celebrated Norman Bates of Alfred Hitchcock's Psycho among all the Trekkies and Doctor Who fans, etc. I think he looked on it as an opportunity to promote the succeeding Psycho films.Tony Perkins was clearly ill at ease among the Sci-Fi crowd. People like the Star Trek cast members know what to expect at these gatherings and act accordingly. Perkins did not really know how to handle the banter, he was in my estimation a serious guy who must have thought he was in a freak show. I asked him about appearing in Friendly Persuasion with Gary Cooper and I told him that that was my favorite role he did. He looked grateful that someone knew he did something besides Norman Bates.But for better or worse, Norman Bates became his career role and it's what we remember Anthony Perkins for. He does create an indelible impression on the screen with Alfred Hitchcock's direction as the shy mother fixated man running a flea bag motel in an area where a new super highway has taken all the potential business.Psycho has a simple plot. Janet Leigh on an impulse embezzles $40,000 in cash from her employer and goes on the run. She winds up in the Bates motel run by Norman and his mother. Later on private detective Martin Balsam goes after her as well. And finally John Gavin as Leigh's boy friend and Vera Miles as her sister go looking for the both of them. Simple enough, but Alfred Hitchcock creates a mood of terror and suspense that lingers long after you've seen the film. My favorite shot of the film is not Leigh's legendary shower stabbing, but of Martin Balsam being knocked down and falling down that flight of stairs and then being stabbed to death. The camera work showing Balsam falling backwards is the most terrifying part of Psycho.Though Anthony Perkins did so many other good things, the average cinema fan will tell you 99 out of 100 times that Norman Bates is the role he remembers Perkins for. So Perkins went with the flow.It was repetitious for him, but a treat for fans."},{"username":"Leofwine_draca","userUrl":"https://www.imdb.com/user/ur0482513","reviewLink":"https://www.imdb.com/review/rw3057477","warningSpoilers":false,"date":"28 July 2014","rate":"10","helpful":"8 out of 12 found this helpful.","title":"Hitch's masterwork","content":"PSYCHO truly is an excellent film, a movie which, along with the same year's PEEPING TOM, managed to kick start a new genre of psychological thrillers which continues to this day. It's perfectly made, with an excellent story (thanks to the reliable schlockmeister Robert Bloch), a great script adaptation, and assured direction from Hitchcock.It's hard to know what stands out here the most: the brooding cinematography, in which features such as the Bates Motel become characters in their own right, or Anthony Perkins's most famous role. Perkins encapsulates Bates perfectly, making him a bogeyman far more frightening than the OTT fantasy creations of a Freddy Krueger or Jason Vorhees.Watching it today, it's tough to imagine sitting through it without knowing the various twists beforehand, but they must have been mind-blowing to newcomers. And one of the things I like best is that the film is already great, and thrilling, even before the action shifts to the Bates Motel. Add in a great Martin Balsam performance and you have one of the greatest masterworks of 20th century cinema, in my humble opinion."},{"username":"Michael_Elliott","userUrl":"https://www.imdb.com/user/ur13134536","reviewLink":"https://www.imdb.com/review/rw3322474","warningSpoilers":false,"date":"23 September 2015","rate":"","helpful":"9 out of 12 found this helpful.","title":"One of the Greatest Ever Made","content":"Psycho (1960) **** (out of 4) There's really no point in giving a synopsis for this film. If you don't already know what this movie is about then you really need to stop reading this right now and go watch the movie. I've seen this movie dozens of times over the years from VHS to DVD to Blu- ray and I've seen it at least five times on the big screen and for my money this is Alfredy Hitchcock's greatest film and one of the greatest ever made. I know VERTIGO, a brilliant movie, gets all the love and respect but for my money this here is his greatest film.Where do you start with a movie like this? Everyone knows that the budget was slashed on the director and it certainly helped the film because had this been in color or had it been lavished with a big budget then it just wouldn't have the same feel. The movie has some of the most historic moments in film history that everyone knows about. These moments are of course the shower sequence as well as the ending. Both certainly deserve to be mentioned whenever you discuss brilliant scenes but for my money the greatest sequence in the movie is what happens before the shower sequence and it's the discussion between Marion Crane (Janet Leigh) and Norman Bates (Anthony Perkins) as they discuss what is basically holding them back.The performances between the two actors are just so flawless and this scene is so important because it tells us everything we need to know going into the second half of the movie, which is pretty much after the shower scene. The first portion of the movie we're worried and caring about the Crane character but we get the shock of what happens and then our sympathy immediately turns to Norman and him helping his mother. The way Hitchcock pulls this off is rather remarkable but the shocks keep happening with one terrific twist after another leading up to the ending.What's always amazed me about this movie is how your initial viewing is nothing but pure shocks and gasps but then on repeat viewings, even when you know all the secrets, you can enjoy it just as much because you can then enjoy the film by watching a master handle the material. You can watch for the clues and see all the winks that Hitchcock is giving the viewer. No matter how many times I watch this film I can simply sit back and enjoy it on so many levels. It's a movie where you brain knows what's going on but the film is just so great that you can enjoy everything and wish that the character's fate changes somehow.Everything from the performances to the score to the cinematography are flawless. This is without question one of the most impressive movies ever made. It's certainly a ground-breaking picture that has its legendary director at the top of his game. PSYCHO has been copied countless times over the past fifty-five years but nothing has come close to its impact."},{"username":"SnoopyStyle","userUrl":"https://www.imdb.com/user/ur2898520","reviewLink":"https://www.imdb.com/review/rw2913501","warningSpoilers":false,"date":"29 November 2013","rate":"9","helpful":"8 out of 8 found this helpful.","title":"Hitchcock the master salesman","content":"Marion Crane (Janet Leigh) steals $40k from work, and runs away. In a stormy night, she stops at the isolated Bates Motel where she meets creepy Norman Bates (Anthony Perkins).This one has Alfred Hitchcock as the master salesman. It's the biggest show in show business, and he's the master of ceremony. He pulls out all the stops like the secrecy and the refusal of entry to late arrivals. It helps to have the most iconic movie scene of all times.Janet Leigh isn't just a damsel in distress or a shrinking violet. She is a woman with a dark side. The fact that she's an A-list star used to mean that she'll last until the end of the movie. When the super creepy Anthony Perkins joins her, it was set up for a prolong creepfest. Then comes the most well made important scene in history. The second half does have a little struggle to reclimb that peak, and I didn't like all the pontificating at the end. But those are tiny problems in a great movie."},{"username":"Hitchcoc","userUrl":"https://www.imdb.com/user/ur0278527","reviewLink":"https://www.imdb.com/review/rw0072087","warningSpoilers":false,"date":"5 October 2001","rate":"10","helpful":"7 out of 8 found this helpful.","title":"Tight and Terrifying","content":"When Hitchcock tells a tale, he engages the mind of the audience. We don't need to see knives tearing into flesh, people being strangled on the screen, or gunshots ripping through a brain. And still, when we are finished, we are more uncomfortable than had we watched the actual murder. In Psycho, it's all about vulnerability. Janet Leigh is in a state of great agitation and needs to trust someone. Unfortunately it is the master taxidermist, Anthony Perkins. His Norman Bates, with his nervous tics, his analytical surmises, his understatement, are master-pieces of madness. This film is what every student should see. It is montage; it is tautness; it is the best kind of storytelling. The things which were still with me a month after seeing this for the first time were as follows:1. The house. That ominous house, peering down, Poe-like from the hill above the motel. How can architecture better capture threat.2. The scene with the patrolman.3. The conversation Norman when Marion first stops at the motel.4. The shower scene. I can still hear the theramin (used again at the end), and the blood flowing down the shower drain.5. The killing of Martin Balsam on the stairs (he also used this perspective in Vertigo and Topaz).6. The \"conversations\" with Mother.7. The naked light bulb swinging as the rocker turns around and Norman coming into the basement.What a great director. He saw everything and knew how to fill every minute with suspense. A truly masterly film."},{"username":"Kirpianuscus","userUrl":"https://www.imdb.com/user/ur61197531","reviewLink":"https://www.imdb.com/review/rw3342708","warningSpoilers":false,"date":"25 October 2015","rate":"","helpful":"2 out of 2 found this helpful.","title":"more than classic","content":"that kind of film who is more than a classic, a gem or a masterpiece. because it is a revolution. not easy to define but powerful for transform a genre and for inspire an industry. courageous, strange, surprising. at each new meeting. because it remands the force of art of a cinema genius. the scene of shower, the performance of Anthony Perkins- first victim of the film's success -, the birds and the last scenes are parts of cultural references. one of the great roles by Janet Leigh, the film is large arena of secrets, vulnerabilities, solutions and falls.and map of emotions with almost cold precision. because it is only about lost people and the search of sense for their life."},{"username":"kosmasp","userUrl":"https://www.imdb.com/user/ur5876717","reviewLink":"https://www.imdb.com/review/rw2161582","warningSpoilers":false,"date":"21 November 2009","rate":"10","helpful":"2 out of 2 found this helpful.","title":"A must-see","content":"Especially if you are into thrillers. I haven't seen the shot-by-shot remake that came out, 10 years or so ago, but if you watch one Psycho, it should be this one. Actually if you watch more than one Psycho, it would be good if you'd watch the other Psychos (Psycho 2, 3 and so forth). Although they are with Anthony Perkins, I'm pretty sure they are not as good as this one though.A very eerie performance by Mr. Perkins then, with a very interesting idea (that hopefully comes as a surprise when you watch it, because it would be a shame if someone did spoil you the movie, by telling you what will happen). Quite a few things get done here and other directors have taken those ideas and used them time and again. It's a testament to Hitchcocks genius, how good his movie works and still how much tension is in it, because it hasn't aged a bit.A great movie, by a great director. I watched it recently at a cinema, but I have to admit, that I missed the small cameo Hitchcock has in his movies. That's saying something about how gripping the movie was for me. And since I hadn't seen it for quite some time, I really discovered quite a few things, by watching it. So even if you have seen it, you can watch it again and again!"},{"username":"classicsoncall","userUrl":"https://www.imdb.com/user/ur2707735","reviewLink":"https://www.imdb.com/review/rw1571618","warningSpoilers":true,"date":"13 January 2007","rate":"9","helpful":"4 out of 4 found this helpful.","title":"\"My hobby is stuffing things...\"","content":"Chances are that if you go into this movie cold without knowing anything about it (I know, that's almost impossible), you'll be about a half hour into the picture and wondering what the title might be all about. Sure Marion Crane (Janet Leigh) seems highly erratic when questioned by the patrolman, but hardly psychotic. It's not until director Hitchcock suddenly pulls the rug out from under the forty thousand dollar robbery setup, and Marion falls victim to the frenzy of a slashing knife accompanied by the now historic soundtrack that's been indelibly identified with \"Psycho\", that we get the idea that this is not your standard mystery.This is a classic and historic movie, the first on many levels to create a new kind of horror film. Hitchcock was a master of thrills and suspense without ever relying on violence. Here he allows a slight departure from that formula, but without overemphasizing the gore. When the naked Marion Crane is attacked in a shower, completely helpless, it was the birth of a new genre, which unfortunately has degraded into the sensationalist slasher schlock of present day. In \"Psycho\", you never see it coming, except for that shadowed figure behind the shower curtain, but by then it's too late to gasp, you're caught up in the on screen event, and it leaves you breathless.Some viewers call it a perfect film. I don't know if I would go that far, as I've thought about things I might have changed in telling the story. When Marion leaves the used car lot under scrutiny of the highway patrolman, it makes you wonder why he didn't follow up his instinct that there was something fishy going on. Then at the end of the film, the way the psychologist explained in detail the nature of Norman Bates' psychosis, made it seem like it wasn't enough to let the viewer arrive at a conclusion for oneself. But those nitpicks aside, one has to give credit to the principals for pulling off a great psychological and horror thriller. Anthony Perkins couldn't have been smoother, and it's not until at least a second viewing that you realize how wonderful a set up you have to the film's dire outcome. Sitting there talking to Marion among his menagerie of stuffed birds, Norman Bates gives a subtle hint as to the horror about to unfold - \"You know what I think..., I think that..., we're all in our private traps, clamped in them, and none of us can ever get out...\"Watch this one alone..., at night..., in the dark."},{"username":"lee_eisenberg","userUrl":"https://www.imdb.com/user/ur4888011","reviewLink":"https://www.imdb.com/review/rw1126526","warningSpoilers":true,"date":"14 July 2005","rate":"10","helpful":"9 out of 13 found this helpful.","title":"since everyone knows the story, let's talk about camera angles and such...","content":"I checked the spoiler box because I think that even any discussion about camera angles will give the ending away. For starters, when Marion and Norman first meet, you can see Norman's reflection in the window, as if there's two of him. When Marion and Norman are eating dinner in the room with the stuffed birds, you can see that some of the birds are positioned so that their beaks look almost as if they're pecking at both Marion and Norman; something is eating at Norman, and we get to see a premonition of Marion's impending fate. When Norman looks through the hole (which incidentally is behind a picture of two people attacking a woman), we get a POV shot; when Marion is in the shower, we get a POV shot. When Norman pushes Marion's car into the swamp, half of his face is in a shadow, as if he has two sides.On the subject of those birds, there are several references to birds throughout the movie: Marion's last name is Crane, she comes from Phoenix, and finally, the stuffed birds. The truth is, Hitchcock had a keen interest in avians; in \"Sabotage\", a woman finds her strength after watching \"Who Killed Cock Robin?\", then the bird references in \"Psycho\", and finally, the ornithological uprising in \"The Birds\". Speaking of the characters' names, there's Crane (a bird), Bates (bait), Loomis (gloom), and Arbogast (aghast).Another thing that Hitch does in this movie is play with the audience. First, the movie focuses on Marion. When she steals the money, you're not sure whether to root for her, because she is the main character and you want her to succeed, but do you want her to steal? Then, the movie focuses on Norman. When he hides Marion's murder, you want him to succeed, but succeed in hiding a murder? Finally, the focus shifts to Lila.Everyone remembers the shower scene, but what does it mean? It seems as though Marion, by flushing the paper down the toilet, was washing away her misdeeds, and taking a shower consecrated that.The dialogue is of course a key part. Obviously, \"Mother...what's the phrase...isn't quite herself today.\" and \"A boy's best friend is his mother.\" are premonitions, but there are others. In the discussion of institutions, Norman talks about \"...the cruel eyes studying you.\" Then, when he looks through the hole, his eyes study Marion. At the end, you might say that there are three explanations: first, the bombastic psychiatrist explains Norman's mental state; then, \"mother\" describes how her son is guilty; and finally, the car is towed out of the swamp, as though they have dug into the putridity of Norman's mind. They have penetrated Norman's mind, just like the knives penetrated Marion's and Arbogast's bodies.On the DVD, you should watch the original trailer, which has Hitch showing us around the motel and house. He was really playing with the audience there. First off, he looked into a toilet. No movie had ever portrayed a toilet (but everyone knew why toilets existed), so what must the audience have thought about that? Also, he looks in a closet, looks surprised, and closes the closet. Did he see something in there? I try to imagine being someone who saw that trailer, and then saw the movie, waiting to see what would happen."},{"username":"gavin6942","userUrl":"https://www.imdb.com/user/ur1234929","reviewLink":"https://www.imdb.com/review/rw1570639","warningSpoilers":false,"date":"12 January 2007","rate":"9","helpful":"2 out of 4 found this helpful.","title":"So Influential, It Makes My Head Spin","content":"A young woman named Marion Crane (Janet Leigh) steals $40,000 (roughly a quarter million today) from her employer and runs off to meet her boyfriend. But along the way she stops at the Bates Motel, and meets the charming Norman Bates (Anthony Perkins). Marion and her money might not make it back to her boyfriend Sam in perfect condition.Yes, after 47 years of this film existing and being a horror fan for well over 10 years now, I finally broke down and watched what is widely considered to be Hitchcock's best film (I had previously seen \"Lamb to Slaughter\", \"Rear Window\" and \"Vertigo\" -- and have now seen many more since). Boy, was I missing out on something! Now I cannot wait to see \"Psycho 2\" and \"Psycho 3\" (which I own for some reason). I have seen parts of the Gus Van Sant remake but was not impressed.The acting was very good, especially from Anthony Perkins (Norman Bates). He did a great job as a friendly boy-next-door caretaker. Vivian Leigh was also good as Marion Crane, and I am sorry she had to have a hermaphroditic child like Jamie Lee Curtis. All other parts were fine. I hear they called the actor who played Sam Loomis \"the stiff\" and boy are they right! Later in the film he loosens up a little bit, but in the opening scene he seems so wooden.The bird symbolism is nice... especially with Hitchcock's other big horror film being \"The Birds\". And the main character being Marion \"Crane\"? Is she going to get stuffed like the other birds in the parlor? I will not say, but you probably already know (since pretty much everyone knows about this film even if they never saw it).Most startling for me was Bernard Herrmann's score, particularly the main theme (not the knife noise). I had long heard rumors that \"Re-Animator\" ripped off the \"Psycho\" theme and I thought they meant it was a variation on the theme. An homage, perhaps (because who would try to steal from such a famous film). Well, the music is exactly the same. I mean, really dead on. So now I do not know how to feel about \"Re-Animator\", which is practically my favorite horror film (with all due respect to \"The Janitor\")... which shakes up my whole foundation and makes me rethink movie history! My only complaint was the confusion (at least for me) of where the Bates Motel is. Marion drives all Friday night and then arrives Saturday evening, implying it is a great distance from Phoenix. Yet, when the detective investigates the motel, he tells someone on the phone he is less than an hour from them. Where is he based if not Phoenix?Well, if you have not seen this, you should. It is a classic and with good reason (as I typed this the first time, it was ranked the 22nd greatest film of all time on Internet Movie Database and still lingers around 25th three years later). Not just a great horror classic, but also a great film with great directing and cast. Plus, if you are from Wisconsin like I am, you'll love the Ed Gein storyline. (Incidentally, if you have never visited Ed Gein's hometown or grave, you should. It is a good time.)"},{"username":"jboothmillard","userUrl":"https://www.imdb.com/user/ur4248714","reviewLink":"https://www.imdb.com/review/rw1032823","warningSpoilers":true,"date":"4 March 2005","rate":"10","helpful":"5 out of 8 found this helpful.","title":"Psycho","content":"This film is the most famous of all the films by Oscar nominated director Sir Alfred Hitchcock, unfortunately Rebecca was the most popular of his films, according to cinema tickets. Golden Globe winning, and Oscar nominated Janet Leigh plays Marion Crane who has stolen $40,000 from her boss, she is now on the run. On her journey she finds the Bates Motel and decides to stop there for the night. She then meets a great villain played by Anthony Perkins, Norman Bates. As she gets to know him she finds he is quite terrifying while talking. He mentions his mother and says \"She just goes mad sometimes. We all go a little mad sometimes!\" Anyway, later she takes a shower, and everyone remembers seeing the stabbing of her, and the star is dead. The film continues this psychopathic story by having first Det. Milton Arbogast (Martin Balsam), who is murdered, and then her sister Lila (Vera Miles) and Sam Loomis (John Gavin) come and look for her. Hitchcock has done a superb job in creating suspense and horror, I especially loved the dead mother in the chair, and the great score by Bernard Herrmann, particularly the famous high screeches of the violins (like knives stabbing). Hitchcock's cameo is a man through Leigh's office window, wearing a cowboy hat. It was nominated the Oscars for Best Art Direction-Set Decoration and Best Cinematography. Sir Alfred Hitchcock was number 75 on The 100 Greatest Pop Culture Icons, the film was number 4 on 100 Years of Film Scores, it was number 56 on 100 Years, 100 Quotes (\"A boy's best friend is his mother.\"), Norman Bates was number 2 on 100 Years, 100 Heroes & Villains, the film was number 11 on The 100 Greatest Scary Moments, it was number 1 on 100 Years, 100 Thrills, it was number 18 on 100 Years, 100 Movies, and it was number 11 on The 100 Greatest Films. Outstanding!"},{"username":"rmax304823","userUrl":"https://www.imdb.com/user/ur0819382","reviewLink":"https://www.imdb.com/review/rw2375124","warningSpoilers":true,"date":"24 January 2011","rate":"9","helpful":"3 out of 4 found this helpful.","title":"Perfectly Normal Norman.","content":"Hereabouts there be spoilers.I don't usually bother with warnings that some reveals will be revealed because so few films actually HAVE twists in them that are in any way shocking. Many mysteries, possibly most, have surprises waiting at the end but they rarely leave you dumbfounded. \"The Crying Game\" is one of the exceptions, however, and \"Psycho\" is the mother of them all.There isn't much point in going through the plot again, so I'll just note a few impressions that have lasted over many viewings.One is that there are a couple of usually ignored people in the crew that deserve medals. One is the production designer, who is responsible for the overall look of the picture. His work could hardly be improved upon, from the oppressively bleak landscape surrounding Janet Leigh's car when the CHP officer wakes her up, to the haunted mansion on top of the slight hill, surrounded by gardens of weeds.The other neglected contributor is the set dresser. Of course the director, the punctilious Hitchcock, decides questions of props and camera placement, but -- that soulless and bourgeois real estate office with its potted plants and its large picture of a sere landscape that perches over Janet Leigh's desk; the stuffed birds suggestive of Poe (a raven) or a menacing nocturnal predator (an owl), and the pictures of birds, juxtaposed with pictures of roly poly naked nymphs, some in the act of being violated. In Bloch's novel and in the film, the untitled book that Vera Miles examines in Perkins' little-boy bedroom is filled with pornography but it couldn't be shown on screen.The murder in the shower doesn't need to be described but I've never been able to watch this without a sinking feeling that Janet Leigh really doesn't NEED that shower at this particular point in time and space. Leigh is a fine actress. When she's driving away from Phoenix and the camera is on her face, minuscule expressions come and go across her features, reflecting the conversations she's fantasizing about. There's even a hint of a wry smile when she imagines the outrage of Cassady, the fat and self-satisfied millionaire, when he discovers that Leigh has absconded with the money he flaunted, as in -- \"Take that, you bastard.\" There's something aptly birdlike about Janet Leigh too. She's narrow shouldered and long legged, a little stork-like, as well as being just the right age. She has the desperation of a woman facing forty. Of course to a man who's spent the last ten years alone with a corpse, Leigh is an object of Paphian interest. She's old but not too old yet, just as she's a star but not too big a star to torpedo the movie when she is eliminated from it.Two shots stand out from a multitude of originals. (1) When Balsam finds Leigh's fake signature in the motel's register, the camera is looking up at Tony Perkins, who is nibbling some candy. Balsam says, \"Oh, yes. Here she is,\" and invites Perkins to examine the fake. The camera doesn't cut away but remains on Perkins' jaw as he leans over the unseen book and we watch his jaw and adam's apple working nervously away. (2) Perkins decides to move Mama from her bedroom to the fruit cellar. The camera follows him very slowly as he climbs the stairs and enters her room, but inside of going through the door, the camera rises about the transom and pivots around, an extraordinary movement, so that when Perkins exits lugging mother in his arms, we are too flabbergasted by what the camera has done to notice any discrepancy between the reality Norman has constructed for us and any reality that most of the rest of us might recognize.(3) Just to be wanton, I'll throw in that shot of Janet Leigh's dead eye. The camera first follows a pale stream of blood down INTO the bathtub drain, then dissolves to Leigh's staring iris, then draws back along the floor while deliberately righting itself from a slight tilt to the proper vertical. (Check out the remake. The camera apes the original shot but practically twirls on its axis.) Two weakness or, let's say, things I wish Hitchcock would have done a little differently. One is that car gurgling and sinking into that accommodating swamp. You only find those swamps in the movies and Louisiana. The second is that experimental scene in which Martin Balsam tumbles backward down a rear-projected staircase. The director was more proud of the mechanical difficulties behind that shot than he had a right to be.You know what occurs to me sometimes, when I'm watching this, or when I'm watching some of the garbage that now fills our screens? I wish that the people writing and directing movies like \"Saw II\" would rescreen \"Psycho\" so they could get some hint about how to make a truly horrifying movie with practically no blood, no monsters with chain saws and no teen agers screaming and running round in panties. Man, have we lost our grip, or what? And while we're at it let's have no more girls named Jillian or Megan, either. I'm tired of them. Bring back the old days when movies had little blood and girls had sensible names like Mary and Hepzibah. Oh -- and let's get rid of that hand-held electronic junk too. No more iPods or Pseudopods or whatever they are. No Blackberries or Strawberries either. Whatever happened to whitewall tires?"},{"username":"ccthemovieman-1","userUrl":"https://www.imdb.com/user/ur4445210","reviewLink":"https://www.imdb.com/review/rw1506203","warningSpoilers":true,"date":"25 October 2006","rate":"10","helpful":"162 out of 187 found this helpful.","title":"The More I See This, The Better It Gets","content":"When I watched this for the first time in over 30 years, I was surprised how little action there was since I had remembered this as some intense horror movie. Of course, I was young and more impressionable so I guess I just remembered those few dramatic, sensational scenes such as Janet Leigh murdered in the shower and the quick other murder at the top of the stairs. Basically, that was about it, action-wise, BUT I have no complaints because the more I watch this film, the more I like it. It has become my favorite Alfred Hitchcock movie, along with Rear Window.I mention the lack of action, and blood, too, because younger people who might be watching this for the first time are not going to see the kind of horror film they're accustomed to seeing. A generation back, movie makers tended to build up characters and suspense, so there was a lot more storytelling and less action than you see today. Also, this movie doesn't have the shock value today for audiences, either, not after years of Freddie Krueger-type blood-and-guts seen in the past 30 years.But, what you WILL see in this movie is (1) superb acting; (2) a fascinating lead character; (3) excellent photography, and (4) a bizarre story.\"Norman Bates\" is one of the most famous fictional names in film history, thanks to this film and the great work portraying him by Anthony Perkins. \"Norman\" is a nutcase, as it turns out and the more you know all about him, the more fun it is to study Perkins and his character \"Norman\" in subsequent viewings. He really has the guy down pat. However, it isn't just Perkins' film; the supporting is just fine with Leigh, whose figure is still awesome no matter how many times you see it; Martin Balsam as the private detective; Vera Miles and John Gavin. Everyone contributes.What makes me really enjoy this movie is the cinematography. I bought this on VHS when it became available on widescreen. Later, of course, I got the DVD. Each time, I appreciate John Russell's camera-work and Hitchcock's direction more and more. I wonder if this isn't Hitchcock's best job of directing as his camera angles and lighting are outstanding. On the DVD, the blacks, whites and grays are just super and the famous house next to the Bates Motel never looked better. That house really looks eerie.The sound effects in here don't hurt. When Balsam is attacked, the accompanying frightening music never fails to bring chills down my spine. The music literally \"screams\" at you.I went 35 years between showings but now have watched this five times in the past four years. I love it and look forward to seeing it again. Many people here think this is Hitchcock's greatest film. Add me to that list."},{"username":"Tweekums","userUrl":"https://www.imdb.com/user/ur13977076","reviewLink":"https://www.imdb.com/review/rw3631718","warningSpoilers":true,"date":"2 February 2017","rate":"10","helpful":"3 out of 3 found this helpful.","title":"An unforgettable masterpiece","content":"Marion Crane works for an estate agent in Phoenix; one Friday afternoon a client pays $40,000 in cash for a property and her boss ask to take it for the bank as he doesn't want it in the office over the weekend. Rather than going to the bank she sets off to California. It is a long journey and after spending one night in her car, after she is woken by a suspicious police officer she buys a new car. Then, as it starts to rain, she leaves the main road and stops at a remote motel for the night. The motel is run by Norman Bates who tells her that he lives in the neighbouring house with his aged mother. He appears to be friendly as he offers to make her something for supper. She hears his mother expressing her disapproval of him being alone with a young woman before she has her supper in the office. The then returns to her room and prepares for bed. Now things get creepy; Norman takes a picture off the wall and uses a spy hole to observe Marion as she gets undressed. Then as she takes a shower somebody enters her room and brutally murders her. Soon people are starting to wonder what happened to her and the $40,000. Her boss has sent a private detective to find her and her sister goes to see her boyfriend, who has no idea where she is. The detective checks a string of motels before finding that she stayed at the Bates motel. As the story progresses we learn more about Norman and his mother all leading to one of cinema's most shocking conclusions.This film is rightly considered a classic; I would love to have watched it without knowing about what happened. For the first half of the film follows Marion Crane, setting her up as the protagonist; everybody else we see, including Norman Bates, appears to be very much secondary characters so anybody lucky enough not to know the film's first famous twist should be genuinely surprised. Until her death it looks as though the film would centre on whether she would be caught or whether she would see the error of her ways and return the money. After the infamous 'shower scene' the tone changes dramatically as we learn just what is going on at the Bates Motel and ultimately discover Norman's shocking secret. Janet Leigh does a fine job as the good girl who has made a bad choice but it is Anthony Perkins who stands out with his nuanced performance as Norman Bates; at times charming at others chilling. Hitchcock's direction is superb; he manages to show brutal murder without actually showing and of the actual brutality; just a raised knife, Marion screaming and blood going down the plug hole blood that isn't even red as the film is black and white. Obviously this isn't suitable for younger viewers but I'd say it is a must see for all older film fans."},{"username":"ma-cortes","userUrl":"https://www.imdb.com/user/ur3270789","reviewLink":"https://www.imdb.com/review/rw1681310","warningSpoilers":false,"date":"26 June 2007","rate":"8","helpful":"14 out of 16 found this helpful.","title":"Hithcock masterpiece in his most accomplished and perfect movie","content":"This famous film with known story tells about Marion Crane(Janet Leigh),she works in a Phoenix(Arizona)office,when his employer trusts her a money.Seeing the opportunity to take the cash and beginning a new life along with her fiancée Sam(John Gavin).Larcenous Marion leaves Phoenix and heads with her car toward California where her lover with debts is owner a store.When is caught in a storm and pursued by a policeman,she leaves the highway and enter to Bates hotel.The hotel with twelve rooms (and 12 showers) is managed by a strange young who seems to be submitted by his overbearing mother,she's leaving into a creaky mansion nearly to hotel.Then,rare thing start to happen.Later a detective named Arbogast(Martin Balsam),her sister(Vera Miles) and Sam(John Gavin) are looking for to Marion,asking help to sheriff(John McIntire).Psycho was not only Hitchcock's biggest successful movie,but was a phenomenon in its own right.The picture is a magnum opus of the terror genre and its immediate impact and its future influence was enormous and cannot be over emphasised.It's the quinta-essential shocker that initiated an authentic sub-genre about psycho-killers continuing until nowadays.The shower images is one of the most studied ,copied and analysed sequences in cinema history and has obtained a notoriety what exceeds of the movie itself.Terrific performance by Anthony Perkins in an immortal role as Norman Bates and sensational Janet Leigh with Oscar nomination included that was the only one of her career.Inventive and superbly constructed plot,filled with delicious black humor, by Joseph Stefano based on Robert Bloch's novel.The highlight film is,of course,the shower scene,it was made 70 cameras to shot the 45 seconds of footage and the creepy sound effects were realized by stabbing a knife into a melon.Magnificent main titles by Saul Bass,he's usual on Hitcock films.Excellent black and white-Hitch thought it would be gory in colour- cinematography by John Russell.Bernard Herrmann'legendary musical score copied and endlessly imitated aids to create a thrilling atmosphere.Film is directed with exquisite taste and intelligence by the master Hitchcock who makes an impeccable control of every scene and maneuvers your emotions, infusing with a deliciously macabre wit,it makes ¨Psycho¨far superior to the several movies what tried duplicate,these are the following: PsychoII(1983)Richard Franklin,PsychoIII(1986)Anthony Perkins and for cable television:PsychoIV(1990)Mick Garris.Psycho'Hitchcock belongs his best period in the 5os and 60s when he produced his finest work,perfecting the art of suspense in a series of masterpieces,Dial M,Rear widow,Vertigo,North by Nortwest,Birds and specially Psycho what are still studied and copied today.Rating: Indispensable and essential classic movie."},{"username":"paul_haakonsen","userUrl":"https://www.imdb.com/user/ur22654354","reviewLink":"https://www.imdb.com/review/rw4200701","warningSpoilers":false,"date":"12 June 2018","rate":"6","helpful":"4 out of 8 found this helpful.","title":"One of the classics...","content":"\"Psycho\" is a true classic, which I doubt anyone would really argue against.It has a good story and an equally great presentation of the storyline on the screen.The movie has a good cast to perform the various roles and characters throughout the movie. And I will say that Anthony Perkins is just amazing in the role of Norman Bates, and he alone truly made Norman Bates immortal.\"Psycho\" is adequately paced, because director Alfred Hitchcock truly was good at building up suspense and letting scenes lead up to interesting climaxes.While \"Psycho\" is not your average slasher movie with high body counts and gore in abundance, it has the right amount of suspense and thrills to make a proper movie. If you haven't already seen this classic horror movie, then you definitely should take the time to do so."},{"username":"BA_Harrison","userUrl":"https://www.imdb.com/user/ur0945066","reviewLink":"https://www.imdb.com/review/rw2230892","warningSpoilers":false,"date":"4 April 2010","rate":"10","helpful":"1 out of 6 found this helpful.","title":"Not to be confused with the 1998 film of the same name (as if).","content":"Psycho is undoubtedly Alfred Hitchcock's most famous film, and not for no reason: it's a masterclass in suspense, tension and terror that, even half a century after it first stunned audiences with its raw, psychological horror, has lost none of its ability to shock.For those who don't already know, Anthony Perkins plays Norman Bates, creepy proprietor of the Bates Motel, situated off the old highway 15 miles from the town of Fairvale. Janet Leigh is bank employee Marion Crane, who has let temptation get the better of her and absconded with $40,000. Feeling tired after a long trip on the road to visit her lover Sam Loomis (John Gavin), Marion decides to check into the Bates establishment, where she meets a sticky end whilst taking a shower (c'mon, don't tell me you didn't know...).When Marion's sister Lila (Vera Miles) travels to Fairvale to see if Sam knows anything of her sister's whereabouts, she is tailed by private detective Milton Arbogast (Martin Balsam), whose expertise eventually leads him to the Bates motel where Norman and 'mother' wait with butcher's knife in hand.Working from a script by Joseph Stefano (based on the novel by Robert Bloch), Hitchcock delivers a flawless exercise in horror that sees the director develop techniques so effective that they are still imitated to this day, but which are rarely as well executed as they are here. Hitchcock's finest achievement with Psycho is undoubtedly fooling his audience into assuming that Leigh is the central character and then suddenly bumping her off, metaphorically pulling the rug from under the viewers feet; but he also manages many other brilliant touches, including Marion Crane's tense flight from Phoenix, where she imagines how events are unfolding at the bank, Norman's disposal of Ms Crane's car in a swamp (with her body in the boot), a moment of wonderful dark humour as the vehicle momentarily refuses to sink, and of course, the macabre ending in which Lila discovers Norman's mother hiding in the fruit cellar.Add a cool title sequence by Saul Bass and a fantastic score by Bernard Hermann, itself often imitated, and what you have is a bona fide classic of the horror genre (yes, horror) that any self respecting fan should ensure that they see at least several times. It's that good."},{"username":"moonspinner55","userUrl":"https://www.imdb.com/user/ur0989035","reviewLink":"https://www.imdb.com/review/rw1202442","warningSpoilers":false,"date":"26 October 2005","rate":"7","helpful":"4 out of 8 found this helpful.","title":"Exasperatingly detailed, steely-cold precursor to the 'slasher'...","content":"Alfred Hitchcock has no sympathy for the victims in \"Psycho\", and he views them dispassionately. This relatively low-budget film is in silvery black-and-white, eerie and beautiful, with gliding camera-work and clever production touches which warrant repeat viewings, however it is much too merciless towards its characters to be a black comedy. It's also not much of a murder-mystery (we have an early idea of what's going on), yet the suspense in the third act is mounted with cunning precision. Mostly, Hitchcock seems curiously fascinated with plot-exposition and details, although the picture is still quite chilling. Anthony Perkins' tightly-controlled performance as Norman Bates is hypnotizing: his boyish good looks can be taken either way--gangly or crazily disconnected--and his eyes, which are frantic, dart around like an impatient child's (it's the role of a lifetime). I didn't much care for Simon Oakland's psychology report at the end, but the final shots and the voice-over are masterfully pulled-off. *** from ****"},{"username":"TxMike","userUrl":"https://www.imdb.com/user/ur0438066","reviewLink":"https://www.imdb.com/review/rw0071995","warningSpoilers":false,"date":"3 July 2000","rate":"","helpful":"0 out of 3 found this helpful.","title":"A real Hitchcock masterpiece...\"She wouldn't even harm a fly.\"","content":"I was only 14 in 1960 when this movie came out, and after 40 years I finally saw it! A true Hitchcock masterpiece. You may not like the story - a pretty young woman steals $40,000 from a client and is murdered just as she decides to return the money - but you gotta like the ensuing drama and detective work. I like the way the detective ties up all the loose ends with a narrative, so you don't have to guess what actually went on in Norman Bates' deranged mind. Black-and-white photography never worked so well.Update August 2021: I watched it again on a more recent BluRay edition with DTS sound and remastered picture, it was quite a treat. The disc also has interesting bonus features. From my public library."},{"username":"dbdumonteil","userUrl":"https://www.imdb.com/user/ur1219578","reviewLink":"https://www.imdb.com/review/rw0072075","warningSpoilers":false,"date":"27 August 2001","rate":"10","helpful":"2 out of 6 found this helpful.","title":"Calling it a masterpiece is an euphemism.","content":"One of the few gems that would deserve more than the simple 10!It's the finest thriller of all times,but it's not only a thriller:it's everything:a psychological drama,a -monstrous- love film,a road movie-in its first part-,a psychopathology study,an update of those novels of the nineteenth century in which you take your life in your hands when you enter an isolated inn.All this and so much more.Indeed so horrendous were the chances taken by Hitchcock on this movie that,with any lesser skill,the result could have been disastrous;think of it: the heroine disappears halfway through the movie ,leaving the spectator an orphan,or Tom Thumb in the threatening forest;one third of the movie features no dialogue at all;it was a shoestring budget because nobody but the Master and his close collaborators like Herrmann believed in such a project.Bernard Herrmann outdoes himself for the absolutely perfect soundtrack.His work is so haunting,so mesmerizing that it was imitated to death,when it was not simply used as it was in countless plagiarisms.(DePalma's \"Dressed to kill\" is a good example)Pushing his innovations forwards,the Master,after having used in \"the rope\",only 11 shots for the whole movie,reverses his strategy:70 in the 45 seconds shower scene.Nothing of the plot should be revealed.Everything you would say would be a spoiler.I'm sure that I've already said too much of it.Just enjoy."},{"username":"Quinoa1984","userUrl":"https://www.imdb.com/user/ur0453068","reviewLink":"https://www.imdb.com/review/rw0071962","warningSpoilers":false,"date":"21 February 2000","rate":"10","helpful":"4 out of 8 found this helpful.","title":"Shocking","content":"Psycho is one of Alfred Hitchcock's best films ever made and is one of the few horror masterpieces in film history. That's the main-line, given stroke of it. But what it comes down to is that, really, seriously... it's Psycho - the one and only (that we acknowledge, screw off, Gus Van Sant). More than anything why it's Hitchcock's triumph as a commercial filmmaker - past the shower scene and the camera tricks and the notorious finale - is that it's (not so) secretly a monument to what we hide in all of us.What I love about the movie seeing it again after so many years is seeing how in her own way Marion Crane is a bit of a psycho, just not quite at the level of 11 that Norman Bates is. There's an interesting parallel to make to how voice-over is used; Marion's imagination gets the better of her for a moment as she drives along and she makes up what the cop that pulls her over, her boss, her boyfriend, etc, all say. Watch as her face contorts into a little grin, almost against her better judgment, when she imagines the more twisted portion of the dialog. Frankly, I've had dialogs going in my head like that, imagining the worst that could happen from a mistake or bad deed, and almost taking pleasure in the more morbid aspects (I mean, hey, I directed Jealous Jerzy, what does that tell you? But I digress).So keep that in mind when it comes time for the end of the movie - hell any portion really with Norman and \"Mother\". But mostly that last scene. After what is an amusing parody of exposition (the psychologist goes on for so long that it's the only logical explanation aside from dated, clunky writing - I prefer to think Hitchcock was smarter than that and was mocking what would or could be an exposition on Norman Bates + Mother and then just \"Mother\"), Norman/Mother is in his/her room, and the camera closes in as the voice-over gets intense, plotting, paranoid, not wanting to swat a fly. Perhaps Hitchcock wants to draw the parallel, though there is a distinction: Marion imagines other people talking, while Norman isn't even in the equation: it IS Mother. Yeah.Such great stuff. And if you haven't seen it before... what are you reading this for ya dummy!"},{"username":"edwagreen","userUrl":"https://www.imdb.com/user/ur2542703","reviewLink":"https://www.imdb.com/review/rw3620811","warningSpoilers":true,"date":"16 January 2017","rate":"9","helpful":"0 out of 0 found this helpful.","title":"***1/2","content":"Janet Leigh received a best supporting actress Oscar nomination for the secretary who steals money only to make a wrong turn on the highway and wind up at the Bates Motel. Guests generally check in and do check out in the most ghastly manner.This is an intense psychological thriller with Anthony Perkins stealing the show as the psychotic killer who has also assumed the identity of the mother he murdered 10 years before and her apparent cruelty sticks with him from the deeds he has done.It does take for picture's end for Simon Oakland, as the detective, to explain what has been going on.Vera Miles, as her sister, John Gavin, as her lover, and Martin Balsam, the detective who sets out to find her after she is missing, are all in her orbit. That shower scene shall forever be eerie."},{"username":"Coventry","userUrl":"https://www.imdb.com/user/ur2020269","reviewLink":"https://www.imdb.com/review/rw0072286","warningSpoilers":false,"date":"13 September 2003","rate":"9","helpful":"3 out of 13 found this helpful.","title":"The one and only !","content":"Millions of movie reviews by respect critics as well as by ordinary film fans have confirmed this many times already: Psycho is a true masterpiece and one of the most influential and original horror stories ever shown. I have very few to add to that, except for the fact that I couldn't agree more with this status. I'm not a giant fan of Alfred Hitchcock but I do find that he deserves his title \"master of suspense\". If it were only for this movie alone. Psycho is the most important modern horror movie since it gave a whole new image to the character of the \"serial killer\". Norman Bates is frightening but there's always sympathy for him. He's the most influential horror icon without a doubt. I doubt that there're many people who don't now about the terrific climax by now. I've heard spoilers about this movie before I knew it even existed...But still, there are always surprises to discover and no matter how many times you see it you'll always be impressed. Other than that, there isn't much to say about this milestone in cinema. Watch this movie if you haven't yet and don't go on calling yourself a cinema fan before you see it !! But, avoid the 1998 remake at all costs! Although there are a few decent actors in that ( William H.Macy, Julliane Moore and Viggo Mortensen ) it's a disgrace to Alfred Hitchcock and to everyone else who was involved with the original version"},{"username":"dougdoepke","userUrl":"https://www.imdb.com/user/ur10348034","reviewLink":"https://www.imdb.com/review/rw2862501","warningSpoilers":false,"date":"2 September 2013","rate":"","helpful":"6 out of 6 found this helpful.","title":"A Key Scene in Depth","content":"In sixty years of movie watching there's one extended scene in Psycho that I count as being of unsurpassed brilliance. That's the about 7-minute scene in Norman's parlor where Marion has a bite of dinner shortly after arriving at the motel. To get an idea of its impact and significance, the setting is important. The parlor is dimly lit, casting shadows appropriate to the Gothic plot. Norman sits on one side, a stuffed raptor on the adjacent wall. It's shrewdly placed since the menacing wing-spread can background Norman when Hitch so chooses. Marion sits on the opposite side in a more conventionally lit setting, bespeaking her more conventional nature. Significantly, Hitch cross-cuts between them the entire time, never showing them in the same frame, thus emphasizing Norman's uniqueness and dominating part of the conversation.Now Norman is clearly unsure how to talk to the attractive woman alone with him in this, a private room. So he launches into a safe topic for him, but completely inappropriate to the light meal Marion is eating, namely his hobby, taxidermy. That is, how he likes to stuff birds but not the gore that comes with beasts. This tells us the important point that Norman is inexperienced socially, an aspect that fits in as the various parts of his nature come together over the movie's time-line. Throughout the tete-a-tete, Marion maintains a cautious but polite reserve as Hitch crosscuts between them. Her role here is mainly to draw the boyish stranger out. From taxidermy the dialog takes a more intimate turn. What emerges from the next topic, namely how to fill one's time, is that Norman is uncomfortable with his life with Mom. At the same time, however, he tries to casually laugh it off, one of his main defense mechanisms. Marion suggests that perhaps he should leave, that is, go away. But Norman senses something. He may be confused about a lot of things, but he's intuitive when he interjects that Marion must be running away from something, as indeed she is. At this point the conversation takes on a momentum that is revealing more and more about Norman's inner life. That's apparent when he starts talking ominously about private traps from which no one can escape—how we \"scratch and claw\" (like a bird) but never to any avail. To Marion, this is a challenge to escape the embezzlement trap she's gotten herself into. To Norman, it's a disclosure of how he views his own life, and an excuse for not doing anything about it as though in his madness he could. At this point, Marion senses Norman's problem lies with his mother and suggests that he get away from the motel and from her. Once the topic turns to Mother, Hitch frames Norman in the foreground with the ominous stuffed bird (Mother) looming over him. Now we know Norman is indeed trapped and that Marion is venturing into dangerous territory. She accelerates the danger by suggesting that he should put Mom away, like \"in an institution or something\". This triggers a sudden, hostile response as Norman associates strangers and unfamiliar surroundings with thoughts of death, as indeed it would be for him. But true to his defense mechanisms, he does an abrupt 180 and laughs off the suggestion with the supreme irony that whatever her problems, at least Mom's \"harmless\". Then in another note of supreme irony, he trivializes her problem by saying that anyway we all go \"a little mad sometimes\". This of course would include Marion by inference, who now has a sense of her own embezzlement predicament and breaks off the conversation by resolving to return to Phoenix and face the music. At the same time, Norman reverts to his usual affable façade. And the scene ends. But unbeknownst to Marion, she may have resolved one trap, but has now entered a far more deadly one.This is the central scene of the film. It's not the most dramatic, but it is the one where we gain important insight into Norman's mental processes. Now as good as the writing and direction are, it's really Tony Perkins's exquisite performance that makes the seven minutes absolutely spellbinding. Watch how quickly and persuasively he changes expression and mood. Because of his expertise, we know that something's seriously wrong with Norman, but can't be sure exactly what, while it takes the rest of the movie to find out. One moment, he's all boyish charm, the next he's glaring darkly with inner fire. Of course, Janet Leigh's superb performance as Marion should not be overlooked. In this key scene, her task is to politely draw out Norman's feelings, an essentially secondary role, but demanding in its own way. Note how delicately she balances her bites of food with proper emotional composure as this strange man reveals more of himself to her. Without doubt, this was an actress with more than just a pretty face.To me, Perkins' eccentric performance is clearly Oscar worthy, ditto the picture itself, along with Hitch's masterful direction. But industry prejudices against horror movies was just too strong then and perhaps now. Of course, it didn't help for Oscar purposes that the production was also low-budget b&w. But I doubt the audience impact would have been nearly as great had that unforgettable package been upscaled in any fashion. At the same time, a big part of the classic flick, in my book, at least, rests with that 7-minutes of emerging horror, so brilliantly understated."}],"errorMessage":""}