{"imDbId":"tt0027977","title":"Modern Times","fullTitle":"Modern Times (1936)","type":"Movie","year":"1936","items":[{"username":"MartinHafer","userUrl":"https://www.imdb.com/user/ur2467618","reviewLink":"https://www.imdb.com/review/rw1324204","warningSpoilers":false,"date":"24 March 2006","rate":"9","helpful":"5 out of 14 found this helpful.","title":"amusing semi-socialist picture","content":"This is an interesting historical film. When it came out in 1936, the Depression was at its height and unemployment was rampant. Because of this, Socialism, Communism and unions were all on the rise. Considering how poor everyone was, these seemed like pretty attractive alternatives. This film was actually a radical political/social message wrapped up in comedy set in the very near future--if it had been presented as a drama, there's a good chance Hollywood would not have made the film. It's about the dehumanization of the worker and this movie as well as Chaplin's political leanings would later come back to haunt him during the Red Scare.But, back to the movie. This film is essentially a series of vignettes all strung together with a schmaltzy plot. It's a shame really, as all the vignettes are good but the plot that connects them is by far the weakest part of the film--partly because Paulette Goddard was NOT a teenager (she was just way too old to play the part) and partly because the moments between her and Chaplin tended to be the slowest and most saccharine in the film. Now I am not saying it's a bad film--far from it. It's just that this element is not the best aspect of the film. Chaplin's timing and athleticism is actually the star of the movie. The film is incredible to watch as he roller skates, glides through AMAZING looking machinery and almost dances through the film. It's a wonderful film technically and fun to watch.PPS--only a few weeks after I first wrote this review, I have seen about 8 more Chaplin movies. After each one, my appreciation for his talents increased. In hindsight, I think a score of 9 is more in order. While it's true I'm not much for pathos, I must acknowledge his amazing talents."},{"username":"TheLittleSongbird","userUrl":"https://www.imdb.com/user/ur20552756","reviewLink":"https://www.imdb.com/review/rw2295183","warningSpoilers":false,"date":"14 August 2010","rate":"10","helpful":"2 out of 6 found this helpful.","title":"Hilarious and original with a great serious message and a poignant love story","content":"As I love Charlie Chaplin, I desperately wanted to see this film, and I am glad I did. It may well have a scathing and critical view of an impersonal society, but that does not stop it from being a wonderful film. What I love most about Modern Times is that it is both hilarious and original, and decides to bring a serious message in and a great one it is too.Modern Times is great visually, the cinematography and editing are both excellent and I loved the machines too as well as the stunning ending shot. The sound is also astonishing, as is the direction. Modern Times isn't completely silent, as it does use some rather nonsensical dialogue, which is used very effectively in mocking the characters. The comedy is very well-handled, we laugh at the Tramp's antics and their consequences, but not only we sympathise with the Tramp but there is also a very poignant love story. And I love the music, actually mainly because of the poignant yet hopeful Smile it is my favourite soundtrack in a Charlie Chaplin movie. The performances are great, Paulette Goddard is wonderful to watch but once again it is Chaplin with his faultless comedic timing and physical humour that captivates most.Overall, wonderful, another one of Chaplin's best. 10/10 Bethany Cox"},{"username":"bkoganbing","userUrl":"https://www.imdb.com/user/ur2483625","reviewLink":"https://www.imdb.com/review/rw2837695","warningSpoilers":false,"date":"24 July 2013","rate":"8","helpful":"1 out of 4 found this helpful.","title":"The last triumph of silence","content":"Modern Times while a wonderful film also forever stamped Charlie Chaplin as the Philip K. Wrigley of film artists. As all baseball historians know Phil Wrigley was the last of club owners to put lights in his ballpark and the Chicago Cubs did not have lights on Wrigley Field and play night games until after his death. So to Chaplin was the last silent screen artist and Modern Times was his triumph in that art form. People actually did see it in 1936 and this was now an audience that was used to dialog from the mouths of movie performers.Modern Times has Chaplin and his little tramp character go after the effects of industrialization and how factory work robs the soul of its individuality and sense of accomplishment. The smarter bosses recognized this and provided workers with incentives and activities that ameliorated this feeling. Too many were like Chaplin's bosses who only thought of increased production.One of the great moments in the film comes when the manager selects Charlie as a test guinea pig for a feeding machine feeling that too much production time was lost while employees had their lunch. Charlie in that machine being force fed was hysterical. The gag was so good that Crosby and Hope used it for a double effect in The Road To Hong Kong.After losing many jobs and spending time in jail when he's picked up for union organizing, Charlie among other things gets a job as a singing waiter. Here Chaplin treads ever so gently into dialog when after losing the lyrics he sings a gibberish type ballad, similar to the Klopstokian language in Million Dollar Legs. Another treasured moment from Modern Times.Modern Times also introduced Paulette Goddard to the big screen and she and Chaplin were involved and got married. In his memoirs Chaplin ironically recounted that while she got many offers after the film was over he because he still would not consider a sound film just stayed at home until 1940 and The Great Dictator. He also said that costuming was difficult. It's easy enough to make a good looking girl enhance her beauty with the best of fashion. But Paulette Goddard who played a poor waif in the film had to look beautiful in rags. Chaplin recounts he spent a lot of time trying to get the right effect for Goddard.Among the many of Charlie's talents was that of composer. His famous ballad Smiles is heard throughout the film at poignant moments. Naturally only as an instrumental. I commend Nat King Cole's recording of the song.Speaking of poignant moments the uncertain future that Charlie and Paulette have at the end of Modern Times cannot be described. Charlie the tramp and Paulette the waif just looking for a spot on earth where they can be themselves. Isn't that something we all want.Though it has little spoken words and none from its leads Modern Times lived up to its billing in that it came out at a time when organized labor was given the right to finally organize and it was struggling to assert that right during the New Deal. A lot of the lessons of Modern Times on that subject need to be revisited. And often."},{"username":"Michael_Elliott","userUrl":"https://www.imdb.com/user/ur13134536","reviewLink":"https://www.imdb.com/review/rw1827799","warningSpoilers":false,"date":"26 February 2008","rate":"","helpful":"0 out of 3 found this helpful.","title":"Another Masterpiece for Chaplin","content":"Modern Times (1936) **** (out of 4)Set during the Depression, a factory worker (Charles Chaplin) and an orphan girl (Paulette Goddard) try to make their way through the world but it appears that they both have everything stacked against them. The two eventually team up and try to form a good life for themselves but more trouble follows.As I go through Chaplin's work again, it's easy to see why someone like him would be so popular among movie fans. I mean, after all, he was filthy rich yet he played a poor and broke man and yet audiences around the world supported the actor (even through some troubled headlines). It's easy to see why because his character is pretty much the working man that you can find everywhere and then there are the dreams that this simple man has.Of course, people connect with the dreams of the Tramp character but they also love the laughs that he brings and there's no doubt that there are plenty here. There are several great sequences here but of course the highlight has to be the feeding machine inside the factory. This entire sequence is one great laugh after another but then you've got the \"nose powder\" scene in jail as well as the now famous skating sequence. On top of that, movie fans were finally given their chance of hearing Chaplin speak and boy what a scene that is!What's really amazing about MODERN TIMES is the fact that Chaplin pretty much stuck to his guns by not including a lot of dialogue. This here is basically a silent film with the exception of a few scenes and there's no question that it works perfectly as one. I mean, can you really imagine spoken words in this thing? As you'd expect both Chaplin and Goddard are terrific in their roles and the chemistry between the two really jump off the screen. The cute romance, the great laughs and the heart strings are certainly pulled by both here.MODERN TIMES is certainly one of the greatest films ever made. It's story is quite simple yet it says so much about the working environment, dreams that workers have and of course Chaplin perfectly mixes the laughs with the drama."},{"username":"SnoopyStyle","userUrl":"https://www.imdb.com/user/ur2898520","reviewLink":"https://www.imdb.com/review/rw3068814","warningSpoilers":false,"date":"14 August 2014","rate":"9","helpful":"5 out of 8 found this helpful.","title":"Some iconic scenes in socially conscious movie","content":"The Tramp (Charlie Chaplin) is just a cog in the modern machinery. He is unable to keep with the production line tightening bolts. The owner picks him out for testing the automatic feeding machine. By late afternoon, he gets lost in the machinery. He can't stop tightening causing great damage and they send him to a mental hospital. He gets out but he doesn't have a job anymore. A red flag falls off the back of a truck. He picks it and a massive march starts behind him without he knowing it. The police grabs him thinking that he's the leader. In prison, he helps thwart an escape attempt and is released. A Gamin (Paulette Goddard) is stealing food for the children. Her unemployed father is shot dead leaving her little sisters sent off to the orphanage. She steals a loaf of bread and runs into the Tramp. He tries to take the blame but she's caught anyways. He prefers life inside and deliberately gets caught stealing. They get thrown into the same wagon and escape getting thrown out together.This has the iconic factory scene with the Tramp in the machinery happening early on. The story is slightly random as the pair has one misadventure after another as they struggle to have the American dream. The Tramp is making a statement of sorts as he gets swept up from one thing to the next. He's the cog that never really fits in the machinery. This is a sound movie with sound being used for specific and interesting ways. The Tramp is actually singing but it's a lot of non-sense. This definitely has a social commentary but it's still funny message movie."},{"username":"Hitchcoc","userUrl":"https://www.imdb.com/user/ur0278527","reviewLink":"https://www.imdb.com/review/rw3624969","warningSpoilers":false,"date":"22 January 2017","rate":"10","helpful":"2 out of 4 found this helpful.","title":"One Last Triumph for the Silent Era","content":"Charles Chaplin, if he never did anything else, will be remembered forever for this film and \"City Lights.\" In this one, there seems to be a revolving door to the jail. He is arrested time after time after time. He is a cog in the machine of the factory where he works. He does monotonous work, putting a single bolt on some piece of equipment. Eventually, he breaks down and causes a commotion, getting himself thrown in jail. He meets a free spirit, played by Paulette Goddard, one of the true beauties of the silent film. Through a series of random events, including inadvertently stopping a burglary, he is give jobs, but they are always a disaster because of his high strung nature. He is accused of being a communist. He comports with criminals, always seeming to be in the wrong place at the wrong time. Society doesn't seem to like free spirits and he pays the price. The thing is that no matter what, he stays in high spirits and continues to prosper as a man."},{"username":"Kirpianuscus","userUrl":"https://www.imdb.com/user/ur61197531","reviewLink":"https://www.imdb.com/review/rw3291745","warningSpoilers":false,"date":"5 August 2015","rate":"","helpful":"2 out of 2 found this helpful.","title":"manifesto","content":"a social manifesto. that is the definition who seems be the perfect choice in this case. industrialization, pressure of machine, the people as tools, the chaos and economic crisis. but the essence remains the comedy. more bitter but comedy. because the Tramp is the same. because Paulette Goddart remains the perfect choice for be the part of a strange, touching couple. because the gags are more significant in this case than the social struggle. because few scenes remains memorable. Modern Times is different in Chaplin's work for the mixture of serious criticism , using the parable, and the pure show. but that fact does it an useful manifesto . because it is the right manner to remind the small details who defines the life."},{"username":"Horst_In_Translation","userUrl":"https://www.imdb.com/user/ur3914439","reviewLink":"https://www.imdb.com/review/rw5400526","warningSpoilers":true,"date":"12 January 2020","rate":"4","helpful":"0 out of 8 found this helpful.","title":"Sound is happening, but the quality is declining","content":"\"Modern Times\" is one of the most famous films by Charlie Chaplin and \"by\" could not be more true actually because once again he was in charge of key aspects in making this film, namely direction, screenplay and lead performance. At almost 1.5 hours, this is among his longer movies and I am a bit surprised to read there is really just one version/runtime. Anyway, this is from 1936, so it will have its 85th anniversary next year. It is really not one of Chaplin's oldest works, that much is safe and the then new technology of sound in films also made it to his movies. I don't think this is really a problem. On the contrary, the used it wisely and for example when we hear these words about the feeding machine (or whatever it is called), it has something really sterile and monotonous to it, which clearly stayed in the mind. This machine is from the early parts of the film and these were the parts that I liked the most, namely when the action takes place inside that factory where Chaplin's character goes more and more crazy, which makes for some nice laughs, for example how he basically turns into a machine himself. And also all the action at the assembly line was quite hilarious too I'd say. Chaplin really worked his talent there and the big guy next to him, who constantly struggles with Chaplin being too late with his performance, made it even funnier. Honestly, if there is one job in the world that I maybe would not want to have, then it is this one. The very first shot from the film with these really many sheep and immediately after really many people was extremely telling and a nice symbolism.Unfortunately, the film gets worse qucikly once the action moves out of the factory. Good for the protagonist that the shrink could help him, but most of the other locations included in this movie did not make a big impact on me at all. First Chaplin is mistaken for a revolutionary, by definition a criminal back then apparently, and ends up in jail where he initially struggles, but then manages to help when some dangerous convicts get in control. Now this did not work at all and with that I mean the bizarre cocaine sequence that I did not find funny at all and also how he actually defeats these hunky criminals there. It just wasn't Chaplin/Tramp how we like him. He felt like Superman almost and that is not the right approach to take. So yes like in many other films, there are constant clashes between Chaplin and the law or the opposite of the law, but here rather the latter as it feels that the police are constantly on his trail and when they are not for once, then they are chasing his sweetheart. She is introduced earliy, somewhat uncreative honestly and a sob story for the sake of it with her sisters and father, but oh well. Next problem is really her scene with the bananas is such heavy overacting from Paulette Goddard that it is painful to watch honestly. Somehow I did not like her character/performance overall and as she does have a lot of screen time, that is a problem. I usually like brunettes, but she was not even physically attractive to me, so it was difficult to really cheer for her. Also there is very little to her character compared to other love interest from Chaplin films. The best example is when he asks her if she would share her life with him and the two live together in a house and she says yes so quickly, way too quickly and still the way she was thinking about it was exaggerated once again. Judging from this film (only) Goddard is not a good actress and the should have cast somebody else. Or maybe it was intentional I don't know that she does not look too good next to the male protagonist who it is all about. Maybe it is for good reason that they do not meet until halfway into the movie.However, there are other struggles too away from her. the comedy just isn't good. I said the first act as really funny and judging from that I would have given a far higher rating had they managed to keep this level, but they did not. Or I should say \"he\" because it is once again almost a one-person project again with Chaplin. Or well, maybe not that much this time because there is a much bigger cast than in almost all other works by him. You can see that he is a star already. He relies on his star appeal atg times and the cuteness and charm to his character is frequently not there. Or the really funny clumsiness like when he accidentally launches this ship into the sea and the faces of the workers afterwards were really hilarious. However, these moments are not enough and this is why I give this film a negative recommendation overall. Pretty surprised to see this is still one of the 50 highest-rated films here on imdb. I mean the final concert scene made it really obvious. The song was good and I love the French language. It sounded nice too. But it was not Chaplin. There was really zero comedy to it the moment he begins to sing until when he ends (except that him being that good also makes no sense from the story perspective with what we knew before that). It is like from a musical, but it is zero funny. This is a very different Chaplin film and clearly he was looking for new directions that could work given his approach and depicting him as a serious singer really did not turn out convincingly, even if I can see how people liekd it back then because sound was really still so new back then. Oh yeah, it may have sound, but of course it is still a black-and-white film unlike stuff like Robin Hood or The Wizard of Oz that came out really not much later. So yeah I have seen several Chaplin full feature films (by imdb standards) in the last weeks and this one here is probably my least favorite. It is also not typical Chaplin and I suggest you do not pick this one, if you want to start exploring him. There are many superior choices."},{"username":"bob the moo","userUrl":"https://www.imdb.com/user/ur1002035","reviewLink":"https://www.imdb.com/review/rw1880289","warningSpoilers":false,"date":"25 May 2008","rate":"","helpful":"0 out of 1 found this helpful.","title":"Not as sharp as I wanted but the comedy more than covers for this","content":"Industrialisation offers potential for men who are willing to work to make money \u0096 albeit not quite as much money as those they work for will be making but still. The work is there to be had and even the little tramp is gainfully employed. Sadly, a form of RSI sees him have a breakdown and find himself jailed. A series of fortunate events see the tramp foil a jailbreak and earn himself his freedom but life is almost harder on the streets now, with unemployment and crime soaring.Considered one of his classics, Modern Times was of course going to be one of the film that I come one when brushing up on my film education. Opening with a wonderfully tongue-in-cheek caption, the film delivers a story about one of the masses, lost in a world of working to earn enough to get by, where individualism is not encouraged and the pressure to do more with less is always on. Sadly it is a relevant theme more than 70 years later as it was then and I was looking for something sharp from it in this regard. I suspect it was my expectation rather than anything else but I was surprised that it didn't have more in terms of teeth towards authority figures. Instead it takes the softer root of supporting the little guy rather than attacking the big one \u0096 the message of the film appearing to be \"don't let the b*stards get you down\".So in this area I did not get what I expected, but this was not a \"failing\" of the film so much as of my expectations of it. In the area of comedy the film does deliver with plenty of wonderfully delivered gags and routines. Of course the classic clips we've all seen are here (Chaplin going through the cogs of the machine) but there are plenty of other moments that are funny. Chaplin's delivery makes most of the material of course. It is testament to his talent that he did the same character so often but yet made it funny every time: his physical work is great. He is well supported by Goddard, who is fresh, charming and gorgeous even in rags, she really makes her character important. Sandford, Alexander, Conklin and others do well with Chaplin to deliver the physical routines.Do I think that Modern Times will wow audiences as it once did? Well, no because it is not sharp enough to build on the laughs. However this is not to suggest the film is not good, because it is very good. The story may lack teeth but it is warming while the routines and gags may vary in regards how famous they are but all very funny."},{"username":"classicsoncall","userUrl":"https://www.imdb.com/user/ur2707735","reviewLink":"https://www.imdb.com/review/rw2431505","warningSpoilers":true,"date":"21 May 2011","rate":"7","helpful":"2 out of 5 found this helpful.","title":"\"Section Five, give them the limit\".","content":"\"Modern Times\" would be Chaplin's last silent film stand against the encroachment of talking pictures, which in actuality were almost a decade under way by 1936. It also takes dead aim at the advance of a mechanized age, a modernizing society dependent on speed and efficiency at the expense of humanity. Fritz Lang's austere 1927 film \"Metropolis\" took a similar approach but with a much darker tone, daring to ask 'Who are the slaves of the machines\"? For Chaplin, opposition to that slavery is on display in his comedic, almost manic depiction of factory life and the assembly line. One can't help but notice the influence Chaplin had on later film makers; I immediately drew a comparison to Lucille Ball's hilarious attempt to keep pace at the candy factory, blending elements of Chaplin's frantic pace on the assembly line with the dehumanizing aspect of the Bellows Feeding Machine.A startling aspect of the story line for me was the introduction of the communist element when The Tramp is arrested for accidentally leading a workers' revolt. One doesn't immediately connect the term 'communist' to it's Bolshevik roots dating back to 1917, but it was obviously on Chaplin's mind two decades later.Knowing that he did his own stunts, it was truly amazing to see Chaplin's dexterity on a pair of roller skates. The blindfold scene on the fourth floor toy shop was incredible, and made me wonder what precautions were taken to prevent serious injury in case all didn't go well. Obviously, the man had talents that went well beyond making films.I mentioned that scene from an 'I Love Lucy' episode earlier, but there's another observation I'd like to offer that might have influenced the opening to a popular TV show of the Sixties. In his domestic daydream involving The Gamin (Paulette Goddard), The Tramp is shown walking away from the camera and tripping over an ottoman as he approaches Goddard. One could surmise that Dick Van Dyke took inspiration for his own pratfall gimmick from the master Chaplin some quarter century later. Chaplin's genius would find his ideas being repeatedly recycled under the slogan 'everything old is new again'."},{"username":"lee_eisenberg","userUrl":"https://www.imdb.com/user/ur4888011","reviewLink":"https://www.imdb.com/review/rw1117776","warningSpoilers":false,"date":"3 July 2005","rate":"10","helpful":"3 out of 7 found this helpful.","title":"this movie applies in all times, modern and ancient","content":"In \"Modern Times\", Charlie Chaplin brings his class analysis to the Industrial Revolution. The opening scene shows sheep, to portray how the working class was being turned into such. Then, we see Chaplin in the factory, where he has the most mind-numbing job in the world: tightening two screws together as the products run by on a conveyor belt. To make matters worse, the boss speeds up the machine, and it gets harder and harder to keep up. This regimen eventually causes him to have a breakdown. Meanwhile, a young woman (Paulette Goddard) is forced into homelessness due to some tragic events. After their lives cross paths, they try to help each other through the hard times.It all may sound pretty grim from that description, but it wouldn't be a Charlie Chaplin movie without some humor: he gets cranked through a machine in the factory, he gets mistaken for a march leader when trying to give a truck back its flag, and he accidentally swallows \"nose powder\", to name a few. It's probably his second best movie behind \"The Great Dictator\"."},{"username":"gavin6942","userUrl":"https://www.imdb.com/user/ur1234929","reviewLink":"https://www.imdb.com/review/rw2359285","warningSpoilers":false,"date":"27 December 2010","rate":"9","helpful":"1 out of 4 found this helpful.","title":"Chaplin's Best, No Debate","content":"This is the story of the modern man, living in a time with busy streets, tiresome jobs and nervous breakdowns. How will he cope? What of the modern prisons and drugs? And of unemployment (between a Great Depression and a World War)? Written by, directed by, produced by, edited by, music composed by, and starring Charlie Chaplin. A true genius.The factory is not just \"modern\" but futuristic in a sense, looking like 1950s and 1960s sci-fi films. There are monitors everywhere (shades of \"1984\") and gigantic switches and cranks, and robots doing uniquely humanlike things.Chaplin, a socialist sympathizer, was clearly attacking the capitalist system in this film, particularly the idea of the assembly line and how monotonous it is. The film even goes so far as to show ways a company could make men even more like machines -- feeding them in line so as not to need a lunch break.Hooray for the \"gamin\" (Paulette Goddard), the child of the waterfront who refuses to go hungry! (The film's use of \"gamin\" is interesting to me for two reasons: one, the word is male, with the female being a gamine; two, it is today a more or less dead word, with the current popular term being \"street urchin\".) And hooray for Chaplin's dancing, which was just about the highlight of the film."},{"username":"jboothmillard","userUrl":"https://www.imdb.com/user/ur4248714","reviewLink":"https://www.imdb.com/review/rw2321382","warningSpoilers":true,"date":"8 October 2010","rate":"9","helpful":"0 out of 1 found this helpful.","title":"Modern Times","content":"Before Sir Charlie Chaplin made his first sound picture in 1940 with The Great Dictator, this was the last of his classic silent films where he played the Tramp we all love. Basically a factory worker, let's just call him the Tramp, is struggling to keep up with machinery of the modern society, specifically tightening bolts on plates. He is at one point selected to try out a new experimental employee feeding machine to speed up production and breaks, but of course the boss is unconvinced. It is when the Tramp gets stuck in the large cogs of the machine that he has a nervous breakdown, where he has a laugh mucking up, and this takes him to prison. Meanwhile an orphan girl known only as Gamine (Paulette Goddard) faces going into a home with her sisters, but she manages to escape and is scrounging to get by. When the Tramp has been released he is immediately put back in when he is mistaken for the leader for a communist parade waving the red flag. In prison he is out of place, but at the same time he prefers to modern society, and when he mistakes cocaine for salt and he unintentionally foils a breakout he is rewarded with release. This release leads the Tramp to meeting Gamine stealing a loaf bread and trying to take the blame to go back to prison, and again getting himself loads of food without paying. He does get arrested for this and sees Gamine in the paddy wagon, but it crashes and they tumble out to make something of themselves, specifically the Trap getting a job in a department store as night watchman. After initially starting out well, the Tramp is caught in a pile of womens' clothes and arrested again, and when he is released ten days later Gamine meets him to show him their new home. She has found a run down old shack house almost falling apart, and while hanging in it and breaking some planks, the Tramp reads a new factory is hiring, and he manages to get a job. Soon enough just after starting, and getting a co-worker caught in a mess, they finds out the workers are on strike, and he gets arrested again because of a brick. Two weeks later, the Tramp is released and finds Gamine working as a café dancer, and she tries to get him a job as a waiter/singer. He fails at the waiter job getting a duck all over the place, but he proves a worthy singer with his own improvised piece which proves a hit. In the end, Gamine is wanted for arrest, but she and the Tramp manage to get out of the café, and the films ends with them starting a life on the road. Also starring Henry Bergman as Cafe Proprietor, Stanley 'Tiny' Sandford as Big Bill, Chester Conklin as Mechanic, Hank Mann as Burglar and Stanley Blystone as Sheriff Couler. Chaplin is lovable, Goddard is lovely as the troubled love interest, the feeding machine scene is great fun, and the other slapstick moments are memorable viewing, so it is a must see silent (there are sound effects and some dialogue) comedy. Sir Charlie Chaplin was number 50 on The 100 Greatest Movie Stars, he was number 24 on The 50 Greatest British Actors, he was number 10 on 100 Years, 100 Stars - Men, he was number 38 on The World's Greatest Actor, and he was number 67 on The 100 Greatest Pop Culture Icons, the film was number 81 on 100 Years, 100 Movies, and it was number 33 on 100 Years, 100 Laughs. Very good!"},{"username":"rmax304823","userUrl":"https://www.imdb.com/user/ur0819382","reviewLink":"https://www.imdb.com/review/rw0015340","warningSpoilers":false,"date":"10 March 2004","rate":"","helpful":"12 out of 25 found this helpful.","title":"Very amusing.","content":"Arguably Charlie's best film. Maybe not his funniest but his best because there's so much more to it than the Keystone Kops kind of pratfalls that he so commonly used.Frankly I don't know how the guy did it, being so consistently humorous without using any words. All of it depends on a story simple enough to be followed visually and on Chaplin's genius for mime and situation construction. There ARE some words spoken on screen -- this was his last holdout against talking pictures -- but none of them involve people speaking directly to one another. There is a song at the end with gibberish lyrics. And the rest of the speaking is always filtered through some mechanical medium, a record player, a radio, a television set. Charlie was accused of communism somewhere along the line and pretty much thrown out of the country, after which he lived in Switzerland. You couldn't tell he was a Commie from this movie. It comments on its time, of course, the Great Depression, and Charlie and Paulette Goddard are two poor people. Management is shown as callus, playing with a jigsaw puzzle and reading newspapers while the workers slave away on the assembly line. There is even a communist demonstration. But it's all played for laughs. One of those red warning flags falls off the back of a truck passing down an empty street. Charlie picks up the flag and waves it, shouting after the truck. As he begins to hurry after the truck, still shouting and waving, a horde of dissatisfied workers silently falls in behind him and he's arrested. Poor people steal, but they only steal food. If having sympathy for the unemployed is communism then roughly one American out of three was a communist, because that's roughly what the unemployment rate was. \"Modern Times\" is no more communistic than, say, \"My Man Godfrey\" or \"Salt of the Earth\" or \"The Grapes of Wrath.\" Besides that, Charlie is no classical Marxist. Marxism posited a transition from \"false consciousness\" (the feeling that one's miserable poverty was due to personal failure or bad luck) to \"class consciousness\" (the realization that exploitation by the property owners was at fault). Charlie is no activist. He fumbles every job he gets. The other workers are hardly sympathetic. Charlie's not a working class hero but a black sheep. The opening shot of the herd of sheep hurrying past the camera includes one black sheep in the middle of the flock and it's hard to imagine that this was accidental.Actually, Charlie had lost a lot of respect in America because he had an eye for young girls. His second marriage resulted from a sixteen-year-old girl's (faked) pregnancy. Paulette Goddard, who became his third wife, maybe and maybe not, was twenty when this movie was made, and Charlie was forty-three. In any case -- boy, if you want to get Americans heated up just combine sex with politics. A sure-fire winner for the puritans. (It may have cost Goddard the part of Scarlet O'Hara in \"Gone With the Wind\" because she may have been living in sin with Charlie at the time.)I don't want to spell out too many of the gags because I don't want to spoil them but be alert for the feeding machine that goes berserk and shoves lug nuts down Charlie's throat and hits him in the face with a corn cob. Charlie looks as if he's strapped helplessly into his seat, but his hands were free under the rotating table so that he could manipulate the fiendish devices himself. The first time I saw this movie was in the Arts Theater on Springfield Avenue in Irvington, New Jersey. When Paulette Goddard first appeared, the man on my right chuckled and said, \"Now that's a good-looking babe.\" On my left, my marmorial ex laughed out loud during the feeding machine episode for perhaps the only time in her life. There can be no higher recommendation."},{"username":"ma-cortes","userUrl":"https://www.imdb.com/user/ur3270789","reviewLink":"https://www.imdb.com/review/rw4739248","warningSpoilers":false,"date":"23 March 2019","rate":"8","helpful":"9 out of 12 found this helpful.","title":"Charles Chaplin masterpiece finds him playing a factory worker who becomes involved in problems and strikes","content":"This mostly silent movie deals with a little man , a disgraced factory worker who goes insane from his repetitious job at an assembly líne . At the same time the exigent boss demands him for greatest efficiency and speed at work . As the unfortunate man moving from hapless factory worker to singing waiter and ultimately triumphing along the way .An interesting and thought-provoking Chaplin film encompassing the tyranny of Machine over man, this great film has more relevance nowadays than ever. The pic contains a sour denounce on capitalism , industrialization and human explotiation . This is a vintage flick much in the fashion that sound films offended his pantomimist's sensibilities . This is a silent movie , being the only dialogue a song sung by Chaplin in gibberish Italian .Chaplin gives an awesome and sympathetic performance as a labourer who goes crazy and triumphs over adversity , just as Charles the film director proved victorious over sound . Chaplin also composed the score which incorporates the charming tune : Smile. His spouse to be Paulette Goddard is attractive in the femenine lead , playing a poor orphan. Look for a young Gloria de Haven , as one of Paulette Goddard's Sisters . She is the real-life daughter of Chaplin's assistant director .The motion picture was masterfully directed by Charles Chaplin .This was one of the longest ones to that date . Chaplin previously directed 2 or 3 reel short movies, such as : Our hero, The fireman, Night at the show , The adventurer, The floorwalker, The cure , The inmigrant , The circus , Burlesque on Carmen , among others . After that , he made long feature films such as : The gold Rush , The kid , City lights , The great dictator , Monseur Verdoux , Limelight, A king of New York and his last one : A countess from Hong Kong . Rating 8/10 . Better than average . Well worth watching ."},{"username":"TxMike","userUrl":"https://www.imdb.com/user/ur0438066","reviewLink":"https://www.imdb.com/review/rw0015342","warningSpoilers":true,"date":"11 March 2004","rate":"","helpful":"2 out of 5 found this helpful.","title":"Timeless classic, Chaplin's talking 'silent' film.","content":"First we need the definition of a 'gamin', the role that Paulette Goddard plays. (gamin, n : a homeless child who has been abandoned and roams the streets.) Much of Chaplin's 'Modern Times' is a parody on modern manufacturing techniques -- assembly line and efficiency studies, the need to keep up with competition. That was 'modern' in 1936, and it is still modern today. It is interesting that years before commercial television came into use, this movie uses large TV-type screens for the factory boss, who works jigsaw puzzles in his office while workers slave, to monitor his workers, and for them to see him as he gives instructions. So what we have in this little movie is a commentary on working conditions, and a lot of typical Chaplin slapstick comedy. Looking at it fresh, I suspect that Rowan Atkinson got a lot of his inspiration for his Mr Bean character from watching Charlie Chaplin's 'Little Tramp.' Great old movie, but impossible to rate against all the fine movies made since then. Chaplin still preferred his movies 'silent', and most of it is. However, whenever there are announcements in the background, we hear them. When he dances, we hear the shoes slide along the floor. When he sings the improvised song, we actually hear his voice. The whole thing works very effectively.SPOILERS, for my own recollection, don't read any further. OK!? We first see him in a very fast-moving assembly line where is only task is to tighten two bolts as plates pass by. Later we see him on the moving belt, then sucked into the machinery, then he passes through the giant gear wheels. He loses this job, is unemployed, end up in jail and has it pretty good there. Several times, after he gets out, he tries to get back in, it is the best housing and food that he has had. When the girls' father dies her two young sisters are put into homes, but knowing her eventual fate she runs away, and is pursued by the authorities much of the second half of the movie. She and he meet, take to each other, and the movie ends with them walking together, away from the audience, down the middle of a rural two-lane road."},{"username":"blanche-2","userUrl":"https://www.imdb.com/user/ur0342623","reviewLink":"https://www.imdb.com/review/rw1730115","warningSpoilers":false,"date":"14 September 2007","rate":"10","helpful":"1 out of 3 found this helpful.","title":"Funny, poignant and brilliant","content":"Charlie Chaplin brings back The Tramp in \"Modern Times,\" a 1936 film that also stars Paulette Goddard. The film is mostly silent - going against modern times in 1936 - though sound effects, music, radio announcements, that type of thing, can be heard throughout. The Tramp and the Gamin (Paulette Goddard) are always silent. Yet they convey anything anybody ever needed to know.Modern Times is about a little man who just doesn't seem to belong anywhere. In the beginning, he's working in a factory on an assembly line, and when an efficiency expert brings in a \"feeding machine\" that will require workers to take less time for lunch, our Tramp is chosen. The machine breaks down while still connected to Chaplin, making for a fabulous scene. In another scene, he becomes part of the machine as he goes through it.The Depression is on and jobs are hard to come by, especially when you keep getting into trouble, so the Tramp goes from job to job. Eventually he meets the homeless Gamin, who is quick on her feet, and the two attempt to survive the hard times together.A small but handsome man, Chaplin as the Tramp is still recognizable today with his funny walk and little mustache. The most astounding thing about Chaplin is the way he used his body. The most brilliant example of this is the roller skating scene, but there are so many others - Chaplin's flexibility and balletic grace made him the greatest comedian ever. When he fails as a waiter and is called upon to sing in a restaurant, his movements to the song are phenomenal.Goddard is young and beautiful as the Gamin and does a terrific job as a streetwise girl who can't help getting discouraged. But The Tramp won't let her - he knows that together, they can make it. As funny in parts as this movie is, we're reminded of how poverty victimizes people and how try as some might, some people just don't belong in these modern, practical times that don't allow time for some of the simpler pleasures.One scene that foreshadowed corporate America today - there is a large television screen where the boss can see everything that's going on, even in the bathrooms, where he yells at people to get back to work. I'm sure that, even if that isn't available in most, if any, companies, workers definitely feel they are being kept track of every minute, with the use of time sheets, security cards, sign-ins, computer monitoring and the like.A truly great film by a master. A must-see."},{"username":"Quinoa1984","userUrl":"https://www.imdb.com/user/ur0453068","reviewLink":"https://www.imdb.com/review/rw1541208","warningSpoilers":false,"date":"10 December 2006","rate":"10","helpful":"3 out of 5 found this helpful.","title":"maybe not as entirely, artistically fulfilling as City Lights, but it might just be funnier","content":"Charlie Chaplin is a true master of at least a few things, and all within a specific world that he's created and fully culminates in City Lights and, even more notably in Modern Times: he has running gags all over the place (his 'Tramp' character getting involved in that is), including always being an unintentional klutz by way of too many people or too much to get acclimated to with the machines and other little things in the world, and somehow getting into trouble and being thrown into jail. But there's also a lyricism to it too, a sense of pure whimsy that while it has been aspired to by the likes of De Sica and even Benigni (the former has probably gotten the closest and topped Chaplin's style), has rarely been matched. Modern Times is a very fine example of Chaplin's world, and when I wasn't laughing myself silly, aside from a couple of notable moments with the Gamin, I had a big goofy smile on my face, which in the end is Chaplin's main message (his final words, unspoken of course, are 'come on, smile). No matter what happens, there's always a good heart somewhere in Chaplin's work, probably one of the purest too.While I could argue about which one of Chaplin's great films, this and City Lights, triumphs more on the basis of being more memorable or not in terms of showing the sense of prevailing loneliness and despair, Modern Times ends up working so wonderfully in its comedy and absurdism that I would at least be more inclined to say this film is funnier. Sometimes I couldn't believe how ingenious the touches got, and it often was accompanied with a precursor- I often said a 'oh no, here we go again' before a gag I knew was coming, like when the tramp is eating a meal in prison and puts too much \"salt\" on his food (really a secret nose powder, a hilarious allusion to cocaine), or when he gets sprayed by the alcohol barrels (while still wearing roller skates he found in the toy story). I also couldn't get enough of the moment when working as the assistant in the steel mill he gets his supervisor stuck in the gears of the machine, only to break for lunch and though not getting him out right away, does do his best to keep the man sated with food. Or a little mishap that sends an unfinished boat sailing off, or getting a chicken stuck in a lamp in the buzz of a restaurant...And so and so forth. Chaplin puts his character- and his lady in the form of a 'Gamin' played brilliantly and charmingly by Paulette Goddard- in the time frame of the title. Not just with what happens at work with the introduction of new technology, and the insanity of the industrial age (another tiny running gag- the tramp can't stop moving his body even after he stops turning the screws), but the social side as well. It's sad that the United States immediately called Chaplin a communist, because for all of Chaplin's sympathies and depictions of the working class in the film, he's always playful in mocking the wealthy and considering the time frame (it was the depression after all, I'm sure more than few could relate to having a shabby house like the tramp and gamin get). There's the sense in the film too of how modern something like a union march or a strike are, and in general I got the sense that Chaplin was out to mock the dangers of going too far with the processes of industrial age and all, and of the added authorities that goes with it, not capitalism itself.Besides, Chaplin's sense of morality is meant to be a given- if one's seen City Lights one can see it even clearer and stronger there. The same poetry of that film might only come out in spurts here, like when the tramp has to sing for the restaurant crowd, or the last scene. But it's really how Chaplin pushes the boundaries of the absurd in a manner that's never meant to be too mean or cruel (even with the police he gets his jabs at them in a playful manner). The use of sound and music are also extraordinary here, as the only time we hear voices, aside from the singing, are through mediums, and also the sounds of gun-shots. There aren't any gray areas in Chaplin's black & white world, but then there isn't any need for them, if anything it would shatter the atmosphere and innocence of the main characters. And even set in the 30s, it hasn't aged much at all; it's very likely one of the great comedies of its time, or any time."},{"username":"dougdoepke","userUrl":"https://www.imdb.com/user/ur10348034","reviewLink":"https://www.imdb.com/review/rw2830555","warningSpoilers":false,"date":"12 July 2013","rate":"","helpful":"0 out of 3 found this helpful.","title":"Humane Satire","content":"I've never exactly been a fan of silent movies or Chaplin, but it's hard not to be captivated by this satirical response to capitalism, in particular, and industrialism generally. Of course, people should be the masters of the machines. The movie, however, pokes poignant fun at how machines have reversed the roles by becoming the masters over people. Of course, this mastery is presided over by an all-seeing owner, who must further mechanize (the automatic feeding machine, for example) or risk losing out to the competition.Chaplin manages to make his points in a number of amusing set-ups that are also poignant in what they reveal. For example, Chaplin's getting pulled into the machine's great digestive cog system amounts to a stunning metaphor. Of course, this was also during the Great Depression, so the threat of unemployment and starvation acted as goads to putting up with all the on-the-job humiliation (being surveilled in the bathroom, for example). Also, Chaplin's use of crowds of unemployed and cordons of mounted police makes its point without need of dialog.I suppose it's not surprising that the nation's anti-communist watchdog committee, HUAC, would 10 years later find a movie like this suspect. But, it strikes me that anyone finding the movie's overall humane message politically objectionable has already been absorbed into the machinery Chaplin so shrewdly satirizes."},{"username":"tedg","userUrl":"https://www.imdb.com/user/ur0643062","reviewLink":"https://www.imdb.com/review/rw0015327","warningSpoilers":true,"date":"8 June 2003","rate":"","helpful":"8 out of 20 found this helpful.","title":"Mechanical","content":"Spoilers herein.Here's a strange opinion: I think `City Lights' is one of the best and most important films ever made. It will always be required viewing for cineliteracy. This one is superficially similar, but not nearly as enjoyable or novel.Yes, the factory sets are well architected to participate in Chaplin's ballet. Yes, the then current Mrs Chaplin has an aggressive feline sensuality. Yes, Charlie's energetic approach and commitment is admirable. Yes, this is highly visual, especially compared to the word gags of the Marxes. But too many elements have become already formulaic.In `City,' there was a clear dependency of concept, clear to us as viewer but built into the story as well: we knew that at root this was a coherent statement coming from one mind rather than the common case, films designed by committee.we knew that the goal was to amuse us in the tradition of the British stage: fun at all costs using clever extensions of extremely familiar notions and techniques. The world of abstractions into which we agreeable enter was known beforehand and part of the amusement; how they are bent is part of the amusement.clearly subservient to all this was the creation of the character in a context of social situations. The relative importance of those was important: `City' was intended as a creative endeavor whose success depended on a collaboration between him and what we brought. But look what has happened to `Modern.' The situation: the Tramp, the technology and personal context of the movie, social injustice all have taken on lives of their own and become additional participants in the contract. No longer can we `let our guard down' and participate. Now we have to worry about how to receive the `message' of the movie.In this project, the hierarchy is all reversed. There is an element of overt social commentary, something that would become even more evident with the Hitler film. But there it is so bold and imaginative it is admirable in its own right.There is also the elevation of the familiar over the novel. There is no innovation here, in fact the whole idea is to emphasize the familiar. He himself is guilty of the same mechanical thinking he criticizes. That's the strange thing for me: the same recipe in two films with the slightest variation on emphasis: one is transcendental, the other amusingly troubled.Ted's Evaluation -- 2 of 4: Has some interesting elements."},{"username":"Doylenf","userUrl":"https://www.imdb.com/user/ur1048771","reviewLink":"https://www.imdb.com/review/rw0015341","warningSpoilers":false,"date":"10 March 2004","rate":"","helpful":"5 out of 10 found this helpful.","title":"Chaplin at his best...Paulette Goddard delightful...","content":"MODERN TIMES is at its best when Chaplin is doing the sort of physical comedy that is his greatest skill. The factory scenes and the skating scene in the department store are just two of the highlights--but all the way through he combines his physical dexterity with warmth as the Tramp struggles to survive in a world gone mad with new technology.And his partner in this happy excursion is PAULETTE GODDARD, a striking young beauty who a few years later almost won the role of Scarlett O'Hara in GWTW.The print TCM is showing is flawless and there is pure delight in watching Chaplin and Goddard romp through a series of vignettes that come together to produce a well-paced story where no dialogue is needed to tell the simple tale. Keeping the running time down to an hour and a half is an asset here--especially in an age where most major comedies are often told in two hours or more.Chaplin's background music is a good counterpoint to the visuals, although one wishes that one of his themes for the scenes where he cheers up the gamin (and later recorded as a hit song called \"Smile\"), had been given a more lavish treatment.Trivia note: GLORIA de HAVEN can be seen as Paulette Goddard's young sister. You have to look closely to spot her since she appears to be only 12 or 13 in the role."},{"username":"LeonLouisRicci","userUrl":"https://www.imdb.com/user/ur33374263","reviewLink":"https://www.imdb.com/review/rw2784525","warningSpoilers":false,"date":"19 April 2013","rate":"10","helpful":"0 out of 2 found this helpful.","title":"Antiquated Mimes","content":"If you are a reluctant Silent Movie watcher and are an unable viewer of antiquation or the Classics of a an era gone by, you might want to see this one. It is forever talked about and made by a Director/Star who is relentlessly talked about and most likely anyone involved in Film History or just casual lovers of the Art will never go silent on the famous Chaplin.Charlie did shut up for the longest time. Here in 1936 he bucked all trends and common sense to produce a \"silent\" picture with the most amazing result. It seems that it is so well conceived, so rich in Sociology, so funny in its slapstick and biting satire that once the sheep were herded into the theaters everyone instantly forgot this was a Silent Movie.There are numerous set pieces that are part of the social consciousness and subconscious of American life that will remain as long as there is a collective. A sense that we all belong in some sort of macro life force and have the ability to empathize, and have an awareness of our social structure and can feel. Chaplin felt deeply. It is obvious in his Art. In real life he paid a price for anti-establishment views and expressions of discontent. But he never lost the Love and respect from his admirers and Fans. This Movie is considered one of his best. It is, because of its insights and sight gags, its heart and its mindful attempt to enlighten while entertaining."},{"username":"grantss","userUrl":"https://www.imdb.com/user/ur2860723","reviewLink":"https://www.imdb.com/review/rw3114734","warningSpoilers":false,"date":"31 October 2014","rate":"10","helpful":"4 out of 7 found this helpful.","title":"Timeless classic","content":"A timeless classic, just as relevant today as in 1936.You have the usual Charlie Chaplin ingredients. First you have the incredibly funny and creative visual comedy. Pure creative genius. Plus you have the usual emotional content. Chaplin's previous classics - The Kid, The Gold Rush, The Circus, City Lights - all had these and are fantastic movies.However, Modern Times trumps all those. Not only is it hilariously funny and bitter-sweet but it has social commentary too. Chaplin takes aim at the dehumanizing effect of factory work, and the general way workers are treated. While the picture he paints makes us laugh, rather than make us angry, behind the comedy there is a lot of truth. This satire is still relevant today. It doesn't have to be factories, it could be any workplace.Superb direction by Chaplin. He is more known for his acting antics and creative scripts but the camera-work here is fantastic.Other than the all-round Chaplin brilliance, the other standout in the movie is Paulette Goddard, who plays his love interest. Beautiful with an endearing waifishness, impishness and sense of humour, she matches Chaplin step for step. (She was to become Chaplin's third wife shortly after the movie was released).An all-time classic."},{"username":"Boba_Fett1138","userUrl":"https://www.imdb.com/user/ur1416505","reviewLink":"https://www.imdb.com/review/rw1948803","warningSpoilers":false,"date":"20 September 2008","rate":"9","helpful":"0 out of 1 found this helpful.","title":"Simply hilarious!","content":"OK so in essence this movie perhaps is like the just as brilliant French comedy \"À nous la liberté\" but \"Modern Times\" is a real classic on its own right. To be honest I think that some Chaplin movies and other classic comedies in general are a bit overrated but \"Modern Times\" always had been a movie which I enjoyed watching.\"Modern Times\" is Charlie Chaplin's protest about the fast growing modern industrial society (seems a like a pretty silly to protest against now days of course). It makes fun of industrialism, with as a result some highly amusing and innovative sequences, when things start to go wrong in the factory, when the tramp starts to loose his mind. This spoof and protest however got him in trouble though, since the American government was not amused by it and labeled him as a communist from that moment on. After that Chaplin left to live for the rest of his love in Switzerland and he never returned to America.Although the movie does feature sound in it, the movie is still shot as a silent movie and also features hardly any dialog in it. It makes this movie of course quite unique and I actually wonder if the movie would had been better if it did feature full sound and more dialog in it. I really don't think so though. Charles Chaplin of course always had been a king of slapstick and silent comedy.Chaplin is in good form in this movie. He shows off his silly antics as his famous tramp character, although in this movie his character is simply listed as 'A factory worker'. His timing and execution is fine as always and provides the movie with moments that will make you laugh, guaranteed. Also Paulette Goddard is fine and looking lovely in this movie. She married Chaplin the same year but then again which co-star didn't Chaplin had a fling with throughout his life.Like so often he also directed and wrote the movie. With this he shows that he not just had a talent for comedy acting but also really for comical writing and directing. For a silent slapstick movie the movie simply features a good and likable story. Also the directing is done with lots of pace and sense for timing.It also has some great looking sets, for factory sequences of course most obviously.A great Chaplin classic!9/10http://bobafett1138.blogspot.com/"},{"username":"evanston_dad","userUrl":"https://www.imdb.com/user/ur4532636","reviewLink":"https://www.imdb.com/review/rw1233051","warningSpoilers":false,"date":"7 December 2005","rate":"7","helpful":"10 out of 13 found this helpful.","title":"Individual Parts Greater Than the Whole","content":"One of this movie's most famous images--Chaplin sliding around inside the gears and cogs of a monstrous machine--provides a handy visual to go along with my opinion of the film in general: there are individual cogs that I remember as being brilliant, but when put together they don't make a totally satisfying machine.Unlike \"City Lights\" or \"The Gold Rush\" before, or \"The Great Dictator\" after, I didn't get caught up in the narrative of \"Modern Times,\" and I felt there were longer gaps between the funny bits. However, some of the set pieces in this are hilarious, most notably the scene where Chaplin finds himself strapped into an automatic feeding machine that goes berserk; and a nimble scene on roller skates that showcases his athleticism.Sadly, \"Modern Times\" was an all too applicable metaphor for Chaplin's place in the film industry. New technologies were beginning to make his artistry obsolete, and the sadness of that is palpable in the film's final shot.I'm recommending \"Modern Times\" because it's a very good movie. I just didn't think it was as good as some of Chaplin's other well-known projects.Grade: B+"}],"errorMessage":""}