{"imDbId":"tt0038650","title":"It's a Wonderful Life","fullTitle":"It's a Wonderful Life (1946)","type":"Movie","year":"1946","items":[{"username":"MartinHafer","userUrl":"https://www.imdb.com/user/ur2467618","reviewLink":"https://www.imdb.com/review/rw1089030","warningSpoilers":false,"date":"26 May 2005","rate":"8","helpful":"37 out of 260 found this helpful.","title":"Very good and very overrated","content":"This is a very good movie. Period. A \"classic\", I don't think so. This is a movie whose actual quality has been exceeded by its hype--though NOT because the producers or actors hyped it (like the typical overblown and over-hyped Hollywood film). In fact, when it was released it was not particularly successful (especially compared to other Frank Capra flicks).No, instead it reached legendary status for TWO reasons alone. It was a public domain video (hence NO ROYALTIES REQUIRED FOR SHOWING IT) AND its setting for the movie's conclusion was the holiday season. These two factors worked together to BLITZ the American public from the 1980s to the late 90s (until its copyright status was restored). I remember these dark days, when It's A Wonderful Life was literally shown on half a dozen channels at the same time!! Not even GREAT movies should be shown that much! As a result, many began proclaiming it a classic while some others got awfully tired of seeing it--which is a shame because it's a very good film."},{"username":"TheLittleSongbird","userUrl":"https://www.imdb.com/user/ur20552756","reviewLink":"https://www.imdb.com/review/rw2227530","warningSpoilers":false,"date":"28 March 2010","rate":"10","helpful":"62 out of 74 found this helpful.","title":"One of those quintessential Christmas movies....","content":"It's a Wonderful Life is something truly special, and along with Scrooge, the original Miracle on 34th Street and Home Alones 1 and 2, it is something I watch every Christmas. Why? Because I love this movie, seriously I do. Looking through my 1000 or so reviews here, I couldn't believe I hadn't reviewed this movie; I have seen movies that I have loved and cherished since childhood and I have seen movies that belong at the bottom of the garbage. It's a Wonderful Life belongs to the former, although I am 17, I appreciate a good movie when I see one. This is more than a good movie, it's a timeless masterpiece, that holds up on repeated viewings and never loses its magic.It's a Wonderful Life could have easily been overly-sentimental and clichéd, but the quality of the direction and the screenplay that others have summed up perfectly assured it was a beautiful, heart-warming and somewhat poignant film. While there are some funny parts, not bursting-your-gut funny but funny in a subtle sort of way, other parts are close to heart-rending. The direction from Frank Capra is excellent, sensitive and nuanced, and Capra shows even more talent as a screenwriter having penned one of the most honest and touching scripts ever in a film. Casablanca, All About Eve and The Shawshank Redemption all had wonderful scripts, but the script here has a lot to say about community spirit and shows that this film is much more than feel-good sentimentality. There is the element of feel good here, no doubt about it, but it doesn't overpower what the film intends.Visually, It's a Wonderful Life is a wonder. I don't think it is dated at all, the cinematography is crisp, the black and white looks beautiful and the pristine Christmas scenery really does take me back. Some of my favourite ever memories was of Christmas, whether it was watching nostalgic Christmas videos, eating Christmas dinner or singing carols under the Christmas tree. Another thing I have to mention is that the movie is richly and beautifully scored, Dmitri Tiomkin's music here is absolutely gorgeous, lyrical, whimsical, nostalgic and most importantly it never felt intrusive in the more integral parts of the film. And I have to mention the story, never in my life(and I genuinely mean this) have I seen a movie where it communicates such a strong message and so well too. The story of a suicidal man who is shown the value of his life by his guardian angel is an effective, timeless one, imitated perhaps but never equalled.Finally the acting is wonderful. James Stewart, and I seriously don't give a damn whether he was a racist or not and neither should you, is absolutely superb as George Bailey, a truly complex character who goes through such a lot to get to where he is at the end of the movie. George Bailey is like Mr Deeds, John Doe and Mr Smith rolled into one, and in my opinion only James Stewart could have given justice to a character that has self-doubt gnawed at his essential decency. Also the character change, like that of Alistair Sim's Scrooge at the end of Scrooge, was heart-breakingly believable. Donna Reed is radiant and charming as his wife, who is like a caring lover, devoted wife and dedicated mother, while Thomas Mitchell gives one of his more memorable performances as Uncle Billy. Henry Travers is a revelation as Clarence the guardian angel, but there is another performance I think is worth of mention. For a good morality tale, you need a good villain. Well in the name of Potter, you have one. Who better to portray him than the great Lionel Barrymore acting at the peak of his powers? Overall, a timeless classic with a true and heart-rendingly poignant ending. 10/10, one of the easiest perfect scores I have made recently. Bethany Cox"},{"username":"bkoganbing","userUrl":"https://www.imdb.com/user/ur2483625","reviewLink":"https://www.imdb.com/review/rw1247136","warningSpoilers":false,"date":"25 December 2005","rate":"10","helpful":"215 out of 247 found this helpful.","title":"\"To My Big Brother George, The Richest Man In Town\"","content":"I've always thought that the reason It's A Wonderful Life has had such enduring popularity is that more than in any other film it shows what can be the value of a single individual and the contribution to the greater good they can make.George Bailey as portrayed by James Stewart is the kind of every man hero we can all identify with. He's got the every day problems to be sure, raising and providing for a family, but he's got bigger problems than that. Fate has made him the rallying point of opposition in his small town of Bedford Falls to the \"richest and meanest man in town\", embodied in Lionel Barrymore.It's a real David vs. Goliath battle. Barrymore seems to have unlimited resources at his disposal. Samuel S. Hinds as Peter Bailey put it so well to him in asking what are you doing all this for? Barrymore does have more money than he could ever possibly use. A little charity wouldn't hurt him.Remember the basic plot outline. A whole lot of people in Bedford Falls one post World War II Christmas Eve see that their friend George is toting a heavy load of mysterious origins. Their prayers reach the heavens where an angel is dispatched to aid.But before Henry Travers the angel arrives, he's given the story of George Bailey's life. And we see the kind of struggles he's had, the sacrifices he's made for the good of a whole lot of others. We've also seen a greedy and grasping Potter, grabbing everything that George Bailey cannot save. Something happens that day before Christmas through no fault of his own, Bailey is in big trouble. It's driven him to the brink of despair. That's why the angel is sent down. He shows him the alternate universe that would have been had he never existed. It's something each and every one of us should try to do, step outside ourselves see just what our contributions can be.But I think what Frank Capra is trying to say in this greatest of his films is that having done that and we realize we haven't contributed to the greater good of humankind, we resolve to do so. It's a simple, but profound lesson.What if Potter got the same opportunity? In a sense Charles Dickens did just that in A Christmas Carol. Would Lionel Barrymore change? It's an interesting point of speculation.In addition to those cast members already mentioned a whole group of players who worked with Capra before grace this film. Add to that some others and you have a perfectly cast feature picture.Donna Reed has an interesting part as well. Your choice of mate is real important in life. Had she not been as loving and supportive to George Bailey, he might very well have taken a different route in life. Mary Hatch Bailey became a signature part for her, more identified than her role in From Here to Eternity which got her an Oscar. It certainly was the basis for her TV series.When Todd Karns who plays Harry Bailey toasts his brother he's saying that the riches of the world are not necessarily things that can be quantified. Your life is not measured in material things, but in how you use the material things given you. And that universal lesson will be taught into eternity as long as It's A Wonderful Life is shown every year. Wouldst we all learn it."},{"username":"Leofwine_draca","userUrl":"https://www.imdb.com/user/ur0482513","reviewLink":"https://www.imdb.com/review/rw2943425","warningSpoilers":true,"date":"17 January 2014","rate":"9","helpful":"16 out of 22 found this helpful.","title":"Great Christmas (and all year round) movie","content":"Frank Capra's 1946 drama/fantasy IT'S A WONDERFUL LIFE is one of the best-remembered films of all time, and it's no surprise; this moralistic tale of human suffering, poverty, greed, courage and determination is one that resounds through the ages, particularly so in our modern age of fat-cat bankers and a growing gap between rich and poor.James Stewart gives a dependably decent turn as George Bailey, a family man who finds himself at the mercy of Lionel Barrymore's criminal banker, Mr. Potter. What follows is lengthy and often profound, an occasionally twee but ultimately moving exploration of the human character and the effect one man can have on his world.What I particularly liked about IT'S A WONDERFUL LIFE is the way that every part of the narrative hangs together without any unnecessary extras. Even the little bits like the accident on the ice at the outset later come back to haunt our characters. It's very well written, and expertly directed by Frank Capra; an unashamedly old-fashioned, heart-warming and sentimental piece of movie-making on a grand scale. I'd even go so far as to call it the ultimate Christmas film."},{"username":"Michael_Elliott","userUrl":"https://www.imdb.com/user/ur13134536","reviewLink":"https://www.imdb.com/review/rw1998074","warningSpoilers":false,"date":"29 December 2008","rate":"","helpful":"12 out of 21 found this helpful.","title":"One of the All Time Greats","content":"It's a Wonderful Life (1946)**** (out of 4) This timeless classic has James Stewart playing George Bailey, a frustrated businessman who gets the chance to see what the world would have been like had he never been born. I've lost count of how many times I've watched this film over the years but it keeps getting better with each new viewing and I can't help but notice new things each time I watch it. There's really nothing I could add that hasn't already been said about this movie but it's certainly one of my all time favorites and I'd argue that it's one of the greatest ever made. This movie has been called timeless by many people but I really can't think of too many movies where this is more true. I can't possibly see how this movie would ever grow old fashioned or out of touch because there's always going to be people who feel like the main character here. The most amazing thing to me is that the film perfectly captures how someone might begin to feel that they're worthless and I can't help but think that anyone who watches this movie will have a better look on life or themselves after watching it. I really can't think of too many movies that contain as much power as this one but I'd say that's why new fans are gained each and every passing year. The greatness of the film is certainly its heart but Stewart also deserves a lot of credit for his marvelous performance, which is certainly one of the best of his career. There are countless scenes in this movie where Stewart just nails it and I'm sure everyone knows the praying in the bar scene but there are many other great ones as well. On this viewing the scene on the bridge when Stewart begs for his life back hit me unlike any other time. There's also the scene in the bank where George has to bargain with the people not to take all of their money. Lionel Barrymore was always great playing bad guys and I can't help but think he's one of the greatest villains in movie history. The evilness that Barrymore is able to get through this character makes it among the actors best work. Donna Reed, Thomas Mitchell and Harry Travers also add great support. Every inch of this movie works flawlessly and that includes the sequences where George gets to see things as if he were never born. I think these moments contain Capra's greatest work as a director as the darkness and atmosphere he creates is so think and depression that it perfectly puts you in the mind frame of George. Then you've got that priceless ending, which ranks right up there with City Lights and Psycho as being the greatest for any movie."},{"username":"SnoopyStyle","userUrl":"https://www.imdb.com/user/ur2898520","reviewLink":"https://www.imdb.com/review/rw2925927","warningSpoilers":false,"date":"21 December 2013","rate":"9","helpful":"8 out of 11 found this helpful.","title":"Unabashed Sentimental Capra","content":"George Bailey (James Stewart) is at the edge of financial ruin. He thinks his life has amounted to nothing and is about to jump off a bridge. An angel named Clarence is assigned to give George a second chance by showing him what if he was never born.This is an unabashed sentimental tear jerker. The movie starts with George's life as it is. His dream is to travel the world, and create great monuments. He is constantly dragged back to the unimpressive little Bedford Falls and the family Savings and Loans. He is a good guy who constantly does the right thing.This is classic Frank Capra. The nice guy struggles but always win in the end. This sentimental melodrama is especially fitting for the Christmas period, and derives its iconic status from the constant showing during those times. The failure in its original run is a long forgotten memory."},{"username":"Hitchcoc","userUrl":"https://www.imdb.com/user/ur0278527","reviewLink":"https://www.imdb.com/review/rw0034344","warningSpoilers":false,"date":"4 October 2001","rate":"10","helpful":"11 out of 16 found this helpful.","title":"A Wonderful Film with a Cutting Edge","content":"Once again, my two cents' worth of a film that is the darling of so many people, myself included. It has its uplifting conclusion, and the theme that every life has its purpose in the great scheme of things. George Bailey is in trouble. He has decided to end it all. The thought of jail and disgrace is more than he can handle. George's life has been a continual parade of missed opportunities. There is a layer of pain just above the surface of nearly every scene. George is a victim and this series of disappointments takes its toll. He eventually becomes hardened and frustrated, but because he is honorable, he goes about the business of living. He has gifts he doesn't realize. He has family. He has status, and while not often appreciated, he is. Unfortunately, we don't always share our love and admiration with those who deserve it. His sense of adventure from birth has been clutched from him over and over. His bad ear makes the army an impossibility, his father's death forces him to run a business he wants to run away from, and even his honeymoon money is used to prevent a run on the bank. George never knows his importance until Henry Travers' well meaning angel comes along.I love this movie, but I also take it seriously. It can be painful to watch sometimes. The best scenes are the ones where George never existed. His despair is evident and the tension builds higher and higher. When he comes back, such a weight that is lifted. Jimmy Stewart is at the top of his acting form; I loved him as a living human being and as an actor; he portrays the kindness I believe the world should have.And then there is Donna Reed, Lionel Barrymore, Ward Bond, and all the others. They are superb. It's a question all of us have wrestled with: \"What if we had never existed?\" There is no peer in Capra's canon. I truly believe that this is a necessary part of our heritage. We need to see things as they should be. I love Christmas because it at least portends to be the time we all look at our gifts. This movie is a gift to the world and one we can learn from over and over, even if the events never took place."},{"username":"Kirpianuscus","userUrl":"https://www.imdb.com/user/ur61197531","reviewLink":"https://www.imdb.com/review/rw3365316","warningSpoilers":false,"date":"2 December 2015","rate":"","helpful":"4 out of 6 found this helpful.","title":"simple charming","content":"one of memorable movies for profound humanistic message. one of films with the gift to be experience more than memory. charming for its simplicity and for the comfortable , protective status. a Frank Capra who could be easy his the best. because entire soft atmosphere, the joy, the crisis, the values, the humor are exposed at the right moment, in the right place and measure. a film about a man and his family. his dreams, projects. and his future. nothing original. but new each occasion to view the movie. because it is a classic in a special sense. not for the taste of old moments but as a moral lesson, very useful, for the present. a film who seems be perfect for the Christmas. in fact, it remains the perfect choice for every day."},{"username":"mark.waltz","userUrl":"https://www.imdb.com/user/ur0968789","reviewLink":"https://www.imdb.com/review/rw4532943","warningSpoilers":true,"date":"25 December 2018","rate":"10","helpful":"13 out of 18 found this helpful.","title":"Each man's life touches so many others.","content":"In looking at this glorious Christmas classic, it's easy to get so involved in the psychology behind it. we obviously become so caught up in our own lives that we often forget about how others around us have influenced who we become and vice versa. This film, which has been redone in many different forms, including taking popular characters from TV shows, both daytime and nighttime and putting them in the same situation as Jimmy Stewart, truly stands the test of time. Not only is it watching one man's slow destruction from things that seem to be beyond his control, it's seeing how one person can deal with the ruthless machinations of the pure evil around him and open the eyes of everybody else to see what's really going on.In a return to the Christmas theme that he earlier used in 1941 classic \"Meet John Doe\", director Frank Capra saves the seasonal Twist of the story for the film's last half-hour. An unseen angel is sent to a small town to aid a possible suicide victim when the actions of the greedy and evil Lionel Barrymore threatens to send him to prison for embezzlement. Stewart's life is seen in flashbacks for much of the film, but when the film joins the present day, it is almost like it has gone some 70 years into the future to today with Barrymore representing the truly evil Scrooge like banker who wants to control everybody's life.It is quite a shocker to see Barrymore playing such a nasty, evil man after playing the kindly Dr. Gillespie in the series of MGM medical dramas. he is basically expanding the role of Scrooge which he did on radio for many years and adds an essence of true malevolence to his characterization. Even Scrooge wasn't as crass as his character here. It seems to be a continuation of the role that Edward Arnold played so beautifully in Capra's earlier films \"Mr Smith Goes to Washington\" and \"Meet John Doe\".The lovely Donna Reed crosses over from MGM ingenue to classy leading lady, adding much depth to her role of Stewart's girlfriend, later wife, with Beulah Bondi saintly as usual his lovable mother. (Bondi played Stewart's mother in so many films and on TV that it is obvious that somehow in real life, he did call her ma.) Then there's Gloria Grahame as the town flirt, Thomas Mitchell as Stewart's rascal uncle, and of course Henry Travers as Clarence, the angel who desperately wants his wings. The smaller roles are filled out by many familiar actors, some of whom were in pretty much every Capra film, as well as Danny Mummert and Larry Simms, both from the \"Blondie\" series and Karolyn Grimes, an underrated child star who stole many movie programmers in the mid-1940s.There are so many other things to credit for this film's excellence beyond the cast and direction, namely the brilliant script, fast pacing and brilliant production design. This film holds up regardless of whether you see it in its original black-and-white form or it's decently restored colorized version. I'm not in favor of colorizing classic movies, but somehow this one actually came out all right. while I watch this one every other year rather than every year, I can say that I am continuously touched and discover new seems in its that I had not seen before. It is no wonder that this is on nearlt everybody's list of the top Christmas movies of all time."},{"username":"Prismark10","userUrl":"https://www.imdb.com/user/ur4569900","reviewLink":"https://www.imdb.com/review/rw3023637","warningSpoilers":false,"date":"27 May 2014","rate":"7","helpful":"4 out of 12 found this helpful.","title":"Small town life","content":"In It's a Wonderful Life, George Bailey (James Stewart) is man who wants out from his small town life but something always keeps him from breaking out and fulfilling his dreams. Instead he ends up working in the family loan company, helping other people out. He has a wife Mary (Donna Reed) and four children in an old house which they make their home.On Christmas Eve, George's Uncle Bill loses $8000 while he is attempting to deposit the money in the bank but loses track when he brags to the town bigwig Mr Potter. The Bailey family nemesis, Mr Potter (Lionel Barrymore) finds the cash but keeps it to himself. George realises when the bank auditor finds out that the accounts do not match he might lose everything and go to jail. George decides to kill himself However an angel Clarence (Henry Travers) is sent to save him and to show him how valuable his life is to the people around him by taking him to the time as if he was never born where he sees an alternate timeline. George discovers that he has made a positive contribution to many peoples lives.The story has been told many times since then in television, books and films. Even the last episode of Classic Dallas was a variant of this movie based on the Ewings if JR was not around!The film is regarded as an all time classic and it does have merits for being novel such as the beginning of the picture with a supreme being calling for an angel and the angel being one who has yet to gain his wings that is another story done many time since.The film is charming, winsome but also a shade too long. The alternate timeline where the town becomes a cesspit looks improbable with Mary being a spinster librarian, a friend of George (Violet) becoming a good time girl and other townsfolk becoming nasty and rather brutish.Also Mr Potter never seems to get his comeuppance, even during the days of the code Mr Potter still managed to find a way round things!"},{"username":"claudio_carvalho","userUrl":"https://www.imdb.com/user/ur2488512","reviewLink":"https://www.imdb.com/review/rw1564670","warningSpoilers":false,"date":"5 January 2007","rate":"10","helpful":"27 out of 41 found this helpful.","title":"One of the Most Beautiful Movies of the Cinema History Ever","content":"On the Christmas Eve of Bedford Falls, the guardian angel Clarence (Henry Travers) is assigned to convince the desperate George Bailey (James Stewart) to not commit suicide. George is a good man, that sacrificed his dreams and his youth on behalf of the citizens of his small town. He inherited the loan business of his father and he gave up traveling the world and joining the university as scheduled. Later he resisted the proposals of the evil banker Mr. Potter (Lionel Barrymore) and has never sold his business to protect the poor community of Bedford Falls and offer a means to afford to buy their own house. He married his beloved Mary Hatch Bailey (Donna Reed) and had four children with her and a tough life with his family. When his uncle Billy (Thomas Mitchell) loses US$ 8,000.00, found and stolen by Mr. Potter, George decides to commit suicide, since he believes he worth more dead than alive. When Clarence sees that he is not able to persuade George to give up his intention, he decides to show the life in town if George had never existed. George concludes that life is wonderful.\"It's a Wonderful Life\" is certainly one of the most beautiful movies of the cinema history ever. This masterpiece has a touching and moralist story, showing that the famous sentence that a man can make the difference is true. Everything works perfectly in this movie. The original screenplay develops the situation and the characters accurately, using flashbacks and magnificent lines. The direction of Frank Capra is outstanding as usual. The cinematography in black & white and using shadows and lights is fantastic. James Stewart leads an amazing cast, showing a perfect chemistry with the gorgeous Donna Reed, in the role of a compassionate and enlightened good man. Lionel Barrymore is also amazing in the role of the despicable banker. I do not recall how many times I have already seen this film, but last time was 16 Dec 2000. This is the type of movie that a lover of cinema will never get tired of watching many times. My vote is ten.Title (Brazil): \"A Felicidade não se Compra\" (\"The Happiness Is not Bought\")"},{"username":"bob the moo","userUrl":"https://www.imdb.com/user/ur1002035","reviewLink":"https://www.imdb.com/review/rw0034375","warningSpoilers":false,"date":"8 February 2002","rate":"","helpful":"11 out of 27 found this helpful.","title":"Classic bit of American propaganda that never fails to warm the heart","content":"`George Bailey is a pillar of his community whose life has been selflessly dedicated to the welfare of others. Through the evil machinations of the town's business mogul, George is driven to the point of suicide. In answer to the prayers of the townsfolk, a missing angel comes to the rescue. He shows George what a sad and sorry place the town would have been without him. Can this life George out of his despair?'Who hasn't seen this film? Anyone? It is an unashamed tribute to homely values and is hugely warming. The story itself is not exactly rocket science, but it is does contain plenty of nice touches as we follow George through his life of missed opportunities and sacrifice through to his marriage and eventual down fall. The world that this happens seems so distant nowadays, with our friendless society - so few people do anything for their fellow man in big cities etc. So this is very touching to see a man who serves others in such a major way. It is a story of how every little helps and how you cannot overdo friendly gestures.Stewart is excellent with his partner Capra. Barrymore is also excellent in a thankless role - he represents all that is wrong in society and of course he rises to a powerful position. Henry Travers is good as Clarence, the wingless angel and of course who can forget the excellent Donna Reed as Mary.It's pure hokum of course, the regular Christmas movie that lifts everyone's spirits. But isn't this what we all wish the world was like really? Why can't it be - if only for two hours. This is what Stewart and Capra do best - enjoy and forget the real world."},{"username":"kosmasp","userUrl":"https://www.imdb.com/user/ur5876717","reviewLink":"https://www.imdb.com/review/rw6494380","warningSpoilers":false,"date":"17 January 2021","rate":"8","helpful":"4 out of 8 found this helpful.","title":"Life - is what you make it (for you and for ...)","content":"Is life really wonderful? I'm certain a lot of cynics would like to disagree from the outset. Sometimes I'm one of them it seems. But back to this and a man (Stewart, always good and good looking) that has done a lot of good ... but seems to get into trouble nonetheless. He's only human after all - but who could help him? Well other humans, but not in a direct way.Especially the later part of the movie takes off, giving us a payoff that we deserve I'd say. It's fascinating how much people seem to be in love with this movie, but it makes sense. It shows that through all the struggle, there can be hope. Even at your lowest point possible, never surrender, never give up, never quit (wait is that the Cobra Kai mantra? Also did I offend you by even comparing that? It doesn't make sense I know ... right? I think ... let's get back to the movie shall we?).So while there is a simple tale here (if you think about it), it is also a morality tale. It is a tale with a social but also personal message! And it is also a message of humanity and strength and the will and the mental strength to overcome hurdles ... A Christmas Carol has similarities to this, though I have to admit, I don't know how intended they are ... I'd guess more than intended, but that's just me. So sit back and enjoy a family film that has its ups and downs and may feel dated at times, not to mention predictable and putting the viewer ahead many times when it comes to knowing stuff way before our lead character does ... but one that is as feel good as they get ..."},{"username":"classicsoncall","userUrl":"https://www.imdb.com/user/ur2707735","reviewLink":"https://www.imdb.com/review/rw2354955","warningSpoilers":true,"date":"18 December 2010","rate":"10","helpful":"10 out of 13 found this helpful.","title":"\"Each man's life touches so many other lives\".","content":"If there's one movie I probably haven't watched enough times, it would be \"It's a Wonderful Life\". The characters, the situations, the message all come together in a way that intrinsically defines it as a Christmas movie, but when you get right down to it, the film transcends Christmas in a way that's truly heartwarming and magical. Jimmy Stewart had that unique ability to put the Everyman into his roles, and this picture certainly qualifies as one of his finest performances. Donna Reed could not have been a better choice to play Mary, displaying a wholesome sex appeal to go along with those traditional home town American values that pictures of the era were so skillful in portraying. Had Director Frank Capra made only this one picture, it would have earned him recognition as one of the true masters of cinema. I could go on and on, but there's really no point in trying to heap further accolades on a picture that has earned it's place in American film right at the top. Watch it, and watch it again, and in taking the picture's message to heart, reach out and help an angel earn it's wings."},{"username":"lee_eisenberg","userUrl":"https://www.imdb.com/user/ur4888011","reviewLink":"https://www.imdb.com/review/rw1294136","warningSpoilers":false,"date":"17 February 2006","rate":"7","helpful":"3 out of 27 found this helpful.","title":"Did anyone read Maureen Dowd's spoof?","content":"Since everyone knows what happens, I'll comment on Maureen Dowd's spoof, called \"A Not-So-Wonderful Life\". It portrays Clarence meeting Donald Rumsfeld and showing the defense secretary how the world would be if he'd never existed. The world would be a much better place: no Iraq war and we'd have caught Osama bin Laden almost immediately.I wrote an extension of that idea portraying that Fonzie is president and the characters from \"The Dick Van Dyke Show\", \"The Beverly Hillbillies\", \"Bewitched\", \"Gilligan's Island\", \"I Dream of Jeannie\", \"Get Smart\", \"The Flying Nun\", \"The Brady Bunch\", \"All in the Family\" and \"Sanford and Son\" are in his cabinet.But anyway, \"It's a Wonderful Life\" is worth seeing. Especially the swimming pool scene and the bathrobe scene."},{"username":"gavin6942","userUrl":"https://www.imdb.com/user/ur1234929","reviewLink":"https://www.imdb.com/review/rw3137700","warningSpoilers":false,"date":"7 December 2014","rate":"7","helpful":"2 out of 7 found this helpful.","title":"Holiday Classic","content":"An angel (Henry Travers) helps a compassionate but despairingly frustrated businessman (Jimmy Stewart) by showing what life would have been like if he never existed.After almost seventy years, and getting played over and over on television, you might think people have grown tired of this film. And yet, as of 2014, it seems to be appreciated more than ever. Not that it is a flawless film. The editing, for example, is pretty rotten. And critical, it is probably not a great film, especially alongside \"The Best Years of Our Lives\", which came out around the same time. But this film really hits the heart.There are some parallels here with \"A Christmas Carol\", only now it is Bob Cratchitt who is the one in a need of a visit from a supernatural friend. The message is different, but also very much the same."},{"username":"jboothmillard","userUrl":"https://www.imdb.com/user/ur4248714","reviewLink":"https://www.imdb.com/review/rw1039911","warningSpoilers":true,"date":"15 March 2005","rate":"10","helpful":"5 out of 10 found this helpful.","title":"It's a Wonderful Life","content":"This is the best Christmas film ever made from Golden Globe winning, and Oscar nominated director Frank Capra. The film begins with seeing most of the past of George Bailey (Oscar nominated James Stewart), before going to the present day, Christmas Eve, where he, as a businessman is losing the plot of life, including living with his wife Mary Bailey (Donna Reed) and his kids. Also, Mr. Potter (Lionel Barrymore) is threatening George with asking for money and trying to tempt George into buying the Baileys business. When money goes missing, Potter won't help him (for being rude) and he has a fit with his wife and kids, he soon thinks about ending his life. Until he meets Clarence (Henry Travers), who calls himself an angel without wings, he can only earn them by helping George. To prove himself, Clarence grants George the wish that he never existed. When George goes back to town everything has changed, the twon is called Pottersville instead of Bedford Fals, members of his family are no longer around, and nobody recognises him, not even his wife. When George discovers how much of a difference he makes to the city he wishes to be back again. It is heart-warming when he is so happy to be back to normal and he ends up as a millionaire, and Clarence got his wings. It was nominated the Oscars for Best Film Editing, Best Sound and Best Picture. James Stewart number 12 on The 100 Greatest Movie Stars, he was number 3 on 100 Years, 100 Stars - Men, and he was number 13 on The World's Greatest Actor, George Bailey was number 9 (Hero) and Mr. Potter was number 6 (Villain) on 100 Years, 100 Heroes & Villains, the film was number 4 on The 100 Greatest Tearjerkers for the happy ending, it was number 8 on 100 Years, 100 Passions, it was number 37 on The 100 Greatest Family Films, it was number 10 on The 100 Greatest Christmas Moments, it was number 11 on 100 Years, 100 Movies, it was number 1 on 100 Years, 100 Cheers, and it was number 7 on The 100 Greatest Films. Outstanding!"},{"username":"ccthemovieman-1","userUrl":"https://www.imdb.com/user/ur4445210","reviewLink":"https://www.imdb.com/review/rw1495432","warningSpoilers":false,"date":"12 October 2006","rate":"5","helpful":"22 out of 68 found this helpful.","title":"Wasn't What I Expected","content":"I've only watched this revered classic film one time. It was okay but disappointing. I expected more after hearing of its great reputation. True, it was interesting but it had too many frustrating and annoying parts for my tastes. It was not the feel-good film I was expecting.I admit the ending was terrific and brings a tear to one's eye with an inspiring message but much of the film deals with tough breaks that \"George Bailey\" (Jimmy Stewart) had to face and also featured a very mean, despicable dishonest man in \"Mr. Potter\" (Lionel Barrymore). A lot of those scenes were not fun to watch; more frustrating than anything else. The movie has several scenes in which Bailey isn't the best person, either, but it could be argued that everyone has their moments, so why not him, too? Since this is so beloved a film, and such a Christmas favorite, I just expected more of a nice, lighthearted, good-natured story. Instead, I got a very dramatic movie with a number of unpleasant scenes.Interesting that this would be a Christmas favorite when Stewart's character admits he doesn't know if God answers prayer, or if He's even there. All of this coming from a guy who's attended church for years? Well, at least he found out, and it was a good message.The \"message\" was that everyone's life counts for something, that life is important and what you do with it especially important because it effects not just you but a number of other people many times in ways you could never imagine.To its credit, the story is an involving one. I will have check this out again and perhaps, with a different outlook going into it, will learn to like this film."},{"username":"Tweekums","userUrl":"https://www.imdb.com/user/ur13977076","reviewLink":"https://www.imdb.com/review/rw2751265","warningSpoilers":true,"date":"10 February 2013","rate":"10","helpful":"4 out of 7 found this helpful.","title":"A timeless classic","content":"This classic film opens with the voices of various people praying for George Bailey; it is clear that their prayers will be answered when voices in the heavens discuss how to help him. Angel Clarence will be assigned to save George but first Clarence, and the audience, must see how George came to be considering suicide. As a child George Bailey dreamt of getting out of the small town of Bedford Falls; he wanted to see the world, get an education then make his mark on the world. It wasn't to be though; he constantly sacrifices his dreams to help others. This leaves him stuck in the town running the savings and loan company that his father ran. It isn't a job he wanted but he does it anyway giving loans to people nobody else will help. This makes him popular with everybody apart from the miserly Mr. Potter who doesn't like to see the people who were paying him to rent slums buying their own houses. The years pass and George gets married and has children; he isn't rich but he is content; then one day Potter gets the opportunity to ruin George; thinking the only way he can help his family is to kill himself for the insurance we get to the point the film started. As he hits the depth of despair Clarence appears in his life and showed him just what the town would have been like if George had never been born; a miserably place full of bitter people lorded over by the odious Potter. When George returns he understands what good friends he has.I'd obviously heard of this film a long time ago but had somehow never seen it until today. I knew the film was considered a classic and think James Stewart was a fine actor so I had to watch it when it was on television. Now that I have seen it I ban see why it is held in such high regard. I was a little put off by the opening but once we started seeing George's life from the time he saved his brother's life when he was twelve till the very end I was engrossed. Stewart did a great job as George; the man destined to miss out on his dream each time it looked as though it would come true... even the moment he was about to go away on his honeymoon was ruined meaning he couldn't go. It isn't all disappointment though; there are many joyful scenes as George helps various people and falls in love and then marries Mary Hatch. By the end it is likely that the viewer will have shed tears of both sorrow and joy. If you haven't seen it yet watch it the next chance you get and if you have seen it I'm sure you don't need anybody else to tell you how good it is!"},{"username":"moonspinner55","userUrl":"https://www.imdb.com/user/ur0989035","reviewLink":"https://www.imdb.com/review/rw1328619","warningSpoilers":false,"date":"29 March 2006","rate":"7","helpful":"3 out of 10 found this helpful.","title":"Fantasy Americana (with a somber undercurrent)","content":"Heartwarming Frank Capra film which has become (quite unintentionally, I presume) a Christmas perennial. Set in small town America, James Stewart stars as a discouraged and suicidal banker who learns a lesson about life from an angel anxious to get his wings. Fantasy with a holiday theme took many years to garner its classic status, yet it's a shrewd mixture of comedic, dramatic, and emotional elements. Capra's direction is quite sensitive, creating an evocative overview of middle America and the struggling working class. Stewart gives his usual sterling performance, and Donna Reed is a good romantic screen match for him; Henry Travers is the perfect twinkle-eyed old angel. Capra also co-adapted the screenplay based on the short story \"The Greatest Gift\" (which seems to have a touch of Dickens as well). Later remade as the 1977 TV movie \"It Happened One Christmas\", which featured Marlo Thomas in the lead. *** from ****"},{"username":"TxMike","userUrl":"https://www.imdb.com/user/ur0438066","reviewLink":"https://www.imdb.com/review/rw6404310","warningSpoilers":false,"date":"26 December 2020","rate":"","helpful":"3 out of 5 found this helpful.","title":"Was an upbeat post-WW2 movie, now a classic.","content":"My wife and I chose this for our Christmas night viewing even though we have seen it before. It is currently available on Amazon streaming movies.WW2 ended in 1945 and this movie was made in 1946. The premise is straightforward, George Bailey ( James Stewart, 38 at the time) had been a fine boy growing up and now as an adult often gave up his own goals for the benefit of others, like his younger brother. Perhaps too generous, when his Building and Loan business was in trouble he was contemplating suicide as a way out, thinking the world would be better off if George Bailey had never existed.An angel is sent down to intervene, in the last third of the movie George gets to see exactly how his town would have been and in the process gets his head straight.Donna Reed (23 at the time) played his wife Mary who would have been the stereotypical \"old maid librarian\" if George had never existed.Filmed in glorious B&W, the film holds up very well all these years later when one pits it against other very old movies."},{"username":"blanche-2","userUrl":"https://www.imdb.com/user/ur0342623","reviewLink":"https://www.imdb.com/review/rw2180032","warningSpoilers":false,"date":"25 December 2009","rate":"10","helpful":"7 out of 9 found this helpful.","title":"A man receives a rare gift","content":"Frank Capra's sometimes dark post-war film, \"It's a Wonderful Life\" was released in 1946. It was intended to be released in 1947, but when a Technicolor print of \"Sinbad\" couldn't be delivered on time, this film was put into release. For that reason, \"It's a Wonderful Life\" - possibly the most wonderful film ever made - was overshadowed by \"The Best Years of Our Lives.\" But you can't keep a great film down, and as the years have passed, \"It's a Wonderful Life\" has found its place as an iconic film that means Christmas. It's survived the public domain (due to a clerical error, when the copyright was not renewed in 1974), where it was cut to ribbons and shown so often on television (and why not, networks could show it for nothing) that people were sick of it. Now that it has to be licensed again in order to be shown, the film is shown in its totality and not as often.This remarkable story of a man who sacrifices his dreams for the betterment of his community and the business his father built resonates today more than ever, when it often seems like no one cares about anything except what's in it for them. James Stewart is perfect as a caring man who swallows disappointment after disappointment and finally is ready to give up, until he is given the gift of seeing what would have happened had he never been born. No man, he learns, is poor who has friends.I can't think of a better message or anything more inspirational than can be found in this film. George Bailey is all of us, and his story is a reminder that we're all important and, no matter how tough it gets, we need to keep going. One of my favorite movies."},{"username":"dbdumonteil","userUrl":"https://www.imdb.com/user/ur1219578","reviewLink":"https://www.imdb.com/review/rw1443282","warningSpoilers":false,"date":"9 August 2006","rate":"10","helpful":"5 out of 9 found this helpful.","title":"It's a wonderful movie!","content":"Frank Capra's peak,this movie influenced a lot of directors and ,unlike some of his other works such as \"you can't take it with you\" ,it is as fresh today as it was 60 years ago.Capra's detractors criticize his eternal optimism but even that is questionable:What would have become of the town,had the hero taken his own life?Was there only one just man ,like in Sodom in Genesis ,to save the city from the impending fall?It brings into question the so-called trust Capra puts in the human race.It's not a rosy world.The scenes between James Stewart and his guardian angel are so powerful you cannot hold back your tears.No other artist told us that ALL human beings were important in such a wonderful way.And nobody depicted the yuletide spirit like Capra."},{"username":"Quinoa1984","userUrl":"https://www.imdb.com/user/ur0453068","reviewLink":"https://www.imdb.com/review/rw1553331","warningSpoilers":false,"date":"24 December 2006","rate":"9","helpful":"4 out of 9 found this helpful.","title":"the tale of the classic selfless man's conflicted mind-set and the town that's ingrained in his life","content":"I should be inclined to say that Frank Capra made his masterpiece with It's a Wonderful Life, and it would probably be the obvious, easy answer to make as a movie-lover. And shock of shocks, it wasn't until today (of Christmas Eve of all times, ho-ho-ho) that I finally sat down and watched it- it wasn't a 'family staple' in my house- but I knew I had to watch it, if only to see James Stewart in the seminal role of George Bailey. It is, no doubt, with enough fantastical scenes to make up a couple more movies, and the heart that sits right in It's a Wonderful Life beats with all the vigor and pride of the most schmaltzy- and rightly proud of it- American spirit. That I ended up not finding it to be a truly astonishing movie may be that I'm just a cynic deep down, or that maybe this kind of story, and how it plays out, has ended up being done so many times I practically knew what the story was before going in. It's the most amazing of credits to Capra and his cast and crew that it does hold up this well, and that the sentimentality stringing together much of what happens is actually well earned. But it does teeter on becoming a bit too dated, or rather that it's appeal of being a fable really only works best when dealing with the crux of the character George Bailey, and almost becomes weird in how it leaps from great happiness to the terrible bleakness of modern American life.Indeed, Stewart was not only the best choice for George Bailey, but the correct one, the kind we'd probably all like to have in our town as the man who despite his better senses commits his life to being there for the ones he cares for. It almost becomes a running gag, however not really funny as much as touching, the way he puts aside his own feelings and self-wants to help save the bank and Bedford Falls from the peril that could come from the dastardly Potter (Lionel Barrymore, cast perfectly for the role as well with his sinister eyebrows and cunning attitude). I first thought it would be all about George seeing life as if he had never been born, but really this is(wisely) kept to the last twenty minutes of the picture. This works because we see how Bailey gets to that point of almost jumping off into the river, which in its selfish way would be, to him, still a selfless act (i.e. worth more than dead). Seeing George's life is like peering into one of those tall-tale American stories where the little guy gets a lot done by just being himself- or at least his better self getting the better of him. All George wants to do as a young man is explore the world, make great buildings and things. But any lofty ambition becomes squashed by reality- of his father's death, of the very sneaky attitude imposed by Potter, and by the townspeople practically needing some hope during the depression. So it's up to him to not only save the town by making a section of the town named after him for low-cost housing, but to marry a girl Mary (Donna Reed) who's fallen totally for George.What ends up being most memorable, for me, about It's a Wonderful Life is the skill which Capra makes possibly one-dimensional figures very real and immediate, and that in this seemingly simplistic world of right and wrong and good and bad there are the slivers of gray that work their way in. I loved one scene in particular where Potter, desperate to gain back control over his possible monopoly in Bedford Falls, tries to will George away to work for him at far more an amount of money he would make on his own terms with his small bank. It's a tense scene in how devilish Potter comes off, and how Barrymore turns on the ideal of greed and necessity and the ego of a man over the higher principles that George ultimately goes for. It's always fascinating too to see how Stewart plays certain scenes and lines and inflections, moments of surprise and delight which probably hide just the bits of bitterness that build up in him. There's something about the American dream that is called into question in American life, even as Capra likes to jump from sweet touches of light comedy to stark tragedy or danger. There's a great juxtaposition that is made too with the characters of Harry Bailey, George's brother, who goes on to lead the life George might have led had he not saved Harry as a boy, and as well in a small part with Sam Wainwright.It's through the sort of realistic groundings then that Capra is able to get away with reaching for the fantasy structure that ends up coming out of the film, the typical 'what if' nightmare scenario that has ended up influencing countless movies and TV shows. Like Christmas Carol, though sort of in reverse, it's sort of meant as a lesson in humanity, and how what is carried in a man or what is lacking in it ends up bringing it out or losing it in others. It all builds to help Capra earn the melodrama and ultra-heightened emotions brought out with Clarence the angel. It doesn't mean that, at least for me, there aren't things that end up being dated (however, scenes like the dance-hall bit in 1928, is timeless in its humor), mainly in how the idealism and old-fashioned ways come out in this day & age. But still, it doesn't stop me from saying that It's a Wonderful Life is a must see, if only once, and there's no doubt why it's been revered as one of the great films about the triumph of the human spirit. Grade: A"},{"username":"tavm","userUrl":"https://www.imdb.com/user/ur11228318","reviewLink":"https://www.imdb.com/review/rw1548008","warningSpoilers":false,"date":"18 December 2006","rate":"10","helpful":"2 out of 7 found this helpful.","title":"Frank Capra and Jimmy Stewart's It's a Wonderful Life is my all-time favorite","content":"Since I first saw this classic in 1981, I've seen an episode of Laverne and Shirley with this premise (it's Laverne who imagines this scenario), a musical version on stage with Ernie the taxi driver-not Martini-owning a bar, and last year a Baton Rouge Little Theater presentation with dialogue almost taken verbatim from the movie. Nothing however compares to the original film interpretation. How can one not laugh when George (Jimmy Stewart) and Mary (Donna Reed) accidentally fall into the high school gym swimming pool after Mary ditched a potential suitor (Carl \"Alfalfa\" Switzer)? Or not get touched by George's speech defending his late father to Mr. Potter (Lionel Barrymore)? Certainly the last hour as George feels the world tumbling before him and his eventual appreciation of his life are some of the most tear-and-laugh inducing scenes I've ever seen in the movies or television. It's a Wonderful Life has always been my favorite movie and nothing I've ever seen has even come close. Kudos to Stewart and director Frank Capra for such a life-affirming project. Thanks also to Barrymore, Reed, Switzer, Samuel S. Hinds (George's father Peter), Beulah Bondi (George's mom), Thomas Mitchell (Uncle Billy), H.B. Warner (Gower the druggist), Gloria Grahame (Violet Bick), Lilian Randolph (Annie the maid), Sheldon Leonard (Nick the bartender), Ward Bond (Bert the cop), Frank Faylen (Ernie the taxi driver), Bill Edmunds (Martini), and Charles Lane in his role as the guy who tells Potter about George's Bailey Park plans for filling the picture with, in Nick's words \"a little atmosphere\". Add to that all the various kid and adult actors I can't remember right now. And finally, special thanks to Henry Travers (Clarence) for making us all believe in angels. No truer words have ever been written as the one in Clarence's book gift (The Adventures of Tom Sawyer) to George: No man is a failure who has friends. Though one may quibble about Harry not being saved without George despite other friends near him or Mary becoming an old maid, It's a Wonderful Life is a flawless masterpiece that has stood the test of time for the last 60 years. May it stand forevermore. P.S. Look for the Blondie movie series' kid stars Larry \"Baby Dumpling/Alexander Bumstead\" Simms (George's son Pete) and Danny \"Alvin Fuddle\" Mummert (Little Marty Hatch). And Ellen \"Grandma Walton\" Corby as the woman George kisses in the run-on-the-bank sequence. Update: 12/25/2020-I just watched the colorized version from Legend Films. While I noticed some detail concerning background and extras I hadn't previously noticed before, I didn't let myself get too distracted by that colorization since except for the skies during the night scene, I didn't notice any scenes that seemed to still be in the original b & w like I did when the first colorization was done by Hal Roach Studios during the late '80s. In other words, I still enjoyed the film enough with that alteration."}],"errorMessage":""}