{"imDbId":"tt0088763","title":"Back to the Future","fullTitle":"Back to the Future (1985)","type":"Movie","year":"1985","items":[{"username":"TheLittleSongbird","userUrl":"https://www.imdb.com/user/ur20552756","reviewLink":"https://www.imdb.com/review/rw2236356","warningSpoilers":false,"date":"15 April 2010","rate":"10","helpful":"27 out of 29 found this helpful.","title":"So good in so many ways","content":"I love Back to the Future. While having a typical 80s feel to it, which I like, I love how fun, irresistible and original the film is. The special effects are dazzling and the comedy is suitably sly and sophisticated. Helping along the way is a script that is pretty ingenious, the sort of script that has quotable lines and also pokes fun at 1950s icons and lifestyles during the frequent bouts of time travelling. The score by Alan Silvestri elevates the sense of fun to a greater level, the main theme is one of the most memorable themes ever in the history of film, or so I think anyway. Robert Zemekis's direction is very good, and the cinematography, scenery and costumes are also excellent. And I have to mention the acting, Michael J Fox is really appealing in the role of Marty McFly, the role that propelled him to stardom, and Christopher Lloyd is brilliant in one of his most memorable roles(and yes this includes Judge Doom from Who Framed Roger Rabbit? and Professor Plum from Clue). Lea Thompson and Crispin Glover are also great. Overall, brilliant film that is good in so many ways. 10/10 Bethany Cox"},{"username":"Leofwine_draca","userUrl":"https://www.imdb.com/user/ur0482513","reviewLink":"https://www.imdb.com/review/rw3466041","warningSpoilers":false,"date":"9 May 2016","rate":"10","helpful":"12 out of 13 found this helpful.","title":"An '80s classic that never disappoints","content":"I admit to having grown up on 1980s films and thus having a special admiration for them. Whichever way you look at it, BACK TO THE FUTURE is one of the most intelligent of the Hollywood blockbusters from that era, a film which perfectly merges crowd-pleasing entertainment with a complex and well-written storyline that gets to grips with the thorny subject of time travel.The underrated Michael J. Fox stars in the role of his life as Marty McFly, a guy who unwisely gets involved in time travel thanks to the machinations of his kooky inventor buddy, Doc Brown. Christopher Lloyd essays this subsidiary character and, again, it's the role of his life; he's over the top in it but nonetheless his character is thoroughly endearing and never less than hilarious.The time travel aspects of the storyline are carefully worked out and hold together very well even today, some 30 years after release. What I particularly liked about this film is the calibre of the writing: there's no slow spots or simplicity here, just one suspenseful sub-plot after another. There are small moments, big set-pieces, cutting edge special effects, action, chase scenes, romance, and of course plenty of humour, and a quirky supporting cast who make the most of their roles. BACK TO THE FUTURE is a classic - and for good reason."},{"username":"SnoopyStyle","userUrl":"https://www.imdb.com/user/ur2898520","reviewLink":"https://www.imdb.com/review/rw2886775","warningSpoilers":false,"date":"14 October 2013","rate":"9","helpful":"2 out of 2 found this helpful.","title":"Wonderful story Wonderful Michael J Fox","content":"Marty McFly (Michael J. Fox) is an average teen from a lower middle class family. His friend Dr. Emmett Brown (Christopher Lloyd) has invented a time traveling DeLorean. Dr Brown is about to travel back in time when the Libyans attack. Marty only escapes by using the DeLorean to go back to 1955. He changes history and must change it back before he disappears all together.Robert Zemeckis has woven together a wonderful charming story. It's perfectly constructed time loop. It certainly is one of the best feel good movie. Michael J Fox is the perfect guy to play the boy next door character. His interaction with his mother Lea Thompson in the past is wonderfully hilarious and Christopher Lloyd is perfect as the oddball scientist."},{"username":"Hitchcoc","userUrl":"https://www.imdb.com/user/ur0278527","reviewLink":"https://www.imdb.com/review/rw3050733","warningSpoilers":false,"date":"15 July 2014","rate":"9","helpful":"4 out of 5 found this helpful.","title":"So Much Fun","content":"Lots of tongue in cheek. Some great characterization. A chance at redemption. These movies showed Michael J. Fox to be a wonderful comedic presence. It is sad what happened to him, but can there be a more impressive example of a person who has overcome the tribulations that life has given him. Whenever I see him in \"The Good Wife\" as the slimy, underhanded character lawyer he plays, I love that I can \"not like\" a man who is dealing with devastating Parkinson's. As the principle character in this movie, Marty is shoved from one situation to another in a time he only can guess at. He has to face the youth of his father, a febrile wimp who gets pushed around. Then, of course, there is the wonderful Christopher Lloyd as the professor. While one could never accuse this film of being true science fiction with all the implications of time travel, there is a kind of suspense that works very well. It's pure fun and is the best of the three films in my opinion."},{"username":"Kirpianuscus","userUrl":"https://www.imdb.com/user/ur61197531","reviewLink":"https://www.imdb.com/review/rw3534249","warningSpoilers":false,"date":"29 August 2016","rate":"","helpful":"4 out of 4 found this helpful.","title":"adorable","content":"all seems great. the idea, the script, the acting, the details who define each period. and the flavor of \"50's in the most realistic manner to define it. sure, it is the result of a happy meeting between a courageous and real great director and the best actors for its project around a dream who is preserved by the imagination of each from us. but not the idea is the most important thing. the mixture of humor, tension, cultural references, the chemistry - yes, the word sounds strange but in this case is the best - between Christopher Lloyd and Michael Fox , the wise use of clichés about teenagers and family, the ignored guy who becomes hero, all make the story to roll in amazing manner. so, a sort of masterpiece. and one of the most adorable meet with a film. off course, a legendary one."},{"username":"bob the moo","userUrl":"https://www.imdb.com/user/ur1002035","reviewLink":"https://www.imdb.com/review/rw1438997","warningSpoilers":false,"date":"4 August 2006","rate":"","helpful":"7 out of 12 found this helpful.","title":"Very entertaining film \u0096 as slick as it is fun as it is engaging","content":"In 1985 teenager Marty McFly is a bit of an outcast and spends his evenings hanging out with eccentric professor Doc Brown and his various crazy and failed inventions. However when Doc asks Marty to meet him late one night in a mall parking lot, he learns that Doc has invented a working time travel system and inserted it into a DeLorean. Much to Doc's joy and Marty's surprise the machine works on its test run and Doc is all set to be the first man to travel in time when he is killed by the terrorist group who stole plutonium for him with the impression he was making them a bomb. Marty flees in the DeLorean but accidentally winds up back in 1955. Back there he convinces Doc to help him out and come up with a way of getting him back to the future. However the problem of no plutonium appears small when Marty changes the past and stops his parents meeting and falling in love.In its own way this is a classic film that delivers the goods in the same way as Frank Capra's films does although I can understand why for some it doesn't hold quite the same appeal. The plot seems complex as it involves time travel and such but it is deceptively simple and is a clever mix of sci-fi and romantic comedy that is as light and enjoyable as you could hope for. It never makes fun of itself but it never takes itself too seriously and by doing this it pitches it just perfectly. The narrative may be light but it is consistently engaging whether it is the time travel aspect or the relationships. It isn't perfect and it isn't the deepest of films but it is effortlessly a lot of fun and there is absolutely nothing wrong with that.The cast are roundly great and are a big part of the film being as light and fun as it is. For my money this is Fox's best all-round performance and he plays the clean-cut American teenager really well bringing energy to the character. Of course Lloyd's performance dominates the film by its sheer colour and energy, making him the most memorable character of the piece. Thompson and Glover (two people who still look young twenty years later damn them) are both good in their roles and work well together and individually to make their part of the narrative match up to the (superficially) more appealing sci-fi stuff. Zemeckis directs with an eye for a memorable shot and visually his film matches the style and vitality of the narrative.Overall a very good film that is every bit as pleasing as the Frank Capra feel-good films that are held up as classics. Whether this film is a classic is as much up for debate as those films' classic status but it isn't really a debate that means a lot to me. What matters is that the film is engaging and entertaining, which it consistently is. It glides through a slick plot and I always enjoy it when I revisit it. Well worth taking a look if you are after a great piece of family fun."},{"username":"kosmasp","userUrl":"https://www.imdb.com/user/ur5876717","reviewLink":"https://www.imdb.com/review/rw5763609","warningSpoilers":false,"date":"23 May 2020","rate":"9","helpful":"0 out of 0 found this helpful.","title":"Marty got Back","content":"Doc Brown and Marty McFly ... character names that are very well known in the Science Fiction movie pantheon I'd say. Any self respecting movie fan should know the names, the actors and the movies that made them famous. Which in case of McFly and the series in general ... could have gone in a completely different direction - literally.Eric Stoltz got cast because the filmmaker could not get Michael J. Fox - had other contractual obligations. This is very well known. That his movie girlfriend was recast too, because the original one wasn't available at first - that I did not know. But it's all there and so much more in the Special features on the discs. Just the beginning of the movie is quite interesting and intriguing, because especially back then, no one knew what this was about. Well apart from the title of course.Very funny movie that sets off something in the careers of everyone involved. Yes the time travel aspect has flaws if you try to apply logic and consequences of certain actions and how they will spin out and what they will do - a ripple effect that is not entirely seen .. which would have been too complicated anyway.So sit back, relax and enjoy a very entertaining and funny movie"},{"username":"classicsoncall","userUrl":"https://www.imdb.com/user/ur2707735","reviewLink":"https://www.imdb.com/review/rw2750392","warningSpoilers":true,"date":"8 February 2013","rate":"8","helpful":"3 out of 3 found this helpful.","title":"\"Yeah well, history is gonna change.\"","content":"Here's a movie that was entertaining when it came out in the mid-Eighties and once again when I watched it today. The issue I have is with the IMDb ratings system that ranks this picture in the number #48 spot as I write this, with \"Citizen Kane\" at #45 and \"Vertigo\" at #51. For me, this doesn't compute. No one can justify to me how this comedy, sci-fi flick gets honored as one of the Top Fifty movies of all time.Well hopefully, my minor little rant doesn't spoil things for you. I do like the film for it's players and the clever way Marty McFly (Michael J. Fox) manages to navigate his way through the Fifties. I became a Christopher Lloyd fan right from the get-go when he made his debut in \"One Flew Over the Cuckoo's Nest\", and his Reverend Jim character in the 'Taxi' TV series was one of the most original ever. He's got the perfect look and attitude for a crazed scientist and it would have been cool to see him work with classic icons of the horror genre like Karloff, Lugosi and Chaney. That would have been something.The thing that bugs me about the characters a bit are the way George McFly (Crispin Glover) and Biff Tannen (Thomas F. Wilson) are portrayed. They're really more like caricatures, though Biff as the town bully had a certain amount of credibility even if he was annoying. I had forgotten how attractive Lea Thompson was as Lorraine Baines, Marty's future Mom but sporting a major crush on him that conjured up all kinds of potential icky situations, but they were handled tastefully for the most part. The biggest kick for me was when Marvin Berry (Harry Waters Jr.) called his cousin Chuck to check out the new music sensation.So yeah, this is a fun movie and a generally family friendly one that would have been better served if some of the language had been toned down a bit. Some of the time travel stuff goes over the top, like the scene where Marty returns from 1955 and sees himself in the present about to do the time jump. Stuff like that just makes me think about the concept too much. As for the very ending scene, that has got to be about the most blatant set up to scream 'sequel' that I've ever seen."},{"username":"lee_eisenberg","userUrl":"https://www.imdb.com/user/ur4888011","reviewLink":"https://www.imdb.com/review/rw1178492","warningSpoilers":false,"date":"23 September 2005","rate":"7","helpful":"5 out of 9 found this helpful.","title":"Many people may remember Michael J. Fox as Alex Keaton, but I'll always remember him as Marty McFly","content":"Okay, so maybe \"Back to the Future\" seems a little hokey, but it's so cool! You probably know the story: typical '80s teenager Marty McFly (Michael J. Fox) accidentally goes back to 1955. His existence is threatened when his mother Lorraine (Lea Thompson) falls for him instead of his father George (Crispin Glover). Only the zany Dr. Emmett Brown (Christopher Lloyd) can help him. Along the way he has to cope with local bully Biff Tannen.If the movie is excessively nostalgic, then they play it to good effect. I sometimes have to wonder what would happen if I accidentally went back in time and met my parents. Given what happens in this movie, it's probably best that I stay in my own time.Anyway, it's an interesting contrast/comparison between the '50s and '80s. After all, who in the '50s would have imagined Reagan becoming president, or any town having an African-American mayor? So check this movie out; it won't disappoint you."},{"username":"gavin6942","userUrl":"https://www.imdb.com/user/ur1234929","reviewLink":"https://www.imdb.com/review/rw3127091","warningSpoilers":false,"date":"19 November 2014","rate":"9","helpful":"30 out of 35 found this helpful.","title":"Gets Better With Age","content":"A young man (Michael J. Fox) is accidentally sent thirty years into the past in a time-traveling DeLorean invented by his friend, Dr. Emmett Brown (Christopher Lloyd), and must make sure his high-school-age parents unite in order to save his own existence.After almost thirty years (2014), this film loses none of its charm, and actually gains respect. The movie has had such a strong impression on everyone, whether they have seen it or not, as it completely permeated pop culture.The script is genius, not only how it parallels 1955 and 1985 (some of the references are dynamite), but how it set the scene for the sequels (despite allegedly not intending to have any). This is just one clever gag after another, and may require repeated viewings to catch them all."},{"username":"jboothmillard","userUrl":"https://www.imdb.com/user/ur4248714","reviewLink":"https://www.imdb.com/review/rw1104447","warningSpoilers":true,"date":"16 June 2005","rate":"10","helpful":"4 out of 6 found this helpful.","title":"Back to the Future","content":"If you like science-fiction films, then you'll love this from director Robert Zemeckis (Forrest Gump) and executive producer Steven Spielberg. Basically Marty McFly (Golden Globe nominated Michael J. Fox) is the young aspiring teenage musician and friend of Dr. 'Doc' Emmet Brown (a fantastic Christopher Lloyd), and finds out that Doc has invented a time machine with a DeLorean car. It is run by tremendous power from plutonium, which he took from the Libyans, who find him and shoot him. When Marty escapes from them in the car and excels to 88mph (the speed needed to time travel) he is transported unintentionally to 1955 (which Doc set). Unfortunately, while looking for Doc to help him get home, he interferes with the history of his parents in this past, where they meet and fall in love, making his mother love him! Marty now not only has to get his parents, George (Crispin Glover, who did not return for the sequels) and Lorraine (Les Thompson) to fall in love again to restore history/the future, before he and his brother and sister are erased from existence, but the only power available instead of plutonium to get him back to the future (1985) is a bolt of lighting that will hit the clock tower (they know this from a paper he brought from 1985). A fantastic look at how time is so precious, and what can change from the tiniest history interference, aka time paradox. By the way, the plutonium was changed to trash in the end to help explain the sequels. Also starring Thomas F. Wilson as Biff Tannen, Claudia Wells as Jennifer Parker (who was changed in the sequels to Elisabeth Shue) and Titanic's Billy Zane as Match. The story is original and though provoking, the characters are lovable, and the special effects are great, just a great film. It won the Oscar for Best Sound Effects Editing, and it was nominated for Best Song for \"The Power of Love\", Best Sound and Best Writing, Screenplay Written Directly for the Screen, it was nominated the BAFTAs for Best Editing, Best Production Design, Best Screenplay, Best Special Visual Effects and Best Film, and it was nominated the Golden Globes for Best Motion Picture - Comedy/Musical, Best Original Song and Best Screenplay. It was number 7 on The 100 Greatest Family Films. Outstanding!"},{"username":"rmax304823","userUrl":"https://www.imdb.com/user/ur0819382","reviewLink":"https://www.imdb.com/review/rw1877060","warningSpoilers":true,"date":"20 May 2008","rate":"6","helpful":"9 out of 29 found this helpful.","title":"Amusing and commercial success.","content":"Good-natured and enjoyable fantasy about Michael J. Fox (as Marty McFly) who travels 30 years into the past with the help of Dr. Brown (Christopher Lloyd) and his magic, plutonium-powered DeLorean.The present -- that is, 1985 -- is a bit of a mess in Fox's small town. What's left of the downtown area is surrounded by strip malls. The two movie theaters are defunct. One has been converted into an evangelical church and the other shows X-rated movies. Homeless bums sleep on the benches of the town square. Fox's mother (Lea Thompson) is an overweight, hopeless alcoholic; his father is a witless nobody constantly abused by a burly friend who exploits him and then insults him for his imperfect efforts.Lloyd is a maniacal scientist who steals plutonium from Lebanese terrorists to fuel his traveling time machine. He's shot by them as Fox barely escapes, zooming into the past.It's 1955 now and we note that the state of the town is rather better in most respects. No garbage on the streets. No suburbs, but farmland \"as far as the eye can see.\" A couple of good gags follow, right out of \"The Twilight Zone.\" Pull into a gas station and half a dozen employees rush out to service your car. A cup of coffee is five cents. When Fox orders a Tab in the diner, the counter man doesn't know what he's talking about. A \"Pepsi free\" doesn't help.But there are of course the kind of complications that usually follow from time travel. Fox meets his own mother and father, as well as Dr. Brown. The problem is that Fox's mother gets the hots for him and Fox must arrange for his own father to take his place in her affection. In brief, he does so, successfully travels back to 1985, and finds Dr. Brown has paid attention to a warning and worn a bullet-proof vest so he survives the terrorist shooting.I enjoy seeing it once in a while and I gather it was immensely popular. There's just enough profanity to pep things up and keep this from being a movie for children. The plot itself isn't challenging in any way, though some of the gags require a certain maturity to be understood. Someone asks who is president in 1985. \"Ronald Regan? The actor? Who's vice president -- Jerry Lewis?\" Fox is a convincing high-schooler and easy to identify with. Christopher Lloyd is overly manic and with his bulging eyes resembles a creature out of the very depths of the ocean. Lea Thompson doesn't add much, but Chrispin Glover as Fox's father seems all flapping arms and legs.I think it might have been more enjoyable if the anachronisms had been spread throughout the movie instead of being all crowded into the first ten minutes or so of the 1955 period. Some of the comedy was thrown away in the interests of special-effects and pseudo-drama. (Think of \"Groundhog Day,\" in which all the elements are seamlessly blended.) And it also appears that McFly adapts too readily to 1955. After the first few minutes, nothing surprises him. He takes this extraordinary experience for granted and simply goes about the business of bringing his parents together and figuring out a way to get back to his real \"present\" before his picture disappears from the snapshot he's brought along with him. (?) I'd have been taking notes every minute. A few liberties are also taken with the norms of 1955. Good girls, like Lea Thompson, didn't reach under the table to squeeze a stranger's thigh. At least none of them did that with me. And if theywouldn't have done it with me, they obviously wouldn't have done it to anyone. Except -- and this is probably the answer -- Lea Thompson was a slut to begin with. Yes, that must be it. How disgusting.Anyway, you'll have fun watching the film. The kids will too. It generated three sequels, none of which I've watched."},{"username":"ccthemovieman-1","userUrl":"https://www.imdb.com/user/ur4445210","reviewLink":"https://www.imdb.com/review/rw1821645","warningSpoilers":false,"date":"17 February 2008","rate":"7","helpful":"11 out of 29 found this helpful.","title":"Mixed Emotions Looking Back On This Film Today","content":"When this came out over 20 years ago, I thought It was solid entertainment with a clever story. It was a big hit, and spawned two sequels. I saw it at the theater and several times on VHS. Then, after an absence of time, I saw it again in the late '90s and was shocked to hear 11 blasphemes - a ridiculous amount for a comedy (and \"PG-rated,\" to boot).Also, the character \"Biff\" (Thomas Wilson) was so irritating to me (he must have done a good job acting) it also fun out of viewing. I could say the same about \"Marty's\" father (Crispin Glover), who was a disgusting wuss. I did enjoy seeing Lea Thompson in her prime: a very pretty woman, and there were still a lot of laughs in here. She and Christopher Lloyd's \"Emmet Brown\" are definitely fun to watch. Michael J. Fox became an even-bigger star, thanks to this movie.The mixture of humor, action, drama, special-effects, science-fiction, etc., all made this a film a lot of people enjoyed. Why they had to include all that \"language\" is a mystery to me, except that it's the twisted world of Hollywood."},{"username":"Tweekums","userUrl":"https://www.imdb.com/user/ur13977076","reviewLink":"https://www.imdb.com/review/rw2094073","warningSpoilers":true,"date":"11 July 2009","rate":"9","helpful":"3 out of 3 found this helpful.","title":"Great sci-fi adventure for all the family","content":"One would have thought that a film made almost twenty five years ago about somebody travelling back in time thirty years would have dated terribly but it seems just as fresh now as when I first saw in on betamax all those years ago. I'm sure people will be enjoying it for decades to come.Michael J. Fox will almost certainly be best remembered for his role as Marty McFly, the eighties teenager who accidentally travels back to 1955 in a converted DeLorean. While much of the humour is derived from the differences between the two eras that isn't over done and it doesn't get in the way of the main plot. Not only must Marty enlist the help of his friend Dr. Brown to get him back to 1985 he must get his parents to fall in love all over again because he accidentally stopped their first meeting. This problem seems to be greater than time travel as his father is the school wimp who is constantly being harassed by the school bully Biff Tannen and his mother has fallen for him.The supporting cast do a great job too, especially Christopher Lloyd is the archetypal mad scientist Dr Brown and Lea Thompson as Marty's mother who is rather prudish in the eighties but clearly knew how to have a good time when she was a teenager.. much to Marty's surprise. In a time before everything was done with CGI the effects are great and not overused. I'd recommend this film, along with its two sequels to anybody with a sense of humour."},{"username":"paul_haakonsen","userUrl":"https://www.imdb.com/user/ur22654354","reviewLink":"https://www.imdb.com/review/rw4746833","warningSpoilers":false,"date":"27 March 2019","rate":"10","helpful":"2 out of 2 found this helpful.","title":"Great Scott! Strap in for some entertaining time travel...","content":"The 1985 movie \"Back to the Future\" is definitely a timeless - pardon the pun - classic. It truly is a movie that has withstood with the trials of time and proves to be a movie that you can watch again and again and it actually never loses its appeal or charm.Writers Robert Zemeckis and Bob Gale managed to put together a very original story here, one that captivates the audience from the very beginning and keeps a grip on the audience until the very end. The story told in \"Back to the Future\" is a story that has so many aspects and so many topics that there definitely is something that appeal to everyone in the audience; ranging from romance, action to science fiction.There is a great pacing to the movie, and director Robert Zemeckis ensured that the movie never left momentum or dropped down in its pacing. This definitely made the movie all the more enjoyable and certainly ensured that the movie can be watched again and again.The movie is packed with great actors and actresses. Of course the movie is so phenomenally well carried by Michael J. Fox in the lead role as Marty McFly, and he definitely made that character lovable and memorable. But right up alongside Fox was Christopher Lloyd in the memorable role as the eccentric Dr. Emmett Brown. Who can't claim to be familiar with the expression \"Great Scott!\"? Furthermore, the movie also brought along Lea Thompson, Crispin Glover and Thomas F. Wilson, whom individually also brought a lot of contents to the movie with their appearances and performances.I can't count the number of times that I have watched this movie, nor the other two in the franchise for that matter. But the original 1985 \"Back to the Future\" is a classic in every meaning of the word.While the movie is from 1985, then the special effects still holds solid even in 2019. Sure they wear symptoms of aging, certainly, but still the special effects are quite good. And back in 1985, they were off the charts.If you, for some unknown reason, never have gotten acquainted with \"Back to the Future\", then shame on you. This is a movie that you HAVE to watch. \"Back to the Future\" is one of those movies that you need to watch regardless of your age, creed and standing."},{"username":"BA_Harrison","userUrl":"https://www.imdb.com/user/ur0945066","reviewLink":"https://www.imdb.com/review/rw2341476","warningSpoilers":false,"date":"20 November 2010","rate":"10","helpful":"3 out of 3 found this helpful.","title":"A film you can watch time and time again.","content":"My DVD of Back To The Future is like my own personal time machine: I hit play on the remote and I'm instantly whisked back to 1985, when hair was big, fashion was fugly, films were fun and I was a mere 17 years of age with my whole adult life ahead of me.Nostalgia certainly plays a big part in my continued enjoyment of the film, and was clearly at the forefront of the minds of producer Steven Spielberg and director Robert Zemeckis, who delight in recreating the 50s of their youth, but the film is much, much more than a simple trip down memory lane: it's a rollicking adventure, a charming love story, and a brilliant comedy, with a career-defining performance from Michael J. Fox as time-travelling teen Marty McFly, fine support from the lovely Lea Thompson, quirky Crispin Glover and crazy Christopher Lloyd, amazing special effects (for the time) from ILM, and a rocking 80s soundtrack.A wonderful film that is as fresh and entertaining today, despite its inescapable 80s style, I have no doubt that Back To The Future will continue to captivate audiences young and old well after my generation is history: my kids sure loved it, and I hope that when they have kids of their own, theirs will too. And theirs, and theirs, and theirs..."},{"username":"TxMike","userUrl":"https://www.imdb.com/user/ur0438066","reviewLink":"https://www.imdb.com/review/rw0218209","warningSpoilers":false,"date":"9 June 2001","rate":"","helpful":"1 out of 3 found this helpful.","title":"Back To The Future, great start to the trilogy, movies in 1985, 1989, and 1990.","content":"As of this date, the 3 \"Back to the Future\" films have these IMDb ratings -- #1 (1985) 7.8 of 26,091 votes. #2 (1989) 6.6 of 9492 votes. #3 (1990) 6.4 of 8230 votes. So, it is clear that the first episode is the most popular, no contest, in both rating and number of votes.I, too, think #1 is the best. In fact, I think it should stand among the best films of all time. Not for any one facet, but for the total entertainment that it provides. Almost all of us dream of \"time travel.\" BTTF certainly is not the first to explore time travel, but the way it does it is unique. Plus the fact that this is clearly a comedy, but one that is so well conceived and written that I never find myself think of it as a comedy. I've been a long time fan of Chris Lloyd's, since his days as Jim Ignatowski (\"flower child\" spelled backward), and he is so perfect as Doc Brown. And, of course, Michael J. Fox as Marty McFly \"defines\" a role as few have been defined in films.The script is uniformly superb in all 3 versions, and to me that is what really makes them \"believable\" within the context of a pure fantasy. Plus, although all the \"science\" in the 3 films is \"bad science\", which for a scientist makes it even funnier, they don't overlook any details. They always offer a \"science\" explanation for what Doc is about to do, even though it is completely nonsense.Tonight, at the end of #3, I first realized one of the reasons I like the BTTF films so much. Ever take a vacation to a totally different part of your country or world? And when you get back home after a few weeks, to the familiar, you sorta mentally pinch yourself and think, \"Just two days ago I was riding a train through southern France, drinking wine by the river, and sleeping in the 200-yr-old silk factory turned home in the country.\" And you look around, you're back home to a totally different world.That's what I believe Marty McFly felt when he arrived home, saw Jennifer asleep on the swing. He had just spent a week during 1885, evading a band of Indians, seeing his original ancestors from Scotland, fighting an infamous gunfighter, and making a harrowing escape from the past by being pushed to 88 mph by a train that blows up, and now he is back home to the familiar. We can all identify with that, and the end of each of the 3 BTTF films gives us that identification.The original, #1, involved the existing friendship between Marty and Doc Brown. Marty accidentally gets sent back 30 years to 1955, and must enlist a young Doc's help to get home. Meanwhile he inadvertently gets his future mother interested in him, jeopardizing the future relationship of his \"parents.\" The old newspaper accounts of the lightning strike of the clock tower is used as a source of energy to get Marty back home. His fight with Biff in 1955 has altered history and his 1985 family is apparently much better off as a result.#2 hinges on Biff inadvertently getting a copy of an almanac for \"future\" events and he dishonestly uses future sports results to gain fortune and power, and drastically change the future. Marty and Doc have to retrieve the almanac before Biff uses it, to restore history to its proper order. It ends in a way that sets up the #3 sequel.In #3 Marty gets a Western Union letter that Doc Brown had actually written in 1885 and requested delivery at the specific time in the future. Doc has ended up in 1885, is content, and insists that Marty not try to interfere. However, Marty discovers a tombstone and historical account of Doc being shot in the back over an $80 issue. So Marty has to go back and help Doc avoid that fate. To me, the original is definitely the better of the 3. The second and third ones are totally different, and I would rate them about the same. The science is funky, a rigorous analysis can uncover a number of \"discrepancies\", but to me none of that matters. The BTTF films are just great fun, and the good guys always come out on top. And there's nothing wrong with that.2015 UPDATE: I bought the 3-disk BluRay set and they really are an upgrade from the DVDs, better picture and sound."},{"username":"BandSAboutMovies","userUrl":"https://www.imdb.com/user/ur69172350","reviewLink":"https://www.imdb.com/review/rw7003273","warningSpoilers":true,"date":"6 June 2021","rate":"8","helpful":"2 out of 3 found this helpful.","title":"Great!","content":"Bob Gale and Robert Zemeckis came up with Back to the Future five years before it got made, but at that time, it wasn't raunchy enough to get greenlit. After their film Used Cars came out, Gale was looking through his father's high school yearbook. His mother wondered if he would have been friends with his father. Time travel was the only way they'd get the answer.The duo wanted to make a time travel film that showed that the past could change the future. And sure, Professor Brown was once a video pirate and the time machine was going to be powered by Coke, but the main story remained the same as the movie was finally sold.Then the movie went into turnaround and forty different studios turned down the movie. Other time travel films like Time Bandits and The Final Countdown had underpeformed and Disney was put off by the fact that the hero made out with his mom. I mean, well, yeah.Steven Spielberg believed in them and the script. And that ended up being enough.That and the fact that Zemeckis had a success with Romancing the Stone and had the clout to make the movie. And a grudge against the studios who turned him down, so he sold the movie to Spielberg's Amblin, who set the project up at Universal Studios. However, that's also where Frank Price, the first person to say no, worked. Spielberg didn't like Price either - he'd passed on E. T. - so Sidney Sheinberg became the chief executive to oversee the studio's investment.For his part, Sheinberg wanted to rename the movie Space Man from Pluto because he believed Back to the Future wouldn't sell. Everyone worried how to deal with the venerable elder man until Spielberg diffused the situation by sending a funny memo that said, \"Hi Sid, thanks for your most humorous memo, we all got a big laugh out of it, keep 'em coming.\"Michael J. Fox was the first choice to play Marty McFly, but the producers of his hit show Family Ties didn't even let him see the script. Eric Stoltz ended up with the role, but he was too intense. The filmmakers realized they hired a great actor for the wrong role. Stoltz also was a method actor and stayed in character the entire time, refusing to answer to any name but Marty, which led to the crew hating him. 34 days of shooting were lost - they kept shooting with the actor despite Fox being hired - and Stoltz was paid his entire salary.Another perhaps exaggerated story is that Thomas F. Wilson, who played Biff, almost had his collarbone broken in the scene where he fights Marty in the cafeteria. Take after take, despite Wilson asking Stoltz to calm down, the actor kept roughing him up. Wilson planned to get a reciept in the car parking scene outside the dance, but Stoltz was gone before that happened.Despite the issues behind the movie, audiences loved the story of Marty McFly going back in time thanks to Doc Brown (Christopher Lloyd) and having to put back together the events that introduced his parents (Lea Thompson and Crispin Glover). What audieces really liked was the DeLorean, a car that was unlike any time machine they'd ever seen in a movie before.The one thing I never liked about this movie is that it posits that a white man now creates rock and roll. I know it's a minor part, but even as a kid, it upset me.Speaking of music, when Marty pretends to be Darth Vader from the planet Vulcan, he plays a tape labelled \"Edward Van Halen.\" It's not any existing Van Halen song, but an untitled song that was written for The Wild Life, which also starred Eric Stoltz (and where producers discovered Lea Thompson as they studied Stoltz's work)."},{"username":"Quinoa1984","userUrl":"https://www.imdb.com/user/ur0453068","reviewLink":"https://www.imdb.com/review/rw0218360","warningSpoilers":false,"date":"8 July 2000","rate":"10","helpful":"19 out of 32 found this helpful.","title":"Old Man Peabody owned all of this!","content":"This is a memorable sci-fi comedy that will always be remembered for it's amazing visual effects and dolorian time machine. Plot (if actually memorable) is about a regular teen (Michael J. Fox in one of his best performances) who is friends with a brilliant yet crazed doc (Christopher Lloyd is terrific as this Doc) who creates a time machine using a flux capasitor and 1.21 gigawots (what the hell is a giawot!). But suddenly, McFly finds himself in 1955, 30 years earlier to his present date. And not only does he have to get back to the future, he also has to reunite his parents after a incident. Great fun with this cast and tale, with some great direction by Robert Zemeckis and from Steven Spielberg's Amblin entertainment. The best one of the trilogy (though the other 2 are questionable). A+"},{"username":"tavm","userUrl":"https://www.imdb.com/user/ur11228318","reviewLink":"https://www.imdb.com/review/rw3339913","warningSpoilers":false,"date":"21 October 2015","rate":"10","helpful":"3 out of 3 found this helpful.","title":"After 30 years, the original Back to the Future is still the best of the series!","content":"Today was the day me and my best friend from high school-who now works at the movie theatre that is showing these Back to the Future trilogies-saw these again, a little more than 30 years after this first one initially came out. Because the second one took place partially on October 21, 2015 was the reason for this series playing for that one day. Anyway, this first one was the best of them mainly because of the contrast between teen Marty McFly's '80s lifestyle and that of his parents' when they were teens in the '50s. Also, his relationship with Doc Brown was also a big part of the movie's phenomenal success. That and plenty of jokes about culture shock and great chase scenes. My favorite scene involved Marty playing heavy metal licks at the '50s dance sequence. And what great players like Michael J. Fox and Christopher Lloyd handling their roles the way they do! And, yes, Lea Thompson, Crispin Glover, and Thomas F. Wilson are also fine as Marty's parents and his father's bully, respectively. Robert Zemeckis and Bob Gale fashioned a fine screenplay with excellent direction from Zemeckis. This is still my favorite '80s movie, bar none! So on that note, I definitely highly recommend Back to the Future. P.S. One of the most interesting things I now know about this movie is that the younger brother of Lorraine in the '50s sequence was played by Jason Hervey who was also in the other summer blockbuster of the summer of '85-Pee Wee's Big Adventure-and would later play Kevin Arnold's older brother, Wayne, on \"The Wonder Years\"."},{"username":"ComedyFan2010","userUrl":"https://www.imdb.com/user/ur23138767","reviewLink":"https://www.imdb.com/review/rw2985955","warningSpoilers":false,"date":"25 March 2014","rate":"10","helpful":"5 out of 6 found this helpful.","title":"A time travel movie that never gets old.","content":"The movie takes us on a great time travel where a teenager McFly meets his parents when they were teenagers. He both needs to get back to 1985 but before that to get his parents to fall in love with each other so he doesn't get erased from the existence.The movie is absolutely great. It has so much energy and there is always something happening. It is also great to look into the past. Nowadays 1985 is old times as well so the movie has twice the charm when we get to see both the 80's and the 50's. And the writers did a great job to make jokes to show us the differences between those times. Even as somebody who hasn't lived in the 50's I could get them, and the jokes about let's say Marty's 80's vest are even more hilarious to us now. So the movie aged very well, if it didn't even get better.The casting is also perfect. Michael J. Fox is the right actor for Marty. He was not the one cast at first but I am so glad they got him. Even though Eric Stoltz is a great actor, but the footage with him from Back to the Future had a more serious feeling to it, it kind of was losing the charm I love so much. Maybe then there would be no other sequels.Christopher Lloyd created a great persona as Doc. If I see a picture of him I would always recognize him. He always has this great crazy scientist in him. Lea Thompson and Crispin Glover who played Marty's parents made a wonderful performance by being them at different ages. The make up artists also contributed to the success of it.I loved this movie as a kid, I love it now. It has everything that I like for such a genre: great cast, a fun story, great lines, well connected plot and perfect time setting. One of the movies I can watch again and again."},{"username":"Coventry","userUrl":"https://www.imdb.com/user/ur2020269","reviewLink":"https://www.imdb.com/review/rw1901585","warningSpoilers":false,"date":"29 June 2008","rate":"10","helpful":"4 out of 6 found this helpful.","title":"Brilliant Scenario!","content":"Few things are as difficult to accomplish as a movie dealing with time-traveling. To take on themes as risky as paradoxes and time loops you primarily need a healthy dose of courage and ambition, but most importantly loads of writing talent and cinematic vision. The scenario of \"Back to the Future\", courtesy of director Robert Zemeckis and co-producer Bob Gale, is honestly one of the most brilliant ones ever penned down and, thanks to the financial support of several acclaimed producers (including Steven Spielberg and Frank Marshall), it also became one of the most massively entertaining films of all time, with sublime special & sound effects, diversity of genres and some of the greatest casting choices and acting performances ever. \"Back to the Future\" is quintessentially speaking a Sci-Fi comedy, but Robert Zemeckis admirably also hints at the more emotional and melodramatic aspects regarding time traveling. Also, even though the film boosts some of the greatest effects ever, their use merely remains functional and occasionally, so that the emphasis continuously lies on the story and the development of the characters instead of on flamboyant machinery and overlong speeches about scientific theories. The DeLorean is a stylish and original piece of scenery, but other than the fantastic and already legendary vehicle there are no giant laboratories with thousands of flickering lights. Marty McFly is a typical mid-80's teenager with a skateboard he knows how to use and a delightful high school sweetheart that loves him very much. His parents George and Lorraine, however, are a pitiable and hopelessly old-fashioned couple and thus he spends most of his free time with his genius but slightly eccentric friend Doc Brown. The latter invented a time-traveling device and, following a series of bizarre events, Marty accidentally travels back to 1955; the year his parents met and fell in love during the school prom. Marty has only one chance to return to the future, but in the meantime he has to correct the events he tampered with in order to save the future and even assure his own birth. The script is very well constructed and literally stuffed with witty little details that refer to earlier events and/or events that have yet to appear, either later in the film or even in one of the sequels. The humor works, the light-headed tone and atmosphere puts a big smile on your face, you come to care for the characters and the awesome soundtrack even makes it difficult to remain in your seat. Michael J. Fox, Lea Thompson and Thomas F. Wilson all give away excellent performances, but my two preferred roles are for Christopher Lloyd (with his confused looks and bizarre facial expressions, he makes a superb mad scientist) and Crispin Glover. The latter appears to be born to depict weirdos and uncanny freaks, so the role of introvert and mysterious George McFly fits him perfectly."},{"username":"studioAT","userUrl":"https://www.imdb.com/user/ur23359813","reviewLink":"https://www.imdb.com/review/rw3680259","warningSpoilers":false,"date":"8 April 2017","rate":"4","helpful":"5 out of 22 found this helpful.","title":"Good fun","content":"This is one of those legendary films that for some reason I just hadn't seen. I have now! I don't think it could ever meet the hype that people put on it, but i can't deny that it is a good film, and certainly one of the iconic ones of the 80's.It's a bit overly long though, and I think it could have been in need of tighter editing, but you can't argue with the quality and performances given by the cast.I enjoyed this film, I thought it was clever, but I can't say it'll be a film I return to regularly."},{"username":"tedg","userUrl":"https://www.imdb.com/user/ur0643062","reviewLink":"https://www.imdb.com/review/rw2226283","warningSpoilers":false,"date":"25 March 2010","rate":"","helpful":"6 out of 10 found this helpful.","title":"Zemeckis Flies","content":"This year, John Hughes died, and we were reminded of the depth of his insight into subadult suspension. Being reminded of his work impressed me. What will we think when Zemeckis dies?Certainly we will be reminded of how he balanced fantasy and reality in all of his projects. Possibly it will be noted that he softened the Spielberg approach by unintuitively adding incoherence.I think I will remember two films: this one and \"Roger Rabbit.\" These both are deceptively trivial. Was this the first mainstream movie that played as cleverly with time travel conundrums? It was not intended to spawn a sequel, and you can see that certain conventions were established that hurt the successors. But seen by itself, the idea of superimposing actors, characters and times in the same package works well. Makes this a gem.Notable is once again the scientist. You have only two types: pipe smoking, chin stroking blackboard thinker who explains, or what we have here. Lloyd is wildhaired, wild-eyed. A hardware guy, not an idea guy. An active risktaker, frantic in demeanor, but with apparently no sense of scope. For instance, he spends more time on a model of how to explain catching lightning than on the apparatus itself.The film revolves around his instabilities and mirrors those as instabilities in the world. It all starts when he bumps his head getting off the toilet, folded into his minute of death from jilted terrorists. Everything that follows is his wacky vision, joined by Marty when knocked out by the nuclear guitar amp.Ted's Evaluation -- 3 of 3: Worth watching."},{"username":"hitchcockthelegend","userUrl":"https://www.imdb.com/user/ur16161013","reviewLink":"https://www.imdb.com/review/rw2157795","warningSpoilers":false,"date":"14 November 2009","rate":"10","helpful":"5 out of 6 found this helpful.","title":"Earth Angel And The Nuclear DeLorean.","content":"It's 1984 and director Robert Zemeckis, fresh from the success of Romancing The Stone, is trying to film Back To the Future - a film about a young teenager called Marty McFly who is accidentally sent back in time to 1955 and inadvertently risks the future of his family. Zemeckis is troubled by his leading man, Eric Stoltz, who just isn't capturing the youthful teenager exuberance that he wants for Marty McFly. Stoltz is jettisoned and in comes Michael J. Fox who was busy wowing audiences in the hugely popular sit-com Family Ties. Fox had been first choice anyway but couldn't get a release slot from shooting with Family Ties. Luckily the wasted time with Stoltz created an opening for Fox to play Marty McFly as well as work on the show - the result of which would turn out to be one of the most beloved fantasy trilogies of the modern era.It's honestly hard to find anyone who seriously doesn't like Back To The Future part one. The second one has its critics, because, lets face it, it's a bridge between two better films, while the third film loses some people because of its Western themed plot (the heathens that they are). Yet really this trilogy opener is as near perfect cinema for all the family as you could wish to view. It's a water tight script from Zemeckis and Bob Gale that not only encompasses witty time travel paradoxes, but also dares to be dramatic into the bargain. The first 15 minutes contains a real shocker that is as cheeky as it bold, something that really gives Marty's 1955 quest a real urgency that the audience can buy into as the comedy relief then comes in spades. The set pieces are first rate - hello skateboard - hello rock \"n\" roll 101, and the makers have fun in winking towards other notable sci-fi pictures along the way. Hell they even manage to deal in an Oedipal strand that is tasteful, handled superbly and garners guffaws aplenty. No mean feat that last one actually. Alan Silvestri provides a whirring & pleasing score and the theme song, The Power Of Love, by Huey Lewis & The News, is infectiously enjoyable. Finally it's the cast that seal the deal for why this is as good as it gets for fantasy escapist cinema. Fox, Christopher Lloyd, Lea Thompson, Thomas F. Wilson & Crispin Glover are the perfect quintet, each feeding off each other and doing justice to the excellently constructed story.Made for $19 million, Back To The Future went on to make a worldwide gross of over $381 million, and those are the kind of figures you really can't argue with. It's snappy, happy and down right funny, so really, if you don't like Back To The Future then seek medical help immediately. 10/10"}],"errorMessage":""}