{"imDbId":"tt0095327","title":"Grave of the Fireflies","fullTitle":"Grave of the Fireflies (1988)","type":"Movie","year":"1988","items":[{"username":"MartinHafer","userUrl":"https://www.imdb.com/user/ur2467618","reviewLink":"https://www.imdb.com/review/rw1519764","warningSpoilers":true,"date":"12 November 2006","rate":"8","helpful":"16 out of 30 found this helpful.","title":"Super-depressing, but an exceptional film","content":"Had I been able to see this film in Japanese subtitles, I might have scored it higher. The version shown on TCM was dubbed and I think the dubbing detracted from the film because the characters didn't seem the least bit Japanese. While this may not matter as much with some full-length Anime movies, this one was based on real people living through the final months of WWII with all its privations on the Japanese people. So, to me, it just didn't seem appropriate having the characters sounding like Americans--this seemed a bit tacky. This is all pretty sad, as the film itself is a marvelous film featuring some of the better animation I have ever seen and exceptional production values.The story is about two siblings whose mother is killed early in the film during a fire bombing. The movie is spent trying to survive on their own and deal with starvation.The film is apparently based on the writer's own experiences and is extremely important for adults and older kids, as it gives a side of war that is seldom mentioned in films. Although it will probably depress your older kids, it would be a good film to watch with them provided you take the time to discuss the film and process what they see as it is a disturbing episode in history.I do NOT recommend this to younger or less mature kids. Oddly, when the film was released, it was combined with MY NEIGHBOR TOTORO as a double-feature!!! This was so wrong--combining a sweet movie targeted for the youngest kids in the audience with this realistic and heart-wrenching film about death and starvation! What were they thinking?! I do recommend you see the film, but if possible, try to find the Japanese language version with subtitles."},{"username":"TheLittleSongbird","userUrl":"https://www.imdb.com/user/ur20552756","reviewLink":"https://www.imdb.com/review/rw2230472","warningSpoilers":false,"date":"3 April 2010","rate":"10","helpful":"38 out of 49 found this helpful.","title":"Beautiful, haunting and emotionally devastating","content":"What an amazing film! Very rarely have I been moved this much by an animated film. Watership Down yes, Bambi yes, Secret of NIMH yes, Beauty and the Beast yes, Land Before Time yes, but Grave of the Fireflies is in a different league. A film that is once seen and never forgotten, a film that is beautiful, haunting and emotionally devastating. It is slow moving perhaps and \"depressing\" but it is very poignant as well. I find it very difficult to fight back tears at the film's end. The animation is amazingly detailed, the backgrounds and characters are drawn with such care and you just marvel at the detail that goes into it. The music is both haunting and melancholic and one of the main reasons why the film is as it is. The story is harrowing, as it details Seita and Setsuko's hopelessness. The characters are easy to relate, Setsuko isn't precocious or obnoxious, instead she is quite cute, and Seita shows real love for his sister as well as being a strong protagonist. There are many memorable sequences, but one that springs to mind is the one with the nocturnal fireflies, which is something of true melancholic beauty. Overall, a masterpiece, pure and simple. 10/10 Bethany Cox"},{"username":"Leofwine_draca","userUrl":"https://www.imdb.com/user/ur0482513","reviewLink":"https://www.imdb.com/review/rw2383315","warningSpoilers":false,"date":"10 February 2011","rate":"10","helpful":"27 out of 30 found this helpful.","title":"Utterly devastating","content":"It's better not to learn too much about this film before watching it, for fear of spoiling it. I'd heard it described as the saddest film of all time, but even that didn't prepare me for what I saw.Speaking from the point of view of somebody who avoids animation as much as possible, I found this to be a piece of exceptional film-making. Use as many superlatives as you like: amazing, engrossing, compelling, outstanding, it all boils down to one important thing - this film tells a story that grips us with its exploration of the human condition. I imagine virtually everybody who watches it will be able to identify with it in some way or other.So forget this one's a cartoon and just go into it expecting a tale packed with emotion and feeling. And if you have to go back and watch the beginning again after you've seen it all the way through, that's fine too."},{"username":"SnoopyStyle","userUrl":"https://www.imdb.com/user/ur2898520","reviewLink":"https://www.imdb.com/review/rw3012888","warningSpoilers":false,"date":"9 May 2014","rate":"8","helpful":"9 out of 9 found this helpful.","title":"Heart breaking animation","content":"This animated movie starts with young boy Seita dying on the floor of a train station after Japan surrenders in WWII. His spirit leads the audience to his story with his little sister Setsuko. During an air raid on their home town, they lose their mother. Their father is away with the Navy. The siblings go to live with their unsympathetic aunt. Seita clash with her, and the siblings go live by themselves in the bomb shelter next to the waters. It doesn't go well as their lives deteriorate to the point where Seita dies alone on the floor.It is the saddest of tragedy. The animation is the perfect foil to the subject matter. The animation style is children's story but the movie is all too realistic. The characters are not cartoons. It is ripped from the pages of history. The children animation style draws the audience in, and it hits the viewer in the heart."},{"username":"Hitchcoc","userUrl":"https://www.imdb.com/user/ur0278527","reviewLink":"https://www.imdb.com/review/rw6580543","warningSpoilers":false,"date":"9 February 2021","rate":"10","helpful":"10 out of 10 found this helpful.","title":"Soul Breaking","content":"This is a film about the sad reality of war. When war is waged, we often think of it as this army against that army. Lost in the mix are the civilians who die horrible deaths--not just from the weapons of war but from disease and starvation. We give great power to the power structure that makes the decision to wage conflict. Often their words sound good and we embrace those words. This film shows what happens to a small, seemingly insignificant pair of children, trying to get a roof over their heads and have a bit to eat. Their mother has been killed in a fire bombing and their father is in the Japanese navy. It shows the efforts to maintain dignity and the cruelty of those who could help but don't. Japan paid a huge price for trying to expand the Empire. The leadership convinced the populace that they were driven by a higher power that wanted them to crush their enemies at whatever cost. But here we see the price. Fire bombings, air raids, and, of course, eventually Hiroshima and Nagasaki. This is the saddest of stories, shown in spotless animation. It is a story of hope and hopelessness. Outstanding."},{"username":"Kirpianuscus","userUrl":"https://www.imdb.com/user/ur61197531","reviewLink":"https://www.imdb.com/review/rw3700272","warningSpoilers":false,"date":"4 May 2017","rate":"","helpful":"1 out of 1 found this helpful.","title":"portrait of life","content":"one of films out of definitions. because it is easy to define it as a film about war, children of brothers love. but each of this therms is too more and too little. it is a portrait of life. precise, subtle, touching, convincing, terrible. in same measure, it is a great example of animation. and an impressive story. it is one of films who could change you. for to understand the real meaning of history and solitude. for the realistic image of society. for to remember the unpredictability of life. so, a different film. beautiful, bitter, delicate, drawing of the experiences of a century."},{"username":"bob the moo","userUrl":"https://www.imdb.com/user/ur1002035","reviewLink":"https://www.imdb.com/review/rw1514667","warningSpoilers":true,"date":"5 November 2006","rate":"","helpful":"5 out of 5 found this helpful.","title":"Beautiful and haunting (suggestive spoilers)","content":"Being the only film from Ghibili film that Disney didn't buy suggested to me that this was either so bad they didn't want it or for some reason something that the makers felt was too special to them to sell off with the rest of the films. (This is not to suggest that the other Ghibili's have been cheapened by Disney because mostly I think they have done a very good job on the majority of them). Knowing the quality of the Ghibili studio, I had good faith that this would be a good film and I was pleased to find myself drawn into a small-scale look at the WW2 as it had its impact on two children living in Japan. Seita finds himself looking after younger sister Setsuko while his father fights and his mother is killed in a bombing raid. The story follows them as they try to survive alone while rationing and bombing limits their access to food.In a way it isn't that general a film about suffering in a war torn country because the story is quite specific but this does not limit its impact or value. The script and the deliver produce strong characters in Seita and Setsuko and they make it easy to get involved with them and care for what happens to them. In this regard it is a tremendously strong film because as it tears the hearts out of our characters it equally rips at the viewer. It is more than the basic \"war is hell\" stuff and I must confess I appreciated just how \"human\" a story it was. Setsuko is the type of wonderful child that I wish more American films could get instead of the precocious brats they mostly cast \u0096 she is beautiful and full of life (thanks in part to the voice work of Shiraishi) and it makes it all the more crushing to see her lose that spark as the film progresses. Seita is as good a character in a different way and he too is well brought out by Tatsumi.The animation is amazing and I did have to keep reminding myself that this was made over 15 years ago because it still looks impressive years later. It captures the heart of the character and has rich backgrounds and detail. It is easy to see why some reviewers have got so worked up over others referring to this as a \"cartoon\"! Overall then this is an engaging and memorable film whose strength comes from many aspects \u0096 animation, characters, heart, all these things gripped me and hurt me. It doesn't make wider points about war and conflict, it simply focuses on the effects it has on these two specific children and it is all the more impacting for it."},{"username":"classicsoncall","userUrl":"https://www.imdb.com/user/ur2707735","reviewLink":"https://www.imdb.com/review/rw2601793","warningSpoilers":true,"date":"24 April 2012","rate":"8","helpful":"7 out of 8 found this helpful.","title":"\"Why do fireflies have to die so soon?\"","content":"The movie took on an added poignancy for me as I kept thinking of my own granddaughter, who's age approaches that of the young Setsuko in the movie. How horrifying a prospect to be left homeless under any conditions, let alone to deal with the death of a mother with no place to turn. The plight of Setsuko and her older brother Seita is dealt perhaps an even more severe blow by the indifference and even hostility of their countrymen and fellow citizens. I was probably more disturbed by the idea that so little compassion was offered to these two troubled wanderers. I rarely watch animated films, and this is actually the very first anime feature I've ever seen, recommended by it's standing in the IMDb top film rankings. The picture is gorgeously rendered, and there's a lyrical quality to the quieter moments when the siblings take comfort in each other's presence against a backdrop of war and devastation. Be prepared for an emotional response to the heartbreak of loss and separation, exemplified by a brother and sister who mean the world to each other."},{"username":"lee_eisenberg","userUrl":"https://www.imdb.com/user/ur4888011","reviewLink":"https://www.imdb.com/review/rw2734784","warningSpoilers":false,"date":"10 January 2013","rate":"10","helpful":"4 out of 4 found this helpful.","title":"once upon a time in Japan","content":"Hiroshima may have been the most famous bombing of Japan, but the air raids were often just as destructive. One such firebombing is the setting of Isao Takahata's \"Hotaru no Haka\" (\"Grave of the Fireflies\" in English). It looks at both the struggle for survival and loss of innocence that accompany war. I've never seen any other anime, but is one movie that should truly be required viewing for everyone. Not only in looking at how the brother and sister try to maintain their hope amid hardship, but two lines in particular stood out. One is where someone mentions that the war is eating up Japan's resources, making it harder and harder to feed the people. Another is when the brother learns that Japan has surrendered. Long taught that the Japanese Empire was invincible, he now has to realize the unpleasant truth. These are important reminders for everyone. The fact remains that the common people will suffer the most in any war, and the movie makes that very clear.Like I said, a movie that everyone should see."},{"username":"gavin6942","userUrl":"https://www.imdb.com/user/ur1234929","reviewLink":"https://www.imdb.com/review/rw3143363","warningSpoilers":false,"date":"17 December 2014","rate":"8","helpful":"10 out of 10 found this helpful.","title":"Greatest War Film?","content":"A tragic film covering a young boy and his little sister's struggle to survive in Japan during World War II.Apparently people, including Roger Ebert, consider this one of the greatest -- or perhaps the greatest -- war film ever made. Now, that is interesting because it is a cartoon. You never expect that, and this might not be something you want to show kids. It is pretty bold, with wounded people, maggots, and anyone can die.Even more interesting is how it takes place from the point of view of a Japanese youth during World War II. He is not nationalistic, he is not anti-American, he is just a kid. And is that not the truth of war? No matter who is right or wrong, millions of kids become the victims."},{"username":"jboothmillard","userUrl":"https://www.imdb.com/user/ur4248714","reviewLink":"https://www.imdb.com/review/rw2311026","warningSpoilers":true,"date":"15 September 2010","rate":"8","helpful":"4 out of 4 found this helpful.","title":"Grave of the Fireflies","content":"Princess Mononoke and Spirited Away are really good Japanese cartoon films, from Studio Ghibli, to feature in the book 1001 Movies You Must See Before You Die, and I was really glad I spotted this one when I did. Basically fourteen year old Seita (Tsutomu Tatsumi) is dead, but the narration continues to tell the story of what made him end up in that way. He and four year old Setsuko (Ayano Shiraishi) are brother and sister living in Japan during World War II, and they witness a mass bombing in their home town. Coming out of the wreckage of the air raid, they find a temporary home with their Aunt (Akemi Yamaguchi), and Seita is devastated when he sees the body of their Mother (Yoshiko Shinohara) and obviously near death. Seita is the only one who knows that their mother has died, and he writes to their father over seas to try and get out of the danger zone, so they stay with the Aunt in the meantime. It is obvious that Seita and Setsuko are getting on the Aunt's nerves, so they leave and make their way to an abandoned shelter to live in. All they need to stay alive is the roof over the heads, to care for each other, and find any food they can, but they still have fun as well. It becomes apparent that Setsuko is sick with hideous rashes developing on her body, and the doctor concludes that it is because of the lack of food. With the low supply of food, they can only entertain themselves while looking gazing at the beautiful light of the fireflies. Eventually Seita finds that his fears about his father being killed over seas are right, and the sick Setsuko confesses that she already knew that their mother was dead also. Seita decides that because she is so sick, Setsuko needs a serious amount of food, so he takes out the money from the bank to get a good supply, and she does take one bite of watermelon, but it is not enough and she dies. The story is nice and simple, it may not be dubbed into English but it doesn't matter, the use of colours was well assorted, and it is quite harrowing viewing which makes it essential. But what I enjoyed most about this film was the beautiful music by Michio Mamiya, not many cartoon films compel you with just some images and the use of excellent music score, but this one definitely does, a most worthwhile animated Second World War drama. Very good!"},{"username":"Tweekums","userUrl":"https://www.imdb.com/user/ur13977076","reviewLink":"https://www.imdb.com/review/rw1853999","warningSpoilers":true,"date":"8 April 2008","rate":"10","helpful":"8 out of 8 found this helpful.","title":"Heartbreakingly Beautiful","content":"I'd heard that this film was very sad before I saw it and knew how it ended but that didn't prepare me for just how harrowing this film was.Instead of focusing on the military this war film focuses on two children, Seita a boy in his early teens and Setsuko his four year old sister. The action is not fast paced as we follow the children's lives from the death of their mother in a fire-bombing raid through a stay with an unpleasant aunt and trying to live on their own in an abandoned air raid shelter to their inevitable end. By taking it slowing and showing the mundane aspects of their lives the viewer grows to care about the characters, especially the delightful Setsuko to such an extent that that I was smiling during flash backs showing her playing while simultaneously sobbing at her loss.This is not a film to be watched if one is depressed but it should certainly be seen by as many people as possible at least once, it may show two children in war torn Japan but it could easily be set in any war zone at any time in history."},{"username":"Quinoa1984","userUrl":"https://www.imdb.com/user/ur0453068","reviewLink":"https://www.imdb.com/review/rw1856606","warningSpoilers":false,"date":"12 April 2008","rate":"10","helpful":"7 out of 7 found this helpful.","title":"a combination of Rome Open City and Wiesel's Night (and like both, an extreme, personally felt story)","content":"In 1988 Grave of the Fireflies was placed on a double-bill alongside My Neighbor Totoro. Two of the most endearing films ever created- animated of otherwise- were paired alongside one another, more than likely to balance each other out; after being submersed in a pure tale of innocence and delight like Miyazaki's great film, there could be accepted such a bleak, heartbreaking story of survival. And both films, incidentally, were based on true experiences, and while Miyazaki's story wasn't without some sadness in real life (his mother was really sick with TB in the hospital), Akiyuki Nosaka's story is one drenched in the worst horrors imaginable for a child. It's basically about two siblings, an older brother and younger sister, who are left practically orphans in a Japan completely devastated by the constant barrage of bombs falling all around, and with very little hope in sight. This lays the groundwork for their relationship, a bond very fragile and incredibly endearing.Not since Rossellini and De Sica had a filmmaker, in this case Isao Takahata, touched a nerve so deeply etched out in deconstructing the horrors of wartime. By leaving us with these two characters, who piece by piece are stripped of their innocence in just the simple task of fending for themselves in a shelter (they at first stay with an aunt who considers them freeloaders) and scrounging for food any way possible, we're left with nothing else but their struggle, essentially. The backdrop itself almost becomes abstract, something so huge that we don't even know that it's Americans dropping the bombs, as it's already too much to grasp that a child's parent is no longer with them. Like Elie Wiesel's book Night, the backdrop and horror is used to pit these people in an untenable situation, and it can only end, honestly, without compromise.So, indeed, Grave of the Fireflies is bleak as hell, but compelling because it doesn't stray from its path with these characters, and that in many scenes we're connected to them without the overbearing heart-tugs of a common Disney feature (though, ironically, as Ebert points out on an interview with the DVD, the big eyes in most anime is based upon those in early Disney films). The animation is exceptionally refined without being excessive in violence; images are visceral for just what is briefly revealed, without the extraneous shots that one might see in a work not meant in a G-rated film (i.e. when Seita sees her mother, dead and wrapped in bandages with the maggots and bugs crawling all over), and at the same time there's a sense of wonderment as the two children watch the fireflies in the shelter. The voice-work, too, doesn't strain credulity- these sound like, if it were a regular live-action feature, the kids who would play these parts (and, speaking of neo-realism, the two credited for Seita and Setsuko never worked before or again).Most often, the film is heart-rending because of how things build with the situation. It's tragic enough to see the loss of the mother on the son, but then to hide it from the little girl becomes a greater challenge. Each time a layer of emotional defense is peeled back, it becomes harder not to connect strongly with these characters, such as when Seiko casually says she knows her mother is dead as she buries the fireflies and Seita finally cries out for the first time, or when Seita is left broken and humiliated after being beat up by the farmer for stealing food for sick Setsuko. And, finally, there's the last ten or so minutes, which I won't mention here. Suffice to say it's one of those times in movies where the opening of the film- Seiko dying homeless and famished- is explained to a perfect degree by film's end. It's a harrowing experience, and one of the very best animated films."},{"username":"dbborroughs","userUrl":"https://www.imdb.com/user/ur3079504","reviewLink":"https://www.imdb.com/review/rw0258294","warningSpoilers":false,"date":"6 July 2004","rate":"9","helpful":"180 out of 219 found this helpful.","title":"Depressing, but a must see","content":"One of the great animated films of all time Grave of Fireflies tells the story of a couple of kids as the try to survive in war time Japan. What happens to them should be seen by anyone thinking of starting a war since it tells very graphically what happens to those often forgotten, the children.Like its companion piece, Barefoot Gen, which tells the story of survivors of atomic bombing and the horrors that were experienced by those unlucky enough not to have been killed out right, this film proves that war is hell for everyone, especially the children.Its very hard to send anyone out to see this unhappy little film (The previously mentioned Barefoot Gen spawned sequels, this has not) but at the same time you owe it to yourself to experience, however distantly what sort of monster we unleash upon the world every time we go to war. It helps that however depressing this is, its also a damn good and incredibly compelling story.9 out of 10"},{"username":"grantss","userUrl":"https://www.imdb.com/user/ur2860723","reviewLink":"https://www.imdb.com/review/rw3619594","warningSpoilers":false,"date":"14 January 2017","rate":"9","helpful":"2 out of 2 found this helpful.","title":"Incredibly powerful and emotional drama","content":"Japan, World War 2. Teenage boy Seita and his young sister Setsuko are left homeless and effectively orphaned when their city is firebombed by US bombers. They end up living with an aunt. Initially things go well and life seems almost normal again. However, their relationship with their aunt deteriorates and Seita and Setsuko decide to leave and fend for themselves. They find a place and things seem to be going well. However, over time food gets scarcer and life becomes a constant struggle for survival A quite powerful examination of life among the civilian population of a nation at war. More broadly, this is a story of survival and the bonds between a brother and sister, made stronger by a cataclysmic series of events. The war is just the setting, and the initial cause of the events – at its core it's a human drama. This is good, as the movie could easily have gone down some sort of bleeding heart anti-war path or even a path that condemned the US bombing of Japanese cities in WW2 (which would have been absurd as the Japanese were just reaping the whirlwind after sowing the wind).Incredibly engaging. You are emotionally invested in the lives of Seita and Setsuko, their struggles and wins, highs and lows. This makes the conclusion very emotional.Superb animation, though you would expect nothing less from director Isao Takahata (director of the TV series Heidi and Maya, amongst others). Some of the imagery is stunningly beautiful, like watercolour paintings.On the negative side, and probably the only reason I didn't give this a 10/10, the outcomes are a bit telegraphed. The conclusion would have been even more powerful and emotional if we didn't know in advance what it was going to be."},{"username":"TBJCSKCNRRQTreviews","userUrl":"https://www.imdb.com/user/ur2093818","reviewLink":"https://www.imdb.com/review/rw2528194","warningSpoilers":false,"date":"5 December 2011","rate":"10","helpful":"3 out of 3 found this helpful.","title":"Beautiful, amazing, stunning","content":"Set during WWII in Japan, 14-year-old Seika is the only one to take care of his 5-year-old sister, Setsuko, after their mother is killed in an aerial firebombing of their village, that also destroys their home. Their father is off fighting, and they have to go to live with their aunt, who scolds them at an increasing rate and level. After a while, they move out, into a shelter. This follows their struggle to survive, on dwindling food supplies and sudden plane raids. In the way of a classic tragedy, this hints at its inevitable conclusion from the very beginning. This doesn't make it \"predictable\", as the point is not to surprise; it renders it even more powerful, as we find ourselves losing the battle in trying to deceive ourselves of where it is headed. I have not read the novel and can draw no comparisons. Like the other Studio Ghibli pictures, this feels very true to life and natural. The astonishing attention to detail, the immense realism, the tiny little human aspects, these have you forgetting that you're not watching live-action(the mood is spot-on, and you're transported directly into the situation). And the animation is impeccable. This is deeply moving and engaging(and it is more focused on this than the plot). If it does not tug at your heartstrings, you are officially a robot. At the same time, it isn't manipulative, and your sympathy and empathy are awoken in an honest manner. The sound design is excellent(and it uses the absence thereof, silence, to fantastic effect), backing up the visuals in recreating something very close to the real world. While there is stylization, and not everything in this is what it appears, it doesn't betray this objective of credibility. This builds and maintains atmosphere extremely well. Whether it's the siblings having trouble getting by, them playing together, an explosive assault from above, it comes across as genuine. The pacing is perfect. At about 90 minutes, this is not in a rush, and it lets you absorb the individual parts of what's going on. The acting is phenomenal. I base this on the original version, not a dubbed one. There is a bit of highly disturbing, bloody, violent, gory and brutal content in this. The DVD comes with a feature-length track of alternate angle storyboards(and another 10 and a half minutes of extra ones), two interesting interviews(one with the writer/director that comes in at 17 and a half minutes, the other with film critic Roger Ebert, that has a running time of 12 minutes), an informational 12 and a half minute documentary (\"Historical Perspective\"), a 6 and a half minute Japanese release promo, a 4 and a half minute DVNR featurette, a 3 minute art gallery, one US trailer and one Japanese(both 2 minutes). I recommend this to fans of Anime and drama. 10/10"},{"username":"The_Void","userUrl":"https://www.imdb.com/user/ur2248099","reviewLink":"https://www.imdb.com/review/rw0993740","warningSpoilers":false,"date":"7 January 2005","rate":"8","helpful":"201 out of 243 found this helpful.","title":"A magnificent piece of work and one of the most heartbreaking tales ever told","content":"Animation is often seen as a childish medium, and for good reason as kid's films often are animated. However, every now and then an animated film comes along that extends it's boundaries and manages to deliver a very adult story, and Grave of the Fireflies is one of those films. Through it's well observed and very real characters, Grave of the Fireflies portrays a story of loss, heartbreak and the effect of war on civilians in a manner that is more effective and more firmly based in reality than many live action films about the same subject are. We follow Seita and Setsuko, a brother and sister that have lost their parents in the war and are now forced to fend for themselves in the war torn country. How the two go about doing that and the boy's development from a child to a (somewhat) responsible adult due to the change in the surroundings makes up the spine of the movie.I'm not a big fan of animation, but there are some films that are so great that a person's personal preferences are irrelevant, and this is one of those films. The animation is beautiful and certain scenes, including the air raids and anything with the fireflies are amazing works of art. The way the music blends with the images on screen is haunting and beautiful, and helps add to the tragedy of the story. Because we are able to care for the characters, the tragedy is increased ten fold and the story on the whole is a sad one, but few movies have ever matched up to this film's ending in terms of pure despair. The conclusion is absolutely gut wrenching to an extent that few movies have ever matched, let alone animated pictures. The fact that it's so plain and blatant, with no attempt to console the audience takes the tragedy to a whole new level and I don't doubt that many audience members will be holding back tears upon the film's conclusion.This film is a must see."},{"username":"Mr-Fusion","userUrl":"https://www.imdb.com/user/ur1994077","reviewLink":"https://www.imdb.com/review/rw3240662","warningSpoilers":true,"date":"18 May 2015","rate":"8","helpful":"2 out of 2 found this helpful.","title":"Very good, but very rough","content":"\"Grave of the Fireflies\"sure isn't a movie I can put myself through with any kind of frequency, but it does make you think about those caught in the middle during wartime. To really turn the knife, the focus here is on two orphaned children. There's money but no food, jobs or family. Is there any possible happy ending here? Hell no! But it's still a powerful story that goes for the emotional throat. And I still care deeply for these characters even after all is said and done. With such a (tear-jerker) reputation, I have to admit I walked into this expecting to come out a blubbering fool. I didn't to such an extent, but on the other hand, it's not everyday you see such power from an animated film.It's just so bloody unfair what these poor kids have to go through, but I can't recommend this highly enough.8/10"},{"username":"Vincentiu","userUrl":"https://www.imdb.com/user/ur13017201","reviewLink":"https://www.imdb.com/review/rw2777064","warningSpoilers":false,"date":"3 April 2013","rate":"","helpful":"2 out of 3 found this helpful.","title":"about war heart","content":"in Romanian,the word hotaru meanings the border, the frontier. in Japanese - firefly. same - only poor words. but in this case, the homonyms has a special sense. because it is a film about borders and fireflies. each - symbols for a touching story about survive and profound love. about war scarfs.or, only, about ordinary reality. it is splendid. not only for script or animation. but for delicate measure. for great art to suggest. for the small gestures and for silence. and, sure, for the things out of words - profound emotions, tears and new manner to discover life.the basic verdict - must see it. because it is far to be just animation movie. it is only an isle. seed for reflection. and occasion to understand essential pieces of happiness. a slice from a war. special. because it is common fact. a crumb. from war heart. amazing."},{"username":"siderite","userUrl":"https://www.imdb.com/user/ur3146136","reviewLink":"https://www.imdb.com/review/rw1100211","warningSpoilers":true,"date":"11 June 2005","rate":"9","helpful":"5 out of 5 found this helpful.","title":"I can hardly see through the tears. Great drama anime.","content":"This is a war time story and, while it has a slow pace, it couldn't have been told any other way. It's like a knife being slowly inserted and twisted in the wound.Everything begins with a \"La Vitta e Bella\" atmosphere: mother dead, father at war, brother and little sister going to a distant relative, brother sheltering the sister from the realities of war as much as possible. But the end of the film (which again, doesn't come abruptly, but gradually) is nothing like happy.This has no action scenes, no fight or physical violence scenes, no sci-fi and no fiction. It's an anime harsh reality that makes you cry your eyes off at the end of the movie. The movie is great, it's a must see for anime lovers or anybody else.I recommend to see again the start of the film after you have seen the whole movie."},{"username":"lasttimeisaw","userUrl":"https://www.imdb.com/user/ur3967726","reviewLink":"https://www.imdb.com/review/rw6901136","warningSpoilers":false,"date":"10 May 2021","rate":"8","helpful":"1 out of 3 found this helpful.","title":"Cinema Omnivore - Grave of the Fireflies (1988) 8.4/10","content":"\"If the plot is a poverty porn of the highest water, viz. Young kids suffer and wither in privation, Takahata magnificently tones down the tragedy with episodes of poetry and reminiscences, even happiness (however fleeting it is), using firefly as a metaphor for evanescent lives, the whole film suffuses with exceptionally tender moments and picturesque illustrations that have been scarcely rivaled ever since. That is the simplicity and beauty of cel animation, I would even prefer this to Hayao Miyazaki's MY NEIGHBOR TOTORO, released in the same year, not because of its technique, but of how Takahata leavens a lachrymose text with adroit considerations, especially those concerning Setsuko, her declining process is depicted with such insuperable felicity (a fruit drop can leave you feel pulverized), everything can be tactlessly fell into mawkishness or ickiness, but GRAVES OF THE FIREFLIES lends its feet victoriously in the end.\"read my full review on my blog: cinema omnivore, thanks."},{"username":"Pjtaylor-96-138044","userUrl":"https://www.imdb.com/user/ur26820801","reviewLink":"https://www.imdb.com/review/rw6333656","warningSpoilers":false,"date":"3 December 2020","rate":"8","helpful":"1 out of 1 found this helpful.","title":"Absolutely heartbreaking.","content":"'Grave Of The Fireflies (1988)' is just heartbreaking. I really mean that, too; it's emotionally devastating. I'm not ashamed to admit that I cried a little before its main title even appeared on screen, and a lot after its credits had begun to roll. Frankly, it's one of the most affecting movies I've ever seen. It tells the tale of two orphaned siblings who must survive in extreme poverty following WWII air raids on Japan, primarily focusing on the relationship between the children and the older brother's attempts to properly look after his young sister. Make no mistake: though it's brought to life with stunning 2D animation, this isn't a happy film. It's bleak and harrowing and surprisingly unconcerned with traditional narrative closure. That doesn't mean it isn't brilliant, though. It's a compelling and powerful anti-war tale that's sure to move you on some level. Plus, it occasionally achieves an odd kind of almost ethereal beauty. It isn't just tragic, it's poignant. It hits you right in the heart, and it hits hard, too. It's a phenomenal piece of filmmaking. 8/10"},{"username":"cherold","userUrl":"https://www.imdb.com/user/ur0011762","reviewLink":"https://www.imdb.com/review/rw2937057","warningSpoilers":false,"date":"7 January 2014","rate":"8","helpful":"2 out of 2 found this helpful.","title":"Well done and very depressing","content":"I loved depressing movies when I was in college, but generally avoid them now; the heartbreak of a movie like La Strada just seems more than I can bear. I knew Grave of the Fireflies was pretty serious, but I did not realize how utterly grim it would be.Still, I'm glad I saw it. It's a very well-made movie. It's also an example of an animated movie that makes a case for animation in drama. I often feel that if there is nothing in a film that can't easily be shown with live action then it's a waste to use animation, which loses the nuances of human acting. But this film allows for scenes you wouldn't get in a live action movie; the use of fireflies would never be as lyrical and striking in a live drama.There are a few issues with the movie. One is those weird red, raggedy-anne circles on the little girl's cheeks, which I found endlessly distracting. More importantly, there are places where the boy's actions don't make sense. This is not to say that there weren't good reasons for what happened (the movie is based on an autobiographical book, so it may be true to life), just that the movie fails to make things clear.It was a good movie, but it has not convinced me to watch more depressing films."},{"username":"StrictlyConfidential","userUrl":"https://www.imdb.com/user/ur89333699","reviewLink":"https://www.imdb.com/review/rw5725219","warningSpoilers":false,"date":"10 May 2020","rate":"4","helpful":"3 out of 48 found this helpful.","title":"Up In The Skies (Before My Eyes) Fireflies From The Grave","content":"Yeah. OK. \"Grave of the Fireflies\" was (Indeed) cute. (And - Yeah. OK.) Its 2-D animation was nicely done. (And - Yeah. OK.) Its story was (Indeed) depressing (And - Yeah. OK.) - Tragic, too.But, with that all said - I really don't get what all the fuss is about here when it comes to praising this 1988 Japanese picture to the high-heavens. No, I don't.'Cause (IMO) if the director of this production (Isao Takahata) was honestly aiming for realism here (in the realm of the characters actually looking ethnically authentic as Japanese citizens). And, yes, I'm sure that that was Takhata's goal. - He certainly missed the mark by a clear country mile. Yep. He did. Indeed."},{"username":"lost-in-limbo","userUrl":"https://www.imdb.com/user/ur3071695","reviewLink":"https://www.imdb.com/review/rw1708296","warningSpoilers":false,"date":"8 August 2007","rate":"10","helpful":"12 out of 14 found this helpful.","title":"One for the unknown victims.","content":"Just marvellous! This hearty masterpiece of Japanese animation is incredibly moving, sincere, haunting and captivating in detailing the special bond between brother and sister caught up in the horrifying and unforgiving face of war. It guides us on one really tragic, but rewarding trip where it truly has an impact. Never does it get overwrought or push itself onto the viewer, but still it manages to leave a lump in your throat and have you emotionally drained when the credits begin to roll. This one is not afraid to stay gloomy, and because you know the outcome at the beginning, this makes the significance of the story's journey more potentate in its increasing pain and devastation. By that alone, the wonderfully textured plot doesn't take the easy way out and the reality of the situation is never lost because it's animated.Staying simple and focused, kept it rather flawless in its in-depth story telling of emotional pride and lasting effects. Slow it might be, but there's too much subtle richness within its characters, premise and visuals to really bother about the loose pacing and lack of action. Isao Takahata adapts the novel of Akiyuki Nosaka, and gets us deeply involved with the civilians, and the mere war stays in the background. A contrast between two different worlds, one being the war itself and secondly the one the two children find themselves in to forget it. Namely those scenes where they're experiencing the beauty and freeness of nature (at if they might never get that chance again) and those sequences with the fireflies admirably paint the feelings of what's to come. The budding relationship between Seita and Setsuko is tremendously done, innocent and full of colour. Even capturing the Japanese citizens and families in this cold plight is believability achieved, as it throws questions, issues and metaphorical messages. These people (including our two central characters) are doing it hard, but their wills won't collapse after what they've been through, but things do take their toll when everything you ever care for can suddenly vanish and the heartache turns to utter numbness. Because what kept you living, is no longer there to hold you.Breathing heavily on the mood is the soft, lovely musical score that certainly weeps with its melodic tone. The vivid animation is gorgeously crisp and enchanting, and the background scenery is profoundly vivid and convincing. Many beautiful, striking illustrations are framed with a sincere touch, where darkness treads neatly together with the lighter moments. What a delightfully effective and soulful meditation piece of sublime art by director/writer Isao Takahata. This one has plenty to say on the topic at hand, and it gets even more relevant everyday.Magnificently heart-wrenching and sensitive war-time story on the people who find themselves dealing with the unbearable consequences of war."}],"errorMessage":""}