{"imDbId":"tt0047478","title":"Seven Samurai","fullTitle":"Seven Samurai (1954)","type":"Movie","year":"1954","items":[{"username":"MartinHafer","userUrl":"https://www.imdb.com/user/ur2467618","reviewLink":"https://www.imdb.com/review/rw1704882","warningSpoilers":false,"date":"2 August 2007","rate":"9","helpful":"6 out of 16 found this helpful.","title":"One of Kurosawa's best","content":"While this movie is probably the most widely recognized film of the director Kurosawa, it isn't my personal favorite--though it's close. But considering how many wonderful films he made and how this movie sparked the Magnificent Seven films, its impact and importance can't be ignored. And I would have to say that it deserves all the attention--it's just too bad that other films like YOJIMBO, SANJURO and THE BAD SLEEP WELL just haven't gotten all the attention this film has. Actually, it['s strange that I am getting around to reviewing this film now--as I have seen it several times and thought I'd already reviewed it.The film begins in the feudal period in Japan in a small town that is being terrorized by a gang. These thugs periodically come to strip the people of what little they have as well as their dignity--much like locusts. Eventually, the gang's demands are so extreme that it appears they have no choice but to fight back when they next return--otherwise they face starvation. The problem is that these are simple peasants and they haven't got a prayer against Ronin (i.e., samurai who have no master). Eventually, townspeople get the idea to bring in some of their own Ronin to fight against the evil gang. At this point, the film concentrates on the seven men--who they are, their motivations, etc. It is here that the film really excels. In fact, probably the least exciting portion of the film is the eventual battle between the forces.An excellent character study and a film with so much to love--great acting, direction and a dandy and exciting script."},{"username":"TheLittleSongbird","userUrl":"https://www.imdb.com/user/ur20552756","reviewLink":"https://www.imdb.com/review/rw2624541","warningSpoilers":false,"date":"9 June 2012","rate":"10","helpful":"6 out of 12 found this helpful.","title":"Kurasawa's best film","content":"As much as I do love Ran, The Hidden Fortress and Throne of Blood, it was Seven Samurai that I love most of Akira Kurasawa's films. As with all Kurasawa's films, it is incredibly well made with authentic scenery that would give meaning to the term epic and the camera work is truly spectacular. This is especially true in the final battle, with inspired use of moving and multiple camera, precise editing, telephoto lenses and variegated film speeds. As always with Kurasawa, the direction is consistently brilliant. Add to that a stirring score from Fumio Hayasaka and a thoughtful script and you have more reasons why Seven Samurai is so good. The story unfolds slowly, but never felt dull to me and is never hampered by the three-and-a-half-hour running time. Plus Seven Samurai is interesting for being one of the first few to utilise the plot element of recruiting/gathering of heroes into a team to achieve a goal, seen especially with when the audience is first introduced Kambei. The action is spectacular and looks even better with the use of multiple cameras from various angles, and any humanity Seven Samurai has, and it does have a lot, is shown in a poignant way. The cast are excellent, with Takashi Shimura and especially Toshiro Mifune the standouts. Overall, of a resume of one of the greatest directors who ever lived, responsible for many wonderful movies(and I'd say that Seven Samurai and Ran are among the best movies ever made) Seven Samurai stands tall. One of the easiest 10/10s I've ever given. Bethany Cox"},{"username":"Leofwine_draca","userUrl":"https://www.imdb.com/user/ur0482513","reviewLink":"https://www.imdb.com/review/rw3598012","warningSpoilers":true,"date":"13 December 2016","rate":"8","helpful":"3 out of 4 found this helpful.","title":"A strong, expertly-made, and influential movie","content":"This Japanese samurai film from Akira Kurosawa sets up a classic action template that would inspire everything from THE MAGNIFICENT SEVEN to THE SEVEN MAGNIFICENT GLADIATORS and utilises the style of camera-work and direction that would inspire Hollywood movies till this day. Be warned, at three hours and ten minutes, this is a leisurely-paced film that takes its time to get to know the leading characters, and many fans of the type of slickly-edited, no-attention-span blockbusters that are made these days will find themselves struggling to sit through the film in one go. However, perseverance is worthwhile, because SEVEN SAMURAI is a very well made film despite the low budget. The direction and camera-work, as mentioned previously, are spot on and Kurosawa reveals himself at home both in the crisply-shot action sequences and the character-fuelled drama.Another big plus for the film is the cast, all of whom really add to the movie experience as a whole. Best of all is Takashi Shimura as Shimada, the chief samurai; taciturn yet friendly, strong yet understanding, he gives an outstanding performance. Shimada's character is off-set by Toshiro Mifune's Kikuchiyo, who has more of a scene-stealing part as a farmer's-son-turned-samurai; Mifune brings vitality and humour to the movie and, while I'm sure his gurning and frenzied comedy will not be to all tastes, he certainly ups the excitement and fun of the film whenever he's around. The supporting characters are also great, especially the stern Kyuzo and the youngster of the seven, Katsushiro.The plot is simple yet is strong enough to have been rehashed countless times. Elements of battle tactics and warfare are used sparingly but effectively, and the emotional punch is there; at the closing scenes, I felt like crying right along with Katsushiro, due to all the unnecessary bloodshed and killing that immediately preceded that moment. SEVEN SAMURAI is best experienced by watching it appreciatively; of course it looks dated nowadays, and many of the plot elements have become clichéd. Appreciating what it did to cinema in 1954, though, reveals what a strong, expertly-made and influential movie it really is."},{"username":"SnoopyStyle","userUrl":"https://www.imdb.com/user/ur2898520","reviewLink":"https://www.imdb.com/review/rw3139541","warningSpoilers":false,"date":"10 December 2014","rate":"9","helpful":"4 out of 5 found this helpful.","title":"Iconic influential movie","content":"It's early 16th century and Japan is in the midst of civil wars. A poor village faces constant harassment from bandits. A villager overhears that bandits are planning to come back after the harvest. After a debate, the village elder proposes to hire samurai. The villagers have little to offer. They witness heroic ronin Kambei rescue a boy. Young Katsushirō is desperate to be his disciple. Kambei reluctantly agrees to help the villagers but he determines that the defense needs at least seven samurai.This is simply one of the best movies ever. It is influential in so many other movies. The characters are funny and compelling. They are iconic in their simple characteristics. Modern audiences may find the over 3 hour running time a bit too long."},{"username":"Hitchcoc","userUrl":"https://www.imdb.com/user/ur0278527","reviewLink":"https://www.imdb.com/review/rw2120763","warningSpoilers":false,"date":"2 September 2009","rate":"10","helpful":"4 out of 7 found this helpful.","title":"It Helped Define Film","content":"This is a movie that makes over three hours seem like a few minutes. As with a great work of art, it appreciates on multiple viewings. This is a classic tale of an oppressed village under siege from enemies. They are plundered and attacked by murderous thieves and have little hope. Enter the good guys who aren't always seen as good guys. Yes, it is a classic plot, but there the comparison ends. The way Kurosawa frames his scenes, the action sequences, the close ups, the emotions expressed are seldom matched. This has everything: a massive spectacle with battle scenes unmatched, incredible acting by Kurosawa's stable, including his star Taoshiro Mifune. In the \"High Noon\" tradition, it has the theme that we need to help ourselves and not depend on others to help us. The Samurai, who have ruled for a long time, have fallen into disfavor and so there's a tension: Why should they fight if the villagers are only interested in keeping what is there's, even if it means constant raids and attacks. There are greater reviewers who have done justice to this film. I can only say that I am a huge fan."},{"username":"claudio_carvalho","userUrl":"https://www.imdb.com/user/ur2488512","reviewLink":"https://www.imdb.com/review/rw2105540","warningSpoilers":false,"date":"2 August 2009","rate":"10","helpful":"26 out of 45 found this helpful.","title":"One of the Best Movies of Cinema History","content":"In the Sixteenth Century, in Japan, a poor village is frequently looted by armed bandits losing their crop of rice. Their patriarch Grandpa advises the villagers to hire a Ronin to defend their village. Four farmers head to town to seek out their possible protectors, but they just can offer three meals of rice per day and lodging for the samurai. They succeed in hiring the warming-hearted veteran Kambei Shimada (Takashi Shimura) that advises that they need six other samurai to protect their lands. Kambei recruits the necessary five samurai and the brave jester Kikuchiyo (Toshirô Mifune) and move to the village. After a feared reception, Kambei plots a defense strategy and the samurai start training the farmers how to defend their lands and families for the battle that approaches. In order to celebrate the milestone of 4,000 reviews in IMDb, I decided to watch again \"The Seven Samurai\", the most known masterpiece of Akira Kurosawa and among my Top-10 movies ever. As far as I recall, this was the first samurai movie that I have watched and it is still my favorite despite many other excellent movies. \"The Seven Samurai\" is a perfect movie: the story and screenplay are amazing, dividing the dramatic story in the recruitment, reception, strategy, training, harvest, romance and the final battle of the samurai in such a way that the viewer does not feel the 207 minutes running time. The direction of Akira Kurosawa is perfectionist as usual, and the choreography of the battle in the rain is extremely realistic. The acting is top-notch, highlighting Toshirô Mifune in a great shape, climbing trees, jumping and fighting in the role of a funny character. The cinematography, set decoration, costumes, lighting, everything is fantastic. In 1960, John Sturges remade this masterpiece with the western \"The Magnificent Seven\". My vote is ten.Title (Brazil): \"Os 7 Samurais\" (\"The 7 Samurai\")"},{"username":"bob the moo","userUrl":"https://www.imdb.com/user/ur1002035","reviewLink":"https://www.imdb.com/review/rw1915333","warningSpoilers":false,"date":"21 July 2008","rate":"","helpful":"5 out of 14 found this helpful.","title":"OK not the flawless classic that some would say but still a very engaging and enjoyable film","content":"A village is plagued by bandits who regularly and clear them out of their crops, leaving them with little to live on. The majority of the village almost seems to accept this as their lot in life but one young man decides enough is enough and tries to organise some way of fighting back. He learns from one of the elders of a village that hired wandering samurai many years ago and were the only village to survive the bandit raids. Sure this is the way forward he heads out with a group to employ the services of samurai before the bandits return next year. However the samurai are a proud breed and can they really find some that will be willing to work for food in return for risking their lives?In an attempt to ensure I do not become someone who only watches new releases on DVD etc, I decided to use LoveFilm to venture into more of the \"classics\" territory and specifically to close the gap that is Akira Kurosawa. I noticed in a couple of reviews that I had referred to Seven Samurai as a \"classic\" and suggested it was better than the films I was reviewing but yet, on reflection, I'd never actually seen it \u0096 hence me getting this version (not aware that it was nearly three hours long). I needn't have worried though because the time went very quickly indeed and I found myself engaged in the story. It mixes action with humour, drama, pathos all within a superficially simple but effective narrative. What I think the problem is when it comes to modern viewings of the film is that we have this collective accepted wisdom that this film is \"brilliant\" and this I think is in us from birth \u0096 preventing us coming to the film on its own terms.It didn't offer me anything that amazed me or made me mark it down as a classic but this didn't bother me while watching it because I was enjoying it and the thoughts of \"is this a classic\" were not in me. Reading others' comments after watching it though I can see that for some it was and that some watched waiting for \"brilliance\" to happen instead of watching the film for themselves. Having said that though, don't take me as saying that this is not any good because, although not all I had assumed, it is still very good. Kurosawa has written a very good script that keeps the contrasting aspects working well together and not feeling disjointed in the delivery, mainly by having the characters be natural and interesting in their design. As director he works with cinematographer Nakai to make the film look very good \u0096 particularly in the heavy mud and rain of the final battle, where the images remain fluid and sharp. He also draws good performances from his cast and in particular Shimura who is a sturdy rock at the core of the group. Mifune gets attention and provides energy with his character while of the rest of the samurai I liked the performances from Miyaguchi, Kimura and Kato.I can understand why some have been a bit down on this film because in some ways it cannot live up to the accepted opinion that we all seem to hold that it is brilliant. However this is not to do down the film because it is still very good \u0096 it just helps to meet it on its terms rather than expect it to bend to meet yours. Really well filmed and acted, the simple story mixes humour, action and drama in an effective blend that will see the running time of near three hours move by pretty quickly."},{"username":"classicsoncall","userUrl":"https://www.imdb.com/user/ur2707735","reviewLink":"https://www.imdb.com/review/rw3069260","warningSpoilers":true,"date":"15 August 2014","rate":"10","helpful":"2 out of 4 found this helpful.","title":"\"In life one finds friends in the strangest places.\"","content":"Apparently it took a second viewing for me to really appreciate this film. The first time around I must have been distracted to the point of being inattentive and today I'm glad I gave it another shot. What particularly struck me this time was the gorgeous cinematography, which hooks you right from the start with the menacing ride of the bandit clan upon the seemingly deserted village. Though filmed in black and white, the images are crisp and clean, elevating the result to a true work of art. In fact, the effect is hypnotic at times, and one must concentrate to stay with the story that unfolds.Thinking back on my first experience with the picture, I tried to figure out what might have prevented my viewing pleasure. Yes the film is long and there is a tendency for Kurosawa to keep the camera stationary for an inordinate length of time to establish mood and a point of view. Perhaps it also had something to do with the motion of the villagers who appear to react erratically, almost as if they were self consciously forcing their activity. Now obviously those elements have not gone away, but it's just that I saw it all in a different light with this viewing.Director Kurosawa does take his time building to the action. The entire first half of the film is used to introduce his characters and set up the framework for defending the village. When the village is finally assaulted by the marauding bandits, the samurai follow a methodical plan devised by their leader Kambei Shimada (Takashi Shimura), whereby one or two of the outlaws are allowed entry into the village while the rest are kept at bay, allowing the villagers to defeat their foes systematically and decisively. The villagers resemble a swarm of bees each time they descend on a fallen enemy.Through a diverse mix of personalities and temperaments, Kurosawa explores various character traits of the samurai, among them honor, loyalty, selflessness, courage and even humor. The comic relief offered by Kikuchiyo (Toshiro Mifune) when attempting to ride the horse for the first time came just at the right moment to break the unrelenting tension faced by the warriors. Kurosawa even delves into matters of the heart with the relationship of Katsushiro and Shino, unfavorably received by the obsessive behavior of Shino's father.All in all, I'm glad I gave this picture a second chance. \"Seven Samurai\" is a masterfully told story and a cinematic achievement, and will certainly warrant another viewing in due course."},{"username":"lee_eisenberg","userUrl":"https://www.imdb.com/user/ur4888011","reviewLink":"https://www.imdb.com/review/rw2501415","warningSpoilers":false,"date":"10 October 2011","rate":"","helpful":"3 out of 5 found this helpful.","title":"helping others is saving yourself","content":"I am embarrassed to say this, but before watching \"Seven Samurai\", the only Akira Kurosawa movie that I had seen was \"Yojimbo\" (which was definitely a good one; it was the inspiration for \"A Fistful of Dollars\"). But now I've seen what is probably Kurosawa's all-time masterpiece. This look at a group of men who come to the aid of a besieged town during the Warring States Period of Japan has it all: perfect direction, incredible cinematography, and even more.Probably the best scene is when Kambei Shimada (Takashi Shimura) addresses the other six samurai and proclaims \"If you seek to help others, you have saved yourself. If you only think of yourself, then you only destroy yourself.\" That should be the ultimate lesson for all mankind in all endeavors. Regardless, this is a movie that you can't afford to miss. I have yet to see \"The Magnificent Seven\", but I have seen \"Three Amigos!\". I certainly hope to see more Kurosawa movies.Another movie set during Japan's Warring States Period that I recommend is Kenji Mizoguchi's \"Ugetsu\", about the effect that war has on people."},{"username":"gavin6942","userUrl":"https://www.imdb.com/user/ur1234929","reviewLink":"https://www.imdb.com/review/rw2229047","warningSpoilers":false,"date":"31 March 2010","rate":"8","helpful":"1 out of 3 found this helpful.","title":"A Truly Epic Film","content":"A village has been hounded by bandits who come in to steal their rice and barley. Sick of it, they decide to hire a samurai to protect them before the next raid. Soon, the number grows to seven... and the bandits have a heck of fight on their hands.Akira Kurosawa is a master, both in writing and directing. Some have compared this film to Orson Welles' \"Citizen Kane\" for its greatness. And surely, we have seen many, many directors and films who have expressed their admiration -- sometimes in words, sometimes by imitation.The film has been said to be the first where an assembled group of men go on a mission. That may well be true. I find it even more impressive that Kurosawa was able to make such a production so relatively soon after World War II, when Japan should have been struggling with recovery. Indeed, the filming quality is not up to American standards for 1954, but he more than makes due with what he has.I really need to see the film again to get a fair assessment of it, but I enjoyed it greatly and think it needs more exposure."},{"username":"jboothmillard","userUrl":"https://www.imdb.com/user/ur4248714","reviewLink":"https://www.imdb.com/review/rw2350059","warningSpoilers":true,"date":"8 December 2010","rate":"9","helpful":"0 out of 2 found this helpful.","title":"Seven Samurai","content":"I read the description of this film given in the book 1001 Movies You Must See Before You Die, I was surprised to find out that it was remade into The Magnificent Seven, so naturally I wanted to see the original source, from director Akira Kurosawa. Basically, set in the 16th Century of Japan, a poor mountain village in the country is constantly being robbed, looted and made fearful by an armed gang of marauding bandits causing them to lose their rice crop. The villagers have finally had enough and decide that they need outside help to both defend themselves, and get rid of the thieves once and for all. Warm-hearted veteran samurai Kambei Shimada (BAFTA nominated Takashi Shimura) is approached by young samurai Katsushirô Okamoto (Isao Kimura)to be hired to defend the village, and he gladly accepts. Together, along with two of the town's farmers, under the advice of Kambei, they leave the village to find six other samurai warriors to protect the lands. They successfully find and recruit four skilled fighters and swordsmen, Gorōbei Katayama (Yoshio Inaba), Shichirôji (Daisuke Katô), Heihachi Hayashida (Minoru Chiaki) and Kyûzô (Seiji Miyaguchi). They had originally planned to leave with just these four men, but they spot clownish but skilled samurai Kikuchiyō Okamoto (BAFTA nominated Toshirô Mifune), and with everyone's encouragement, Katsushirô is secured as the seventh samurai. With the promise of three free meals a day the seven samurai look forward to their arrivals, but when they get back to the village with a fearful reception, but don't worry, things settle. Kambei gets to work immediately on the battle strategy against the gang of thieves, and the other samurai start training the people in the village to be ready for any incoming attack or raid. There are forty bandits in total, and the first attack gets underway, with a good amount of the opposite side being brought down, but of course there has to be a casualty. Gorōbei was shot and killed in the first attack, Kikuchiyo's friend Yohei (Bokuzen Hidari) was also killed in action, but the samurai and villagers are determined not to be beaten in the second bandit brawl. Kyûzô suffered the fate of the second attack, and the final attack finishes off the gang of thieves, with Kikuchiyō being the final samurai to meet their maker. In the end, the three surviving samurai, Kambei, Katsushirô and Shichirôji look over the villagers looking happy planting their new crop, and the graves of the other four warriors. Also starring Kamatari Fujiwara as Manzô, Yoshio Tsuchiya as Rikichi and Yoshio Kosugi as Mosuke. Being three hours and ten minutes long I was expecting to doze off and have to rewind at some point, but with great acting, the training and fight sequences, historical detail, humanism, the final battles, but also clever editing and speed techniques, this black and white is a masterpiece of foreign cinema, a brilliant classic action drama. It was nominated the Oscars for Best Art Direction-Set Decoration and Best Costume Design, and it was nominated the BAFTA for Best Film from any Source. Very good!"},{"username":"rmax304823","userUrl":"https://www.imdb.com/user/ur0819382","reviewLink":"https://www.imdb.com/review/rw0053404","warningSpoilers":false,"date":"28 November 2003","rate":"","helpful":"3 out of 8 found this helpful.","title":"The Magnificent Seven: The Prequel.","content":"I won't go on about this except to say I recommend it without qualifications.It is the fons et origo of so many Westerns. Slow-motion deaths were introduced to the screen here. But then, everything here was pretty much original, an updated Iliad. Two groups of warriors standing a few feet apart, shaking spears at one another, the only thing missing being Hector. But then too it is an alegory of WWII. The samurai may have weaknesses -- they're only human after all -- but they are governed by a code of honor. And when they die it is in a noble cause or because they and their swords are outmatched by modern weapons like rifles (or atomic bombs).If I can make an outrageous generalization (and I can), China is known for its innovations, and Japan is known for adapting those innovations and perfecting them -- whether lacquered bowls or weapons of war. (The poor Koreans are left somewhere in between, known mainly for kim chee.) Akira Kurosawa was a fine director and an intelligent man. He not only perfected the genre of the samurai movie but put Shakespeare up there on the screen with the best of them -- \"Throne of Blood,\" which is MacBeth, and \"Ran,\" which is King Lear. Kurosawa was both a craftsman and an artist and this is one of his better works."},{"username":"ccthemovieman-1","userUrl":"https://www.imdb.com/user/ur4445210","reviewLink":"https://www.imdb.com/review/rw1426730","warningSpoilers":false,"date":"22 July 2006","rate":"3","helpful":"27 out of 93 found this helpful.","title":"Not What It Is Cracked Up To Be","content":"This 1954 Akiro Kuroswa-directed film has legendary status among critics. It was the forerunner for the western hit \"The Magnificent Seven.\"Knowing these facts, I was anxious to see it. Wow, what a letdown! Yes, it had some nice photography but the story was way too slow-moving to sustain interest. It took FOREVER to get to the main action scene. By then, it was too late; I had lost interest. The film runs 160 minutes and can seem longer.So many of these Kurosawa films are overrated by the critics. Maybe it's not politically-correct to criticize this man's work, it's not the \"thing to do,\" so they keep telling everyone what great films like this are, hooking unsuspecting people like me into wasting my time and money on them..I wanted to like this, but I have to be honest, too. If you thinking of purchasing this, sight-unseen (especially with an expensive Criterion price) , don't say I didn't warn you."},{"username":"ma-cortes","userUrl":"https://www.imdb.com/user/ur3270789","reviewLink":"https://www.imdb.com/review/rw4689135","warningSpoilers":false,"date":"27 February 2019","rate":"7","helpful":"9 out of 19 found this helpful.","title":"Classic epic ,though overlong , Kurosawa's masterpiece and at the time it was Japan's most expensive picture ever","content":"This is a superior and enduringly popular film , considered to be a real classical movie .The film gets action in Western style , thrills , intrigue , human relationships , it's fun and entertaining . Kurosawa's vintage pic set in 16th century Japan , a small farming village beset by marauding attackers hires 7 professional Samurai to rid of the scourge. As a group of villagers go to the nearly town where find Kambei : Takashi Shimura , who has carried out a risked rescue of a baby taken hostage by a nasty bandit . As Kambei walks towards town a young samurai, Katsushiro : Kimura , asks to become his acolyte. Then the farmers ask Kambei to help defend their village; to their great joy, he accepts. Kambei, with Katsushiro's assistance, then enlists four samurai more from the city, . Kambei initially decides that seven masterless samurai , Ronin , would be necessary to recruit , and time is running short . The villagers beg him to take Katsushiro also and, with some prodding by the others, he agrees . A clownish samurai named Kikuchiyo : Toshirô Mifune , whom Kambei had rejected for the mission, follows them to the village at a distance , ignoring their protestations and attempts to drive him away. The team gradually come together and 7 Samurai , at last , one by one, each with distinctive skills and personality traits ; all of them to help a poor village against savage thieves .As Kambei and his buddies , each of whom comes for a different reason , must free a village attacked by heinous outlaws who are devastating the small location . All of them get a chance to redeem themselves . Later on , the bunch develops a plan to secure the villagers defend it against enemy attack .This is a magnificent picture by Akira Kurosawa starred by his ordinary actors Toshiro Mifune , and Takashi Shimura , being his international breakthrough one . Sweeping , dramatic , complex human drama with all the ingredients : suspense , action , comedy , character studio and many other things . Seven Samurai , the picture blends drama , violent fights , emotion , slaughters with high body-count and results to be pretty entertaining as well as thought-provoking . It is incredibly detailed vision in its own right , as the impact of the action and combats on this trail-blazing adventure film opened the floodgates for the huge numbers of samurai films and subsequent Spaghetti Westerns that made fortunes for their producers in the sixties and early seventies . Dramatically staged sword-plays occur on and off throughout the plot . The story is classic and traditional , following its interesting premise in subsequent remakes , rif-offs and sequels , including customary misfit band formed by an eclectic gang with diverse characters as well as speciality . Kurosawa took an elemental Western issue ¨good guys against bad guys¨ plot and turned it into a breathtaking classy which is still probably the best-know and one best Samurai film to come from Japan . At the time of its making it got a big success at the boxoffice around the world . Kurosawa's pacing is immaculate and allows for periods of calm in which to establish roles punctuated by viscerally thrilling burst of action . These culminate in the overwhelming climatic battle between the bandits and the samurai which ranks among the very nicest combat scenes ever put on movie . It is followed by several reboots and imitations . Standing out ¨The magnificent seven¨ by John Sturges . Unlike Sturges' remake in 7 Samurai the roles grow originally from the action and they are not conveniently established by star-casting , like in the American film formed by big actors as Yul Brynner , Charles Bronson , James Coburn , Robert Vaughn , Brad Dexter , Elli Wallach . Very good acting by Toshiro Mifune as a valiant Samurai , as he is a harebrained but courageous young dominating warrior , as well as Takashi Shimura as the intelligent and brave leader of the fabulous Samurai . This one made an international star out of Toshiro Mifune .This fiercely-charging , uncompromising picture was compellingly directed by Akira Kurosawa and being exhibited with subtitles or dubbed .After working in a wide range of genres, Kurosawa made this awesome film . And available in a big number of versions of varying length , all too long . Kurosawa's previous and subsequent years saw the low-key , touching Living (1952) , this great epic The seven samurais (1954), the barbaric , fascinating Shakespeare adaptation Throne of blood (1957) , a Macbeth's version , a masterful rendition that transports the story to Medieval Japan , and a fun pair of samurai movies Yojimbo (1961) and Sanjuro (1962) , and Rashomon , often credited as the reason the Academy created the \"Best Foreign Film\" category. When this film was released internationally to rave reviews, many speculated that Akira Kurosawa was influenced by Citizen Kane (1941) in the element of flashbacks that ultimately provide conflicting accounts of events. However, Kurosawa didn't even see Orson Welles's film until several years after . Rashomon won the top prize at the Venice Film Festival, and first revealed the richness of Japanese cinema to the West.Yet , there was a quieter side to Kurosawa's nature , expressed most succinctly on Living , The Lower Depths and especially the medical drama Red Beard . After a lean period in the late 1960s and early 1970s, though, Kurosawa attempted suicide . Other important movies were : The idiot based on Feodor Dostowieski , Drunken Angel , Scandal , A quiet duel , Tiger's tale , High and low . He survived, and made a small, personal, low-budget picture with Dodes'ka-den (1970), a larger-scale Russian co-production Dersu Uzala (1975) an epic tale of adventure in turn-of-the-century Siberia and , with the help of admirers Francis Ford Coppola and George Lucas, the samurai tale Kagemusha (1980), which Kurosawa described as a dry run for Ran (1985), an epic adaptation of Shakespeare's \"King Lear\" . He continued to work into his eighties with the more personal Akira Kurosawa's Dreams (1990), and Madadayo (1993) and Rhapsody in August . Kurosawa's films have always been more popular in the West than in his native Japan, where reviewers have viewed his adaptations of Western genres and authors with suspicion , but he's revered by American and European film-makers, one of his least well-known films but most agreeable pictures is The Bad Sleep Well , a transposition of an Ed McBain detective novel , being remade many his pictures such as The seven samurais (1954), as The magnificent seven (1960),The Hidden Fortress (1958), as Star Wars (1977)as Yojimbo (1961) as For a fistful of dollars by Sergio Leone (1964), in fact Kurosawa's style was the biggest single influence on the Spaghetti Western sub-genre ; as his Samurai 'Western's were copied not only in America but also in Italy . Rating : 7.7/10 . Better than average . Well worth watching ."},{"username":"TxMike","userUrl":"https://www.imdb.com/user/ur0438066","reviewLink":"https://www.imdb.com/review/rw0053410","warningSpoilers":false,"date":"8 January 2004","rate":"","helpful":"10 out of 31 found this helpful.","title":"Good movie, mixes comedy with drama, but I fail to see why so many consider it great.","content":"My public library system has been bolstering its collection of 'classic' movies on DVD, and viewing this one is part of my quest to see all the 'great' movies on lists like the AFI Top 100. 'Seven Samurai' is not on the AFI list, but is #1 on many lists of foreign films. So it was with great anticipation that I set aside 3.5 hours on this rainy Thursday, fighting off a sinus cold, to see it. I did, and while I consider it a very fine movie in some respects, in others I found it to be quite ordinary and slow. Maybe part of it is a cultural thing. The movie is very long in part to accommodate character development, and to tell the story in three parts -- finding the Samurai to protect the defenseless farming village, planning the defense and training villagers, then the actual battles. The 17th century Japanese samurai culture is so far removed from what interests me, I had some difficulty being attentive for 3.5 hours. Plus, while I can enjoy some B&W movies, an epic one like this just suffers so much. Many times it was hard to tell the villagers from the samurai from the enemies, especially in dark scenes. To me 'Seven Samurai' appears to be given far too much reverence by fans of 'classic' movies.The critic Berardinelli has a very nice review of the entire movie, however I don't share his high rating of it."},{"username":"Quinoa1984","userUrl":"https://www.imdb.com/user/ur0453068","reviewLink":"https://www.imdb.com/review/rw0053406","warningSpoilers":false,"date":"7 December 2003","rate":"10","helpful":"146 out of 191 found this helpful.","title":"Kurosawa's triumphant epic- totally & successfully driven by character and story","content":"Akira Kurosawa was and is considered the master of east-western film-making (in that he made his Japanese films accessible for fans of American westerns while still making the movies his country found popular), and out of the few Kurosawa movies I've had the pleasure of viewing (Hidden Fortress, Rashomon, and this) I'd have to say that while Rashomon is still my favorite, I nevertheless had a blast during this one. The story has become quite influential to filmmakers from the likes of John Sturges (The Magnificent Seven) to John Lasseter (A Bug's Life): a small village has been terrorized by bandits for far too long, amid times of civil war in the nation, and so on the advice of Grand-Dad, they decide to hire four - which soon becomes seven - samurai for the job. There's no money, just food and honor, even though the village isn't exactly pleased to have samurai back in their village. Each character is drawn and executed compellingly, though for my money Toshiro Mifune proves why he became one of Japan's most notorious film actors. His work as the brave, bold outcast of the seven is awe-inspiring practically all the way through, like the hero of a western that anyone can root for since he's a true rebel at heart within a group of men with a task at hand. Kurosawa directs his tale and main and supporting players like a grand composer, orchestrating a vivid story and extracting from great actors like Takashi Shimura (the old, wise Samurai), Ko Kimura (the disciple Samurai), Daisuke Kato (Schichiroji), and Mifune (Kikuchiyo, which isn't his real name) just the right touches of humanity, humor, tragedy, romance, and intensity. The overall intensity, by the way, isn't over-estimated; its long length (almost 3 1/2 hours) isn't distracting in the slightest since Kurosawa's editing and photography (the later helmed by Asakazu Nakai) are extraordinary. Not to compare the two films, but one thing I saw in common with Seven Samurai and a Lord of the Rings film is that, if anything else, it definitely isn't a boring experience. Along with a score by Fumio Hayasaka that gives the film just a bit more of a pulse, and a showdown that is relentless with excitement, this is one of the must-see action films for film buffs, or anyone with an serious interest in having fun with an epic."},{"username":"tedg","userUrl":"https://www.imdb.com/user/ur0643062","reviewLink":"https://www.imdb.com/review/rw0053206","warningSpoilers":true,"date":"27 November 2001","rate":"","helpful":"26 out of 50 found this helpful.","title":"A Solid Defense of Art","content":"Spoilers herein.We are all villagers through whose small world great artists pass.This is so clean, so effortless -- the originality is hard to appreciate because so much has been absorbed into the vernacular, but it still amazes. My idea of genius is when someone can show you something you have never seen, but show it to you in such a way that you believe you knew it all along.This is a work of genius."},{"username":"lastliberal","userUrl":"https://www.imdb.com/user/ur2171244","reviewLink":"https://www.imdb.com/review/rw1881469","warningSpoilers":false,"date":"27 May 2008","rate":"9","helpful":"0 out of 2 found this helpful.","title":"An action movie dream","content":"You just can't add enough praise for Akira Kurosawa and for this film. It is a cinematic masterpiece that affects many movies made since. It certainly is one of the greatest of all times.Everyone is familiar with the approaching band of riders coming into view as they crest a hilltop. This is the first film in which it was used.This is the first modern action movie. Certain elements in this movie are banded together for the first time by Kurosawa to produce a film that is brilliant in it's cinematography and costuming and sets.Sure, it's long at over three hours, but that gives us time to really get to know the characters and feel pain when they die. Unlike it's successor, The Magnificent Seven, the motivations of the samurai are not clear, and we are left to surmise why they would take a job that pays nothing. That is the magic of this film.It certainly belongs in the queue of anyone that calls themselves a movie lover."},{"username":"view_and_review","userUrl":"https://www.imdb.com/user/ur3670492","reviewLink":"https://www.imdb.com/review/rw4384480","warningSpoilers":false,"date":"8 October 2018","rate":"8","helpful":"1 out of 2 found this helpful.","title":"Self-Sacrificing Samurai","content":"When some lowly farmers in 16th century feudal Japan decide to protect their tiny village from bandits they set out to find some samurais that can help them. They set out for four and are convinced that they need at least seven. With nothing to offer but rice and a place to sleep they needed to find samurais that were willing to fight for the sake of fighting or fight for the honorable cause of helping the little guy.This movie was incredibly long but marvelous. At roughly three and a half hours it is long enough for two movies. Even as good as it was I needed three intermissions to finish it. This is not to say that the movie was boring I just needed a break. The performances were good as far as I could tell being an American judging Japanese actors. Who doesn't like a tale of self-sacrifice to help the downtrodden?"},{"username":"Boba_Fett1138","userUrl":"https://www.imdb.com/user/ur1416505","reviewLink":"https://www.imdb.com/review/rw1099217","warningSpoilers":false,"date":"9 June 2005","rate":"9","helpful":"1 out of 4 found this helpful.","title":"Great action movie driven by its story and characters.","content":"This is the movie that set the standards for future action movies. It perfectly mixes all the action movie elements we are familiar with these this days in movies.But still its not the action I'll remember this movie by. I'll remember the movie for its wonderful and heroic story and top-notch characters. For me it truly were the characters that made the movie. Every characters has its own fun strong personality. My personal favorite character was Kyuzo played by Seiji Miyaguchi, he simply is one of those characters I always love in movies. Heroic, extremely specialized, without fear and many emotions but he doesn't have a prominent role or many lines. For some odd reason he really reminded me of Capt. Speirs from \"Band of Brothters\".The cinematography and editing are good. Even though the movie is almost three and a halve hour long, it doesn't feel like it, due to a pleasant pace and story that never gets dull even though there are some slow moments in the movie, I mean basically it isn't until the ending till the first real action starts.Also impressive are the costumes and the set decoration. The nice little musical score suits the movie well and is only used in the right places. The final showdown also ain't a disappointment although the sword fights and all are pretty lame, especially compared to movies made present day of course.A highly enjoyable action movie with heroic characters and a wonderful story, with multiple layers in it.9/10http://bobafett1138.blogspot.com/"},{"username":"TBJCSKCNRRQTreviews","userUrl":"https://www.imdb.com/user/ur2093818","reviewLink":"https://www.imdb.com/review/rw0961054","warningSpoilers":false,"date":"12 November 2004","rate":"9","helpful":"3 out of 8 found this helpful.","title":"An amazing piece of film, but the length alone will discourage many possible viewers","content":"I haven't seen any of Akira Kurosawa's other films, but I hear that this is his best, so maybe that's a good place to start(and maybe not). From the very first frame I was captivated by this film, and very interested in it. Then after about five minutes of watching, I realized how slow it was moving; \"Fine,\" I thought, \"it'll probably pick up later on\". But it didn't. The film stays in the same uncompromisingly slow pace for the entire runtime which is about three hours(more or less, depending on which cut/version you see). That's OK, don't get me wrong, but it brings the movie down. The film is epic, and truly astounding. It's a shame that it's so long and slow. The plot is great. The acting is very good, and great in some cases(for the most part, actually). The film contains a multitude of interesting, well-developed characters... but maybe that's part of the problem; there are too many of them. By the end of the film, I found myself being able to keep up with who was who, and as the credits came on, I couldn't really remember any of the names(though that may have something to do with them being in Japanese). The film has plenty of good dialog, though several of the characters spout lines that sound like they come from fortune cookies, but given just a little thought, they are quite profound. The film is called the first actual action film, due to the use of many plot points that have later ended up being clichés. The film has so much going for it, but at the end, I found myself barely paying attention. Maybe the film is too long for its own good... maybe I have a too short attention spam to fully enjoy the film(which is said to be a masterpiece, which I definitely won't argue with)... I don't know. In the end, after carefully going over all of the pros and cons of the film, I find myself rating it a nearly perfect 9/10. Too many low points to it to merit a perfect 10, but far too many high points to rate it any lower, even if I didn't particularly care for the last part of the movie(which probably has more to do with my attention spam than the content of that part of the movie). The cinematography is excellent. The film is very, very well-done overall, but seems a little too long and slow, and is hurt(in any other part of the world) by the very obvious Japanese culture/nature of the film, which is a little hard to accept, especially for us Westerners. It is a great film, though, and I can't argue with its placement on the top 250 best films of all time here on IMDb(it's #5 as I'm writing this). As a final note; to anyone out there who want to see the movie but are worried about violent content: everything is only implied. Much like Hitchcock, Kurosawa obviously realized the effect of only implying violence, and as a result, most people can watch the film. Most people will probably enjoy (at least) parts of it, but I fear few will watch the whole thing through. Since I barely did so myself, I can't really say anything to keep you watching all the way through to the end; but I will say that the film is visually impressive, contains some great acting, some humane and credible characters that the audience will be able to sympathize and identify with. I recommend the film to just about anyone who is interested in watching it. However, if there are action/Samurai fans out there, craving for fight scenes and Katana action, I will say this; Look elsewhere. This has very little of such, and what there is, is only implied. Watch this movie, but watch it for the drama, not the hope of fight scenes. 9/10"},{"username":"evanston_dad","userUrl":"https://www.imdb.com/user/ur4532636","reviewLink":"https://www.imdb.com/review/rw1448252","warningSpoilers":false,"date":"14 August 2006","rate":"10","helpful":"14 out of 29 found this helpful.","title":"There's Not One Thing Wrong with This Film","content":"If you think a three-hour Japanese movie from the mid-50s about an ancient time in history sounds like one big snoozer, you'd be right. It SOUNDS like a snoozer. But just sit down to watch this film, and you'll realize how wrong you are. \"Seven Samurai\" is one of the most exciting, suspenseful films I've ever seen, and the running time passed so quickly that I wasn't even ready for the film to be over. I've watched T.V. sitcoms that felt longer.Akira Kurosawa displays utter mastery of every aspect of cinema. There's not a flaw in this film: it's flawlessly acted, paced, edited, composed, scored. It's an action film for thinking people, one that more than holds its own against any movie released today.Astoundingly good.Grade: A+"},{"username":"Uriah43","userUrl":"https://www.imdb.com/user/ur36357573","reviewLink":"https://www.imdb.com/review/rw2816945","warningSpoilers":false,"date":"20 June 2013","rate":"8","helpful":"1 out of 1 found this helpful.","title":"One of the Best Films Ever Made in Japan","content":"At about the same time as the St. Bartholomew's Day Massacre in France (1572) a civil war has broken out in Japan which has spread chaos throughout that country. Because of the turbulence, brigands roam the land raping and pillaging along the way. Having already lost their summer crop of rice to them, a small village has learned that the same band of brigands are planning to return once their winter barley has ripened. Without this crop of barley to sustain them the people in the village will starve to death. Realizing that they are no match against this group of bandits the people go to the village patriarch and ask him what they should to do. He tells them to hire some samurai to protect the village. Unfortunately, they have very little to offer other than a small amount of food. So the village patriarch tells them to find some \"hungry samurai\". With that advice a few of the farmers venture out of their village hoping to find a few samurai who might be willing to help them out. As luck would have it they manage to find one particularly wise samurai named \"Kambei Shimada\" (Takashi Shimura) who not only agrees to help them but he also recruits 5 more samurai of exceptional talent to join their cause. Additionally, another warrior named \"Kikuchiyo\" (Toshiro Mifune) follows them even though he was initially rejected by Kambei. As a result there are now seven samurai who agree to fight for the village--against 40 brigands. Anyway, rather than spoiling the movie for those who haven't seen it I will just say that this is perhaps one of the best films ever made in Japan. Be advised though that it is a bit long (141 minutes) and the acting is more than a little overly dramatic in the typical Japanese fashion. But there is plenty of action and humor along with a depth that is seldom seen in motion pictures. Not only was it nominated for 2 Academy Awards but it was also remade 6 years later into a western movie known as \"The Magnificent Seven\". Highly recommended to those who enjoy classic films from around the world."},{"username":"morrison-dylan-fan","userUrl":"https://www.imdb.com/user/ur5424352","reviewLink":"https://www.imdb.com/review/rw6994539","warningSpoilers":true,"date":"3 June 2021","rate":"9","helpful":"1 out of 2 found this helpful.","title":"\"This is the nature of war:By protecting others you save yourself,if you think of yourself, you'll only destroy yourself.\"","content":"Along with Rashomon (1950-also reviewed) this is the title that I was aware of by auteur film maker Akira Kurosawa, but had never got round to viewing. Watching the first 14 movies Kurosawa directed in a row,I got set to finally meet each samurai.View on the film:Spanning across two disc, Criterion present a pristine transfer,with the film being supported by two detailed audio commentaries,and a third DVD packed with interviews.Spreading the 148 shooting days across the entire year,with the studio fearing a disaster as production went four times over the original budget on what would become the title with the longest run time to come from the film maker, editor/ co-writer/(with regular collaborators of this era Shinobu Hashimoto & Hideo Oguni) directing auteur Akira Kurosawa reunites with cinematographer Asakazu Nakai and lays out the battleground canvas in long panning shots across the farmland.Charging to a superb score from regular composer Fumio Hayasaka, (the last completed score for a Kurosawa movie he would do,before dying of tuberculous in 1955 at 41 years old) Kurosawa continues to build on the experimentation with light that had been ignited in Rashomon, via reflecting shards of light across the samurai in the heat of battle,which gets whipped by rain hitting them like a sword through the heart.Binding each of the loner ronin together, Kurosawa expands on his sharp eye for depth of field, with ultra-stylised dolly shots and delicately composed tracking shots unveiling an immerse atmosphere which glides the audience deep into the village, that is burnt down by Kurosawa's excellent, distinctive screen-wipes slicing into the bond of the seven, leading to a poetic, Pyrrhic final shot.Detailed by Kenneth Turan in the Criterion booklet that the title was written in 6 weeks, with Kurosawa banning co-writers Hashimoto and Oguni from taking any phone calls or having visitors come round their homes until the script was completed, the writers have the destruction from war (a major theme in Kurosawa's work) hang in the air,as the dialogue becomes increasingly brittle from each battle that opens new wounds in the samurai's.Wandering the land with no direction home, the writers match up the moral code of each samurai with new personal power from their new responsibilities which becomes an armor, that gets hammered from each battle, where their aggressive behavior poisons their relationship with the locals and grinding down the moral line of separation between the samurai and the bandits, until their decades-held code of loyalty is left as a pile of ashes on the hills.Spinning across the battlefield like a rabid Tasmanian Devil, Toshiro Mifune gives a fantastic performance as samurai Kikuchiyo, who coming from a poor farming family, carries an anguished aware of the decay seeping in, but is unable to turn away,from charging in with the magnificent seven samurai."},{"username":"zetes","userUrl":"https://www.imdb.com/user/ur0391152","reviewLink":"https://www.imdb.com/review/rw0053279","warningSpoilers":false,"date":"8 April 2000","rate":"9","helpful":"4 out of 12 found this helpful.","title":"Great Film, but I think Kurosawa did better","content":"Watching this film for over 3 hours, I felt excited every step of the way. I thought the situation was interesting, the characters were interesting, the acting was spectacular, and the action to be very intelligently crafted. But I felt there were some small problems, as well. The characters' names were rarely spoken, so it became easier to mix some of the characters up as the film progressed. Especially, I thought two of the samurai looked very like each other (and the person with whom I was watching this film had the same problem, so it's not just me).Also, I don't think this film belongs within the top ten of anyone's list. It is very well directed and executed, but it has no profundity. After I was done watching it, I put it away, went to my room, and thought very little about it. A great film leads to pondering. I think Kurosawa's _Rashomon_ and, even moreso, _Ran_ contained a lot more depth. Also, Japan has produced many, many very thoughtful and powerful animated films such as _Princess Mononoke_ and _Grave of the Fireflies_. _The Seven Samurai_ is a great film, but I would hesitate to call it a masterpiece."}],"errorMessage":""}