{"imDbId":"tt0080684","title":"Star Wars: Episode V - The Empire Strikes Back","fullTitle":"Star Wars: Episode V - The Empire Strikes Back (1980)","type":"Movie","year":"1980","items":[{"username":"TheLittleSongbird","userUrl":"https://www.imdb.com/user/ur20552756","reviewLink":"https://www.imdb.com/review/rw2165784","warningSpoilers":false,"date":"29 November 2009","rate":"10","helpful":"21 out of 28 found this helpful.","title":"Manages to be even better than New Hope, and that was just as brilliant","content":"The original trilogy of Star Wars contain three films, all of which are sophisticated, imaginative and enormous fun. I feared it wouldn't be my thing, but it was exactly that. I loved the original trilogy for all those reasons. Empire Strikes Back maintains all the fun of its predecessor, while even darker and more mature. Visually it's a marvel to look at, with the stunning special effects and highly imaginative-looking sets. John Williams's score is just outstanding, epic and monumental in every way. The story is darker than that of New Hope and perhaps more sophisticated, and I loved the fact the filmmakers made the romance between Leia and Han more developed. The battle sequences are mesmerising, the beginning is bound to have you on the edge of your seat, but the battle between Luke and Darth Vader was simply out of this world. The script is still as affectionate as ever, the pace is fast and the acting is great. Mark Hamill is ever as likable as Luke, and Carrie Fisher still has her spunk and vivacity. Harrison Ford is noticeably more subdued, but he is still terrific, and Frank Oz is a perfect Yoda. Chewabacca is hilarious, and Darth Vader is a fantastic villain, especially when voiced so magnificently by James Earl Jones. All in all, a perfect successor to an already brilliant first film. 10/10 Bethany Cox"},{"username":"bkoganbing","userUrl":"https://www.imdb.com/user/ur2483625","reviewLink":"https://www.imdb.com/review/rw2315025","warningSpoilers":false,"date":"24 September 2010","rate":"9","helpful":"3 out of 7 found this helpful.","title":"Exile To Hoth","content":"Though the intrepid three heroes of Star Wars destroyed the Death Star commanded by Darth Vader, the rebel army is still on the run. They've taken refuge in a frozen planet called Hoth much like George Washington and the Continental Army at Valley Forge. In the meantime the Empire still searches for the rebel army in The Empire Strikes Back.When the attack comes, it comes full force, the rebels flee as do Luke Skywalker and R2D2 in one ship and Princess Leia, Han Solo, Chewbacca and C3PO. Mark Hamill as Luke Skywalker is given a mission in a dream by the late Alec Guinness, killed in the first Star Wars film to receive Jedi Knight Advanced Training from the legendary Yoda and he seeks him out. Harrison Ford and Carrie Fisher and company seek out Ford's old friend Lando Kalrissian to repair his ship after Ford plays a dangerous cat and mouse game with Darth Vader's battle cruiser.As Lando Kalrissian, Billy Dee Williams steps into the Star Wars pantheon of heroes and proves quite useful if not quite on the up and up. George Lucas continues his tradition of writing about futuristic Homeric like heroes in a galaxy far away. And as cinema, The Empire Strikes Back continues the quality of excellence that the original set. Looks like the Force is definitely with George Lucas."},{"username":"Michael_Elliott","userUrl":"https://www.imdb.com/user/ur13134536","reviewLink":"https://www.imdb.com/review/rw3375707","warningSpoilers":false,"date":"19 December 2015","rate":"","helpful":"5 out of 8 found this helpful.","title":"A Bigger and To Some Better Sequel","content":"The Empire Strikes Back (1980) **** (out of 4)The second film of the original trilogy has the Empire forcing their vengeance as Luke Skywalker (Mark Hamill) begins his Jedi training with Yoda while Hans Solo (Harrison Ford), Princess Leia (Carrie Fisher), Chewbacca and the gang try to get to Darth Vadar.George Lucas directed the original STAR WARS in 1977, which was a tremendous hit with both fans and critics. He basically took a \"B\" movie idea, something you'd see at a Saturday matinée and made it into a high-quality picture. This sequel had Lucas turning the directing duties over to Irvin Kershner and the end result certainly raises it to an \"A\" movie and one that many fans believe is the greatest of the series. I'm not going to lie, I somewhat enjoy the original a tad bit more but that's not to say this is a bad movie. Far from that.What's rather amazing is the fact that the producers, director and screenwriters simply could have given us the same film again but instead they decided to make it much bigger, more darker and I'd argue they really wanted to blow the original out of the water. The film once again benefits from some terrific special effects, a rousing score from John Williams and there's no question that visually the film is a lot more impressive than the original.You've also got the cast back together with both Hamill and Fisher once again delivering the goods but also Billy Dee Williams and Alec Guinness in a bit part. Once again it's Harrison Ford who easily steals the film with his comic timing and just that hero persona that shines through. Plus, it's just magic seeing him and Chewbacca work together.THE EMPIRE STRIKES BACK is considered one of the greatest science fiction movies ever made and it's hard to argue with that."},{"username":"SnoopyStyle","userUrl":"https://www.imdb.com/user/ur2898520","reviewLink":"https://www.imdb.com/review/rw3464781","warningSpoilers":false,"date":"6 May 2016","rate":"10","helpful":"9 out of 12 found this helpful.","title":"Best Star Wars FILM","content":"After the destruction of the Death Star, the Rebel Alliance has been hounded by the Empire. Princess Leia, Luke Skywalker, and Han Solo are with the Rebel forces on the secret base on the planet Hoth. Darth Vader locates the base driving the rebels on the run. Leia, Chewie, and Han with C-3PO escape on the Millennium Falcon eventually ending up in Lando Calrissian's Cloud City. Meanwhile, Luke goes to the Dagobah system and finds Jedi Master Yoda.There are superior popcorn movies in the Star Wars franchise although there is plenty of eye-popping action in this one. This is the best overall film in the series. The dialog is snappier. The combative romance between Leia and Han is the best. Everything looks great. It introduces Yoda and Lando. There are great legendary twists. It is a Star Wars movie for film fans. Even the Special Edition is the best of the original trio. There may be one or two stiff additions but most of them actually help. There are so many incredible moments in this."},{"username":"Kirpianuscus","userUrl":"https://www.imdb.com/user/ur61197531","reviewLink":"https://www.imdb.com/review/rw3342760","warningSpoilers":false,"date":"25 October 2015","rate":"","helpful":"0 out of 2 found this helpful.","title":"dark. and useful","content":"one of the films from series who gives not only a good show but a special key for discover heart of the story. dark. and precise in exploration of details. the presence of Yoda, the meeting between Darth Vader and Luke, the battle scenes and the evolution of the group's members are pieces of a large puzzle. a film who defines relationships and gives fascinating scenes. first definition of Force and dark side, inspired map for the status of Luke Skywalker, fascinating adventure and extraordinary scenes who preserve the elements of old fairy tales. short, a dark part. and useful trip in heart of a universe who defines popular culture."},{"username":"Horst_In_Translation","userUrl":"https://www.imdb.com/user/ur3914439","reviewLink":"https://www.imdb.com/review/rw3407937","warningSpoilers":true,"date":"3 February 2016","rate":"6","helpful":"7 out of 48 found this helpful.","title":"Okay movie, but not an epic","content":"\"Star Wars: Episode V - The Empire Strikes Back\" is the second film from the \"Star Wars\" franchise and the fifth in terms of chronology of the contents depicted in there. It was directed by Irvin Kershner over 35 years ago and had some success with the Academy Awards, even if not nearly as much as the first film. And I myself must say that I found it not better than the first (even if the IMDb rating says so), but also not much worse. Once again, it delivers especially on the visual side in terms of sets, cinematography and special effects while coming a bit short in terms of the story. The characters are all fairly memorable though, the humans and the others. There are many many characters that appeared in the first film already, for example Obi Wan Kenobi is even back for one scene, but there are also some interesting new additions, most of all the uber-famous Yoda. And Darth Vader is the main villain in here while being just one of several villains in the first film. A great light saber sequence is included here too.I said that I was not too overwhelmed by the story and that implies the plot as a whole, but also minor scenes and references. One example would be Calrissian's character obviously being totally scared of Vader for almost the entire film and then, completely out of nowhere, he suddenly has no fear anymore and joins the resistance fighters. Not very realistic character development. I also did not like the references in terms of mathematical probability early on. This makes it look really unrealistic that Skywalker survived or that Han Solo managed to control the spacecraft some time later.All in all, it was an okay watch at best and the film has several lengths, starts off nicely with the snow planet scenes, gets worse, but gains some momentum again towards the end. However, I believe that they could have done without roughly 20 minutes and kept this movie at 105 minutes instead of over two hours. You have to be very generous to appreciate this film as a whole as there were more than just a few weaknesses to it. Still, the good moments make somewhat up for it, even if the film never reached real greatness. Not once. Nonetheless, I will be generous and give it a cautious thumbs-up, especially for science fiction fans, which I am probably not really."},{"username":"claudio_carvalho","userUrl":"https://www.imdb.com/user/ur2488512","reviewLink":"https://www.imdb.com/review/rw3371066","warningSpoilers":false,"date":"13 December 2015","rate":"10","helpful":"17 out of 24 found this helpful.","title":"Fantastic Sequel","content":"The rebels' new base is hidden in the icy planet Hoth and Princess Leia (Carrie Fisher) commands a unit with Luke Skywalker (Mark Hamill), Han Solo (Harrison Ford) and Chewbacca (Peter Mayhew). During the investigation of a meteor crash, Luke is wounded and captured by a creature but succeeds to escape. While dying on the snow, he has a vision of Obi-Wan Kenobi telling him to go to the Dagobah system to be trained by the Jedi Master Yoda. Later he is saved by Han and they are rescued in the morning by the rebels. Meanwhile Darth Vader (David Prowse) sends probe droids through the galaxy to find the location of the base. The rebels are located and they need to leave the planet under the attack of the Imperial Fleet. However Luke heads to Dagobah to find Yoda while Leia, Han, Chewbacca and C-3PO travel to the planet Bespin to meet his friend Lando Calrissian (Billy Dee Williams) and repair the Millennium Falcon. However, they are betrayed by Lando and captured by Darth Vader. Meanwhile Luke has a premonition with his friends in danger and he decides to interrupt his training with Yoda to save them, despite the warning of Obi-Wan and Yoda. Will Luke be ready to face Darth Vader and save his friends? \"The Empire Strikes Back\", later retitled \"Star Wars: Episode V - The Empire Strikes Back\" is a fantastic sequel of Star Wars, with a great story. The plot has adventure, romance, comedy and betrayal and is engaging until the very end. The characters now are more experienced and bonded. The mannerisms of C-3PO recalls Dr. Smith, from \"Lost in Space\". This is the type of sequel that keeps the high quality of the original film. My vote is ten.Title (Brazil): \"O Império Contra-Ataca\" (\"The Empire Strikes Back\")"},{"username":"bob the moo","userUrl":"https://www.imdb.com/user/ur1002035","reviewLink":"https://www.imdb.com/review/rw0175328","warningSpoilers":false,"date":"27 June 2002","rate":"","helpful":"187 out of 229 found this helpful.","title":"All the fun of the original with a much better, darker plot","content":"The Rebellion has struck an important blow to the power of the Empire by destroying it's Death Star, however the power of the Dark Side of the Force remains strong and continues to hunt the rebellion. While the Rebellion base on Hoth is under treat, Luke has gone to a distant swamp planet to receive further Jedi training from Master Yoda. However the power of the dark side should not be underestimated and many dark truths are revealed as the threat of the Empire looms large.Following Star Wars was never going to be easy but this is actually better. Empire retains the same characters and the same sense of fun that the first had \u0096 the battle on Hoth is just one of THE moments of the series. However what gets added to that is a much darker strand. The Empire is not beaten by the destruction of one ship \u0096 it's power is barely dented in fact. This sees some startling revelations (I won't spoil it in case you've been living under a rock!) but also sees significant blows to the rebellion. In fact the ending of this film could not be more different from the end of Star Wars.Like the recent episode two this follows two strands \u0096 the more pedestrian scenes with Luke and Yoda and the more action based scenes with Han and company. The scenes with Yoda add depth to the film and hint at the truth. Meanwhile the other half is a lot more action orientated and has comedy and good new characters such as Bobba Fett. The two work well together and come together well for a great finale. The addition of a dark strand to the film makes it all the better as it can be enjoyed as a story and not just a fun sci-fi film with good effects.The characters are better here than the first. The strong characters from the first (Han, C3P0 et al) are all still good here. However we also get a much more interesting version of Luke as he continues his journey into becoming a full Jedi. Yoda is a good addition (despite sounding like Fozzie Bear!) and Darth Vader becomes a lot more than just a good villain \u0096 we learn his past, a revelation then, but a thing of common knowledge now.Overall this is as good as Star Wars at it's heart, but the darker nature of the film makes it much better. Where the first one was a victorious uprising this is, as the title suggests, the time in history where the Empire strikes back against the uprising. All the music, characters and things that make Star Wars Star Wars are here and it's simply one of the best of the series to date."},{"username":"classicsoncall","userUrl":"https://www.imdb.com/user/ur2707735","reviewLink":"https://www.imdb.com/review/rw1670428","warningSpoilers":true,"date":"8 June 2007","rate":"10","helpful":"5 out of 8 found this helpful.","title":"\"No! Try not. Do. Or do not. There is no try.\"","content":"The summary line is one of my favorite movie quotes of all time because it embodies a philosophy and a discipline. Whenever I hear someone say 'I'll try', I already know it's a cop out with no intention of getting involved with the task in question. Had George Lucas 'tried' to make the movie, it would never have gotten done. I guess that's why Yoda is my favorite Star Wars character. Yeah OK, he's a puppet, but the character of Yoda is like the Spock of the SW universe, a stabilizing force (Force?) who helps Luke remain grounded and in control of his emotions.I recall some disappointment the first time I saw this film during it's original theatrical release relative to the Han Solo cliffhanger, somehow I felt it took away from the structure I was looking for in the chapter following the original \"Star Wars\". Viewing it today I don't feel the same way. It dealt a momentary reprieve to the Han/Leia romance and allowed for analysis of the Darth/Luke relationship. Vader's attempt to shield his son from the Emperor by promising a turn to the Dark Side was ingeniously turned on it's head with Vader suggesting young Skywalker use his power to defeat the Emperor. The scene was cleverly done and Luke's response hinted at things to come in \"Return Of The Jedi\".My most recent viewing of this episode was only the third time since the original theatrical release, and I find that it hasn't lost any of it's impact, maintaining a vitality and excitement that time hasn't diminished. Watching the remastered DVD version, particularly with the sub titles, offers an entirely new perspective when you can pause and rewind to understand better what certain characters said. Perhaps that's why I found it a lot easier to keep track of the fine points of the story, place names like Hoth, Yavin and Bespin, and secondary characters like Governor Tarkin. All those subtle points add a more defined structure to the story, and helps one appreciate much more the intricacy of the universe created by George Lucas."},{"username":"lee_eisenberg","userUrl":"https://www.imdb.com/user/ur4888011","reviewLink":"https://www.imdb.com/review/rw1186395","warningSpoilers":false,"date":"4 October 2005","rate":"10","helpful":"3 out of 6 found this helpful.","title":"I guess that the Force will be with the original series forever!","content":"I don't know whether or not \"The Empire Strikes Back\" was better than \"Star Wars\" or not, but it's pretty much equally good. Since everyone knows the plot, I figure that I'll just talk about a few aspects. It's weird to think that Yoda was only introduced here; he's been such a central character in the series that it's easy to forget that he didn't star in Episode 4! In some ways, watching \"TESB\", you get the feeling that the people behind the scenes realized how lucky the series was making them, and so they decided to go all out. And they do just that. They played it to good effect here (I personally thought that \"Return of the Jedi\" overdid it a little). But anyway, the Force is with this movie from start to finish!"},{"username":"gavin6942","userUrl":"https://www.imdb.com/user/ur1234929","reviewLink":"https://www.imdb.com/review/rw2232674","warningSpoilers":false,"date":"7 April 2010","rate":"9","helpful":"3 out of 5 found this helpful.","title":"The Way Star Wars Was Meant To Be","content":"Any comments here refer to the theatrical release, not the pile of rubbish known as the special edition. Rick McCollum should be tracked down and given a good kick in the pants.In your epic battles of good and evil, \"Empire Strikes Back\" pretty much takes the cake. We have everything here -- characters with depth, tragedy, romance, adventure... aliens that are believable. It has become cliché to compare \"Star Wars\" to \"Lord of the Rings\", and that's not entirely unfair... but, really, \"Star Wars\" is better and \"Empire Strikes Back\" is the best.As Dante Hicks says in \"Clerks\", this film is the best because it imitates life, \"a series of down endings\". Sometimes life is better than that, but it's often not. And whereas most movies want happiness, this one put Luke and Han in a bunch of bad situations with no hope of escaping unscathed. That's what makes this fantasy very much reality."},{"username":"jboothmillard","userUrl":"https://www.imdb.com/user/ur4248714","reviewLink":"https://www.imdb.com/review/rw1032832","warningSpoilers":true,"date":"4 March 2005","rate":"10","helpful":"3 out of 9 found this helpful.","title":"Star Wars: Episode V - The Empire Strikes Back","content":"One of the best film sequels ever made (along with The Godfather, Part II and Terminator 2), this is the second part to great original trilogy, and saga, from writer/creator George Lucas and director Irvin Kershner. \"A long time ago, in a galaxy far, far away\" on the ice world of Hoth, Luke Skywalker (Mark Hamill) is investigating possible Empire activity, only to be attacked by a snow monster. He manages to escape with the help of the Force and his light sabre, but he is still stuck in the blizzard, and before going unconscious and being rescued by Han Solo (Harrison Ford), he sees a vision of Ben (Obi-Wan) Kenobi (Sir Alec Guinness) telling him to go to the Degobah system and find Jedi master Yoda. So after a quick battle between the Rebels and the Empire, Luke, with R2-D2 (Kenny Baker) heads to this planet, and eventually he finds Yoda (a Muppet style creature voiced and performed by Muppet member Frank Oz, aka Miss Piggy and Fozzie Bear), and they start training. Meanwhile, Han, Princess Leia (Carrie Fisher), Chewbacca (Peter Mayhew) and C-3PO (Anthony Daniels) are in the Millennium Falcon, pursued by the Empire (because of a tracking device), and hide for a while in what they thought was the inside of a near meteor, but it was in fact the belly of a giant worm alien. When they do get out, they head for their destination to fix the ship, the planet Bespin, where they are greeted by Han's old shifty gambler friend (and original Millennium Falcon owner), Lando Calrissian (Billy Dee Williams). But what they didn't know is that Darth Vader (acted by David Prowse, voiced by James Earl Jones) and the stormtroopers arrived before them, and they are the bait of Vader's trap to get Luke, who he has become obsessed with finding. As a prize for finding them, Han Solo is frozen in carbonate and (when confirmed he is alive) is give to bounty hunter Boba Fett (Jeremy Bulloch) to be delivered to crime lord Jabba the Hutt (who you saw in the first film). Eventually, Luke does land on the planet, and he and Darth have a long and exciting light sabre fight, while Leih's gang escape in the Millennium Falcon. The pinnacle twist and great quote of the film is, after cutting Luke's hand off, Darth Vader revealing the truth about his father's death, he says \"I am your father!\" After this he is eventually rescued, has his hand replaced, and Lando and Chewbacca fly away in the Millennium Falcon, a more more obvious 'to be continued' moment. Also starring Julian Glover as General Veers. It won the Oscar for Best Sound, and it was nominated for Best Art Direction-Set Decoration, Best Music for John Williams and a Special Achievement Award (for visual effects), it won the BAFTA for Best Original Film Music for John Williams, and it was nominated for Best Production Design/Art Direction and Best Sound, and it was nominated the Golden Globe for Best Original Score. Star Wars was number 24 on The 100 Greatest Pop Culture Icons, the film was number 67 on The Ultimate Film, and along with the Episode IV: A New Hope, both were number 1 on The 100 Greatest Films. Outstanding!"},{"username":"ccthemovieman-1","userUrl":"https://www.imdb.com/user/ur4445210","reviewLink":"https://www.imdb.com/review/rw1389976","warningSpoilers":false,"date":"10 June 2006","rate":"9","helpful":"41 out of 84 found this helpful.","title":"Big Improvement Over The First Star Wars","content":"Although called \"Episode V,\" this was second movie in the Star Wars 6-part installment and I've always thought one of the better entries in the series.If you watch the first Star Wars and then this one, you'll immediately see a vast improvement in the special-effects department. There is a much more polished look to this one, and improved sound In fact, the DVD transfer is outstanding considering the age of this film.While the first Star Wars was a bit subdued, this one picks up the action right from the start, although lulls are really appreciated because the first 40 minutes are pretty hectic. The most notable of those scenes are the gigantic robots which were awesome when this film first came out, and are still pretty good. The movie calms down after that opening land war but retains the viewer's interest with other things.The second half of the movie features two stories going on at once: the battle in space with most of the cast involved, and \"Luke Skywalker (Mark Hamill) in a swampland involved in his training sessions with the Master Yoda.Some of the movie's dialog is still corny, especially between Han Solo (Harrison Ford) and Princess Leia (Carrie Fisher) with their love-hate relationship, but it's not overdone. What is overdone is constant bleating noises emanating from \"Chewbacca,\" the wookie. That sheep-in-heat noise can get annoying after awhile. The \"Rambo\" action continues as it did in the first film, with the villains firing everything at our heroes and never hitting them. Ludicrous, but part of the deal. Those things you just put up with as the film, overall, delivers another interesting adventure, far more than the first Star Wars and leading up to the next one, which was even better."},{"username":"Tweekums","userUrl":"https://www.imdb.com/user/ur13977076","reviewLink":"https://www.imdb.com/review/rw1957117","warningSpoilers":true,"date":"7 October 2008","rate":"10","helpful":"3 out of 5 found this helpful.","title":"The best of the six","content":"Like most children who loved Star wars when it was first released I looked forward to the next big screen instalment of the saga. I was not disappointed. The action started almost immediately and keeps up throughout the film till the climactic light sabre battle. We are also introduced to the new interesting characters Yoda, Lando and the Emperor himself.As the film begins the rebels are on the run, hiding on the barren ice planet of Hoth and the empire is dispatching droids to search the galaxy for them. One lands not far from Luke and he sets off to investigate but before he can get far he is attacked by a yeti-like creature which drags him off to an ice cave. Luke manages to escape but it is too late for him to get back to the base and it looks like he might freeze to death. Luckily for him Han is out searching for him and eventually finds him just after he has a vision of his old friend Obi-Wan Kenobi who tells him to seek a Jedi master called Yoda on the planet Dagobah. Once back at the base the soon learn that the Empire has discovered where they are and start to evacuate. While this is occurring they must hold off an attack by imperial walkers which are attempting to destroy the shield protecting the base. Eventually the base falls but not before our heroes can escape.At this point the action splits, Luke and R2 fly to Dagobah and Han, Chewie, Princess Leah and C3PO flee in the Millennium Falcon. When Luke arrives on Dagobah he discovers the planet is one huge swamp into which his X-wing sinks. He and R2 soon find a strange creature who says that he can take them to Yoda, of course it turns out that he is Yoda, after some persuasion he begins to train Luke. Meanwhile back on the Falcon things aren't going according to plan; when ambushed by imperial star destroyers they discover that the hyper-drive isn't working so must hide in a dangerous asteroid field. Flying into cave on one of the larger asteroids the attacked by strange creatures that feed on the ships power cables, when they go outside to remove them they discover that the cave itself isn't what they thought it to be so must flee once more into the path of the imperial forces. Being a crafty pilot Han manages to escape from them but is pursued by the bounty hunter Boba Fett.Needing repairs they head to Cloud City in the nearby Bespin system. Here they are met by Han's old friend Lando Calrissian who offers to help them. Unfortunately for them Darth Vader got there sooner and made a deal with Lando. Meanwhile Luke has a vision that his friends are in danger and ends his training early to go and help, despite Yoda's warning that he is at risk from the dark side of the force and could make things worse. When he gets there he confronts Vader who tells him something that goes against everything he thought to be true... in the very unlikely event that you don't know already I'll avoid spoiling it.Like the original film this is full of excellent special effects but isn't swamped with excessive CGI like the more recent prequels. The acting and direction are both pretty good. Being the middle act of the original trilogy it is much darker in tone than the first film and the ending can hardly be called happy. I'd certainly recommend this film to anybody regardless of their age, it is one of the few sequels to improve on the first film of its series."},{"username":"paul_haakonsen","userUrl":"https://www.imdb.com/user/ur22654354","reviewLink":"https://www.imdb.com/review/rw3384626","warningSpoilers":false,"date":"31 December 2015","rate":"10","helpful":"1 out of 2 found this helpful.","title":"The embodiment of Star Wars...","content":"In many ways \"Star Wars: Episode V - The Empire Strikes Back\" is the best and most outstanding of all the movies in the \"Star Wars\" franchise. There is just something epic and very impressive about the story and presentation of the movie.The entire battle of Hoth has left a very lasting impression on me and it captures the struggle of the Rebellion against the Empire very well, and it is filmed in such a manner that it feels like you are right there on the snow-clad battlefield yourself.It really is unnecessary to say how well the cast performed in the movie. But once again, all actors and actresses did prove how perfectly cast they were in this original trilogy.The storyline in \"Star Wars: Episode V - The Empire Strikes Back\" is very entertaining from start to end, and it has many different aspects and layers to it. And there really is something for everyone to be had in episode five of the \"Star Wars\" saga.Whether you are a fan of \"Star Wars\" or not then \"Star Wars: Episode V - The Empire Strikes Back\" is a movie that you just can't miss out on. And it is a movie that everyone is or should be familiar with."},{"username":"BA_Harrison","userUrl":"https://www.imdb.com/user/ur0945066","reviewLink":"https://www.imdb.com/review/rw1610681","warningSpoilers":false,"date":"3 March 2007","rate":"10","helpful":"11 out of 15 found this helpful.","title":"Why can't they make them like this any more?","content":"From it's opening scenes on the bleak ice-ball that is the planet Hoth, to its exciting finale on the cloud city of Bespin, The Empire Strikes back is a worthy sequel to the magnificent Star Wars. Taking over the directorial reins from George Lucas, Irvin Kershner steers the movie into darker territory to deliver a more mature movie than its predecessor.The Empire is still licking its wounds after the destruction of the Death Star, and evil Darth Vader is intent on finding the rebels responsible for destroying his new toy. Luke's aim, meanwhile, is to become a fully fledged Jedi knight, whilst Han sets himself a more difficult target: he plans on getting into Leia's knickers.With more incredible FX packed action scenes than you can shake a light-sabre at (highlights include the fantastic battle on Hoth, a chase scene through an asteroid field, and the Luke/Darth light-sabre duel), and THAT moment where we learn the truth about Luke's father, it's no surprise to find that this episode is often said to be the best of the series. Personally, A New Hope will always be my favourite (for sentimental reasons), but The Empire Strikes Back is a very close second."},{"username":"moonspinner55","userUrl":"https://www.imdb.com/user/ur0989035","reviewLink":"https://www.imdb.com/review/rw1842809","warningSpoilers":false,"date":"19 March 2008","rate":"6","helpful":"1 out of 15 found this helpful.","title":"Involved, occasionally rousing, but lacking spirit...","content":"The first sequel to 1977's \"Star Wars\" was so hotly anticipated, it sparked the whole trend of film-goers sleeping outside movie theaters in droves, waiting anxiously for the eventual release. Once the picture premiered, it didn't seem to matter to the faithful that it was missing the frisky spirit of \"Star Wars\", as well as a solid finish. Mark Hamill returns as Luke Skywalker, being educated by mystical Yoda and facing off against Darth Vader, who reveals an unanticipated secret. Irvin Kershner's direction is thoughtful--he brings to the action sequences a deep undercurrent of purpose--but he's also mechanical, perhaps spending too much time with Luke (who, due to a car accident suffered in real-life by Hamill, has a perplexed, dour appearance). Harrison Ford provides lots of old-fashioned charm, the special effects and music are wonderful, but the cliffhanger finale wasn't really fair (at the time, it felt like a slap in the face). Producer/creator George Lucas re-released this to theaters in 1997 with three extra minutes and a lofty title change. **1/2 from ****"},{"username":"TxMike","userUrl":"https://www.imdb.com/user/ur0438066","reviewLink":"https://www.imdb.com/review/rw0943055","warningSpoilers":false,"date":"7 October 2004","rate":"","helpful":"145 out of 188 found this helpful.","title":"A worthy second (or 5th??) Star Wars installment, might be the best of the bunch.","content":"My five children were all pre-teens when 'The Empire Strikes Back' came to the theater. While there had been other Sci-Fi movies with a theme of conflict in outer space, the 'Star Wars' trilogy filled our imaginations like no other movies before them. The fantastic, strange worlds were presented almost like we were there too. Aliens sitting around a tavern, enjoying drinks and speaking in all sorts of languages. Nothing before had approached the sheer size of the space ships depicted here, huge cities traveling all over the galaxy. And how about the jump to hyper speed, then disappearing from the screen as the speed exceeds light speed! And the light sabres of the Jedi Knights. The Jedi Knights, a striking parallel to the Japanese Samurai.It is fruitless trying to argue 'which is best' in a trilogy, because the first one, in this case 'Star Wars', starts it all and has to be the 'father'. However, an argument can be made that 'The Empire Strikes Back' (now on DVD called Episode V) is overall a better-made movie which has more excitement, and grabs your imagination,than the other two original installments (now called parts IV and VI). The DVDs finally came out last month, and they are near perfect, as we should expect from Lucas Films and THX. The bit rate is high, and the picture is nothing short of superb. As is the Dolby EX surround track. My wife and I watched all three of the movies on DVD this week -- Star Wars, Empire Strikes Back, and Return of the Jedi -- compliments of our local public library. It was an appropriate reminder how good these movies are, and still ahead of their time. Nothing else has been made to compare to them."},{"username":"Quinoa1984","userUrl":"https://www.imdb.com/user/ur0453068","reviewLink":"https://www.imdb.com/review/rw0175071","warningSpoilers":false,"date":"4 February 2000","rate":"10","helpful":"3 out of 9 found this helpful.","title":"One of the Best Films Ever Made!","content":"This 2nd (or fifth) enstallment in the Star Wars series I believe is the best one yet (and ever). The special effects are as good if not better than the first film and the characters are much better than in the first. Though George Lucas didn't direct this enstallment, I think that's good because it gives the chance for Irvin Kershner a chance to see what he can put on the screen for us to watch. And it is actually quite good. With a terrific soundtrack by John Williams, the character Yoda (voiced by Frank Oz who is my favorite puppetter ever beside Jim Henson) and a startling revelation (this is the film where we find out Darth Vader's secret), this film is a dark, enchanting and great movie experience."},{"username":"studioAT","userUrl":"https://www.imdb.com/user/ur23359813","reviewLink":"https://www.imdb.com/review/rw3356502","warningSpoilers":false,"date":"17 November 2015","rate":"7","helpful":"1 out of 4 found this helpful.","title":"And it strikes back with a bang","content":"Empire Strikes Back is widely called the best Star Wars film (to date) and it is clear to see why.It certainly contains lots of the iconic moments from the series and all the best lines. Hamill, Fisher and Ford all have eased into their lead roles and there is enough action for them all to be involved, even if after the first act they don't spend much time together.Whereas 'A New Hope' had a sluggish start this second film in the original trilogy opens with action and never really lets up after that. There are great fight scenes and technical effects that more than make up for the moments where it all gets a bit sci-fi jargon heavy.Is this the best Star Wars film, the one for future films to beat? Possibly."},{"username":"tedg","userUrl":"https://www.imdb.com/user/ur0643062","reviewLink":"https://www.imdb.com/review/rw1599630","warningSpoilers":false,"date":"15 February 2007","rate":"","helpful":"16 out of 28 found this helpful.","title":"The Son","content":"The SonI am convinced that movies are about other movies more than life. The original \"Star Wars\" was a success in my opinion because it had three things: \u0097 a collection of images from other films, distinctly referencing them. Some were film- schoolish like the Kurosawa quotes. But most were like what Kurosawa himself referenced: already deeply embedded visual touchstones, not having lost their power in becoming clichés. These were collected in one large form, the Flash Gordan form let's call it, which all of us slightly knew. It could be recalled with enough familiarity to register but not enough to set expectations, so Lucas could fill the bucket with whatever he found and liked.\u0097 a notion of a complete, understandable cosmology. Its the noir notion that laws of the universe exist and cannot be seen, and if they could they wouldn't be comprehensible. This notion is deep in film, so deep that when a movie comes along that posits a cosmology that is whole, and revealable, it shocks. What that movie did was give us enough of a glimpse into this to believe that we could understand the world, at least THIS world of the \"galaxy far away.\" Remember when that original came out? The images were impressible, but what people talked about wasn't what they saw, but about how the world worked. It settled first in an ersatz religion among geeky kids and now has been swallowed by the \"simple\" US religions, and its presidential representative.\u0097 the notion of a quest. Its an old form, but cast in the above noted situation, it takes new power. The traditional form, the Goethe-Lytton form was there to remind and reveal mysteries. Here it is clearer, to explain. There was a lowbrow professor at the time of a women's college that a TeeVee interviewer made popular. It was sort of a metaquest. This simple man said that we could actually understand the nature of trying to understand nature. It was a lucky break for Lucas, because it meshed with this shocking notion of a grand cosmology that we know our hero (check out the name: \"sky walker\") will grasp, master and show us.That was the first film. A huge success, just huge. It did change many things, but from my perspective the key thing was how it reset that great American invention of noir, as important as jazz, and liberty which form a sort of trilogy of contradictory, three-way tension.Okay. Now the second big Ted idea, the necessity for the equal size of steps in abstraction when you have two steps. It seems this is hardwired in the brain, a sort of human quantum mechanics. If you look back along the abstraction, say a cartoon in a cartoon, the distance between the two will be precisely the same as the surrounding cartoon.So, when they made the second Star Wars movie, they could reference the previous one in the way that it referenced its cinematic background. It had a writer in Kasden who knew how to do this. And it had a director in Lucas' film school teacher who did also. Neither had a huge hit other than this because it was such a cool setup, having such a thing to build on.You'll read lots about trying to humanize, and how faces were used. But all that is simply in the service of abstracting closer to us from the original, in equal portion. This is the son. Why did the franchise fail after this? Because there was no step left to abstract to and maintain the brand.(This comment is a replacement of one deleted for unknown reasons. This was requested by a reader.)Ted's Evaluation -- 3 of 3: Worth watching."},{"username":"hitchcockthelegend","userUrl":"https://www.imdb.com/user/ur16161013","reviewLink":"https://www.imdb.com/review/rw2044535","warningSpoilers":true,"date":"29 March 2009","rate":"10","helpful":"2 out of 5 found this helpful.","title":"It's a dark time for the rebellion; and us the audience as well.","content":"Luke, Leia and Han are fighting with the rebels in the hope of defeating the Imperial forces. But Luke gets a calling to the planet Dagobah, where under the tutelage of Jedi Master, Yoda, he hopes to become a Jedi himself, but that also brings him closer to his, and Leia's, destiny.Lets tell it as it is, The Empire Strikes Back is a better film than Star Wars, not as impacting of course, but most definitely better. Technically, in story telling and in tone, it holds up well today and certainly warrants the amount of times it crops up in best sequels debates. That it's not actually a sequel is irrelevant, it is of course the filler in a wonderful sci-fi sandwich, because as second instalments go, Empire has few peers. With Empire Strikes Back we get all the whizz bang adventure strewn heart of Star Wars, but George Lucas (stepping aside for Irvin Kershner to direct) has also fleshed the story out with a serious dark tone that oddly becomes a bedfellow to the romantic fun on offer, where new and engaging characters (and creatures) add spice to this wonderful fantastical broth.Aided by the considerable writing talent of Leigh Brackett (The Long Goodbye, Rio Bravo, The Big Sleep), Lucas took the bold and ingenious step of giving the bad guys the upper hand, in fact it could be argued that he was taking a considerable risk with his ending. Forcing his viewers to wait for the final chapter (three years later), after tantalisingly setting us up with a corker of plot twist (one which is still to this day as potent as it was back on release), Lucas pulled perhaps one of the cheekiest carrot dangles in cinema history.Though more famed for its dark undertones, Empire is for sure still a very fun movie, C3PO goes into camp overdrive and Han Solo ups his quip quota by some margin. Then of course there is Yoda, in himself a comedic joy. The action sequences beg for repeat viewings, a battle on the ice laden planet Hoth is a marvel and the choreography for Skywalker's fight with Darth Vader is out of the top draw. But ultimately it's with the dark side that the picture excels. Complex and amazingly posing moral quandary's, The Empire Strikes Back is quite an experience, one that will forever hold up to repeat viewings for this particular viewer. 10/10"},{"username":"Theo Robertson","userUrl":"https://www.imdb.com/user/ur1532177","reviewLink":"https://www.imdb.com/review/rw2835337","warningSpoilers":false,"date":"20 July 2013","rate":"7","helpful":"4 out of 19 found this helpful.","title":"It's Good But Is It Really That Great ?","content":"A conjunction is a word linking two sentences . A couple of examples of a conjunction is \" and \" and \" also \" so when I say THE EMPIRE STRIKES BACK is a good film then I also have to use the conjunction \" but \" in case I suffer an internet disembowelment on the grounds of blasphemy or heresy Two things the film does well is spectacle and character interaction . The film gets off to a great start where the rebel forces on the Planet Hoth have to fight a battle against The Imperial Empire who are attacking the base using giant robotic camels . That alone makes it worth seeing and we get some smart liners between Han Solo and Princess lela and we get some smooth patter from Lando who gives a masterclass in how to impress a woman But ( There's always a conjunction ) most of the spectacle is confined to the first half of the film and after that the story concentrates on all the spiritual nonsense involving the force between Yoda and Luke Skywalker . Some people may be surprised that Mark Hamill's career as a movie star didn't take off but one wonders why he was cast in the franchise in the first place since he makes a rather wet unlikely hero rather than the youthful everyman the role is written as . Watching Hamill try and carry his scenes shows how unimpressive he is and how good the rest of the cast are in comparison THE EMPIRE STRIKES BACK is a good Summer blockbuster but the brutal truth is that it's no more than that . It was made in an era before CGI dominated spectacular FX driven films at the turn of the century and that alone makes it worth seeing even if the most impressive scenes happen in the first half . But ( There's always a conjunction ) it's ridiculous the film is so highly rated on this site's top 250 movies and at best probably belongs in the lower reaches of the chart"},{"username":"bevo-13678","userUrl":"https://www.imdb.com/user/ur76062573","reviewLink":"https://www.imdb.com/review/rw5591292","warningSpoilers":true,"date":"30 March 2020","rate":"10","helpful":"1 out of 1 found this helpful.","title":"Cool","content":"The best of the \"original\" trilogy. I like the bit when Luke gets his hand cut off and finds out Vader is his father"},{"username":"Hey_Sweden","userUrl":"https://www.imdb.com/user/ur28159509","reviewLink":"https://www.imdb.com/review/rw2823467","warningSpoilers":false,"date":"1 July 2013","rate":"10","helpful":"1 out of 1 found this helpful.","title":"The standout film in the series so far.","content":"Story author and executive producer George Lucas truly managed to outdo himself when it came to making a sequel to his landmark 1977 \"Star Wars\" film. It combines an appreciably high level of character development with some genuinely exciting and riveting scenes, and introduced the well loved character of diminutive Jedi master Yoda into the formula. Villainous Darth Vader is brought to the forefront rather than being a lackey to somebody else. The relationship between cocky spaceship pilot Han Solo and serious minded rebel leader Princess Leia evolves to where romance can finally take place. And Luke Skywalker becomes more than just the naive and idealistic farm boy, letting his emotions get the better of him.With the directing chores being handed over to Irvin Kershner (\"A Fine Madness\", \"Up the Sandbox\", \"Eyes of Laura Mars\"), \"The Empire Strikes Back\" marks a maturation in terms of story quality, as well as a willingness to go to some dark places. After all, as it begins, it sees its hero in serious jeopardy. It's never treated as a given that Good will prevail. The screenplay is credited to Leigh Brackett (\"The Big Sleep\", \"Rio Bravo\", \"El Dorado\") and Lawrence Kasdan (\"Raiders of the Lost Ark\", \"Body Heat\", \"The Big Chill\"), and stars Harrison Ford, Mark Hamill, and Carrie Fisher make the most of the material. The endearing Yoda is one of those examples of a puppet who truly does become a character rather than just a gimmick. The film is a little short on cool aliens, but it does feature a Yeti-like monster called a Wampa, and an enormous slug used in a funny \"worm in the apple\" sort of gag. The spectacle is fantastic, but it never overwhelms the story. The early battle scene on the ice fields of the planet Hoth is incredibly well executed, and the final lightsaber duel between Luke Skywalker and Darth Vader (who of course has a revelation in store for the youngster) offers one thrill after another.The special effects are as impressive as ever, and it would be difficult to hear that memorable John Williams score and not get into the spirit of the thing. You truly care about the characters and want to see what will happen with them. And it delivers an ending that perfectly captures a sense of uncertainty and a degree of despair, setting up the problems to be solved in the next film.This is definitely a milestone blockbuster that holds up well 33 years later.10 out of 10."}],"errorMessage":""}