{"imDbId":"tt0073486","title":"One Flew Over the Cuckoo's Nest","fullTitle":"One Flew Over the Cuckoo's Nest (1975)","type":"Movie","year":"1975","items":[{"username":"MartinHafer","userUrl":"https://www.imdb.com/user/ur2467618","reviewLink":"https://www.imdb.com/review/rw2033013","warningSpoilers":true,"date":"6 March 2009","rate":"10","helpful":"20 out of 33 found this helpful.","title":"A wonderful film","content":"Before I discuss this exceptional film, I need to point out that there is a lot of truth to this film if you are looking for what it was like in psychiatric hospitals in the 1950s and into the 60s. The hellish practices and dehumanization was definitely true of many facilities during this era. However, today, many of the horrific abuses are no longer relevant. So, while some will point to this film as proof that psychiatry in general is evil personified (such as the Scientologists), for the most part, this isn't the case today. Shock treatment is rarely done today and when it is, it's nothing like it is portrayed in the film and it actually has therapeutic value when all else fails. Lobotomies are also thankfully a thing of the past. So, while debating the pros and cons of hospitalization and medications is reasonable today, don't assume the film is in any way like psychiatric institutions today--many of which have been closed or severely reduced in size as well as the length of stay of the average patient.The film begins with a cocky sociopathic criminal, McMurphy (Jack Nicholson), being sent to a psychiatric hospital from prison. It seems McMurphy thinks that by \"playing crazy\" he'll have an easier time and shorter stay in a hospital instead of prison. However, over time, he comes to see that a mental hospital is a pretty sick place--particularly when it comes to the crazy staff who run the place. McMurphy responds to this system by constantly fighting it and trying to subvert their needless rules and control. Some of this is very funny (such as the fishing trip) and you can understand why he would fight the oppressive ways of the hospital. In the end, however, the system ultimately crushes him like so many others. The conclusion is certainly something you won't forget!Although Jack Nicholson was great in the film as were the rest of the ensemble cast, the star in the film was Louise Fletcher. She played the coldest and most awful nurse in the history of film. Her tough performance truly made the film. Otherwise, if she hadn't been so utterly devoid of humanity, the film just wouldn't have worked. Oddly, the film's producers had a hard time accepting her for the job--and she was the last one cast in the film.Exceptional in every way--the writing, acting and direction. The only reservation I have regards the misuse of the film by anti-psychiatry groups. However, I am glad the film was made as the abuses of the industry need to be understood and not forgotten."},{"username":"TheLittleSongbird","userUrl":"https://www.imdb.com/user/ur20552756","reviewLink":"https://www.imdb.com/review/rw2374177","warningSpoilers":false,"date":"23 January 2011","rate":"10","helpful":"5 out of 11 found this helpful.","title":"So much good about this movie...","content":"What an amazing movie! I cannot begin to describe how good One Flew Over the Cuckoo's Nest is, the whole film has the word classic written all over it. The production values are of top notch quality, and Jack Nitzsche's music is excellent. The film also has a brilliant script, superb direction from Milos Forman(who also directed one of my other favourite movies Amadeus) and a compelling story. The pace is spot on, and there are many memorable scenes especially the very poignant yet harrowing ending. The characters all add a lot to the film, especially Nurse Ratched who is oppressive and terrifying. The cast are all terrific, Jack Nicholson is superb in one of his best roles and Louise Fletcher is just unforgettable as Nurse Ratched. Among the supporting cast are Danny DeVito, Christopher Lloyd and Brad Douif, all great. So overall, I cannot fault One Flew Over the Cuckoo's Nest, it is considered not only one of the best of the 70s but one of the best ever, and it deserves that reputation. 10/10 Bethany Cox"},{"username":"bkoganbing","userUrl":"https://www.imdb.com/user/ur2483625","reviewLink":"https://www.imdb.com/review/rw2007664","warningSpoilers":false,"date":"15 January 2009","rate":"10","helpful":"18 out of 25 found this helpful.","title":"The Ultimate Backfire","content":"It took a dozen years for One Flew Over The Cuckoo's Nest to make it to the big screen from Broadway. In 1962 Kirk Douglas made his one and only return to Broadway to star as Randall P. McMurphy on stage with Joan Tetzel as his nemesis, nurse Ratched. Douglas bought the screen rights, but by the time anyone was interested in doing the film version, Kirk was too old for the part.That may have been a break for the movie fans because as much as I like Kirk Douglas, I can't see anyone but Jack Nicholson doing this role as the free spirited McMurphy. McMurphy's a low level career criminal type who statutorily raped a girl as he put it '15 going on 35'. He decides to fake a crazy act while in prison to get out of the work farm he's assigned to.So Nicholson's goes to the mental hospital where he meets an odd assortment of people whom he discovers voluntarily checked themselves in there, mainly because it's easier to stay there and not take all your psychological baggage into society. That's a crucial difference that Nicholson finds out the hard way, his new friends most of them can pack up and leave anytime they want. He's sent there by the state and the state determines when he's ready to go even if it's past the allotted jail time he was sentenced to.The state in this case is Louise Fletcher as Nurse Ratched, one of the great Dickensian names ever given a movie character. Louise is the ultimate control freak and these people who've shut themselves away from life are her ultimate tools. When Nicholson comes in, he hasn't given up on life like the rest of these poor souls, he becomes a threat to Fletcher's little empire.It's hard to believe that such a smart guy like McMurphy would not have known the rules about commitment. Still it doesn't detract a bit from the overall quality of One Flew Over The Cuckoo's Nest.Though the topic is not a fixed one to any era, the script does leave many oblique references to the Sixties in the film. The electroshock treatment and the lobotomy operations depicted here were by 1975 no longer in use. They were pretty barbaric and the mental health profession discarded these, but not before too many lives were shattered with them. One Flew Over The Cuckoo's Nest swept the main Oscar categories, it won for Best Picture, Best Director for Milos Forman, Best Actor for Jack Nicholson, Best Actress for Louise Fletcher and Best Adapted Screenplay to Lawrence Hauban and Bo Goldman. Brad Dourif was nominated for Best Supporting Actor, but he lost to George Burns in The Sunshine Boys.Louise Fletcher never got the career mileage she should have for playing Nurse Ratched. It took her years, but she did get another career role in television as the ruler of Bejor, Kai Winn on Star Trek Deep Space Nine.One Flew Over The Cuckoo's Nest is one timeless classic, it will be popular a millenia from now."},{"username":"Leofwine_draca","userUrl":"https://www.imdb.com/user/ur0482513","reviewLink":"https://www.imdb.com/review/rw2854713","warningSpoilers":false,"date":"21 August 2013","rate":"10","helpful":"1 out of 4 found this helpful.","title":"Classic movie","content":"ONE FLEW OVER THE CUCKOO'S NEST, an exploration of life inside a mental institute in America in the 1970s, is THE definitive exploration of mental illness put on film. It's a classic for a good reason, a movie that has it all: laughs and heartache, drama and pathos, feel-good moments and scenes of pure tragedy. The film is an adaptation of a novel but it's the screenplay which proves so successful, making perfection out of the story elements.Jack Nicholson is perfectly cast in the edgy lead role, playing the new guy who comes into the ward to shake things up a bit. Nicholson always has that wild side to him and he plays it perfectly here. As the antagonist, Louise Fletcher has a much more rounded character than you might expect; although she's cast as the villain, she's more complex than that, truly convicted that her ways are the best.The film is also notable for the prevalence of familiar faces in the supporting cast, many of whom went on to better things. Christopher Lloyd, Danny DeVito, Brad Dourif and Will Sampson are the stand-out players, many of them so young as to be virtually unrecognisable, but all revealing the greatness to come.The intensity of ONE FLEW OVER THE CUCKOO'S NEST builds as the story progresses and the stakes are raised, with the narrative in the end proving to be a life and death battle between humanity and the establishment. It doesn't get much more powerful than that, huh? And the ending, although bittersweet, is sheer perfection realised on film. I can't wait to watch this one again."},{"username":"Michael_Elliott","userUrl":"https://www.imdb.com/user/ur13134536","reviewLink":"https://www.imdb.com/review/rw3123451","warningSpoilers":false,"date":"13 November 2014","rate":"","helpful":"8 out of 11 found this helpful.","title":"One of the Greatest Ever Made","content":"One Flew Over the Cuckoo's Nest (1975) **** (out of 4)What can one say about this masterpiece that hasn't already been said? Winner of five Academy Awards, director Milos Foreman's ONE FLEW OVER THE CUCKOO'S NEST is without question one of the greatest movies ever made and I think it also contains some of the greatest assembled acting that you're ever going to witness.Randle McMurphy (Jack Nicholson) is put into a hospital where he's going to be evaluated and right from the start this rebel butts heads with the main nurse (Louise Fletcher). That's pretty much all you need to know about the story because the great characters and the remarkable story just captures you and doesn't let you go until the end credits.There's a lot of credit that deserves to be shared in why this film is so special but you really have to start with Nicholson. If you look at his filmography during this period, it's really remarkable to see the type of roles he was doing. It's also easy to see how these type of films certainly wouldn't be made in today's age and time. Today rebels are shown to be tough guys with no weak spots but films like FIVE EASY PIECES, CARNAL KNOWLEDGE and this one show that the tough rebel can also be highly flawed and not always win.Nicholson's performance here is simply flawless and there's not one false move throughout. It doesn't matter if he's just laughing at what's going on around him or connecting with one of the other characters. It's really hard to think of anyone in the history of cinema doing more with the role than what Nicholson did. Fletcher is also extremely good but for other reasons. It's not so much her \"performance\" but the simple ways she looks at the other characters. She expresses so much with her eyes that you can see why she's able to get the Nicholson character to bring out so much anger and rage. The supporting cast members are all flawless in their own right and really make this one of the most memorable assemble pieces ever put together. Brad Dourif certainly deserves special attention as the troubled Billy.Everything from the music score to the editing to the way the story is build is done with such perfection that I really have no problem in calling this one of the greatest films ever made. The film is full of emotional highs and lo's but this is yet another reason it's so memorable."},{"username":"SnoopyStyle","userUrl":"https://www.imdb.com/user/ur2898520","reviewLink":"https://www.imdb.com/review/rw2932303","warningSpoilers":false,"date":"31 December 2013","rate":"9","helpful":"2 out of 5 found this helpful.","title":"Great acting performances from everybody","content":"R.P. McMurphy (Jack Nicholson) has been sent to the mental institution for evaluation. He's in prison for statutory rape of a 15 year old girl. He has a history of fights and assault charges. The prison thinks he's faking to get out of work details. Inside the mental institution, he finds a whole range of people with disorders, and one controlling Nurse Ratched (Louise Fletcher).Jack Nicholson is a rebellious man who's itching to break out of the oppressive dictatorship of nurse Ratched. Louise Fletcher is completely cold hearted, and projects great interior anger. It's all on her face. This is a movie of great performances from everybody. It's not just Nicholson and Fletcher. Everybody is spot on. There isn't a false note being struck."},{"username":"Hitchcoc","userUrl":"https://www.imdb.com/user/ur0278527","reviewLink":"https://www.imdb.com/review/rw1328997","warningSpoilers":false,"date":"30 March 2006","rate":"10","helpful":"3 out of 5 found this helpful.","title":"Excellent Film-making; Excellent Casting","content":"Take a book like Ken Kesey's which did startle some and had a good following. I read it in a graduate English class. I remember setting it down and saying, \"That's a pretty good book.\" It is well written with insights into the characters, but I didn't get the life I did in the movie. Throw a good director and some great character actors into a film like this; add Jack Nicholson, one of the most complex actors on the face of the earth; throw in Louise Fletcher with her soft spoken acts of terror; and you have a real film. Even though there are a few differences between the book and the movie, I actually enjoyed the book more the second time because the movie extended, for me, the depth of the characters. I don't know if Kesey would like to hear that, but sometimes it becomes a win win situation. The mental patients (some people choose to call them psychos which isn't fair) are wonderfully alive and full of their own being. Nicholson's character comes along and pulls out the humanity from them. I met some of the most wonderful people when I worked at a state mental hospital for a time (I now teach Junior High kids, which is a whole other issue). How would you like to be treated, given their setting? Medicated and controlled? There was a lot of that where I worked and I always thought, you may as well sentence them to death as treat them as you are. I think things are a bit more enlightened now. I think that maybe the movie helped a bit. This one has always been a top ten film in my book."},{"username":"Kirpianuscus","userUrl":"https://www.imdb.com/user/ur61197531","reviewLink":"https://www.imdb.com/review/rw3556683","warningSpoilers":false,"date":"5 October 2016","rate":"","helpful":"0 out of 10 found this helpful.","title":"just a film","content":"for a large part from its public , it remains an experience. for the other part - convincing reflection of the struggle of America to reinvent it. or a magnificent adaptation. in fact, it is one of films who change. the perception about life, the impression about actors, the way to understand the thin line between normal and madness. because it is a warning and the great part is the force to be cruel and touching, dramatic and naive. a war. and the position of the parts. and the need to change everything. a story about power. and about system. and the fiction of real victory or victims. short, a great movie. useful for see again. because at each new view it is different - more power, dramatic and ideal support for reflect about fundamental aspects of every day life."},{"username":"Horst_In_Translation","userUrl":"https://www.imdb.com/user/ur3914439","reviewLink":"https://www.imdb.com/review/rw3180593","warningSpoilers":true,"date":"10 February 2015","rate":"8","helpful":"2 out of 5 found this helpful.","title":"A true classic, packed with great performances","content":"\"One Flew Over the Cuckoo's Nest\" is one hell of a movie. Not only does it deliver fully in terms of comedy and drama, but it also managed to win the five big categories at the Oscars back in 1976. Jack Nicholson gives the maybe finest performance from his career and that says a lot. Louise Fletcher's Nurse Ratched regularly makes all-time villain lists and this film is considered one of the greatest examples of how the movie is better than the book it is based on, namely Ken Kesey's novel. So congrats to the writing team Goldman/Hauben, of which the latter never wrote another screenplay than this one here. And to director Milos Forman who, now in his early 80s, gave us many more great films during his 50-year-long career.If you take a closer look, you will see that this movie starts the way it ends. With a camera shot outside the institution. At the beginning a car approaches, possibly the one bringing McMurphy and at the end we see Chief leaving to freedom. Everything in-between (except the boat trip) takes place behind the walls/fences of the institution. We get to see several sessions with sadist Ratched in control, which usually end up way worse for all the inmates than they started. As I mentioned earlier, there's moments when you can never be sure which direction this film is gonna take in the end, comedy or drama. That is also why the final developments are so shocking for everybody. Is it an uplifting ending? Or a depressing? I'm not sure. You have to decide for yourself. The boat trip was certainly the highlight in terms of lightness. Everybody had such a great time with the evil nurse not present. I liked how McMurphy acted as if catching the fish was something so big, such a huge event to boost the inmates' confidence.Apart from that, it is also interesting to see how the employees of the institution act. Some are sadist and like to humiliate as well, some almost treat the inmates equally at times, like during that big party scene. Obviously, the scene when Billy is caught with the woman by Nurse Ratched is very significant too. You could argue how Ratched's own sexual frustration may play a role in the way she reacted ruthlessly and pushed her unstable patient into suicide. She is maybe an even more interesting character than McMurphy. But is she lead or supporting? I'm not sure about that with McMurphy being so much in the center of the movie. But maybe that is just due to Nicholson's great screen presence. Anyway, it's fascinating to see how Ratched hides her mean behavior behind alleged seriousness: She allows the poll, but still decides the outcome. She tells that the more insane members count as much as everybody else as they are part of the institution as well etc.And there is a water application (not sure of the exact name) that plays a major part in this movie too, as this is basically the means to freedom, at first only seemingly with McMurphy, but in the end actually with the Chief, also a very interesting character. However, the early significance of this application is also shown as his little demonstration about how McMurphy at least tried makes everybody brave enough to vote for seeing the baseball game in the face of Ratched's evil eye.Finally you could argue: Did Chief do the right thing in the end? Or, what if McMurphy had been the doctor and Ratched was one of the patients (as it should be?). Would it be better for all the other inmates as they seem to get along with him well. Is it even possible with McMurphy's anti-authority lifestyle and approach. Anyway, if you see that this film was made in the 1970s you could certainly applaud it for its liberal attitude towards sex, nudity, alcohol, authorities and possibly even euthanasia towards the end. Be warned that this movie has two very intense scenes: first the medical procedure taken on McMurphy after the first brawl and finally the pillow scene. Stay away if you maybe can't handle these. Or better look away as it would be a pity if you missed this brilliant film because of that. However, completely in contrast to that: If you have perceived asylums as something creepy (just like many others) so far, you may change your opinion after seeing this film. The inmates all seem fairly harmless compared to the one person in control of them."},{"username":"Prismark10","userUrl":"https://www.imdb.com/user/ur4569900","reviewLink":"https://www.imdb.com/review/rw2972041","warningSpoilers":false,"date":"1 March 2014","rate":"7","helpful":"1 out of 6 found this helpful.","title":"Joker in the ward","content":"I rewatched this film after going through some of Jack Nicholson's earlier performances in Five Easy Pieces and King of Marvin Gardens.He won an Oscar for Best Actor for this film. It is here we get the 'Jack' mannerisms that crop up in later films especially as we see aspects of the 'Joker' as soon as he appears on the screen.It is almost 40 years since the film was made. I never realised the film is set in the early 1960s as it had a contemporary setting especially as we see 1970s cars in some of the exterior scenes.The film also has what were at the time unknown actors that have since become stars in their own right. Danny DeVito, Christopher Lloyd, Brad Dourif, Vincent Schiavelli. Even the producer Michael Douglas managed to become an Oscar winning actor!Randle McMurphy (Nicholson)is a convict who enters a mental hospital thinking it would be easier to do time there than an ordinary prison. He brings chaos in his wake that stirs the other patients.We have had similar themed films done since then and even parodied on numerous occasions. So there is a lot of familiarity to the story even if you have never seen the movie before.McMurphy's behaviour brings him into conflict with Nurse Ratched (Louise Fletcher.) Nurse Ratched is a cold, icy character who lacks empathy. As McMurphy mentions she is not playing a straight game.Although it could be said that it's McMurphy that has brought chaos with his wilful rule breaking. Her mask slips at the end when she humiliates young Billy Bibbit (Brad Dourif) that brings tragedy.One Flew Over The Cuckoo's Nest is an example of the edgy, adult 1970s cinema. It dealt with mature themes. It is not an epic like the Godfather which deals with a grandiose story. Yet it still won the Grand Slam of Oscars with Best actor, actress, screenplay, director and film."},{"username":"classicsoncall","userUrl":"https://www.imdb.com/user/ur2707735","reviewLink":"https://www.imdb.com/review/rw1581683","warningSpoilers":true,"date":"24 January 2007","rate":"10","helpful":"2 out of 4 found this helpful.","title":"\"...ahh, Juicyfruit.\"","content":"Though it may not rigidly adhere to the novel, \"One Flew Over The Cuckoo's Nest\" is still a riveting story, moved along powerfully by the roiling battle of the minds between it's principals, Randle P. McMurphy (Jack Nicholson) and Nurse Ratched (Louise Fletcher). When I was much younger I often found myself with the same attitude as many of the reviewers here that find fault with a less than faithful line by line adaptation of the source material. However having seen enough films that stray from the original novel, I chalk it up to the poetic license taken by the screenwriter in an effort to tell an effective story. In my case, I had read Ken Kesey's novel before the film was made, and then again after seeing the film during it's original theatrical release. Honestly, unless you read the book and watch the film virtually back to back, I don't think you'll come away from the movie unimpressed. In fact, the one difference I can recall with clarity between the two concerns an element in the novel that I'm satisfied was changed for the movie. In the book, the character of Cheswick drowned during a recreational swim in the pool. With Nicholson's first appearance on screen, you can note the glint in his eye that would also serve him well in 1980's \"The Shining\". His aggressive behavior has managed to secure confinement to a mental institution instead of a work farm where he quickly understands that his nemesis Ratched operates the asylum much like a a rigged carny game. It's interesting to note that throughout the story, Ratched's hairdo is uniquely styled to resemble a pair of horns, and she's more than willing to offer McMurphy and whoever takes his side a devil of a time.My favorite scene of the film relates to my summary line above, when The Chief (Will Sampson) reveals he's not deaf and dumb, and McMurphy revels in the fact that the Indian might be an even bigger con man than himself. It was McMurphy's cultivating of that relationship along the way that helped The Chief understand that he could be as 'big as a mountain'. I can think of no other film ending that winds up being so depressing and uplifting at the same time; you'll want to believe the Chief when he tells his friend he's coming with him. It's a chilling moment. With a repeat viewing, take note of the Chief's expression when McMurphy attempts to lift the sink to win a bet in an earlier scene. It's where the seed was planted for the Chief's escape.It's a tribute to all the talent involved in this movie that makes each character vivid and memorable, even those that don't have any lines. Danny DeVito, Sydney Lassick, and Christopher Lloyd are stand out in their respective roles, for each virtually their first major big screen appearance. Brad Dourif is probably my favorite modern day character actor, his work as Doc Cochran in the Western series \"Deadwood\" is tour de force.Interestingly, in addition to 'Cuckoo's Nest', Ken Kesey also wrote what remains to this day my favorite novel, \"Sometimes A Great Notion\", telling the story of an Oregon lumber family. Even though that story is told from the perspective of differing narrators, it moves along seamlessly without confusing the reader, and in many cases, one doesn't even recall the switch taking place! That book was also made into a film with the same name, but you might find it broadcast under an alternate title, \"Never Give An Inch\"."},{"username":"lee_eisenberg","userUrl":"https://www.imdb.com/user/ur4888011","reviewLink":"https://www.imdb.com/review/rw1151308","warningSpoilers":false,"date":"15 August 2005","rate":"10","helpful":"3 out of 7 found this helpful.","title":"This will remain a classic for all time.","content":"Based on Ken Kesey's novel, \"One Flew Over the Cuckoo's Nest\" is still the ultimate story of rebelling against authority. Jack Nicholson gives the performance of a lifetime as mental patient Randle Patrick McMurphy, resisting the dictatorial Nurse Ratched (Louise Fletcher). I just can't describe how great this movie is; you have to see it to understand that. Among other things, it disproves the notion that Oregon-filmed movies suck (mostly caused by movies like \"The Postman\" and \"Men of Honor\"). Watching \"OFOTCN\", anyone can see why it won the top four Academy Awards for 1975. You don't even know the definition of \"classic masterpiece\" until you've seen this movie."},{"username":"gavin6942","userUrl":"https://www.imdb.com/user/ur1234929","reviewLink":"https://www.imdb.com/review/rw2245345","warningSpoilers":false,"date":"5 May 2010","rate":"8","helpful":"1 out of 3 found this helpful.","title":"Very Fine Film","content":"I'm going to make this very brief: you have a nut-house with Christopher Lloyd, Danny DeVito, Michael Berryman and Brad Dourif. Then, you transfer a violent prisoner (Jack Nicholson) into the asylum, who is sure to rouse the nuttiness of the patients there. That's really all you need to know.Of course, there's more to it than that. Nicholson's character takes it to a whole new level, doing things that are not only unpredictable but at times rather extreme. Not crazy extreme like cutting himself or flinging excrement, but just testing authority.What to watch for: when does testing authority go too far (and who is the bad guy when it does), and who is helping the patients more: the nurses on staff or the strong personality of the new patient?"},{"username":"jboothmillard","userUrl":"https://www.imdb.com/user/ur4248714","reviewLink":"https://www.imdb.com/review/rw1028003","warningSpoilers":true,"date":"25 February 2005","rate":"10","helpful":"1 out of 6 found this helpful.","title":"One Flew Over the Cuckoo's Nest","content":"From Oscar, BAFTA and Golden Globe winning director Milos Forman, this is an excellent story based on the novel by Ken Kesey. Basically Randall P. (Patrick) McMurphy (Oscar, BAFTA and Golden Globe winning Jack Nicholson, in his greatest role) is the free spirit with several assault convictions who, after convincing guards he is crazy, is put into a state mental home. He has a different point of view though, and is ultimately a rebel in amongst the real mental patients and the hospital staff, particularly his main enemy, ward sister Nurse Mildred Ratched (Oscar, BAFTA and Golden Globe winning Louise Fletcher). But during his time in the hospital, he actually helps some of the patients make progress. These patients are a variety of then unknown actors, including Harding (William Redfield), stuttering Billy Bibbit (introducing BAFTA winning, and Oscar nominated Brad Dourif), Charlie Cheswick (Sydney Lassick, who played another Cheswick in Carrie), Taber (introducing Back to the Future's Christopher Lloyd), Martini (Danny DeVito), and faker Chief Bromden (Will Sampson). The best sequences I always remember are all the group meetings, McMurphy jumping over the fence and stealing the bus of patients taking them fishing, the late night party (and attempted escape), and of course the tear-jerking ending where (after choking Nurse Ratched) McMurphy has had a lobotomy (taking out some of his brain), Chief kills him (euthanasia) and chucks the sink at the window to escape. Also starring Ghost's Vincent Schiavelli as Frederickson, The Shining's Scatman Crothers as Turkle, Louisa Moritz as Rose, Mews/Marya Small as Candy and Delos V. Smith Jr. as Scanlon. The film was produced by Michael Douglas, who had played McMurphy on stage. It won the Oscars for Best Picture and Best Writing, Screenplay Adapted From Other Material, and it was nominated for Best Cinematography, Best Film Editing and Best Music for the great score by Jack Nitzsche, it won the BAFTAs for Best Film and Best Film Editing, and it was nominated for the Anthony Asquith Award for Film Music, Best Cinematography, Best Screenplay and Best Sound Track, and it won the Golden Globes for Best Motion Picture - Drama and Best Screenplay. Jack Nicholson was number 6 on The 100 Greatest Movie Stars, he was number 71 on The 100 Greatest Pop Culture Icons, he was number 63 on The 100 Greatest Sex Symbols, and he was number 7 on The World's Greatest Actor, Nurse Ratched was number 5 on 100 Years, 100 Heroes & Villains, the film was number 59 on The Ultimate Film, it was number 17 on 100 Years, 100 Cheers, it was number 20 on 100 Years, 100 Movies, and it was number 14 on The 100 Greatest Films. Outstanding!"},{"username":"rmax304823","userUrl":"https://www.imdb.com/user/ur0819382","reviewLink":"https://www.imdb.com/review/rw3426891","warningSpoilers":true,"date":"6 March 2016","rate":"8","helpful":"1 out of 2 found this helpful.","title":"On Being Sane In Insane Places.","content":"If you enjoyed \"Cool Hand Luke\" you'll enjoy this for similar reasons. A rogue is thrown into a total institution with a gaggle of passive inmates, organizes them and gains their admiration and allegiance, goes too far, and is defeated by the agents of social control.In both films the story is gripping, exuberant, painful, and allegorical. The psychiatric hospital of 1963 is no more the enemy here than the Southern prison camp. It's the social system with its demands that is the target, and the figure who rebels against the rules is its Prometheus.In both films, too, you'll find sterling performances in the lead roles and among the supporting players. It's one of Jack Nicholson's best, and the director, Milos Forman, isn't afraid to use the editor in order to make the most of it.One of the supporting actors, Louise Fletcher, won an Academy Award for her performance, and she deserved it, just as George Kennedy deserved his for \"Cool Hand Luke.\" Fletcher's features and demeanor are perfectly suited to the role of Nurse Ratched, the personification of the social system. Her face seems made of half-melted wax, changing subtlety from fake-pleasant to honest resentment at Nicholson's leaching away of her power over the inmates.There's a knowingness in her anger, as if, underneath the robotic ministrations, there's an extremely perceptive apparatus at work. She reminds me of a stern arithmetic teacher, specifically Miss Velma Spurge, a knotty spinster, of Hillside High School, may her soul be barbecued for eternity.I don't think I'll get into the plot. It's full of surprises. So was the author of the work, Ken Kesey, who was a kind of link between the Beatniks of the late 50s and the hippies that came later and drew their inspiration from acid and a general taste for the colorful and the sensational. Kesey was a genuine innovator. His novel, on which this film is based, is written from the point of view of the Indian chief. Kesey was also the focal point of Tom Wolf's book, \"The Electric Kool-Aid Acid Test,\" one of the rare instances in which Wolf finds something to admire about noncomformists.See it."},{"username":"ccthemovieman-1","userUrl":"https://www.imdb.com/user/ur4445210","reviewLink":"https://www.imdb.com/review/rw1336130","warningSpoilers":false,"date":"8 April 2006","rate":"8","helpful":"26 out of 43 found this helpful.","title":"Looking At This Famous Film Then, And Now","content":"Like most people, when this film came out in the mid '70s, I thought it was great. Being still young and Liberal, I, too, looked at the rebel as the good guy and the authority figure as the bad guy....just as Hollywood has wanted us to do for a half century. Over the years, I watched a couple of more times and then stopped maybe 20 years ago.A funny thing happened when I looked at it again a few years ago as someone in their mid 50s: I looked at the two main characters in a totally different light.For the first time, now that my Left Wing rebel days are over, I didn't see Nurse Mildred Rachet (Louise Fletcher) as an evil person. On the contrary, the woman was just doing her job. I also appreciated Fletcher's performance more in here. She is outstanding, especially with her facial expressions. The only negative I could find on her was late in the film when she threatened to tell on \"Billy.\" Jack Nicholson's character, \"Randle Patrick McMurphy,\" was generally an obnoxious ass. He must have set the Hollywood record at that time for most usages of the Lord's name in vain. I lost count on all the GDs. But Nicholson's performance was still outstanding: that hasn't changed in my eyes. He was also the perfect actor for that role.Who could argue with either of those actors getting Academy Awards for their performances?Yes, the story was good but it was the acting in general which made this such a memorable film. Without Nicholson, Fletcher, Will Samson, William Redfield, Brad Dourif, Danny DeVito (I didn't recognize him!) and Christopher Lloyd, this film wouldn't have reached the heights it did.This is an unpleasant film in parts. Mental illness is not pretty, but it sure was a memorable film, I'll give it that. Unlike most reviewers, I don't love this film, but I respect it. It hasn't lost its power, either, nor is it dated."},{"username":"moonspinner55","userUrl":"https://www.imdb.com/user/ur0989035","reviewLink":"https://www.imdb.com/review/rw1373770","warningSpoilers":false,"date":"22 May 2006","rate":"7","helpful":"8 out of 16 found this helpful.","title":"Difficult, fascinating drama runs on pure emotion, not logic...","content":"Multiple Oscar winner is an astounding, gripping piece, although occasionally the material allows too much showing off for its star and the four-letter dialogue coupled with the bleak material can be exhausting. A softened (albeit no less hard-hitting) film-adaptation of Ken Kesey's novel about sex-deviate Randle McMurphy (Jack Nicholson) sent to a mental institution instead of prison, quickly butting heads with the stony head-nurse on his ward (a hissable Louise Fletcher playing Nurse Wretched--uh, Ratched). Ostensibly a downer, the film does get a rousing kick from Nicholson, going full bore with an actor's relish and infusing the movie with unpredictable, kinetic energy. Director Milos Forman helps us get to know the patients at this hospital, easing us through the preliminaries and yet sparing us none of the ugliness. Still, this plot is a bit thin on the screen; Forman does his best to \"open up\" the material, which was first produced on the stage, but the sequence on the boat is more an emotion-based relief for the audience's benefit than a logical turn of the story. Tough-going, compelling film is occasionally brilliant, with Nicholson and Fletcher both winning Oscars, as did Forman and producer Michael Douglas. *** from ****"},{"username":"TxMike","userUrl":"https://www.imdb.com/user/ur0438066","reviewLink":"https://www.imdb.com/review/rw0143186","warningSpoilers":false,"date":"21 November 2003","rate":"","helpful":"0 out of 1 found this helpful.","title":"Just saw it again on DVD, a classic!","content":"I saw \"Cuckoo\" many years ago, probably in the theater. It is strange how we remember certain things vividly, but others not at all. Nurse Ratched is truly a demon, you get to feeling all the inmates should be free, if just to get away from her. In a sense she is worse than the warden in \"Shawshank Redemption\". She kills not with guns, but with emotional torture. Nicholson's performance is inspired but the ending is depressing and uplifting at the same time. It will never be remembered as one of my favorites, but I will always remember \"One Flew Over The Cuckoo's Nest.\""},{"username":"Quinoa1984","userUrl":"https://www.imdb.com/user/ur0453068","reviewLink":"https://www.imdb.com/review/rw0143063","warningSpoilers":false,"date":"15 April 2000","rate":"10","helpful":"175 out of 242 found this helpful.","title":"Best film of its era","content":"Milos Forman's One Flew Over the Cuckoo's Nest is a landmark (one of the few I might add) in cinema. Pretty much everything in this film is at or close to perfection. And rightfully so, it became only the 2nd (1 in 3 films in history along with It Happened One Night and Silence of the Lambs) film to win the top five Oscars- Best Picture, Actor (Jack Nicholson), Actress (Louise Fletcher), Director (Forman), and Screenplay (Bo Goldman).The story (based on Ken Kessey's astounding, though not too similar, novel) focuses on a rowdy misfit named Randle Patrick McMurphy (Nicholson) who is put in a mental hospital with other people (some voluntarily in) who are not all there. Some of these guys include Danny DeVito (in his first role), Christopher Lloyd, Brad Dourif (in his Oscar nominated role) and the never forgettable Will Sampson who played the Chief. The film, It's actors and scenes will always be terrific achievements in cinema and is one of my favorites."},{"username":"edwagreen","userUrl":"https://www.imdb.com/user/ur2542703","reviewLink":"https://www.imdb.com/review/rw1310725","warningSpoilers":false,"date":"9 March 2006","rate":"8","helpful":"1 out of 3 found this helpful.","title":"Surviving the Nut House ***","content":"Jack Nicholson's first Oscar winning performance as a patient in a mental institution.Based on Ken Kesey's best seller, we come to realize that the heads of these institutions are in desperate need themselves. This movie correctly showed what goes on in these institutions.Nurse Mildred Ratched was skillfully played by Louise Fletcher, who won the best actress Oscar. Needless to say that an argument could be made that Nurse Ratched was a supporting performance. Fletcher also benefited from the fact that Elizabeth Taylor and Anne Bancroft turned the part down. Could one imagine Geraldine Page doing this role? She would have had a field day with it.Anyway, Ratched is an instigator. She riles the inmates up and then steps away after calling for emergency assistance. She is sicker than anyone confined there. This nurse actually believed that she was helping the patients by her strong beliefs in instilling scheduling and no change in the routine for the inmates. Obviously, she turns on McMurphy because he is a threat to her very existence.Nicholson, ideal for the role, made the most of it. His refusal to conform shall lead to his ultimate downfall. Note a strong performance by Brad Dourif as one of the inmates, who Ratched destroys in one of her blistering fits.Remember our short friend Mr. Cheswick? Vulnerable, his nervousness was memorable in a well designed film."},{"username":"Coventry","userUrl":"https://www.imdb.com/user/ur2020269","reviewLink":"https://www.imdb.com/review/rw6663122","warningSpoilers":false,"date":"5 March 2021","rate":"10","helpful":"3 out of 3 found this helpful.","title":"Insanely perfect","content":"This will probably be regarded as a very blunt and unpopular statement, but I think that almost one third of the films listed in this website's top 250 do not belong there. Particularly among the first 50-100, there are far too many movies that are either vastly overrated and/or only listed so high because they have large and obsessive fanbases that vote continuously to keep them up there. The opinion naturally doesn't count for a handful of films that are - and forever will remain - undisputable masterpieces. \"One Flew over the Cuckoo's Nest\" is such an undisputable masterpiece, and it actually hurts to see that a landmark like this is getting pushed back in the ranking. I remember, a couple of years ago, this was #5 and all of a sudden, it's only at #18 now.Anyway, I certainly do not always concur with the choices of the Academy Awards committee, but it was the right decision that \"One Flew...\" triumphed in the five main categories, and this in spite of the tough competition that year (\"Dog Day Afternoon\", \"Jaws\", \"Barry Lyndon\", ...). When your film is considered the best in those five areas, including best script and best film altogether, you can safely conclude it's pretty close to perfection. The story is definitely one of the most absorbing ones ever told, with courageous themes and utmost fascinating characters, and strengthened by the flawless performances of the ensemble cast. The authenticity of the asylum setting, Jack Nitzsche's music, the cinematography and about half a dozen other things all contribute to its pure genius."},{"username":"tedg","userUrl":"https://www.imdb.com/user/ur0643062","reviewLink":"https://www.imdb.com/review/rw0143128","warningSpoilers":true,"date":"30 December 2002","rate":"","helpful":"21 out of 33 found this helpful.","title":"Storytelling that Imprisons","content":"Spoilers herein.This film is hypnotic. The actors lead with skill, Nicholson is just right, the story is very accessible and the combination hits home. Why should I be unhappy?Because I know the book. Now, I have no illusion about books and translation into film. But it bothers me when I think about why I am drawn into this film, and the book helps me understand why.Kesey's work was from the perspective of the damaged mind of the Indian. It was Nabokovian in dealing with created realities, realities that did not exist but were confabulated as an artifact of us entering some diseased eye. The whole point was there is no anchor of right and wrong.Forman is a talented storyteller, but before he is an artist, he is a Czech. And Czechs (at least in those days) live in only one world: a world where some forces in society unjustly imprison the rest in ways that imprison all. It is a real world, a dark broken world illuminated only by brief flashes of tenacious individualism. Self-immolation. Svankmajer stuff -- check him out. The problem with this vision of 1975 is that it uses the very same techniques it rails against: there really is a good -- it says -- there really is an institutional bad in Forman's world. Cartoonish films are as common as grass, but this one rankles. The institution of Hollywood selfishly changed the ambiguous, morally shifting world of Kesey into a simple morality play knowing that we would be hypnotized with its very clarity. Shame I say -- where's the sink?You want fine Nicholson? You'll find him in the ambiguous, multilayered Chinatown.Ted's Evaluation -- 2 of 4: Has some interesting elements."},{"username":"Calicodreamin","userUrl":"https://www.imdb.com/user/ur29385135","reviewLink":"https://www.imdb.com/review/rw6103614","warningSpoilers":false,"date":"18 September 2020","rate":"9","helpful":"3 out of 5 found this helpful.","title":"Incredibly well acted","content":"The acting in this movie is incredible, the characters have depth and are well cast. Nickolson is the perfect lead, just the right amount of manic to sell this character. The storyline is unique and well developed and draws genuine emotions. Very well made."},{"username":"bevo-13678","userUrl":"https://www.imdb.com/user/ur76062573","reviewLink":"https://www.imdb.com/review/rw5597613","warningSpoilers":false,"date":"1 April 2020","rate":"10","helpful":"1 out of 1 found this helpful.","title":"Fly","content":"I like how he's always annoying nurse ratchet. I like the funny hat he looks like a burgler"},{"username":"view_and_review","userUrl":"https://www.imdb.com/user/ur3670492","reviewLink":"https://www.imdb.com/review/rw4341561","warningSpoilers":false,"date":"16 September 2018","rate":"8","helpful":"0 out of 0 found this helpful.","title":"Wonderfully Upsetting","content":"Who knew that Nurse Ratched's last name would become a common slang word as a negative connotation for women? OK, OK, so the term \"ratchet\" is not derived from Nurse Ratched but it could be! Oh was she wicked. Not in an overt demonstrative manner; but in a subtle, cold, inherently evil manner. Just the stare she gave was icy and induced frowns. Louise Fletcher played that role too well, almost like she was made for it.As good as Louise was, Jack was better. He was excellent as the not-crazy crazy ward McMurphy. It was like the psychiatric hospital needed a McMurphy to come along to expose it for its destructive policies and expose the patients to real therapy. One Flew Over the Cuckoo's Nest was a wonderfully upsetting movie."}],"errorMessage":""}