{"imDbId":"tt0034583","title":"Casablanca","fullTitle":"Casablanca (1942)","type":"Movie","year":"1942","items":[{"username":"MartinHafer","userUrl":"https://www.imdb.com/user/ur2467618","reviewLink":"https://www.imdb.com/review/rw1998393","warningSpoilers":false,"date":"30 December 2008","rate":"10","helpful":"38 out of 49 found this helpful.","title":"A perfect film.","content":"Although I have so far reviewed over 5700 films, I haven't yet reviewed CASABLANCA--mostly because nothing I can say about the film can add to the many excellent and insightful reviews for this cinematic masterpiece. But, having seen it several times, I guess it's worth at least saying a few words out the film.Although Humphrey Bogart is one of the finest actors ever and he made many, many wonderful films, I think it's not much of a stretch to say this is his best performance and best film. He was perfect for the world-weary and cynical Rick. Sure, African QUEEN, THE CAINE MUTINY and several other of his films were brilliant, but none come close to CASABLANCA because in my opinion CASABLANCA is a perfect film--or about as close to one as you can find. If IMDb were not so heavily weighted in favor of newer films (just look at the top 250), it probably would be at the top of the list. For example, you can't seriously think that THE SHAWSHANK REDEMPTION and THE DARK KNIGHT are better films, though they both are ranked higher on the list. Now this isn't to say these are bad films--heck they are terrific,...just not in the same category as CASABLANCA.Aside from Bogart, the film also is directed perfectly by Michael Curtiz--with excellent pacing, atmosphere and charm. The supporting cast is amazing--one of the best you could find in a film. In addition to the great stock Warner Brothers character actors (such as Sydney Greenstreet, Peter Lorre and Cuddles Sakall), Conrad Veidt is the perfect scary Nazi, Claude Rains is his usual wonderful self, Ingrid Bergman luminous and Paul Henreid, though a great actor, is somewhat lost among all the immense talent! Amazing music, a top script and all the style and quality that Warner Brothers could muster--this is my pick for top film ever. A fine romance and a fine film about people."},{"username":"TheLittleSongbird","userUrl":"https://www.imdb.com/user/ur20552756","reviewLink":"https://www.imdb.com/review/rw2084081","warningSpoilers":false,"date":"21 June 2009","rate":"10","helpful":"26 out of 34 found this helpful.","title":"One of the best black and white films I have ever had the privilege of watching!","content":"Casablanca is just an extraordinary film, if I had to describe it in one word, it would have to be perfection! I honestly don't care that it's an old film, I personally think that's not a convincing enough excuse for hating a film as wonderful as this , because you are seriously missing out, if you haven't seen it. The cinematography is just fantastic, with clever brooding camera-work. The music by Max Steiner is outstanding, from the sweeping haunting love theme As Time Goes By, to the excerpts of the french national anthem. The scene where everyone starts singing in the café was extraordinary and one of the many highlights of the film. The screenplay is unquestionably one of the finest in the history of cinema, right up there with Shawshank Redemption and All About Eve, containing great memorable lines such as \"seems as though Destiny is at hand\". The performances were superlative, Humphrey Bogart giving one of cinema's greatest lead performances as the \"cynical sentimentalist\" Rick Blain. Also superb are Ingrid Bergman who positively lights up the screen as Ilsa, the young woman who breaks his heart, Paul Henreid as the fugitive husband, and Claude Rains as Captain Renault. The plot is a little complicated, but I couldn't help being impressed with the performances and the screenplay. Not to mention a timeless love story that I don't think has ever been topped. Overall, a masterpiece, that quite rightly received an academy award for best picture. 10/10 Bethany Cox"},{"username":"bkoganbing","userUrl":"https://www.imdb.com/user/ur2483625","reviewLink":"https://www.imdb.com/review/rw1310037","warningSpoilers":false,"date":"8 March 2006","rate":"10","helpful":"139 out of 175 found this helpful.","title":".....it's still the same old story, a fight for love and glory, a case of do or die, the world will always welcome lovers, As Time Goes By.\"","content":"It's one of the great Hollywood legends how George Raft helped make Humphrey Bogart a leading man by turning down in succession, High Sierra, The Maltese Falcon, and Casablanca. Maybe Raft showed some good sense in letting a better actor handle those roles. In any event we've got some proof in the case of Casablanca.Check out some time a film called Background to Danger that Warner Brothers did with George Raft that also featured Peter Lorre and Sydney Greenstreet. Had Raft ever done Casablanca the film would have been a routine action/adventure story just like Background to Danger. Instead with Bogey we get that, but also one of the great love stories of the century. Humphrey Bogart set the standard for playing expatriate American soldiers of fortune in Casablanca. Right now he's between wars running Rick's Cafe Americain in Casablanca in Morocco, an area controlled for the moment by the Vicky French government. He's got his fingers in a whole lot of pies, but Bogey operates with his own code of ethics. He sticks his neck out for nobody.Nobody except the great love of his life Ingrid Bergman who left him mysteriously in Paris as he was fleeing the oncoming German occupation. She walks back into his life with a husband, Paul Henreid who is a well known anti-fascist leader.The rest of the film is a contest for Bogey's soul. Torn between his great love, his own anti-fascist beliefs, and certain practical necessities of operating a liquor and gaming establishment in a hostile environment. So many things combine to make Casablanca the great film it is. Ingrid Bergman's lovely incandescence melding and melting Bogey's cynical screen persona. The indelible characterizations of Peter Lorre, Sydney Greenstreet, Claude Rains, Conrad Veidt and the whole rest of a 100% perfectly cast film. And the revival of a great ballad which serves as Casablanca's theme song.I say revival because As Time Goes By was introduced in 1931 in the George White Scandals on Broadway by Rudy Vallee. He made a record of it which sold quite a few disks back then. But by the merest of coincidences there was a strike that lasted two years that just began around the time Casablanca came out. The Musicians Union struck against the record companies. With no new records being made RCA Victor re-released Vallee's record and it became a monster hit on revival.Also when Casablanca came out as if the White House had a personal interest in the film FDR and Churchill had the first of their wartime conferences in----Casablanca of all places. Jack Warner must have said a prayer for that to happen.There are so many classic scenes and lines from Casablanca you can write a comment just by listing them. But my favorite has always been when the Germans have taken over Rick's place and are singing some of their songs, Paul Henreid goes to orchestra leader and asks him to lead La Marsellaise. With a nod from Bogey, the orchestra plays, Henreid leads them and the rest of the non-Germans in the cafe join in. Over 60 years later, one still gets a thrill from that act of defiance.Bogart and Rains were nominated for Best Actor and Best Supporting Actor. Any of the others could have been as well. As I said before Casablanca is perfectly cast right down to minor roles like Curt Bois as a pickpocket, John Qualen as a fellow resistance leader, and S.Z. Sakall as a waiter at Rick's. If there was an award for ensemble cast, Casablanca would have won it. As it was it did win for Best Picture of 1943 and best director for Michael Curtiz.Casablanca will be seen and loved by filmgoers for generations unto infinity, as time goes by."},{"username":"Michael_Elliott","userUrl":"https://www.imdb.com/user/ur13134536","reviewLink":"https://www.imdb.com/review/rw1827786","warningSpoilers":false,"date":"26 February 2008","rate":"","helpful":"3 out of 11 found this helpful.","title":"Great","content":"Casablanca (1942) **** (out of 4) Michael Curtiz's all-time classic about a war-torn city, a local bar owner (Humphrey Bogart) and his former love (Ingrid Bergman). There's really nothing new I can add to this film because it's certainly one of the greatest classics to come out of Hollywood but on a personal level, I enjoy The Treasure of the Sierra Madre more in the Bogart canon. I know a lot of people feel Bogart was just an image and not really an actor but I've never bought into this theory. Sure, he once again plays a tough guy here but the flashback sequence shows another side of him as does the smaller moments between he and Claude Rains. Bergman is very good in her role but I feel she's the weakest character in the film. It's not that she's bad but I feel the supporting players are a lot better here. You've got Rains, Peter Lorre, Paul Henreid, Conrad Veidt, Sydney Greenstreet and of course Dooley Wilson. While this film wouldn't make my #1 movie I might put it down as having the greatest dialogue of any film made."},{"username":"SnoopyStyle","userUrl":"https://www.imdb.com/user/ur2898520","reviewLink":"https://www.imdb.com/review/rw3098382","warningSpoilers":false,"date":"4 October 2014","rate":"9","helpful":"2 out of 6 found this helpful.","title":"Movie romanticism at its best","content":"Casablanca is a desperate place during WWII. Refugees escaping the Nazis travel a back route through Casablanca to Lisbon and then to the free world. Some can go no further than the French colony which is home to scoundrels, smugglers, double dealers, and freedom fighters. Rick Blaine (Humphrey Bogart) is a world wearied expat American who runs a popular nightspot Rick's. He sticks his neck out for nobody. Captain Louis Renault (Claude Rains) leads the local police. He's eager to catch the underground leader Victor Laszlo to please the Germans. Ugarte (Peter Lorre) is a sweaty people-smuggler who is selling 2 letters of transit stolen from 2 German couriers. He gives the valuable letters for Rick to hide. Much to Rick's surprise, Lazslo arrives with his old flame Ilsa Lund (Ingrid Bergman).It's hard to quantify everything that is so great about this movie. Bogie as the Rick is one of those movie icons that transcends even the movie world. The desperation is well projected. This is melodrama of the highest order and the best of the genre. Sometimes movies come along at the right time. This is a propaganda film at the perfect time where the theme of sacrifice hit hardest. This is the standard bearer for movie romanticism as much as Romeo and Juliet for plays. Some can complain about Paul Henreid's stiffness as Laszlo but that's the point of his character. Some others can complain about the effects but that's missing the point of the movie entirely. Some can complain about all the clichés, and I agree that this movie is one big cliché. So what? In the end, this is a movie that deserves every bit of its iconic status."},{"username":"Hitchcoc","userUrl":"https://www.imdb.com/user/ur0278527","reviewLink":"https://www.imdb.com/review/rw1310564","warningSpoilers":false,"date":"9 March 2006","rate":"10","helpful":"3 out of 6 found this helpful.","title":"One of our most quotable movies","content":"Not only have countless responders talked about this film; geniuses of the film criticism have picked it apart. Like so many of my most highly rated films, it's all about character. Someone said that modern film audiences don't see it as a classic. I love all kinds of movies. I am disappointed much more with contemporary films than older ones because filmmakers were forced to us a lot more imagination. Granted, there are many bad films in every era as well as great ones. When I see every reviewer start with an evaluation of special effects. Why is it that so many films need to rely on special effects. This movie is a romance of the highest order. It asks so much of its stars. The incredible lighting that accentuates the faces of the characters makes it all work. Then you have real stars in Bogie and Bergmann. Todays actors are so bland and interchangeable for the most part. There was a reason for a star system. Even today, I want to see the less glamorous actors: Hackman, Eastwood, etc. When Bergmann is on the screen, there is no one who can show the passion and pain that she does. Also, consider the vignettes concerning war embattled Casablanca. There is a force at work to destroy all that is good and right. The singing of the French national anthem is antithetical to that scene in Cabaret where the young Nazis sing \"The World Belongs to Me.\" See this if you never have."},{"username":"Kirpianuscus","userUrl":"https://www.imdb.com/user/ur61197531","reviewLink":"https://www.imdb.com/review/rw3278299","warningSpoilers":false,"date":"16 July 2015","rate":"","helpful":"1 out of 2 found this helpful.","title":"special","content":"for many, a masterpiece. for me, only a trip. behind secrets, choices, fights, hopes and memories from the past. behind people's links and decisions. a splendid love story who has the science, courage and force to be more. to become a kind of map or a spectacular exercise of cinema not only at an only level but as profound analysis of existences in war time. the acting is great, the music is memorable but the gift of Casablanca is to be at each new view entirely another movie. details, nuances of dialogs, a new gesture's signification does the film a kind of revelation. a film who has status of legend. nothing new at the first sigh. but interesting for discover, again and again, a special gate to yourself."},{"username":"Horst_In_Translation","userUrl":"https://www.imdb.com/user/ur3914439","reviewLink":"https://www.imdb.com/review/rw5535723","warningSpoilers":true,"date":"8 March 2020","rate":"6","helpful":"7 out of 38 found this helpful.","title":"A pretty decent film that gets better towards the end, but hardly a classic","content":"\"Casablanca\" is an American black-and-white film from 1942, so this one is already almost 80 years old and it was directed by Michael Curtiz. He won an Oscar for his effort there and the movie also took home the big prize, namely Best Picture. Another win was for the screenplay and three writers received a trophy there, even if we have a total of 7 writers listed here on imdb because this movie is based on a play. The actors and a few other nominees managed \"only\" nominations, but no wins. The year was 1942 like I already said, so of course World War II was a huge issue and this was a truly contemporarily relevant movie. Maybe this is why many mistook it for a great movie. It is not bad by any definition, but it is also certainly not the classic many people say it is. The subject here is also fairly unusual for a war movie and I cannot really remember any other film that focused primarily on the issue of people getting visas in order to be able to leave Europe/Africa and get to the United States where war hadn't arrived yet. Maybe this uniqueness in terms of subject is another reason why many people like it. We don't get military action or Holocaust stories (obviously because the entire mess was not known at that point yet) here, but something else. As for the cast: The lead actor here was Humphrey Bogart. He was okay overall, but not good enough for an Oscar nomination I'd say. I am glad Ingrid Bergman did not get any because she really was mostly forgettable here and honestly her scenes with Bogart were not the best the film had to offer, but maybe the worst, so it is really bizarre how some talk about this being the biggest romance story ever. If it really was this big, she would not have left him behind (twice!) and he would not agree that it is the right thing to do towards the end. The only solid moment there was when he said that now they have Paris again because he knows her real motivation for letting him go. Actually, I like the idea of this motivation in the sense of a greater cause, even if it is of course debatable if it makes sense that the two split up although they have major feelings for each other, which clearly she does not have for the Hungarian fella. There were at least two occasions when he says he loves her, but she does not say the same back. As for the cast, the second Oscar nomination went to Claude Rains, one of the most influential supporting actors of his time. He was okay too I'd say, but again not good enough for an Oscar nomination. I guess many mistook his surprising twist at the end (when he helps Bogart's character after seeming more like an antagonist all the way before that) for a great performance. But surprising does not equal sublime. His nomination was probably more about the writing than really about the portrayal. And of course that he was a good guy eventually. I must also say something about him becoming good did not make sense entirely. I can see why he was not too angry at Bogart's character for the fact that he let him not have the Bulgarian girl (by the way how did he even know the roulette numbers?), but he says earlier that they have not decided yet if a prisoner committed suicide or was killed while trying to flee (implying murder), which shows that he is definitely one of the bad guys, even if he is not German. The one who is German here is actor Conrad Veidt and his character was pretty much the main antagonist, even if he did not have too much screen time. Really sad how Veidt died shortly after this film was made at a relatively young age. He could have head a great career in Hollywood ahead of him. I think he was sublimely talented. Another (somewhat) German actor here was Peter Lorre. Many people immediately think of \"M\" when they hear his name, but they do not remember he was in here too and he plays a victim once again. I think his character is a Spaniard? With the black hair it kinda works. Luckily he lives on for a while afterwards. The supporting players are all pretty good here, for example also Sydney Greenstreet, who was nominated for an Oscar too the year this came out, so a fairly impressive cast for sure. It surprises me that Rains is the one we are supposed to believe stood out.Well, I would not include Lebeau there. She was featured early on only, really early on, to basically show us how all the women love Bogart's character despite (or because of) his shenanigans, but she added nothing. And I already said that I did not like Bergman one bit here either, so this is not a film at all that shows us great character writing for females back then. Also kinda telling when we see how Bogart's character acts towards women and I am the last person who would say something like that if it wasn't entirely true. Snowflakes must melt. Anyway, what else can I say about this one here? I personally felt that it needed a little while to get going and draw me in with the action. I still was not too big on the overall plot, but preferred individual scenes and moments instead, even if some of these scenes also did not make a huge amount of sense. The best example is the shooting at the end. Are we really supposed to believe absolutely nobody saw who pulled the trigger? Oh well, still a good scene, one of the better. There are many other scenes. I liked the Ugarte/Lorre moments. The flashback scenes in Paris were fine too. The two epic quotes of course (\"We'll always have Paris.\" and the recurring \"Here's looking at you, kid.\", which did not become remotely memorable before the second mention). The scenes with the Black musician were fine as well, even if I must say I am not too amazed by how they treated him, especially Bogart's character. Here and there, we also get an ounce of comedy in this otherwise pretty serious movie and that stems from a pickpocket doing his job. Then there is of course the lengthy sequence with the Bulgarian girl and her lover that was supposed to show us what a good guy Bogart's character really is. Annina is her name. And by the way, she is already living evidence of how the quote that there was never a more beautiful woman than Bergman's character coming to Casablanca is complete nonsense. Oh yeah, another scene I really adored was the big spectacular music scene. This clash between German traditional music and the French anthem was one of the most powerful moments of the movie and showed the resistance against the Nazis in a pretty interesting fashion. Speaking of the music, the film's soundtrack was also nominated for an Oscar and the one who came up with it (Max Steiner) won several Oscars in his career, already had 2 by then and many many more nominations and you can see from the title he was also German (well, Austrian to be exact), but it shows how many German-speaking people were a part of this film, from both cast and crew, and of course all of them are people who had turned their back on Hitler by then. Okay, I guess this should be all then. I enjoyed the watch overall after the film gained pace and the first rather weak 30 minutes were over. So I certainly recommend checking it out and I give it a thumbs-up. You can surely have a pretty decent time seeing this one. Just don't think you will be in for something truly extraordinary because otherwise your great expectations here could end up unfulfilled. Just enjoy it for what it is!"},{"username":"mark.waltz","userUrl":"https://www.imdb.com/user/ur0968789","reviewLink":"https://www.imdb.com/review/rw7556006","warningSpoilers":true,"date":"17 November 2021","rate":"10","helpful":"4 out of 6 found this helpful.","title":"I will always remember this....","content":"And certainly this is Hollywood movie making at its finest, a film that by accident went from an intended standard propaganda war film to unforgettable blockbuster. An early showing in New York made this a 1942 release that didn't make it Oscar eligible, and it's easy to see it taking the prize over the excellent but not as good \"Mrs. Miniver\" since this didn't get wide release (and an L. A. premiere) until early 1943.The success of the movie cannot be pinpointed to one source, because everything that brings this movie together is started from the screenplay, and spread out to the cameraman, director, musical score and the excellent technical team, with even the smallest roles brilliantly cast. You can say that there was an angel over-the-shoulder at Warner Brothers guiding director Michael Curtiz and fully realized to the pairing of Humphrey Bogart and Ingrid Bergman.Bogart wasn't exactly a huge star at the time, having just achieved his first huge success with \"The Maltese Falcon\", and Bergman had been in a few moderately successful films that didn't indicate that she had superstardom ahead of her. This assured legendary status for both, and their single pairing on screen is incredibly perfect, aided by the fact that they never worked together again.For the villains, you have Conrad Veidt as the evil Nazi officer and in smaller roles Sydney Greenstreet and Peter Litre. Claude Rains is initially a character of ambiguous description, but he becomes the moral conscience of the film as you get to know him. He's hysterically funny, especially when he is ordered by Veidt to shut down the casino and then given his gambling winnings after indicating shock that gambling is going on.Bland on the surface, there's much more to Paul Henreid's character than you see on the surface. You can see what drew him and Bergman together yet understand what draws her to Bogart. It's a no win situation for her because she does indeed love both men even if the passion for Bogart is greater. Chance for long term happiness comes with Henreid.Then there's the comic relief of S. Z. Sakall, a character who is much more wise than he lets on, and the soulful performance of singer Dooley Wilson who shows great support for Bogart with great heart and intelligence as well. Wilson easily could have been a supporting actor nominee for this film because he is legendary in this film, and once you've heard him sing \"As Time Goes By\", you'll never forget it.I can watch this film over and over and never be bored. There are films that are classics in a way that over the years has made them notorious and films that have stood the test of time because they are just brilliant. This one fits in the class of the later description, a film so perfect in its casting. This is a film that is completely flawless, patriotic and moving, funny and romantic, and like the sequence where the Nazis sing their anthem while the Allies sing theirs, it is a film that makes viewer stand up and cheer when the good guys win and the bad guys are dealt with in a way that film villains should be."},{"username":"Prismark10","userUrl":"https://www.imdb.com/user/ur4569900","reviewLink":"https://www.imdb.com/review/rw6146110","warningSpoilers":false,"date":"4 October 2020","rate":"10","helpful":"3 out of 4 found this helpful.","title":"Casablanca","content":"Writer and story consultant Robert McKee regards Casablanca as the perfect screenplay. Something he deconstructs in his famous 3 day film screenwriting seminars.In the late 1980s I saw McKee giving his insights on Casablanca on British television. He broke down the beats of a scene from Casablanca when Rick and Ilsa meet in the bazaar where she is looking at some lace. The dialogue is full of subtext and hidden meanings.McKee points out the costume both characters are wearing clothes that included stripes. The setting in the bazaar with some rods above the characters look like prison bars.It shows that both characters were soul mates, somehow bound together. The bars also implied that both of them were also destined to remain apart.It was the first time I realised that costumes and set design even in what initially looked like a mundane scene is not something random. The positioning of the actors on the screen to even shadows that fall on the characters can mean something.The weird thing about the screenplay for Casablanca was that the script was being rewritten as the movie was being made.I have seen Casablanca through the years. It has sizzling lines that are so quotable. it has been imitated so often and misquoted. It has been parodied for decades and the basic premise has been redone many times. Just look at Sydney Pollack's Havana from 1990 that shows what happens if you do not get the script or the chemistry between the actors right.I just watch movies for enjoyment purposes. In my latest viewing of Casablanca during the Covid pandemic of 2020. I found myself gaining more insights. At a time where some people were stranded abroad as flights suddenly got cancelled or had to quarantine and then look for ways to scramble back home. I sympathized with people in the movie who were stuck in Casablanca looking for exit visas to get to Lisbon and then onwards to America.As the film is set before the USA entered the second world war. Rick Blaine (Humphrey Bogart) the cynical, world weary bar owner and American ex pat is basically a metaphor for American isolationism. He cares for himself and his piano player Sam. Rick does not want to get involved with other people's problems. People can visit his bar, drink, gamble and conduct business but just do not ask him for any favours.Blaine gets possession of some stolen letters of transit. Soon two more people arrive in Casablanca looking for a way to escape Europe. Notorious underground resistance leader Victor Laszlo and his companion Ilsa Lund (Ingrid Bergman). Ilsa was Rick's former love in Paris, the one that left him with a broken heart and his idealism in ruins.Rick has been warned by the local police chief Captain Louis Renault (Claude Rains) not to aid Laszlo to escape. Renault wants to stay sweet with the Nazi officer Strasser.The movie is really a bittersweet love story between Rick and Ilsa. In a way her reappearance sees a thawing of Rick's cold heart. He makes a choice to be noble and make sacrifices. In 1942 this amounts to the USA entering the second world war.Apart from the cracking dialogue the movie has memorable but shady characters and lots of humour. Renault is the standout, the corrupt police chief who moves where the wind blows but secretly as his own side. Then there are two members of the cast who followed Bogart from The Maltese Falcon. Peter Lorre and Sydney Greenstreet.The film might now look cliched because it has been done so many times. Just imagine for over 40 years every major film studio has booked McKee to do his 3 day course and deconstruct Casablanca. You must remember this, the movie still stands the test of time."},{"username":"claudio_carvalho","userUrl":"https://www.imdb.com/user/ur2488512","reviewLink":"https://www.imdb.com/review/rw1784226","warningSpoilers":false,"date":"21 December 2007","rate":"10","helpful":"11 out of 21 found this helpful.","title":"The Most Beautiful Movie of the Cinema History Ever","content":"In 1942, in World War II, Casablanca is the escape route to America for a few wealthy or influential people and limbo for many others that wait for a chance to raise money and get a visa. The expatriated American and former idealistic rebel Rick Blaine (Humphrey Bogart) owns the Rick's Cafe Americain, the most famous nightclub and casino in the French Morocco's town. Rick is a bitter and cynical man that neither drinks with costumers nor involves with women, and does not stick his neck out for anyone, keeping a neutral political position in times of war. Rick has a good relationship with the corrupt French Chief of Police Captain Renault (Claude Rains), who is bribed to cover the existence of Rick's casino and protect the place. When two German messengers are killed and the valuable letters of transit in their possession are stolen, the Nazi Major Strasser (Conrad Veidt) arrives in Casablanca seeking the document and the Czechoslovakian leader of the European resistance Victor Laszlo (Paul Henreid). The Germans believe Viktor will try to buy the letters of transit and escape to America. Meanwhile Rick's acquaintance Ugarte (Peter Lorre) asks him to keep the letters of transit for a couple of hours, but is captured and killed by the police and the Germans. Later Victor arrives in the Rick's Cafe with his wife Ilsa Lund (Ingrid Bergman), and when she sees the piano player Sam (Dooley Wilson), she asks him to play and sing \"As Time Goes By\". When the upset Rick complains with Sam for playing the forbidden song, he sees Ilsa and recalls their romantic moments in Paris and the wound in his heart when Ilsa does not leave the town with him without any explanation.\"Casablanca\" is the most beautiful movie of the cinema history ever and the number one of my preference. I do not know how many times I have watched \"Casablanca\", but since the first time I have fallen in love for Ingrid Bergman and Humphrey Bogart and they became my favorite actress and actor. Further, I feel myself emotionally affected every time that I see this film, maybe expecting Rick to stay with Ilsa in the end. But Rick's sacrifice for love is certainly one of the reasons that made \"Casablanca\" an unforgettable masterpiece, maybe the most romantic film ever made. The sequence in Rick's Cafe with the French costumers singing La Marseillaise causes goose flesh on me \u0096 imagine in French people! The wonderful romance is disclosed through a magnificent screenplay, with memorable and witty dialogs, perfect development of the characters and the geopolitical situation of Casablanca in 1942 in a dramatic environment of war and a stunning chemistry of the leading couple. The direction of Michael Curtiz is amazing, using closes, shadows and exploring the talent of the cast at their best with the support of an awesome black and white cinematography. The music-theme is among the most well-known in the world. In the end, \"Casablanca\" is the perfect movie, and Rick and Ilsa will live forever together in my heart. My vote is ten.Title (Brazil): \"Casablanca\""},{"username":"classicsoncall","userUrl":"https://www.imdb.com/user/ur2707735","reviewLink":"https://www.imdb.com/review/rw1187241","warningSpoilers":true,"date":"5 October 2005","rate":"10","helpful":"5 out of 6 found this helpful.","title":"\"Everybody comes to Rick's.\"","content":"\"Casablanca\" has been my favorite movie for the past thirty years, and each annual viewing further cements that standing. For me, it's the perfect film, with perfect characters, locales, action, romance and dialog. In fact, it is the most quoted movie ever, including a line that was never even uttered (Play it again, Sam).It's hard to imagine that during the studio days of the 1940's, \"Casablanca\" was just one more movie being pumped out a week at a time by Warner Brothers. The story itself, based on a stage play \"Everybody Comes to Rick's\" went through continuous rewrites, even as filming was under way. Fortunately, the vision of a handful of gifted artists ultimately found it's way on screen, with a cast as colorful and star studded as any before or since. Even the music, composed for the film by Max Steiner is perfect, dominating the Paris flashback scenes of Rick and Ilsa's fleeting romance.Now picture if you will, the original contenders for the three acting leads in the film; Dennis Morgan for Victo Laszlo, Ann Sheridan for Ilsa Lund, and George Raft or Ronald Reagan for the part of Rick Blaine. If that had actually occurred, the result may well have wound up in obscurity, but instead, Warner Brothers went out of their way to hire on Ingrid Bergman, on loan from David Selznick in return for Olivia DeHaviland. For the part of Victor Laszlo, Warner signed up Paul Henreid who was under contract to RKO Pictures. Coming off a successful on screen collaboration in \"The Maltese Falcon\", Humphrey Bogart as Rick was once again supported by Peter Lorre as the scheming Ugarte, and Sydney Greenstreet as the conniving owner of the rival gambling joint, \"The Blue Parrot\". Rounding out the major film credits, Conrad Veidt successfully sneers his way into Rick's world as Nazi General Major Strasser; and for sheer delight in a characterization, there's none to equal Claude Rains' portrayal of Prefect of Police Captain Reinault. Rick and Ilsa may have always had Paris, but Rick and Reinault have always had Casablanca.The ultimate outcome of the film was not known during early film production in May of 1942. It was not until brothers Julius and Philip Epstein, brought in for their humorous wit, both got their inspiration in a single moment while driving down Sunset Boulevard - \"Round up the usual suspects\". Cleverly interjecting the elimination of the hated villain Strasser by the film's hero, the film successfully answers the question of who gets the girl. Ilsa, in love with one man but devoted to the cause of another, must resign herself to the fate entrusted to Rick the night before - \"You have to think for both of us, for all of us\".Even world events conspired to help \"Casablanca\" achieve it's unparalleled success. Originally to be released in June 1943, Warner Brothers' dedication to the war effort was matched by the Allied landing in North Africa in November 1942, in Casablanca. Shortly after on Thanksgiving Day 1942, the film opened in New York following a wildly enthusiastic pre-screening. And in a well timed follow up, the general release date of January 23, 1943 coincided with a conference between President Roosevelt and Prime Minister Churchill in Casablanca.\"Casablanca\" cemented Humphrey Bogart's reputation as a romantic leading man, and made Ingrid Bergman a very popular star. Though each would continue on in highly successful careers, they would not appear in another film together, and that's probably for the best. Both artists achieved their master work in \"Casablanca\", and how do you top a perfect?"},{"username":"lee_eisenberg","userUrl":"https://www.imdb.com/user/ur4888011","reviewLink":"https://www.imdb.com/review/rw1226524","warningSpoilers":false,"date":"28 November 2005","rate":"10","helpful":"5 out of 9 found this helpful.","title":"Here's lookin' at you, film.","content":"Overall, \"Casablanca\" went a little overboard on being pro-American, but certain traits make it worthwhile. The plot of course has American expatriate Rick Blaine (Humphrey Bogart) owning a Cafe Americain in WWII-era Casablanca and meeting ex-lover Ilsa (Ingrid Bergman).Much of the film's strength lies in its dialogue. Rick says \"I don't stick my neck out for nobody.\" Alone, this helps the audience understand what kind of a person he is, but the movie also shows his other side. When Ilsa comes to the café, Sam (Dooley Wilson) tells her \"A lot of water been under the bridge.\" This alone is enough to describe not only Rick and Ilsa's life, but also the events that had come to dominate the world during the past few years.As for the other characters, Paul Henreid plays Ilsa's husband Victor Laszlo. Even though he has been fighting the Nazis, one wonders how much value he has in life. Capt. Renault (Claude Rains) is amoral but we grow to respect him. Conrad Veidt, Peter Lorre, and Sydney Greenstreet also provide great characters. All in all, \"Casablanca\" remains the embodiment of the phrase: \"They don't make 'em like they used to.\""},{"username":"gavin6942","userUrl":"https://www.imdb.com/user/ur1234929","reviewLink":"https://www.imdb.com/review/rw2209533","warningSpoilers":false,"date":"18 February 2010","rate":"9","helpful":"3 out of 5 found this helpful.","title":"Classic Film at Its Best","content":"In Casablanca, Morocco, during World War II, there is a place called Rock's run by an American where fugitives can meet safely and enjoy a refreshing drink and soothing music. Think of it as a 1940s Mos Eisley Cantina, if you will. And at the center of it all? Rick, played by Humphrey Bogart.It really goes without saying that this film is a classic, and probably one of the most famous and highly acclaimed films ever, as well as being Humphrey Bogart's biggest role. It is quotable, the scenes have been emulated or parodied scores of times... what more can I say that hasn't been said over the last sixty-odd years? So, I will say two things: one, this film loses nothing to time. Despite being a clear period piece (filmed during WWII and taking place as a war film, sort of) it resonates just as strongly today with audiences as it did the first day. And also, it exceeded my expectations. Surely I thought it would be good. But often when films (or anything, really) have something of a legendary status, the hype is difficult to match. \"Casablanca\" matched the hype and at times went above and beyond. From the opening scene with the spinning globe, I knew this was going to be the next step in film history -- perhaps \"Casablanca\" is the first modern film?"},{"username":"jboothmillard","userUrl":"https://www.imdb.com/user/ur4248714","reviewLink":"https://www.imdb.com/review/rw1123871","warningSpoilers":true,"date":"11 July 2005","rate":"8","helpful":"6 out of 16 found this helpful.","title":"Casablanca","content":"I have seen this enough times to have the same opinion every time, it could be a little better, nevertheless I did see this film featured in the book 1001 Movies You Must See Before You Die, from Oscar winning director Michael Curtiz (The Adventures of Robin Hood, Mildred Pierce). Basically, set in World War II, many Europeans are trying to get into America to escape the threat of the Germans, but to do that they have to go to Casablanca, Morocco and get a visa. A hot spot in the town is Rick's Cafem run by American exile Rick Blaine (Oscar nominated Humphrey Bogart), who is shocked to see his past lover Ilsa Lund (Ingrib Bergman) walk into his place. He has a flashback about what he and Ilsa used to get up to when they were in love, and now she is married after running away to Paris. He has other problems however, Ugarte (Peter Lorre) has given him important transit letters, Nazi officer Major Strasser (Conrad Veidt) is snooping around, and police Captain Renault (Claude Rains) tries to make the Nazi happy detaining Czech underground leader Victor Laszlo (Paul Henreid). In the end, to save her husband's life, Rick forces Ilsa to board a plane leaving the country, the letters are given to the right people, and when Rick looked like he was going to be in trouble he was saved by his new friend. Also starring Sydney Greenstreet as Signor Ferrari, S.Z. Sakall as Carl, Madeleine Lebeau as Yvonne and Dooley Wilson as Sam. I personally think that this film is a little overrated, Bogart is really good, Bergman is beautiful and the supporting cast all do good too, and the score is great. My concern is that the only thing I will ever remember are the memorable catchphrases and little love story in amongst everything else which I find a little confusing and too political, but it's not a bad film at all, it is a classic wartime romantic drama to see. It won the Oscars for Best Writing, Screenplay and Best Picture, and it was nominated for Best Cinematography, Best Film Editing and Best Music for Max Steiner. It was on 100 Years, 100 Quotes at number 67 (\"Of all the gin joints in all the towns in all the world, she walks into mine.\"), number 43 (\"We've always got Paris.\"), number 32 (\"Round up all the suspects.\"), number 28 (\"Play it, Sam. Play 'As Time Goes By.'\"), number 20 (\"Louis, I think this is the beginning of a beautiful friendship.\"), and number 5 (\"Here's looking at you kid.\"), \"As Time Goes By\" was number 2 on 100 Years, 100 Songs, Ingrid Bergman was number 68, and Humpherey Bogart number 36 on The 100 Greatest Movie Stars, Bogart was also number 1 on 100 Years, 100 Stars - Men, Bergman was also number 4 on 100 Years, 100 Stars - Women, Rick Blaine was number 4 on 100 Years, 100 Heroes & Villains, \"As Time Goes By\" was number 2 on 100 Years, 100 Songs, the film was number 35 on The 100 Greatest Tearjerkers, it was number 37 on 100 Years, 100 Thrills, it was number 30 on The 100 Greatest War Films, it was number 1 on 100 Years, 100 Passions, it was number 32 on 100 Years, 100 Cheers, it was number 2 on 100 Years, 100 Movies, and it was number 16 on The 100 Greatest Films. Very good!"},{"username":"rmax304823","userUrl":"https://www.imdb.com/user/ur0819382","reviewLink":"https://www.imdb.com/review/rw2121052","warningSpoilers":true,"date":"2 September 2009","rate":"5","helpful":"9 out of 26 found this helpful.","title":"Wartime Drama, Intrigue, Romance in Exotica.","content":"Since no one reading these comments knows the plot, I'll outline it. Loner Humphrey Bogart runs a shady saloon and gambling house in French Morocco in 1942. The Nazis are closing in. The region is under the government of the French puppet government and is represented by Claude Raines. Bogart is wary of relationships. \"I stick my neck out for nobody.\" Into his gin joint walks an old girl friend, Ingrid Bergman, and her husband. They're still in love but Bergman is bonded to her idealistic husband, a resistance hero and concentration camp escapee. Bogart is distraught. A flashback reveals that they were lovers in Paris before it was occupied by the Germans. They kiss often on the screen and it's even suggested that they had premarital intercourse. Bergman finds out that her husband is still alive and deserts Bogart without explanation. The rebuff leaves him shocked -- shocked! Back in the present, in Rick's café in Casablanca, it's revealed that Bogart has two unimpeachable passes out of Casablanca, which Bergman attempts to get from him, for use by her and her hero husband, at the point of a gun. But she can't shoot Bogart. Instead, she collapses in his arms. The scene dissolves. When the next scene fades in they are standing apart and conversing. I suspect another illicit interlude has taken place.In the end, good prevails. Bogart and Bergman sacrifice their love for the greater good.It's practically an icon of 1940s Hollywood. It has a great cast -- Bogart, Bergman, Cuddles Sakal, Claude Raines, Greenstreet and Lorre from \"The Maltese Falcon,\" Paul Henreid, John Qualen, Leonid Kinsky, Conrad Veidt from Fritz Lang's \"The Cabinet of Doctor Caligari.\" It was probably the high point of Michael Curtiz's career. And it's been applauded by fans from all over the world for almost seventy years.And it's not bad, either. It's just that, to the extent that it eludes my aesthetic apparatus, I guess it's because I find it no more than an interesting but strictly routine tale of the nasty Nazis, the ambiguous French, the heroic European resistance, and the cynical and embittered American who converts to the values of the Free World at the end. Bogart was to play similar roles for the rest of his career. (Cf., \"Key Largo.\")The very features of the film that are so consistently pointed to as its greatest assets I find kind of corny. Everybody quotes tag lines. \"The problems of two people don't amount to a hill of beans in this crazy world.\" \"Round up the usual suspects.\" \"Louie, I think this is the beginning of a beautiful friendship.\" I remember every detail of Paris. The Germans wore gray, you wore blue.\" Then there's the scene in which the Free French outsing the Germans. Is that cannon fire or is it myself I hear snoring? The movie is okay for what it purports to be, a strictly commercial, patriotic effort from Warner Brothers. There's nothing to indicate the slapdash quality of the shooting itself. (At one point, Bogart had a scene in which he stood on a balcony nodding at something below, without knowing what the something was supposed to be.) I watch it more out of a sense of duty than any magnetic attraction towards an irresistible film. The schmaltz is frankly irritating. I wince, watching the tears roll down Bergman's gorgeous face, hearing Bogart's repeated, \"Here's looking at you kid.\" It would be nice to think that there was more going on than what we see and hear on the surface. Somewhere between the rainy train station in Paris and the colorful desert resorts of Casablanca, couldn't Bogart have come out of the closet? Maybe he and Claude Raines were jealous of one another? Couldn't Bogart have sent Bergman off with her husband because he was more in love with his collection of ladies' undergarments? He found the local goat herds more inspiring?Anything?"},{"username":"ccthemovieman-1","userUrl":"https://www.imdb.com/user/ur4445210","reviewLink":"https://www.imdb.com/review/rw1286882","warningSpoilers":false,"date":"8 February 2006","rate":"10","helpful":"24 out of 41 found this helpful.","title":"Tough To Beat This Movie","content":"I am not getting into the \"The greatest picture of all-time\" debate. It's too subjective but if I forced to cast a vote, I would give this the most serious consideration. I mean, what aspect of this film isn't top-notch?The dialog is superb, one of the best ever put on film. The acting is great, cinematography first-rate and the story offers an interesting mix of drama, action, romance, music...you name it. This film has everything but color, which might prohibit of a lot of younger folks from ever checking this classic out. That would be a shame because film- making doesn't get much better than \"Casablanca.\"All of this doesn't mean it's my favorite film of all-time. It isn't even in my top ten but I always find it very, very enjoyable and the latest 2-disc DVD transfer makes it even better to view.Humphrey Bogart and Ingrid Bergman, of course, are the stars but I always found Claude Raines' character the best to watch. His witty dialog as the police chief always makes me smile. He has many clever lines and isn't a guy you can figure out. He and Bogart's character are similar, essentially coming across as people who only care about themselves but deep inside are good-hearted people.The ending is much discussed and very famous and helps make the movie so revered. There has been so much written about this film that there I won't add more except to make one negative statement but that's about a line in the story and not a reflection on the quality of the film. I wasn't impressed that Bergman, despite being married, was willing to run off with Bogart, claiming she \"doesn't know\" what's right or wrong! Are you serious? Well, judging by the marriage records of Hollywood over the years, maybe they don't know adultery just might be wrong. Anyway, other than that, this is a great movie with many, many classic scenes. Bergman never looked prettier, albeit the aid of soft lens shots on her closeups, and Bogey was never more, well, Bogey, than in here. Add Paul Henreid, Sydney Greenstreet, Peter Lorre and other fine actors and wow, what a cast!An added bonus is hearing \"As Time Goes By\" throughout the film, a haunting song. Actually, there are several songs played, mainly by pianist Dooley Wilson, and they're all fun to hear. As I said, one could go on and on about this movie. 'Nuff said."},{"username":"Tweekums","userUrl":"https://www.imdb.com/user/ur13977076","reviewLink":"https://www.imdb.com/review/rw2100430","warningSpoilers":true,"date":"23 July 2009","rate":"10","helpful":"4 out of 6 found this helpful.","title":"One of the greatest films ever","content":"If ever a film deserved to be considered a classic then this is it, even if you haven't seen it before you'll recognise much of the dialogue; it is probably the most quoted, and misquoted, film of all time. Humphrey Bogart is excellent in this career defining role as bar owner Rick Blaine who has come into possession of two \"letters of transit\" which guarantee the holders unhindered passage out of Casablanca. He has these as Ugarte, the man who asked him to look after them, was captured by the Vichy French police before he could get them back. Ugarte had been planning to sell the documents to Victor Laszlo, a Czech nationalist who is fleeing from Nazi occupied Europe to the United States via neutral Portugal. Things are complicated by the fact that Laszlo's wife Ilsa had a relationship with Rick before the fall of Paris and he never really got over her.Right up until the end we don't know what Rick will do, perhaps he will let Victor and Ilsa have the letters, perhaps he will let Victor have them on condition that Ilsa stays with him or perhaps he will betray Victor and leave Casablanca himself with Ilsa. Bogart isn't the only great performance; Ingrid Bergman is fantastic as Ilsa, there is a real chemistry between her and Bogart, Claude Rains is great as the French policeman who's loyalty is likely to change depending on who he thinks is likely to be the most use to him and Paul Henreid's restrained performance as Victor Laszlo is faultless too.It is hard to say what genre this film is, it is one of the great romances, it is also a war film, a thriller and even has some subtle comedy moments. Don't be put off by the film's age, the fact that it is in black and white or that it has a U certificate, this film is a must see. Whatever your tastes you owe it to yourself to watch this at least once, although I suspect few people will only want to watch it just once."},{"username":"ma-cortes","userUrl":"https://www.imdb.com/user/ur3270789","reviewLink":"https://www.imdb.com/review/rw1212121","warningSpoilers":false,"date":"9 November 2005","rate":"8","helpful":"6 out of 7 found this helpful.","title":"The most famed for many and one of the greatest movie ever realized","content":"Casablanca is deemed by many to be the biggest picture ever made and one of most famous movies of all time . It's a masterpiece produced in 1942 that was thought as a run-of-the-mill studio production . It was only afterwards which it became clear that it would be a landmark cinema . Humphrey Bogart's forty ninth film , would transform the studio contract player into a superstar and to be the first in a whole string of Warner Brothers's classics in which he would play the leading role . Producer Jack Warner assigned the Rick's role for George Raft , however Hall B. Wallis wanted to Bogart who luckily obtained the important character , but he previously played only mobster roles and afterwards romantic protagonists , besides tough main lead. It's an extremely romantic film converted in cinema history with images (Rick and Ilsa embraced) , moving scenes (final farewell in the airport) and dialogs have been used or imitated in other films, spots and television programmes .Casablanca is homaged with fascination as in ¨One from the heart¨ (by Francis Ford Coppola) or from irony as ¨Play it again Sam¨(Herbert Ross). The movie has immortal images with memorable quotes and the best scenes ever written , such as the exciting final when Bogart bids Bergman farewell at the airport with ¨Here's looking at you kid¨still has audiences choking back a tear. All film originates unforgotten characters as makes with Wilson, the piano player to whom Ingrid Bergman says : ¨play it Sam¨. Bergman is enticing and wonderful , stunningly photographed by Arthur Edeson , she was fortunate to have Orry Kelly an hugely talented designer costume to dress her. His shone as radiantly as Bergman's luminous beauty who never looked lovelier. Along with a fabulous plethora of secondaries such as : Claude Rains , Paul Henreid , Conrad Veidt , Peter Lorre , S.Z.Sakal, Madeleine Lebeau , John Qualen , Dooley Wilson , among others . And a large number of extras , as in the famous scene where the \"Marseillaise\" is sung over the German song \"Watch on the Rhine\", many of them had real tears in their eyes ; they were actual refugees and Jews who had escaped from Nazi persecution in Germany and elsewhere in Europe and were overcome by the emotions the scene brought out . The motion picture with sensitive score by Max Steiner was very well directed by Michael Curtiz . Well worth seeing for everybody and specially to the classic cinema lovers."},{"username":"moonspinner55","userUrl":"https://www.imdb.com/user/ur0989035","reviewLink":"https://www.imdb.com/review/rw1728701","warningSpoilers":false,"date":"11 September 2007","rate":"6","helpful":"7 out of 16 found this helpful.","title":"Great characters, classic dialogue, teary-eyed romance...","content":"Humphrey Bogart in his preeminent role, that of the marvelously tough nightclub owner Rick Blaine, living in Algiers and sheltering refugee ex-girlfriend Ingrid Bergman and her new husband from the invading Nazis. Bogart is so ideally cast, the minute you see him on-screen in his white tuxedo jacket is a welcome sight. Bergman is somehow less interesting, and director Michael Curtiz keeps her crying all the time (usually in close-up), which, although appropriately tender and moving, becomes repetitive. The screenplay, reportedly the victim of frequent change on the set, is loosely structured and is often handled indifferently by Curtiz, who nevertheless stages some classic sequences, particularly the finale at the airport. But what does Rick mean by his line, \"I think this is the beginning of a beautiful friendship\"? Has Ilsa's emotional devotion sworn him off women for good? Beautiful cinematography by Arthur Edeson; Max Steiner's score is used to underline everything, but Herman Hupfeld's \"As Time Goes By\" makes up for the oversell. *** from ****"},{"username":"TxMike","userUrl":"https://www.imdb.com/user/ur0438066","reviewLink":"https://www.imdb.com/review/rw0026286","warningSpoilers":true,"date":"17 September 2003","rate":"","helpful":"5 out of 6 found this helpful.","title":"Simply, one of the classic movies and still superb after all these years.","content":"\"Who thinks 'Casablanca' is the number one movie of all time?\" That is a game many play, but I refuse to play it, because I don't think it matters. I have seen many movies over the past five decades, and 'Casablanca' is one of my all time favorites. It is set in a mysterious place at a very mysterious time, and has many mysterious figures running through the story. It has war, it has friendship, it has love, it has sacrifice. All the elements combine to form an entertaining but gripping film that always seems as fresh as the first time you viewed it.This is perhaps my favorite Humphrey Bogart role, as Rick Blaine the exiled American who owns and operates his own gin joint. We know he isn't totally a good man, but we also sense that inside he is not a bad man at all. Mostly he just wants to do his job and be left alone. But danger lurks at the turn of every page of script.Most SPOILERS follow. The crux of the story involves Rick, Ilsa (Ingrid Bergman) and Victor (Paul Henreid). Rick and Ilsa have a history, they parted under suspicious circumstances when she failed to meet him at the train leaving town. Now she shows up with a husband that Rick never knew she had. Victor and Ilsa want safe passage to America, and Rick holds the papers that can get them there. Still in love with Ilsa, he realizes that true love will give her what she needs, and he does. Safe passage for her and her husband.Casablanca has quite a good ensemble cast, with stars in their own rights Claude Rains as Capt. Louis Renault, Conrad Veidt as Maj. Heinrich Strasser, Sydney Greenstreet as Signor Ferrari, and Peter Lorre as the shady Guillermo Ugarte.The DVD is superb!!"},{"username":"Quinoa1984","userUrl":"https://www.imdb.com/user/ur0453068","reviewLink":"https://www.imdb.com/review/rw1458979","warningSpoilers":false,"date":"26 August 2006","rate":"10","helpful":"6 out of 8 found this helpful.","title":"a classic that's known to people long before they actually see the movie","content":"For years when I was younger I thought I had seen Casablanca, but it wasn't until I was 17 that I actually SAW the entire thing from start to finish. Before that, I had seen some of the most indelible scenes from the picture (I don't remember them all, but one had Peter Lorre, another was when Bogie is drunk in the bar after the bar is closed and Bergman's Isla goes to him and he tells her off, another was, of course, the last scene). It's when one sees all of the story put together and all of those really terrfic scenes in the club that it really does gell as being a classic. It might not be up there for me with the very great films ever like Citizen Kane or One Flew Over the Cuckoo's Nest, but there's never a minute, a line, or a performance in Casablanca that turns out to be dull or un-watchable. It's by turns very funny in a few spurts even though it's a romantic drama of the highest Hollywood order. For some on the level of movies dealing with loves lost and found and lost again it's no wonder that this takes the cake. Even the last scene, the lines of which have been parodied God knows how many times now, still has that ring of emotion in the greatest escapist sense. It's a must-see-once kind of movie, even if you find that you don't like the movie.And the cast is probably one of the best reasons to see it. It's really got the best crop of stars and character actors from Warner brothers and beyond. Bogart and Bergman have their spotlight on them here at full blast and they each deliver impeccable performances in roles that aren't too unexpected, but never less than stylish and dramatic. Then there's Peter Lorre, Peter Greenstreet, and of course Claude Raines who probably gives if not his most memorable performance one of his most striking. It's rare that an actor is given such a part that really fits him and still keeps a hold on the viewer so many years later. From the story intrigue and deception and danger involving the Nazis, the heroism and sacrifice that gets involved, and at the core of it- after the club which Bogie owns- is the love triangle that gets resolved in a somber way that makes for a sensational ending. In fact, it's main goal is to be sensational, and for the most part it's truly successful, from its 'a kiss is just a kiss' song to the sweet one-liners."},{"username":"JohnHowardReid","userUrl":"https://www.imdb.com/user/ur12596887","reviewLink":"https://www.imdb.com/review/rw3765700","warningSpoilers":true,"date":"27 July 2017","rate":"10","helpful":"4 out of 6 found this helpful.","title":"One of Hollywood's Greatest!","content":"If ever a movie deserved the year's most prestigious award for Best Picture, Casablanca is it! The tragedy is that Bergman was not even nominated for Best Actress, and that Bogart and Claude Rains both lost! And that Arthur Edeson was passed over for Best Photography is equally incomprehensible! Time has robbed many of the other winners and nominees (Joan Fontaine in \"The Constant Nymph\"? Mickey Rooney in \"The Human Comedy\"? J. Carroll Naish in \"Sahara\"?) of present-day relevance, but Casablanca — the first cult movie — has undoubtedly been seen and enjoyed by a far greater audience than all the other 1943 nominations put together.What is the reason for this amazing popularity? I'd like to put it down to the picture's excellence in all departments:— its stylish, pacey direction, the enormous variety and drama of its camera set-ups, its sharp film editing and artistic lighting — not to mention its superb performances and engrossing plot. In his fascinating book Cult Movies, Danny Peary feels that audiences respond because \"Casablanca\" contains every element of ideal entertainment — \"Action, adventure, bravery, danger, espionage, exotic locale, friendship, gun-play, humor, intrigue, a love triangle, a masculine hero, a mysterious heroine, patriotism, politics (without being too political), romance, sentimentality, a theme song, a time factor, a venomous villain, and war.\"Yes, Peary is absolutely on the right track. \"Casablanca: provides all these ideal qualities — and more. Rick is not only a masculine hero — but a hero with a romantic past. This is the trait that appeals to women, while men admire Rick's resourcefulness and savage wit. And, as Peary points out, there's not just a simple friendship between the Bogart and Rains characters, but a tension, a respect, a latent guiltiness for abandoned ideals. These three- dimensional characterizations make the film seem so realistic despite its preposterous plot and laughable stage devices such as the irrevocable letters of transit.Tension is what \"Casablanca\" is all about. The war-time tension of the setting, the tension of the plot, and especially the tension between the characters — not just tension in the broad sense or even tension between the principal figures in the action, but tension between just about every character in the script — between Bogart and LeBeau for instance, between Rains and Veidt, between Curt Bois and Olaf Hytten, between Rains and Joy Page, between Veidt and Sakall, between Kinsky and LeBeau, between Lorre and Bogart, between the Italians and the Germans. This is just the beginning of a list. But then you have inner tension in the characters themselves, particularly Bogart and Bergman of course, but even in minor figures like John Qualen and Dooley Wilson. Only Henreid and Veidt, who both stand for what they see as ideals, are free of any guilt or self- doubts and can be relied upon to act decisively and predictably at any given moment. This is why the climax is so effective and Veidt's action is just what we would expect. Hard to believe isn't it that a script so perfectly constructed — such a fine meshing of so many disparate elements — was the work of many hands, often working independently and (especially in the latter half of the film) in considerable haste?That's the picture business. Curtiz's control, mastery and unification of all these elements cannot be over-estimated. And he gives them class, style, polish and atmosphere as well."},{"username":"tavm","userUrl":"https://www.imdb.com/user/ur11228318","reviewLink":"https://www.imdb.com/review/rw6114681","warningSpoilers":false,"date":"22 September 2020","rate":"10","helpful":"1 out of 2 found this helpful.","title":"Casablanca is the definite all-time movie classic!","content":"Since my mom once mentioned not ever watching this from beginning to end, I thought I'd rectify that now. She loved it and I once again did. How could one not when listening to the sparkling dialogue, or seeing the great images courtesy of director Michael Curtiz who won his only Oscar for this? And of course there are all those great players starting with Humphrey Bogart and Ingrid Bergman whose only teaming on film this was and who made such a great romantic couple here. Paul Henreid as Ingrid's other leading man wasn't so bad either especially during that \"dueling anthems\" scene. Then there's Claude Rains as the French prefect whose loyalties are constantly tested for him and us. And, finally, Dooley Wilson is aces especially when singing \"As Time Goes By\". Really, I'll just now say Mom and me definitely highly recommend Casablanca and leave it at that! P.S. Since my favorite movie is It's a Wonderful Life, I have to again cite someone from that movie that's also in another one I'm reviewing. In this case, William Edmonds-Mr. Martini in IAWL-plays one of the patrons of Rick's Cafe Americain in the beginning scenes here."},{"username":"edwagreen","userUrl":"https://www.imdb.com/user/ur2542703","reviewLink":"https://www.imdb.com/review/rw1476470","warningSpoilers":false,"date":"16 September 2006","rate":"10","helpful":"2 out of 3 found this helpful.","title":"Play it Over & Over Again Warner Brothers ****","content":"\"Casablanca,\" a memorable 1943 film,received the Oscar for best picture. In those years, the academy nominated 10 films. That practice would end the following year when only 5 films would receive nominations. While my favorite for 1943 was \"For Whom the Bell Tolls, I have to admit that \"Casablanca\" is a film classic which will survive throughout time to come.Humphrey Bogart was phenomenal in the role of Rick, the casino owner who finds his love Elsa, so well portrayed by Ingrid Bergman. Problem is that Elsa has married Paul Henreid, who gives another excellent performance in the tradition of \"Now, Voyager,\" which was the year before.Claude Rains is just great as the police official who knows that Rick is right in a setting with a pro-Nazi government.Who can forget the lines- PLAY IT AGAIN SAM, HERE'S TO YOU KID, LOUIE, IT'S THE START OF A BEAUTIFUL FRIENDSHIP, ROUND UP THE USUAL SUSPECTS.Made during World War 11, the film evoked much sympathy from its audiences. An oddity in the Oscar voting was while the picture and director won, Bogart and Claude Rains, the latter in a supporting role, both lost the coveted Oscar to Paul Lukas and Charles Coburn respectively. Bergman was not nominated here but did snag a nomination that year for \"For Whom the Bell Tolls.\"Casablanca has always been a sight for intrigue in motion pictures. It just continues with this memorable film.Keep playing it again Warner Brothers."}],"errorMessage":""}