{"imDbId":"tt0056058","title":"Hara-Kiri","fullTitle":"Hara-Kiri (1962)","type":"Movie","year":"1962","items":[{"username":"MartinHafer","userUrl":"https://www.imdb.com/user/ur2467618","reviewLink":"https://www.imdb.com/review/rw1497674","warningSpoilers":true,"date":"15 October 2006","rate":"8","helpful":"9 out of 20 found this helpful.","title":"Sort of an \"Anti-Samurai\" flick","content":"This film was very well-made and the story is excellent. The story begins with a man asking his local warlord permission to commit ritual suicide. His reason is that the country has been at peace so long that ronin (out of work and master-less Samurai) have no income and nothing to do. So, instead of the indignity of just wasting away, a vicious and painful suicide is apparently the best option! Instead of instantly granting this request, the Counselor tells the suicidal ronin about a similar request that occurred recently and how the ronin who killed himself probably only asked for permission to die as a ruse to get money from the warlord! In other words, this other man had hoped that his request would NOT be granted and he would instead been given a small income. But, not wanting to see the Bushido code perverted, the warlord demanded that this man commit ritual suicide--even though the sword the ronin had was made of bamboo and doing the painful ritual was super-painful and difficult with such a sword.This story was pretty interesting but how it related to this second ronin is what makes this story so interesting. Plus, I loved how the story ended.Overall, I think this is a bit of an \"anti-Samurai\" film, as it talked how adherence to the rules of Bushido actually could be very cruel and violate the spirit of the feudal system. The inherent cruelty and desire to only worry about appearances instead of right and wrong make this an excellent and intriguing movie. Good stuff."},{"username":"SnoopyStyle","userUrl":"https://www.imdb.com/user/ur2898520","reviewLink":"https://www.imdb.com/review/rw3172413","warningSpoilers":false,"date":"28 January 2015","rate":"7","helpful":"4 out of 12 found this helpful.","title":"horrific scene","content":"It's 1630. There is peace in the land and many samurai have become poor homeless vagrants. Hanshiro Tsugumo is a samurai whose clan has fallen. He comes to the home of a feudal clan to ask permission to commit seppuku within the courtyard. Kageyu Saito is a senior counsel and he tries to deter the man with the story of another ronin Motome Chijiiwa from the same clan. They forced him to do the job despite he has sold his blade. All he has is a blade made of bamboo. It's a brutal painful event. Nevertheless, Hanshiro insists on continuing with his seppuku and then he reveals that he did indeed know Motome.The first recollection is actually quite compelling. It catches my attention culminating in one of the most memorable horrific scenes. The rest of the movie can't really compare. It's another series of recollections and it's not as compelling. I think it would be just as good to compress the second half and keep the big final fight."},{"username":"claudio_carvalho","userUrl":"https://www.imdb.com/user/ur2488512","reviewLink":"https://www.imdb.com/review/rw2560250","warningSpoilers":false,"date":"3 February 2012","rate":"10","helpful":"19 out of 27 found this helpful.","title":"A Heartbreaking and Tragic Story of Poverty and Revenge","content":"In 1630, after a long period of peace in Japan after the end of the clans, thousand of samurais do not have masters and are living in absolute poverty. The ronin Hanshiro Tsugumo (Tatsuya Nakadai) and former samurai of Lord of Geishu arrives at the house of Lord Lyi requesting a spot to commit hara-kiri (an honorable form of suicide through self-inflicted disembowelment followed by decapitation under the samurai code).Tsugumo is received by Umenosuke Kawabe (Yoshirô Aoki), who tells the story of the young samurai Motome Chijiiwa (Akira Ishihama) that arrived at the house also asking for a place to commit hara-kiri but expecting to receive coins instead. The warrior Hikokuro Omodaka (Tetsurô Tanba) convinces the clan to force Chijiiwa to really commit suicide using his bamboo blade as an example to other samurais that would appear using the same pretext to receive coins from the master.Tsugumo discloses that the lad Chijiiwa was his son-in-law that was forced to the situation expecting to raise some money to treat his sick wife and baby son. Further, Tsugumo had arrives in the house expecting to die not committing suicide, but revenging Chijiiwa, his daughter and his grandson.\"Harakiri\" is a heartbreaking and tragic story of poverty and revenge in a period when Japan was ruled by the Tokugawa clan and thousand of samurais lost their work with the fall of the clans. This film is a little masterpiece based on the wealthy history and culture of Japan and the screenplay uses flashbacks and gives an explanation of this period of story for those that do not have a minimum knowledge of the history of Japan. The Internet is a useful tool to understand the big picture of this historical moment.The acting is top-notch and the cinematography in black and white is magnificent. My vote is ten.Title (Brazil): Not Available"},{"username":"classicsoncall","userUrl":"https://www.imdb.com/user/ur2707735","reviewLink":"https://www.imdb.com/review/rw4080979","warningSpoilers":true,"date":"4 March 2018","rate":"8","helpful":"5 out of 7 found this helpful.","title":"\"I came here with every intention of dying.\"","content":"Unlike all the Kurosawa films I've seen, this one has a principal protagonist that announces his intention early in the story and then takes the viewer on a stunning journey of revenge that's entirely unexpected. Director Masaki Kobayashi prepares the viewer with a preliminary accounting of the fate of thousands of unemployed Samurai as a result of the 17th Century dissolution of the Japanese Shogunate. Masterless Samurai, or ronin, appear at the doorstep of a feudal lord requesting a place in which to perform ritual suicide, but for the dishonorable, this effort is merely a ploy to accept some small token of monetary value before moving on. \"Harakiri\" tells the story of two such ronin, and until we learn the true relationship of both men to each other, the viewer is at a loss to understand the real motivation of Hanshiro Tsugumo (Tatsuya Nakadai). With frequent forays into the past utilizing a series of flashbacks, Tsugumo relates the story of his son-in-law, helpless in the face of his wife's deteriorating physical condition and unable to seek medical attention for their sick baby due to lack of resources. What I found quite clever about the story was the absence of the three men Tsugumo called for to be his seconds for the purpose of hara-kiri. One realizes that it can't be simple coincidence that none of these men are available, as the story swerves to a desperate climax that pits Tsugumo against the entire House of Iyi. What would have been a tremendous let down in the story is avoided when Tsugumo follows through on his original mission, unable to physically overpower all the retainers employed by the clan's Master. So many films have the story's hero defeat an overwhelming number of rival opponents that it reduces the credibility factor to zero. At the point Tsugumo knows he can no longer pursue a fight strategy, he takes his life in the ritual manner. For followers of Japanese cinema, this film is a must see, with it's emphasis on honor, loyalty and embracing the truth of one's convictions. Tsugumo's unselfish final act unmasks the hypocrisy of the feudal lord's position, and mocks the cowardice of it's counselor Saito (Rentarô Mikuni). An appropriate amount of swordplay attends the story without becoming excessive, allowing for the more subtle aspects of Tsugumo's strategy to take over the narrative, which it does in compelling fashion."},{"username":"gavin6942","userUrl":"https://www.imdb.com/user/ur1234929","reviewLink":"https://www.imdb.com/review/rw3157825","warningSpoilers":false,"date":"7 January 2015","rate":"9","helpful":"4 out of 6 found this helpful.","title":"Sadly Overlooked","content":"An elder ronin samurai (Tatsuya Nakadai) arrives at a feudal lord's home and requests an honorable place to commit suicide. But when the ronin inquires about a younger samurai (Akira Ishihama) who arrived before him things take an unexpected turn.For many, samurai films may be closer associated with Kurosawa... but this one, possibly the best ever made, comes from Masaki Kobayashi. How does Kobayashi not have the same level of international fame as Kurosawa? Interestingly, Hanshirō is able to fight off a great many retainers with a sword, yet is helpless against three guns; this is a foreshadow of the Meiji Restoration, wherein sword-bearing samurai were defeated by the \"new\" Japanese military. Indeed, the whole notion of \"honor\" and all that comes with it is radically changed once the battles become uneven."},{"username":"tedg","userUrl":"https://www.imdb.com/user/ur0643062","reviewLink":"https://www.imdb.com/review/rw3177293","warningSpoilers":true,"date":"4 February 2015","rate":"","helpful":"10 out of 13 found this helpful.","title":"Layered Stories in Conflict","content":"This has to be the best movie I have seen in a while. Good luck to me that I would like to pass on to you.We have two warring narrators. The first begins the film as an entry in his journal as local governor of a wealthy country estate. The film is closed with him finishing his entry, some days later. This official narrative deviates from what we see at the end.His story: one, then a second unattached ronin appeal to commit suicide in their courtyard. The first of these it is plain is just looking to be paid to leave, but our narrator is very strict about cleaving to that ronin's story. If he says he wants to kill himself, well then he must. This poor man had sold his sword and was now carrying bamboo, and it is this that he was forced to use. The resulting death is disturbing.So midway in the film, we have a samurai who has suffered because he was forced to live his story, forced by the narrator-governor who we later watch not live the story he has created and instead change it to suit.Now along comes an older samurai with the same request. He is dealt with in the same manner, but insists on telling a story to the assembled household before killing himself. He tells an amazing story: a fall from grace of his master, the dissolution of the household, poverty. His frail daughter and her son lay dying without a few coins for a doctor. The man's son is his daughter's husband, and it is he that came and was forced to die. The wife and son do as well, shortly after. Details of that death were told by the governor to the elder samurai earlier, though known because of the mocking way the body was returned.Until now, we have a classic case of warring narrative. We have the captive audience assembled. One storyteller is an official, so much so that he controls the official version of the film's story. The other has power in his gritty, true story. That story, incidentally is very close to what I consider noir: a random innocent fellow is cast in circumstances that seem full of circumstance and accident. The events of his life are played out not as they would in real life but as they would in a fictional life in a story told by others.Truth versus power in a struggle for the story of the film, essentially a struggle for the allegiance of the outer audience: us.The two beings as they face off are perfect in small mannerisms belying tension.Then slowly, the governor's world explodes as we learn new bits of the elder ronin's story of recent events. Many die.We (the audience) and control of all the cinematic effects was won by the ronin. Our governor is seen at the end writing the official account to be seen by his master that for his safety eradicates all story on both sides. The main actor, the winner, features in some of Kurosawa's best work as well."},{"username":"grantss","userUrl":"https://www.imdb.com/user/ur2860723","reviewLink":"https://www.imdb.com/review/rw4889033","warningSpoilers":false,"date":"26 May 2019","rate":"8","helpful":"0 out of 2 found this helpful.","title":"Not your average samurai drama","content":"A samurai, Hanshiro Tsugumo, arrives at the house of the Iyi Clan with an unusual request. Due to his circumstances, he wishes to commit harakiri, ritual suicide, in the courtyard of the house. Turns out this is not such an unusual request: the clan has had such requests before, though the requestor's intentions weren't always honourable. The Clan elder tells Tsugumo the story of the last samurai who made the request and how that ended. Will he still go through with it?Not your average samurai drama. Slow-burning, plot-filled and relatively light on action, this movie will come as a bit of a surprise to most. This doesn't make it less interesting though. In fact, it makes it better.Instead of a basic plot that's just an excuse for heap of well-choreographed action scenes, the plot here is great, and quite poignant. The action is held back until the end, heightening the anticipation. The action scenes themselves are quite realistic - none of the ridiculous Crouching Tiger, Hidden Dragon stuff - and have a plausible outcome.On the negative side, the slow-burn does get drawn out a touch too long. In addition, in the end there's no clear message - the conclusion is a bit flat.Overall, a great movie."},{"username":"morrison-dylan-fan","userUrl":"https://www.imdb.com/user/ur5424352","reviewLink":"https://www.imdb.com/review/rw5816488","warningSpoilers":true,"date":"11 June 2020","rate":"10","helpful":"2 out of 3 found this helpful.","title":"\"Swordsmanship untested in battle, is like the art of swimming on dry land.\"","content":"A few years ago I looked online for some good offers,and picked up a Criterion release for a title I've not heard of before. Arriving in a white case with the title in small font, I put it on the end of a shelf before leaving,where it remained lost for years! Rearranging things during Lockdown, I was surprised to discover that this film had been facing me the whole time.View on the film:Bringing the sword down on this adaptation of Yasuhiko Takiguchi's novel by titling Hanshiro Tsugumo \"The ronin from Hiroshima\", the screenplay by Shinobu Hashimoto brings the defiance against authority in post-WWII Japan to the early beginnings, of what would become a consolidation of power, leading to the 250 year Tokugawa reign.Seating Hanshiro face to face with Saito in the house of Li Clan palace, the poetic dialogue Hashimoto balances the blade with the refine allegorical brutal, feudal authority of the Li Clan being used to rip the other clans and samurai's of the land apart, leading to Hashimoto striking back,and exposing the fragility from shattering their orders.Bringing Hanshiro into the palace pledging to commit harakiri, Hashimoto skilfully blades the allegorical with a absolutely thrilling samurai tale, drawing Hanshiro's compassion for his family with a fierce, passionate fire to fight and save the individualism of his family, up against the authoritative band of Li Clan.Saying later in a interview with Joan Mellen in 1972 that \"In any era, I am critical of authoritarian power.\" directing auteur Masaki Kobayashi reunites with cinematographer Yoshio Miyajima, and stylishly displays his rebellion against authoritarian rule with the empty suit of armor hanging above the Li Clan palace like a gargoyle, which Kobayashi brings crashing down to earth via Hanshiro throwing the façade of power from the armor,right back at Li Clan.Cutting Toru Takemitsu's score to sparse inserts, Kobayashi displays a expertise in the use of silence, filling the Li Clan palace with Hanshiro's anguished words, being only interrupted by the lone sound of wooden panels being stepped on as guards rush to Saito's side.Igniting a lit fuse atmosphere which ends in a thrilling final fight, (where real swords were used!) that breaks the walls of the Li Clan palace, Kobayashi begins to shake the foundation with long static camera shots a few feet from the floor listening to Hanshiro, that Kobayashi starkly cracks with tightened close-ups on Hanshiro's agonised face,and refined zoom-ins on the terror sinking into Saito's face.Reuniting with Kobayashi,Tatsuya Nakadai gives a incredibly raw performance as Hanshiro, thanks to the love and warmth Hanshiro gives to his family, being contrasted by Nakadai with a simmering rage to fight for freedom freed from harakiri"},{"username":"zetes","userUrl":"https://www.imdb.com/user/ur0391152","reviewLink":"https://www.imdb.com/review/rw0077383","warningSpoilers":false,"date":"12 April 2002","rate":"9","helpful":"4 out of 9 found this helpful.","title":"Stunning work","content":"Harakiri is a little slow, but stick with it. The film is exquisite in every way. Kobayashi's direction is simply beautiful. The camera movement is original, exciting, and effective. The script and its characters are endlessly complex. And Tatsuya Nakadai is great, as always."},{"username":"lasttimeisaw","userUrl":"https://www.imdb.com/user/ur3967726","reviewLink":"https://www.imdb.com/review/rw6179436","warningSpoilers":false,"date":"16 October 2020","rate":"9","helpful":"2 out of 3 found this helpful.","title":"Film Review - Harakiri (1962) 8.5/10","content":"\"Most actions are confined in the palace's courtyard and other indoor spaces, HARAKIRI flags up Kobayashi's optimal stagecraft, the geometrical blocking of actors, the wide-screen spatial compositions, stationary but never feel constricted; when the actor moves, like in the final one-against-many mêlée, everything is crystallized to a T, the minutely calibrated choreography, the lethal slash and damage caused by the swordplay, and Nakadai's total abandon into a bleeding beast and desperate iconoclast. In a sense, the set piece is even more extraordinary than Kurosawa's best offers in YOJIMNO and SEVEN SAMURAI, because Hanshiro is outnumbered, doomed, a forlorn hope who fights until his last breath, a hero whose valor and integrity will not be extolled but buried, but when the dust settles, we actually feel triumphant for him, what a glorious death!\""},{"username":"Pjtaylor-96-138044","userUrl":"https://www.imdb.com/user/ur26820801","reviewLink":"https://www.imdb.com/review/rw5877836","warningSpoilers":false,"date":"3 July 2020","rate":"7","helpful":"1 out of 2 found this helpful.","title":"Honour as punishment.","content":"Essentially a condemning statement on the falsity of the samurai's supposed 'code of honour' and the concept of an 'honourable' death, this slow-burning drama sees a man recount his life as he prepares to take it in a ritualistic 'harakiri' ceremony. The tragedy of 'Harakiri (1962)' is profound and, as it moves from one phase to the next, it manages to emotionally affect in some surprising ways. It's a really layered piece, one with a multitude of intertwining themes and hard-won messages. The few sequences of violence it has are suitably brutal and exciting. They're grounded yet stylish, visceral yet thrilling, devastating yet inevitable. Arguably, the movie's most effective moment is an early example of its eponymous act, as a young man is forced to commit 'seppuku' in an incredibly cruel way. This scene is really difficult to sit through, to be honest, and it becomes even worse when the narrative revisits the reasoning behind its circumstances. The film is slow paced but it isn't boring. It's an interesting, entertaining but heavy affair. 7/10"},{"username":"gbill-74877","userUrl":"https://www.imdb.com/user/ur66111139","reviewLink":"https://www.imdb.com/review/rw3589403","warningSpoilers":false,"date":"30 November 2016","rate":"8","helpful":"2 out of 4 found this helpful.","title":"Beautiful and works on many levels","content":"What is more dishonorable, out of work Samurai (Ronin) asking a clan to commit hara-kiri in their courtyard out of a desire to gain employment, with no intention of committing the act, or those in houses being cruel to them? When the country dishonors its Samurai, and they are driven to acts of desperation, leading to cruelty and further dishonor, the country spirals, and this movie set in 17th century seems to reflect decline in then present day (1962) Japan.The movie is quite beautiful visually, with traditional Japanese architecture and at one point a swaying bamboo forest framed beautifully by director Masaki Kobayashi. The story is taut and works on many levels, first and foremost as a vengeance with honor tale, which might remind you of an American Western, including a couple of epic battle scenes. It also has the individual man, disillusioned and saying that the Samurai code he lives by is a façade, and yet acting honorably, against a multitude misled by corrupt leaders. It's one against many in a battle that is timeless and certainly relevant today, and whose results are sadly akin to the entropy of the universe. \"Who can know the depths of another man's heart?\" the Samurai asks, signaling a need for empathy. Indeed."},{"username":"ThomasDrufke","userUrl":"https://www.imdb.com/user/ur39517558","reviewLink":"https://www.imdb.com/review/rw5926123","warningSpoilers":false,"date":"22 July 2020","rate":"9","helpful":"1 out of 1 found this helpful.","title":"\"What befalls others today, may be your own fate tomorrow.\"","content":"While not being a Kurosawa samurai film, Harakiri is an unbelievably great entry for the genre, and perhaps one of the more forgotten ones of the mid 20th century. A tale of revenge, honor, and one samurai's quest to avenge a potential tragedy is a calm, thought-provoking and intricate samurai film that will stay with you long after the credits roll. This is one of the greats.9.0/10"},{"username":"CinemaClown","userUrl":"https://www.imdb.com/user/ur20018357","reviewLink":"https://www.imdb.com/review/rw5099360","warningSpoilers":false,"date":"4 September 2019","rate":"","helpful":"2 out of 3 found this helpful.","title":"Death Over Dishonour","content":"An ethically & morally complex tale of honour, beliefs & all things bushido that's crafted with composure, narrated with patience & is steered by a measured lead performance, Harakiri calmly contemplates on ethics, morality, injustice, poverty & desperation to both celebrate the samurai code as well as lay bare the hypocrisy of the feudal system of its depicted era. One of Japanese cinema's most essential works, this period piece still packs a punch and lives up to the hype for the most part."},{"username":"851222","userUrl":"https://www.imdb.com/user/ur4405474","reviewLink":"https://www.imdb.com/review/rw5201148","warningSpoilers":false,"date":"20 October 2019","rate":"9","helpful":"1 out of 2 found this helpful.","title":"Great movie","content":"Greetings from Lithuania.\"Harakiri\" (1962) is a great movie. It tells a simple at first look story, but later it becomes more layout and complicated then it looks. Acting was great as well as directing, cinematography and directing. This is also a sad movie, with tragic heroes and consequences.Overall, \"Harakiri\" is a great film. It tells a very sad story and its also a very good character study movie."},{"username":"briancham1994","userUrl":"https://www.imdb.com/user/ur5788055","reviewLink":"https://www.imdb.com/review/rw7089035","warningSpoilers":false,"date":"4 July 2021","rate":"9","helpful":"3 out of 3 found this helpful.","title":"Gripping critique of bushido","content":"This film ranks as a masterpiece among samurai films for its humanistic critique of the rigid, hierarchical bushido code of conduct. The samurai who espouse this code are depicted as either malicious or enslaved by its snare - reduced to begging or arbitrarily enforcing it as a tool of humiliation. The story unfolds in a gradual way, revealing how all the characters have interacted in the past, bringing a lot of context to the situation in the courtyard. This is all punctuated with skillful cinematography of claustrophobic architecture, heartfelt acting and desperate swordfights."},{"username":"eddie_baggins","userUrl":"https://www.imdb.com/user/ur8462477","reviewLink":"https://www.imdb.com/review/rw6209226","warningSpoilers":false,"date":"26 October 2020","rate":"9","helpful":"1 out of 1 found this helpful.","title":"A genuine samurai classic.","content":"Firmly entrenched in movie bible IMDB's Top 250 Films of All-Time list, Masaki Kobayashi's anti-samurai film remains to this day a stunningly crafted achievement that subverts its genre's expectations to give us a samurai film that favors talking and mystery over sword play and sensationalising.Set in the 17th century where newfound peace in the Japanese landscape has forced many samurai warriors that were previously hired for their bloodthirsty skill-sets to be forced out of work and large portions of them seeking to perform a ritual suicide known as seppuku, Harakiri (named for its referencing of this suicidal act) introduces us to a samurai clan working in the house of Lord Lyi as the clan plays host to a humiliating act of the seppuku of a young warrior that eventually leads to the arrival of the mysterious Hanshiro Tsugumo who too seeks to perform his last act in the house.Played out at a quiet but steady pace, Yoshio Miyajima steady camera work capturing every moment and Tôru Takemitsu's unnerving and perfectly suited score working alongside it, Harakiri is one of the era's most proficiently constructed affairs that may at times seem as though its headed for predictable outcomes only to change course unexpectedly throughout as its heartbreaking and confronting narrative takes place around Tatsuya Nakadai's tortured and determined Hanshiro.Working as both an unflinching examination of the samurai code and also as an exploration of post Japanese sentiment in the aftermath of their countries moving forward in the wake of World War 2 and their acceptance of long-forged laws, regulations and traditions, Harakiri evolves from its seemingly simplistic set-up to become an allergy and nuanced deep-dive into the countries history while at all times remaining a haunting character examination.Steering well clear of the over acting and hastily put together aspects that haunted many other similar productions and products of this era in general, Kobayashi's guiding hand help craft Harakiri into an ageless and captivating piece of movie-making, with the underrated Nakadai delivering one of Japanese cinema's great leading turns and the collective supporting cast all bringing their characters to life with carefully considered and well attuned performances.Unafraid to explore its dark themes and moments (a drawn out and horrifying suicide at the hand of a bamboo sword is still hard to sit through in today's more tolerant environment), Harakiri is deserving of its lauded reputation, even if many other higher profile \"samurai\" themed films outshine it in the general public spectrum.Final Say -A film best watched with as little knowledge as possible leading into it, Harakiri is a powerful and confronting piece of Japanese cinema that has remained relevant and required viewing these many years on since its release.4 1/2 bamboo knives out of 5"},{"username":"SAMTHEBESTEST","userUrl":"https://www.imdb.com/user/ur50463365","reviewLink":"https://www.imdb.com/review/rw6093832","warningSpoilers":false,"date":"14 September 2020","rate":"8","helpful":"0 out of 0 found this helpful.","title":"A Legendary tale from Japanese Cinema on Samurai Honour and Traditional Facade.","content":"HARAKIRI (1962) : Brief Review -A Legendary tale from Japanese Cinema on Samurai Honour and Traditional Facade. This is the Best Samurai Film i have ever seen till date. I mean it by all intellectual angles irrespective of what legacy other Samurai Films like \"Seven Samurai\" and \"Yojimbo\" carries. Harakiri made me feel the pain into Mysterious narrative and exposed the malicious traditional honour and abrogates. The characters study and subtle meaning in Samurai films couldn't have got better than this. In 133 minutes of runtime, Harakiri tells a story of a Ronin who requests to perform Harakiri at feudal lord's palace. This brutal suicide theory turns into a tight slap to all Ancient theories which have been worshiped by brutal lords and arrogant ronins. Action, drama, Mystery, Social Message and what not to expect from one narrative and Harakiri gets everything right on top. Tatsuya Nakadao in leading role is fantastic from the start and the protagonist Tetsuro Tamba is humanly evil as hell. The supporting cast does well in limited space and mostly in action sequences which have been performed on slow mode to have realistically elegant look. The film is set in 17th century and thankfully I don't know nothing about the Japanese culture from that era to point out faults in production design. However, the film mostly takes place in that one palace so even that production design part of nuances set in specific era didn't bother much to my brain. It all looks fine under one roof and one place. This is my first film of Director Masaki Yobakashi and undoubtedly it turned out to be an unforgettable experience. Harakiri is Masaki's only film in IMDb Top 250 Rated list (if I'm not wrong) and it deservingly holds it's ground and will hold it for years. I am trying to remember the legendary films made in 60s decade all over the world and at the moment i think Harakiri would be in Top 3 in my list. Strongly Recommended to matured Cinema lovers.RATING - 8.5/10*By - #samthebestest"},{"username":"jamesrupert2014","userUrl":"https://www.imdb.com/user/ur58781741","reviewLink":"https://www.imdb.com/review/rw3550028","warningSpoilers":false,"date":"24 September 2016","rate":"9","helpful":"1 out of 2 found this helpful.","title":"Excellent atypical Samurai film","content":"Harakiri tells the story of vengeance with a minimum of action (but a surprising amount of blood for a early '60s film). The flashback based story is well told, Tatsuya Nakadai is excellent as the down-and-out samurai slowly unravelling his tale, and the black and white film is beautiful to watch, especially the last showdown. The Samurai film genre lends itself to comparison to the American \"western\" and, with its emphasis on the plight of the destitute ronin, Harakiri could be likened to the early revisionist oaters. Highly recommended, especially before or after a viewing of one of the Japanese versions of \"47 Ronin\" (personally, I like the lengthy, understated 1941 version)."},{"username":"ersbel","userUrl":"https://www.imdb.com/user/ur18857804","reviewLink":"https://www.imdb.com/review/rw1845815","warningSpoilers":false,"date":"24 March 2008","rate":"","helpful":"5 out of 7 found this helpful.","title":"A masterpiece","content":"A masterpiece. There you have a story, you have twists, you have tension. And although the movie is old and there are no special effects other than some blood it's still technically better than the over-done products like Matrix or whatever. Here you... have a clean three dimensional view of the scene both as a figure of speech but also visually the film is 3D. Can't remember one of the recent productions that have a camera that could compare to this one. No CGI and still gives a strong feeling of space and of the restrains of that given space. A masterpiece from all points of view. With a story about how not all things are what they seem to be.Contact me with Questions, Comments or Suggestions ryitfork @ bitmail.ch"},{"username":"noralee","userUrl":"https://www.imdb.com/user/ur2042633","reviewLink":"https://www.imdb.com/review/rw1175679","warningSpoilers":false,"date":"16 September 2005","rate":"10","helpful":"158 out of 175 found this helpful.","title":"Samurai Genre is Used to Exposively Indict Japanese Politics and Culture","content":"I saw Harakiri (Seppuku) in a new 35 mm print at NYC's Film Forum. This is a brilliant use of a narrow period genre to explosively indict politics and culture. Writers Shinobu Hashimoto and Yasuhiko Takiguchi surely must have been as inspired by \"The Count of Monte Cristo,\" Ambrose Bierce and Howard Hawks' Westerns as much as by samurai literature and movies.The film begins deceptively as a story within a story, seemingly providing a traditional example of upholding samurai honor, such as in the conventional, oft-retold tale of \"The 47 Ronin.\" The context is set at a time when the central government, the shogunate, is supplanting local clans and arbitrarily unemploying thousands of people, notably their samurai, forcing them into the mercenary mode of ronin at best and begging for food at worse. But the parallels to the 20th century are made repeatedly explicit as the samurai who comes to this clan seeking help is from Hiroshima.Very gradually we get further insight on the tale within a tale, as we see more flashbacks within flashbacks into what each character has been doing before these confrontations and we get uneasy inklings that the moral of the story may not be what it appears at first and the stakes get higher and higher with almost unbearable tension.It is almost halfway through the film until we see a female and we suddenly see an alternative model of masculinity, where a priority is put on family, support, education and creative productivity. In comparison to the macho opening relationships, with their emphasis on formal militaristic loyalty to a hierarchy, a loving husband and father is practically a metrosexual. Seeing the same stalwart samurai making casual goo goo sounds to his grandbaby puts the earlier, ritualized scenes in sharp relief, particularly the recurring image of the clan's armor which seems less and less imposing and is finally destroyed as an empty symbol.The psychological tension in the confrontations in the last third of the film is more excruciating than the actual violence. Even when we thought we already knew the outcome from the flashbacks, the layers of perception of relationships and personalities are agonizingly peeled away with each thrust of a sword to reveal the depths of the horrifying hypocrisy of the political and social structure. And those are just the overwhelming cultural resonances that a 21st century American can glean. Like \"Downfall (Der Untergang),\" it reveals the inhumane mentality that led to World War II.The repeating motif of long walks then confrontations down empty corridors emphasizes the stultifying bureaucratic maze that entraps the characters. The revenge motifs are accented by startlingly beautiful cinematography that recalls traditional Japanese art, including drops of blood like first snow flakes then a waterfall.The over all effect of this masterpiece is emotionally draining."},{"username":"Kdosda_Hegen","userUrl":"https://www.imdb.com/user/ur41485753","reviewLink":"https://www.imdb.com/review/rw5625542","warningSpoilers":false,"date":"10 April 2020","rate":"9","helpful":"1 out of 2 found this helpful.","title":"Brutal. One of the darker japanese movies","content":"Best samurai movie I have ever seen. The writting was amazing, it's breathtaking at moments, action scenes while dated still feel awesome. Great cinematography, sound design and setting. The storyline is much better than I could've ever hoped for a samurai movie. The only tiny problem is that the middle of movie is quite slow. Still, this is a must watch movie."},{"username":"alansabljakovic-39044","userUrl":"https://www.imdb.com/user/ur70682706","reviewLink":"https://www.imdb.com/review/rw5410897","warningSpoilers":false,"date":"15 January 2020","rate":"9","helpful":"1 out of 2 found this helpful.","title":"Samurai genre is the best genre","content":"4 stars just for samurais and 1/2 star for lesson in life. It will probably jump to a 5 star because it is just flawless but for now I didn't like it like my other 5 star movies. Still one of the best samurai and moral movies out there alongside Kurosawa's masterpieces."},{"username":"lastliberal-853-253708","userUrl":"https://www.imdb.com/user/ur23944958","reviewLink":"https://www.imdb.com/review/rw2525730","warningSpoilers":false,"date":"29 November 2011","rate":"9","helpful":"1 out of 2 found this helpful.","title":"What befalls others today, may be your own fate tomorrow.","content":"I think it was in Zorro, the Gay Blade, that George Hamilton said, \"The Lord must love the poor because he made so many of them.\" In this outstanding film, it is the struggles of the poor that are the prime focus, and the way in which they continue to maintain their honor and pride as they are forced to take menial tasks or watch their loved ones die due to lack of money.It is also timely as the poor we are talking about were the former Samurai who were forced into poverty as their jobs were eliminated by the Shogunate.These newly poor then, as now, are demonized as unworthy, ignoring the fact that it was society that made them poor, and society that made them unable to retain other work except for the most menial tasks. They were often reduced to begging, and that is how the story opens.The story is not what is seems at first as we soon find there is much more than we first imagined.Make no mistake, it includes some great action that one expects to see in a Samurai film, but that is not as important as Shinobu Hashimoto's dialog. It was captivating.The film is an indictment of the class system and it's so-called \"honor.\" It also shows the mentality that lead to World War II. It is a film that will captivate you and anger you.The acting is superb, the score amazingly good, and the black and white cinematography first rate.Tatsuya Nakadai (Ran, Yojimbo) was outstanding in the lead role, and Masaki Kobayashi's direction ranks him among the best in Japan."},{"username":"Amyth47","userUrl":"https://www.imdb.com/user/ur45390749","reviewLink":"https://www.imdb.com/review/rw4638930","warningSpoilers":false,"date":"11 February 2019","rate":"6","helpful":"6 out of 14 found this helpful.","title":"Good Samurai Film.","content":"My Rating : 6/10Set in the 1600's, 'Harakiri' is a slow-paced Japanese drama about a ronin who wants revenge - he tells his story in flashbacks to the family of samurai's where his son-in-law previously went to commit harakiri (self-killing) due to unemployment, poverty and shame.The story unravels very slowly and takes some time getting used to.All in all, I enjoyed it, just found the second half could have been better."}],"errorMessage":""}