{"imDbId":"tt0050083","title":"12 Angry Men","fullTitle":"12 Angry Men (1957)","type":"Movie","year":"1957","items":[{"username":"MartinHafer","userUrl":"https://www.imdb.com/user/ur2467618","reviewLink":"https://www.imdb.com/review/rw1636505","warningSpoilers":false,"date":"13 April 2007","rate":"10","helpful":"68 out of 86 found this helpful.","title":"An absolute must for anyone who considers themselves a film buff","content":"This is one of the greatest films ever made...period. Much of this can be attributed to the exceptional writing and much of this can be attributed to the amazing performances in one of the best ensemble casts in film history. In fact, anyone who considers themselves a film buff or a serious student of film cannot say so unless they have seen this film. I also wish all young directors and writers were forced to watch the film as it demonstrates the power of excellent writing and acting. Imagine...a film that is great that does NOT have special effects, was filmed in black and white, and 99% of which takes place in one small room.Aside from Henry Fonda, all the other actors are a virtual \"who's who\" of supporting character actors from the 1950s--and all were at the top of their game in this film. Unfortunately, the film has been parodied and copied so many times that the film's originality has been blunted. Oddly, one of the parodies of this plot came from the TV show \"The Odd Couple\"--which starred Jack Klugman who was ALSO in 12 ANGRY MEN! See this film. And, if it turns out you don't like it, then I suggest you see a psychiatrist!!!"},{"username":"TheLittleSongbird","userUrl":"https://www.imdb.com/user/ur20552756","reviewLink":"https://www.imdb.com/review/rw2262425","warningSpoilers":false,"date":"10 June 2010","rate":"10","helpful":"20 out of 24 found this helpful.","title":"Brilliant, brilliant, brilliant!!","content":"There are a few wonderful courtroom dramas out there, Anatomy of a Murder, To Kill a Mockingbird and Witness for the Prosecution immediately springing to mind. 12 Angry Men is so brilliant, it could very well be the definitive courtroom drama on film. Sidney Lumet's direction is masterly, and although the action takes place on one set(an actual New York drawing room) there are a huge variety of innovative camera angles and visual set-ups. The screenplay is sophisticated and smart, and the story is compelling and intelligent. The film is also brilliantly made, and the acting is superb. Henry Fonda especially dominates the film, with an integrity that makes his character so wonderful, but the other actors are wonderful as well, Ed Begley, Jack Warden, John Fiedler, Lee J Cobb, Rudy Bond et al. are all impeccable support to Fonda. Overall, brilliant courtroom drama. 10/10 Bethany Cox"},{"username":"bkoganbing","userUrl":"https://www.imdb.com/user/ur2483625","reviewLink":"https://www.imdb.com/review/rw1164567","warningSpoilers":false,"date":"3 September 2005","rate":"6","helpful":"73 out of 265 found this helpful.","title":"A Very Flawed classic","content":"When I was younger I thought 12 Angry Men was a near perfect ensemble film with a great group of male players. At that time in those sexist fifties women had an automatic out from jury duty. It was not unusual to have all male juries as we have here.Then I served on a few juries and my concepts changed. One of the key scenes of the film is when Henry Fonda produces a switchblade knife exactly like the weapon the young perpetrator allegedly used in the stabbing death of his father. The second that Fonda produced that knife, someone should have yelled for a mistrial.In all 50 states of the United States of America, a standard jury instruction is that the jury is to decide the guilt or innocence of a defendent on the evidence presented at trial. Jurors are free to come and go until they are sequestered for the verdict. But they are instructed not to go near the crime scene or gather ANY independent evidence. I remember being on jury duty and assigned on a case where the crime took place in an apartment that was one block away from one of two routes to a BMT subway stop that took me to work. And those same subways also took me to downtown Brooklyn and the court house. I made it a point to take the IRT to court for the next two weeks while the trial went on to avoid the temptation of going over to the crime scene.It was a great dramatic effect, but totally at odds with our legal system. I can't believe that something that elementary was left in a film that was purported to be a realistic look at jury deliberations.The juries I was on did debate and in some cases quibble over all the points of the trial. They were a good cross section of the breed Brooklynus Americanus just as in 12 Angry Men. If you watch Law and Order you know how hard the prosecutors job is to get 12 people to convict.Still it's a wonderful group of players that participated here. Henry Fonda and Lee J. Cobb are the biggest names in the cast. But others like Robert Webber, John Fiedler, Martin Balsam, and Jack Klugman got their first real notice in this film.Jack Klugman's portrayal was a particular favorite of mine among the group. He's from the same slum background as the defendent and some of the knowledge he has from that environment makes for the most compelling argument for the defendent's innocence. We should be thankful that Sidney Lumet assembled and directed the find cast he did."},{"username":"Leofwine_draca","userUrl":"https://www.imdb.com/user/ur0482513","reviewLink":"https://www.imdb.com/review/rw7611152","warningSpoilers":true,"date":"3 December 2021","rate":"10","helpful":"2 out of 8 found this helpful.","title":"Gets to the heart of it","content":"A gripping single-location drama and one of the best ever filmed. I put off watching it for many years, partly because I was worried about it not living up to expectations, partly because I enjoyed the anticipation of a future watch. Having seen it now, it's every bit as good as I could have hoped for; a tour de force of acting from every cast member, combined with Lumet's efficient direction and a truly involving script. I'm a details man myself, a real sucker for getting into the nitty gritty of a subject, and 12 ANGRY MEN allows you to do just that, getting to the heart of a single subject like never before (and rarely since)."},{"username":"Michael_Elliott","userUrl":"https://www.imdb.com/user/ur13134536","reviewLink":"https://www.imdb.com/review/rw1899308","warningSpoilers":false,"date":"25 June 2008","rate":"","helpful":"4 out of 12 found this helpful.","title":"Masterpiece","content":"12 Angry Men (1957) **** (out of 4) A poor slum kid is on trial for the murder of his father and it's up to one juror (Henry Fonda) to try and convince the other's that he's not guilty. Martin Balsam, John Fiedler, Lee J. Cobb, E.G. Marshall, Jack Klugman, Ed Bins, Jack Warden, Fonda, Joseph Sweeney, Ed Begley, George Voskovec and Robert Webber are the twelve jurors and it's going to be hard trying to find a film with as much great acting as what we see here. I really think this is one of the greatest screenplays to be written for any movie since the movie only runs 96-minutes and we've got all the evidence to listen to and watch them discuss it but we also get to know each one of them personally with just a few remarks, which tells us everything about them. Another important aspect is the direction by Lumet, which might be the best of his career, which is certainly saying a lot considering how many great films he has made over the years. There's nothing getting blown up here and there are no gunshots but this film, in terms of drama and suspense, can rival any action movie ever made for those edge of your seat thrills. The cinematography is also top-notch as the camera just floats around the juror's room picking up pieces of the action. What I love most about movies is when you get great actors going at each other in a great screenplay and I can't think of a movie that does this better than this one right here. There is so much excitement as the men, who all believe they are right, slowly fight and tear away at one another until the thrilling end. All of the performances are wonderful and what better than having a mild Fonda going up against the anger of Cobb. The final sequence is brilliantly handled and doesn't come off as forced or silly. On the top this is certainly a courtroom drama but underneath the film plays more like a lesson of this countries legal Constitution and why it is so great."},{"username":"SnoopyStyle","userUrl":"https://www.imdb.com/user/ur2898520","reviewLink":"https://www.imdb.com/review/rw3454110","warningSpoilers":false,"date":"18 April 2016","rate":"7","helpful":"6 out of 22 found this helpful.","title":"a movie for actors","content":"In a NYC courtroom, a first degree murder case against a poor 18 year old boy with a troubled history has just rested. The 12 men of the jury are sent to decide the seemingly open and shut case. They hold a vote and it's 11-1 guilty. Henry Fonda is the only not-guilty vote. He's not sure and wants to spend time discussing the case.This is the classic stage play. I say this meaning it's a bunch of characters in a room. The characters don't even have names. Lee J. Cobb and Jack Warden have the flashiest roles. Henry Fonda is essentially the lead as the central heroic role. He has the nobility. The roles are all filled with first rate character actors. This is an actor's movie. The only drawback is the cinematic potential. In the end, it is 12 men around a table in a room. The visual opportunities are limited. Despite that, the debate interplay is engrossing and the movie is satisfying."},{"username":"Hitchcoc","userUrl":"https://www.imdb.com/user/ur0278527","reviewLink":"https://www.imdb.com/review/rw1293846","warningSpoilers":false,"date":"17 February 2006","rate":"10","helpful":"3 out of 4 found this helpful.","title":"It Blends Together","content":"This movie came out of an era that I really loved, when ensemble acting was so strong. We had a whole group of character actors who really took seriously the smaller roles that they had. The direction by Sidney Lumet on this film is outstanding. To take the Henry Fonda character from the meek, inconsequential juror, simply putting forth a theory, to watching the other men slowly see his way of thinking, is subtlety at its best. Lee J. Cobb does his burn, done in by impatience and inconvenience. Pusing an agenda that fits only him. Underlying the entire plot is the defendant whom we never see but get to know through a slow, methodical, yet fascinating series of revelations. It's quiet, suspenseful, and human. It's the true whodunnit without Hercule Poirot. This is the element that is most obvious; that 12 men can sit in a single room for the entire movie and interact and still keep us totally occupied. Enough has been said about this. I just wish that contemporary film making could take a bit more from these masterpieces; let the fine actors that we have do their individual things."},{"username":"mark.waltz","userUrl":"https://www.imdb.com/user/ur0968789","reviewLink":"https://www.imdb.com/review/rw3666418","warningSpoilers":true,"date":"20 March 2017","rate":"10","helpful":"13 out of 14 found this helpful.","title":"One of the great theatrical examples of what makes for superb drama.","content":"Theater at its best is practically impossible to get down on film correctly. When Hollywood gets it right, they create a work of art. In this case, they did it simply, without frills, casting actors who looked real and fell into their individual parts like kids into a swimming pool on a hot summers day. It's the hottest day of the year, and these twelve men must decide the fate of an accused killer. But twelve men means twelve personalities, twelve temperaments, twelve political views, twelve religious opinions and twelve preconceived notions. As the temperature swells, so does the temperament. Having been a very reluctant jury foreman, I find myself seeing eye to eye with the shyness of the man forced to lead the proceedings. Everybody looks at you to get the ball rolling and hopefully get out of there as quickly as possible. Martin Balsam, as the foreman, tries to remain dignified and not be overly in control, losing that to one of the jurors who looks at the case in a completely different way than the others. Twelve personalities means plenty of neuroses, and in a very short time, seeing what's really going on in the minds of strangers whom you'll never see again.This trial involves young John Sacova, accused of killing his own father, and the twelve men must decide whether he gets the chair or not. These men, only identified through their juror number, are completely different, and it's obvious from the start that some of them (John Fiedler in particular) vote guilty because they think they have to. Only one (Henry Fonda) votes not guilty, and of course, one of them says, \"There's always one.\" There are the aggressive ones certain of guilt, empathetic ones who would like to see the charges reduced, and those who view all young people from certain areas as scum regardless of their situation. At 60 years old, this film shows the same prejudices we face today, yet shows that there is always someone not about to follow the crowd simply because something strikes them as off. It is Fonda who will pretty much control the room, although he does it in a subtle way where nobody realizes that he's pretty much taken over.While jury's have changed in 60 years (allowing women to serve being the most obvious change), what hasn't changed in the conflict of trying to understand the truth and to agree with 11 other people about it. Fonda goes against what would be allowed today by acting on his own and visiting the neighborhood of the crime, but his passion in figuring out the truth is very admirable. He is quiet in his determination, making this typical Fonda but one that fills his soul with humility and integrity.Under the direction of novice Sidney Lumet, the entire cast is outstanding. Familiar faces from all walks of show business each get their chance to shine. Jack Klugman, Ed Begley, E.G. Marshall, Jack Warden, to name a few. I could easily write something about each of them, but it's worth checking them all out yourself. The one juror who really makes an impression in creating his character is Lee J. Cobb as the very aggressive juror who is hiding behind similarities to the case, having had a contentious relationship with his son that sparks his instant sense that the defendant is guilty beyond a shadow of a doubt. He was deservedly nominated for a Golden Globe (as was Fonda), but the Oscars only acknowledged the film, director and script for nominations. Each jury is its own story, and from city to city, nothing changes but the type of case and the date."},{"username":"bob the moo","userUrl":"https://www.imdb.com/user/ur1002035","reviewLink":"https://www.imdb.com/review/rw1864661","warningSpoilers":false,"date":"27 April 2008","rate":"","helpful":"13 out of 16 found this helpful.","title":"The material is slightly forced for dramatic purposes but the delivery is perfect across the board","content":"A young ethnic kid from a rough area is up on a murder charge and to the jury of twelve men, it all seems a fairly open and shut case. So all are surprised when the votes come back with one \"not guilty\" in the pack. Juror #8 maintains he holds a reasonable doubt, much to the frustration of the rest of the group. The stalemate forces a debate over the details of the case which sees each man questioning others and themselves for their motivations and decisions. The heat in the room and the passage of time sees tensions rising by the minute.I'm not a massive fan of the \"Movie You Must See\" podcast crew because they mostly tend to discuss the events in a film rather than really critiquing or reviewing it (although at times this \"mates in a pub\" approach is OK). Anyway, one of the advantages of having anyone pointing out \"films you should see\" is that it reminds you that you should these films. So it was for me as I listened to 12 Angry Men and realised that not only had I never reviewed it but that I had not actually watched it for many years. Of course mentally I knew it was a \"classic\" but did I really understand why it was? So when it came on television recently I watched it again with new eyes.The films moves right into the jury room and pretty much this room is all we have for the duration. Initially the script does really well to have the viewer side with the majority because in the discussions the evidence does seem very clear cut and #8's doubts seem so general and non-specific. This is a good way to start because it means the viewer also has to question and we are taken along the journey just like the men in the jury. Gradually we get into the detail and doubts are tweaked out \u0096 not to the point of solving the crime because that is not what it is about but it is done in a way that is interesting and engaging. It is not perfect in this regards though because some of the jumps are big, some of the assumptions are stretching and some of the knowledge in the room is a little too convenient. However what weaknesses there are in the material are covered by the fact that the delivery is roundly quite brilliant.Lumet directions from within the room and makes great use of such a small space. It feels like it could be a play (not sure if it was or not) but Lumet prevents this just feeling like filmed theatre. The camera captures the room, sticks close to characters, moves around, in and out accordingly and it never feels stiff. This aids the sense of tension from the audience point of view as we are not just left watching the room so much as being in it. The ensemble cast are another big factor in this delivery as they all deliver. On the surface of it the characters could easily be labelled \"racist\", \"old\", \"naïve\", \"angry\" and so on but the actors don't let themselves be that basic and they also do a good job of pacing the building resentment and tension in the room to be convincing. Fonda maybe has \"top-billing\" but he does have the least showy role, leading those into his corner. Cobb and Begley have good turns as the anger of the room but everyone plays their parts very well. OK Balsam, Webber and Voskovec come out the least memorable of the lot but this is understandable when viewed beside such sterling turns from Fielder, Klugman, Warden, Sweeney and Marshall. There really isn't a weak link in the room.With modern cynical eyes it is perhaps totally hard to accept the film for its praise of the jury system and I do agree with the \"MYMS\" group when they made reference to the moment in H:LOTS which is essentially the bitter reverse of this film. However this slightly flag-waving stuff is covered by the delivery being as strong and as well paced as it is. Overall then this is an eminently watchable film and I can understand why it is so well regarded. The material and message may not be note-perfect but the delivery is brilliant across the board and it is one that I could easily return to again and again and still get pleasure out of how well it is all done."},{"username":"kosmasp","userUrl":"https://www.imdb.com/user/ur5876717","reviewLink":"https://www.imdb.com/review/rw5203330","warningSpoilers":false,"date":"21 October 2019","rate":"10","helpful":"6 out of 6 found this helpful.","title":"Classic in every sense and moment and frame","content":"I could go on, but I thought I'd stop there before my summary line gets too big. Now just because this is a classic movie (and we really should try to use that term lightly, but this movie really deserves it and I'll elaborate on that), does not mean everybody will love it. And if one does not like it, it does not mean they have no taste. They just have different tastes, which is a good thing, because if every human on earth would have the same taste, life would be very boring now wouldn't it? The asnwer is yes, in case you were wondering.But back to this, which begins outside and takes us inside. And it is important that we were outside because we will live inside a building (a room to be more specific) for the most time. There is also a brief shot of the alleged culprit/criminal. After that we get in a room with 12 men, who are quite different from each other. And while it wasn't yet time to give African American a chance in a movie like that (or Asian American for that matter), there is a critical racial line that is drawn. If you follow what is happening and who says what or argues in certain ways, you will see that this movie has quite the social commentary in it.Now that is one part of this being genius, because it never rubs your nose in it. It never says, this guy who is i.e. from Italian descent has a reasonable thing/argument to say. No you just hear the things and see the people interact. And I have not even mentioned the way the movie is shot. And I'm not talking about the black and white cinematography (which is beautifully lit), no. I mean the framing and the set-ups. the editing and how everything flows. You feel like you're inside the room. You feel like this really happens or happened. Even the things that seem not staged (someone blocking another person, a shadow, peoples back and more) are in fact staged and masterfully done so.There are way smarter people than me, that can list you many things this movie has done right and I'm sure there quite a few sources online to look for. Just listening to the audio commentary can give a small glimpse into certain things too. But again, since this is not something that one might call light entertaining, if it does not appeal to you, then it is so. It does not mean you are wrong and it surely does not mean that this movie is falsely considered a masterpiece!"},{"username":"classicsoncall","userUrl":"https://www.imdb.com/user/ur2707735","reviewLink":"https://www.imdb.com/review/rw2466462","warningSpoilers":true,"date":"30 July 2011","rate":"9","helpful":"7 out of 8 found this helpful.","title":"\"You can't send someone off to die with evidence like that\".","content":"When I was a store manager for a regional supermarket chain, about thirty years or so ago, our team was presented a developmental seminar featuring \"12 Angry Men\". Breaking into work groups, our task was to watch the film, and at strategically paused moments, predict which of the jurors would be the next to change their verdict from guilty to not guilty. It was an exercise in analytical thinking and observation of human behavior, characteristics that a good manager needs in order to develop a work force toward a common goal. There was actually a group that got all the positions right from one through twelve, which astounded me. Watching today, I got stuck again right at the outset, figuring Jack Klugman's Juror #5 would be the first to be influenced by Henry Fonda's argument.The film is an extraordinary piece of ensemble acting, and if the players weren't that well known back in the day, they have certainly made themselves a name since. Almost all have passed on, but to see actors like Henry Fonda, Lee J. Cobb, E.G. Marshall, Martin Balsam, Ed Begley and Klugman all in one film is a veritable treat, even apart from the story. But it's the story itself that rivets one's attention to the screen, and the slow, methodical plodding Fonda brings to the table with convincing arguments even in the face of his own uncertainty about the case. With a surety that \"The facts are supposed to determine the case\", Fonda's character struggles to assure his fellow jurors that the life of an accused killer is worth the effort to consider reasonable doubt.Aside from Fonda, the two most galvanizing characters are portrayed by Lee J. Cobb and Ed Begley. Begley, Juror #10, who exhibits the most extreme traits of racism and bigotry, forces each of the jurors to confront their own prejudices in an uncomfortable scene where almost every other juror stands up and turns their back on him. Cobb, Juror #3, has a much more personal investment in the trial, harboring a failed relationship with his own son that colors his view of the world. The really interesting point regarding Fonda's character is that he accomplished his mission without ever raising his voice. I don't think I could have done that considering the stakes involved.It's a rare film that can anchor the viewer in one spot for an hour and a half and make time fly by with an intriguing story and realistic dialog. Rarer still is the ability to poke a finger at one's own pre-conceived notions of guilt or innocence, forcing the serious viewer to take a seat at the jury table and examine the facts from all sides before voting guilty or not guilty."},{"username":"lee_eisenberg","userUrl":"https://www.imdb.com/user/ur4888011","reviewLink":"https://www.imdb.com/review/rw1143681","warningSpoilers":false,"date":"6 August 2005","rate":"10","helpful":"24 out of 32 found this helpful.","title":"I find this movie guilty of being a masterpiece.","content":"Shot in real time, this story of a jury trying to decide whether a young man is innocent or guilty never lets the viewer's attention go. Henry Fonda plays Juror #8, who is convinced the entire time that the defendant is innocent, while everyone else has already called him guilty. Throughout the movie, we not only get to hear everyone's opinions on the matter, but also every possibility of the verdict. With \"12 Angry Men\", Sidney Lumet brought to the screen the same kind of \"closing in\" feeling that he brought to movies like \"Network\". In the end, the issue is not whether the defendant is innocent or guilty; the important point is the process by which the jurors reached their decision. This may be THE perfect movie."},{"username":"Woodyanders","userUrl":"https://www.imdb.com/user/ur8239592","reviewLink":"https://www.imdb.com/review/rw1434348","warningSpoilers":true,"date":"30 July 2006","rate":"10","helpful":"3 out of 5 found this helpful.","title":"An outstanding courtroom drama thriller which benefits greatly from tight direction, a literate script and superb acting from a first-rate cast","content":"A teenage Puerto Rican boy from the slums is on trial for allegedly murdering his own father. Eleven of the twelve jurors are certain that he's guilty, but one token odd man out dissenting juror (beautifully played with subtle understatement by Henry Fonda) has his doubts. The juror gets everyone else to question their motives and more heavily scrutinize every last minute detail of the seemingly cut and dried case.Director Sidney Lumet, working from Reginald Rose's smart, literate and incisive script, further aided by Boris Kaufman's sharp black and white cinematography and Kenyon Hopkins' spare, unobtrusive score, works wonders with the simple premise, placing a keen and intimate emphasis on the exceptionally colorful and distinctive dozen characters. The uniformly marvelous acting from a bang-up ensemble cast qualifies as a substantial sterling asset: Fonda and Lee J. Cobb are both terrific as radically opposing guys who are at continual loggerheads with each other while Ed Begley (incredibly fearless as a despicable racist jerk), Jack Warden, Joseph Sweeney (simply lovely as the old man), George Voskovec, Martin Balsam, Jack Klugman, John Fiedler, Robert Webber, E.G. Marshall and the criminally underrated Edward Binns all lend top-drawer support in equally meaty roles. The twelve individual jurors serve as a very revealing and insightful microcosm of our justice system in particular and our society in general, representing all the various flaws, strengths and quirks of our culture which range from blithe indifference (Warden's boorish baseball fan, Webber's slick advertising executive) to cold pragmatism (Marshall's prissy intellectual) to meek passivity (Fiedler's soft-spoken wimp) to foul prejudice (Begley's unforgettably odious hatemonger, Cobb's seething ball of roaring rage and resentment) to true blue responsible patriotism (Fonda's calm voice of liberal reason, Sweeney's supportive old man, Voskovec's proud adopted American immigrant). Kaufman's gorgeously crisp photography tremendously heightens the considerable tension, palpably evoking a sweaty, uncomfortable and claustrophobic sweltering hot atmosphere that's as gripping as it is convincing. In the hands of a lesser cast and director the story could have been flat and stagy. But Lumet's tight direction and the seamless ensemble acting from an amazing cast effortlessly blend together to create a crackling sense of absorbing drama and rip-snorting energy that's constantly engrossing and exciting throughout. An undeniable classic."},{"username":"gavin6942","userUrl":"https://www.imdb.com/user/ur1234929","reviewLink":"https://www.imdb.com/review/rw3096035","warningSpoilers":false,"date":"30 September 2014","rate":"9","helpful":"3 out of 4 found this helpful.","title":"Deservedly a Top Ten Film","content":"A dissenting juror (Henry Fonda) in a murder trial slowly manages to convince the others that the case is not as obviously clear as it seemed in court.Today's audiences will find a young Jack Warden, perhaps now best known as Big Ben from \"Problem Child\", and Wisconsin-born John Fiedler, whose voice is recognizable as Piglet from \"Winnie the Pooh\". Along with Ed Begley and Henry Fonda, you already have a strong cast (and the other eight men are no slouches).This film is timeless, both as a tribute to great actors of their generation, but also as a testament of the greatness of the American justice system. One likes to think this has inspired at least a few people to approach jury duty with the utmost seriousness and give the concept of \"reasonable doubt\" a run for its money."},{"username":"jboothmillard","userUrl":"https://www.imdb.com/user/ur4248714","reviewLink":"https://www.imdb.com/review/rw2438916","warningSpoilers":true,"date":"5 June 2011","rate":"9","helpful":"2 out of 6 found this helpful.","title":"12 Angry Men","content":"I should start by saying that twelve is my favourite number, but it wasn't just because of that that I planned to see this film, I had heard many people state it is one of the finest films in the genre, from debuting Oscar and Golden Globe nominated director Sidney Lumet (Murder on the Orient Express, Dog Day Afternoon). Basically the jury of twelve men (a jury is always twelve people) has just come from the courtroom after hearing the defence and prosecution rest their cases, and they are now the people who must decide the verdict for the case. They must determine if a young Spanish-American is guilty or not guilty of the first degree murder by stabbing of his father, and if they all unanimously agree to find him guilty he instantly gets sentenced to death. With a weak alibi of going out to the movies and not remembering what he saw, a knife he supposedly bought and lost, and a number of witnessed hearing screams, someone shouting the words \"I'm going to kill you\" and possible seeing it happen, it seems open and shut. All Jurors have immediately decided to vote guilty, one Juror however is voting not guilty until he clears up the facts, this is Mr. Davis, aka Juror #8 (BAFTA winning Henry Fonda, also producing). At first he is voting opposite to everyone else for the sake of conversation and discussion, deliberations however crop up and he slowly straightens things out and brings forward things that the defence, prosecution and ultimately witnesses may have missed. These include Juror #8 having the same knife as the boy and pondering the stabbing, the noises going on when the murder happened, the reason for the shouted words, the timing of the old man heading to answer the door, and most importantly, a key witness who chose not to wear glasses but marks on her nose prove she does. Slowly the Jurors, some wise, bright and empathetic, one or two arrogant, prejudiced and merciless, may be seeing that this lone Juror has some good points and brings forward some good ideas as to what may have happened. Juror #3 (The Exorcist's Golden Globe nominated Lee J. Cobb) and Juror #10 (Ed Begley) for a long while seem adamant to stick to their verdicts of guilty, but slowly the others: Juror #1 (Psycho's Martin Balsam), Juror #2 (John Fiedler), Juror #4 (E.G. Marshall), Juror #5 (Jack Klugman), Juror #6 (Edward Binns), Juror #7 (Being There's Jack Warden), Juror #9 (Joseph Sweeney), Juror #11 (George Voskovec) and Juror #12 (Robert Webber), do start to doubt their decision is right. Being swayed by the very convincing predictions of the murder events, one by one the Jurors change their verdict to not guilty, until the final one sobbingly gives in, and in the end they all agree the boy should go free. Fonda gives a magnificent performance as the calm, collective and convincing lone voting Juror to turn the others decision, Cobb is equally fantastic as the one who takes ages to change the mind of, and the other actors all get their moments on screen as well. The one location film based on a play could have been a little dull, but director Lumet keeps you gripped with a marvellously worded script played out to perfection by the actors, with the addition of great camera work and set pieces as well, it is a brilliant classic courtroom drama. It was nominated the Oscars for Best Picture and Best Writing, Screenplay Based on Material from Another Medium, it was nominated the BAFTA for Best Film from any Source, and it was nominated the Golden Globe for Best Motion Picture - Drama. Henry Fonda was number 6 on 100 Years, 100 Stars - Men, Juror #8 was number 28 on 100 Years, 100 Heroes & Villains, the film was number 88 on 100 Years, 100 Thrills, it was number 87 on 100 Years, 100 Greatest Movies, and it was number 42 on 100 Years, 100 Cheers. Very good!"},{"username":"rmax304823","userUrl":"https://www.imdb.com/user/ur0819382","reviewLink":"https://www.imdb.com/review/rw0060112","warningSpoilers":true,"date":"11 November 2003","rate":"8","helpful":"6 out of 7 found this helpful.","title":"Finely tuned","content":"First of all, what a cast! Fonda doesn't seem like much of a New Yorker, but the rest of the cast reads like a Who's Who in New York movies. All of them except Sweeney and Voscovek went on to lengthy careers in character and support roles.The plot comes from a TV show and is very tightly written. There's hardly a wasted word or an unnecessary gesture. This has its drawbacks because it imposes a dramatic frame on the characters and the development. There's not much sense of \"real life\" here. Everything fits together too neatly for that. But if events follow earlier events with a logic that is a bit obvious, it's forgivable because the screenplay is done so well. Like \"Stagecoach,\" it may be mechanical but it's as finely tuned as a good wristwatch.Also more or less unavoidable in a short movie dealing with a dozen often conflicting characters is the reduction in their complexity. Each is a stereotype. They practically wear sweatshirts with logos on them. \"I AM A SHALLOW AD MAN.\" \"BORED MARMALADE SALESMAN HERE.\" \"KICK ME, I AM AN IGNORANT RACIST.\" They are capable of changing their opinions but they show only one side of their characters.A third unfortunate quality in the script is that it is imbued with what Tom Wolfe referred to as \"nostalgie de la bou\" -- a kind of admiration for the lowbrow. Pauline Kael made the same observation back in the early 60s in an essay called \"Fantasies of the Art House Audience.\" What it boils down to is a dislike of the middle-class. Fonda is an architect, a professional. The other good guys in the movie are members of minority groups or ordinary working stiffs with slum backgrounds. The two most repulsive villains (Ed Begley and Lee J. Cobb) are self-made men who run their own successful businesses. The rufescent Begley has a line, something like, \"I got ten factories going to pot while we're talking' here.\" Cobb brags about how he built up his delivery business starting out with nothing. A third dummy is a SALESMAN -- of marmalade! (Yukk.)Okay. That gets pretty much all of the weaknesses out of the way. The pluses outweigh the minuses by exactly two short tons. The acting is almost impossible to improve upon, not surprisingly. It's unfair to single out Jack Warden and Martin Balsam for their performances but I'll do it anyway.The photography, by Boris Kaufman, is perceptive and adds to the tension, the feeling of claustrophobia. Especially memorable is the scene in which most of the jurors are standing together, there is a rumble of thunder, and a shadow falls gloomily over the group. It's a small touch but palpable.Lumet manages to suggest New York City effectively in this crowded room, practically the only set. (There is a shot at the end that is done on the steps of the real Courthouse.) Lumet's direction makes the most of his actors' talents. The pauses in their arguments last just long enough for us to take a few breaths.Rose's script avoids an easy ending. Yes, there is reasonable doubt enough for the verdict to turn out as it does, but there is no dramatic introduction of crucial evidence to demonstrate that the defendant is innocent. Did he do it? We don't know. Suppose the kid actually did it and gets away with it? Fonda is twice challenged on that point -- once at the table and once in the men's room -- and in neither instance does he have a reply.Overall, it's a marvelous movie, a lesson in acting, directing, writing, and shooting. The recent updated version has been made politically correct but is not an improvement over this original. See it if you have the chance."},{"username":"ccthemovieman-1","userUrl":"https://www.imdb.com/user/ur4445210","reviewLink":"https://www.imdb.com/review/rw1469639","warningSpoilers":false,"date":"8 September 2006","rate":"4","helpful":"40 out of 196 found this helpful.","title":"Another Liberal Propaganda Classic","content":"Ah, another Liberal \"classic\" with Henry Fonda, a true left winger showing all the right wingers where they went wrong!This all-star cast is really a play as the entire thing takes places in a jurors' room where 12 men determine the fate of a suspect charged with murder. Eleven of them vote \"guilty\" but Fonda holds out for \"not guilty.\" The story is about him slowly convincing everyone else to see things his way. There are lots of familiar faces from the '50s: Lee J. Cobb, Ed Begley, E.G. Marshall, Jack Warden, Martin Balsam, Jack Klugman, etc. They are all interesting.Good for one look. As with most movies with political leanings (this one, All The Kings Men, The Manchurian Candidate, etc.) Hollywood is always ready for re-makes where Liberal causes are far more pronounced than they are in these classic movies. Only in the twisted mind of Liberals are we to have more sympathy for the criminal than the victim. Only in Hollywood are the defense attorneys always the good guys and movies end like this where nobody ever goes to jail!"},{"username":"Tweekums","userUrl":"https://www.imdb.com/user/ur13977076","reviewLink":"https://www.imdb.com/review/rw2721456","warningSpoilers":true,"date":"18 December 2012","rate":"10","helpful":"3 out of 5 found this helpful.","title":"One of the greats","content":"As the film opens we see the inside of a court room; the evidence has already been put to the jurors and the judge is reminding them of their solemn duty... the twelve of them must reach a unanimous verdict and a guilty verdict will mean an automatic death sentence for the accused. The way the jurors talk as they enter the jury room it sounds like an open and shut case; they call for a quick vote before any discussions take place; eleven men say he is guilty, but one dissents. Juror Eight explains that he doesn't necessarily believe that the accused, an eighteen year old slum boy, is innocent but he won't allow him to be executed without the jurors even discussing the evidence. On the face of it the evidence is compelling; the accused bought a knife just like the murder weapon a couple of weeks previously, the woman across the railway line says she looked out of the window and saw the killing, the man below says he heard the accused shout 'I'm going to kill you' before hearing the body fall and seeing the accused leave the building. Gradually they look at each piece of evidence in turn and as doubts are raised the number of 'not guilties' increases but some jurors are adamant that they just know he did it; to get an acquittal prejudices must be overcome too.Set almost entirely within the confines of the jury room this film is rightfully considered a classic; it may not contain any action but it is taut from start to finish. The fact that we haven't seen any of the trial means the viewer must rely on what the jurors say to decide whether or not they think the accused is guilty and for the whole time they are deliberating we don't even know their names. The cast of twelve do a great job playing each of the very different characters; obviously Henry Fonda stands out as he is the best known actor and plays the man arguing against the majority but each of the others also put in fine performances; especially Lee J. Cobb and Ed Begley who play the two jurors most determined to bring in a guilty verdict. The way some of the evidence is questioned in the jury room in a way that it was never questioned in court may be a little unlikely... especially the incident with the second knife but it isn't too far fetched and that particular moment is a brilliant piece of theatre that anybody who watches the film will remember for years afterwards. This is one of those films that everybody should see at least once."},{"username":"ma-cortes","userUrl":"https://www.imdb.com/user/ur3270789","reviewLink":"https://www.imdb.com/review/rw2935056","warningSpoilers":false,"date":"4 January 2014","rate":"8","helpful":"7 out of 8 found this helpful.","title":"A top-notch cast under superb direction by Sidney Lumet makes this movie excellent in every aspect","content":"A dissenting juror (Henry Fonda) in a murder trial slowly manages to convince the others (Jack Klugman , Martin Balsam , Jack Warden , Lee. J. Cobb , Ed Begley , E.G. Marshall , Robert Webber , among others) that the case is not as obviously clear as it seemed in court. As Juror #8 holds out with a verdict of not guilty, thus setting the stage for arguments and reasons why or why not the boy may be guilty . As he desperately seeks to convince his eleven peers to reconsider their hast conviction of a boy framed of murdering . As 12 jurors are struggling to decide the fate of a teenager who allegedly killed his father . Made for television classic about twelve jurors quick to condemn a youth on trial for murdering his father before reviewing the evidence. Though the whole movie is set in a jury room it never lacks for taut , suspense , intrigue and inspired direction . The struggle behind closed doors is tense , charged and riveting . Reginald Rose's brilliant TV play script was left virtually intact in its move to feature film. This famous play from the 'Golden Age of Television' was splendidly directed by Sidney Lumet with an extraordinary plethora of actors who give magnificent performances .Because the painstaking rehearsals for the film lasted an exhausting two weeks, filming had to be completed in an unprecedented 21 days and shot in a total of 365 separate takes. However, nowadays none of the twelve stars are still alive . The acting level of the cast during some of the intense discussions and debates almost bursts in the screen . The movie is commonly used in business schools and workshops to illustrate team dynamics and conflict resolution techniques. Nominated for 3 Oscars , another 16 wins & 6 nominations ; the film lost out in all its categories to The Bridge on the River Kwai . It ranked #2 on the American Film Institute's list of the 10 greatest films in the genre \"Courtroom Drama\". This Lumet's impressive debut was followed by a remake made for cable TV (1997) , a contemporized rendition of the memorable tale whose script has been slightly updated but the premise is the same , it was directed by William Friedkin with a formidable cast such as William L. Petersen, Edward James Olmos, Hume Cronyn, James Gandolfini, Dorian Harewood, Ossie Davis, and Courtney B. Vance , George C. Scott , Armin Mueller-Stahl , Tony Danza and Jack Lemmon takes on the voice of dissent , the Fonda role . Furthermore , a Russian version (2007) by Nikita Mikhalkov with Sergey Garmash , Valentin Gaft , Aleksey Petrenko , Yuriy Stoyanov , Efremov , among others ."},{"username":"moonspinner55","userUrl":"https://www.imdb.com/user/ur0989035","reviewLink":"https://www.imdb.com/review/rw1215051","warningSpoilers":false,"date":"13 November 2005","rate":"8","helpful":"21 out of 34 found this helpful.","title":"A bit overwrought, over-directed, but compelling nonetheless...","content":"Twelve-man jury decides the fate of a young man on trial for murder; eleven think the kid is guilty, the twelfth isn't so sure. Director Sidney Lumet makes his directorial debut here, and he's overly fond of riled-up actors shouting at the camera, but he doesn't stray from the proved path of this celebrated play by Reginald Rose, and that's a plus (the material stands quite well on its own). The claustrophobic, muggy atmosphere is rife with tension, and Henry Fonda is a tower of sanity as the only voice of reason. The film attempts to substitute the electricity of a live performance with too many tight shots of angry, sweaty faces, spitting and yelling, however this ensemble cast has a rich anti-camaraderie that puts the film across. *** from ****"},{"username":"TxMike","userUrl":"https://www.imdb.com/user/ur0438066","reviewLink":"https://www.imdb.com/review/rw1000280","warningSpoilers":true,"date":"16 January 2005","rate":"","helpful":"7 out of 8 found this helpful.","title":"Character study in a small jury room.","content":"This movie, currently ranked as #21 all time on the IMDb list, is a simple story of the deliberations of 12 men on a jury of a murder trial. We see nothing of the actual trial or the closing arguments. The story begins as the judge instructs the jury, in weighing the evidence presented, they must return a verdict of 'guilty' unless there is reasonable doubt. Although not made clear in the movie, a verdict of \"not guilty\" is not the same as 'innocent.' Not guilty simply means that the prosecution did not present a case strong enough to prove guilt beyond reasonable doubt. The case that we do not see or hear of first hand involves a son accused of murdering his father. One witness was an elderly man who claimed to have seen the boy running down the stairs from the apartment a few seconds after hearing voices and a body hitting the floor. Was this old man who shuffled along really able to get there in time? Could he really hear clearly over the noise of the passing train? Another was a woman who identified the boy as the one plunging the knife into the victim. But did she wear glasses, and did she have them on when she claimed she saw the murder 60 feet away through the windows of a passing train on elevated tracks (the 'el')? First seated the jurors take a vote, and it is 11 to one in favor of conviction. There is a ball game that evening and many of the men are anxious to delivered a verdict and get home. One man (Henry Fonda) says he is not sure, the boy may in fact be guilty, but suppose he isn't. He just wants to talk about it. A boy's life is at stake. Don't they owe it to him to examine all possibilities? But the other 11 at first look upon their task as one to convince the lone juror that he is wrong.As the 90 minutes move along, various jurors bring up points that they noticed, possibilities that neither the prosecution nor the defense attorneys had brought up. Others gradually join the 'not guilty' side, until it is only one for 'guilty.' Then there were none. Much of the dialog brought out prejudices certain men held, that were clouding their reasoning, and preventing them from seeing both sides of the argument. This is a story less about jury verdicts, and more about human nature.The movie sets out to show that with reasonable doubt at hand, a verdict of 'not guilty' must be returned. Thus it is mostly an examination of how our personal prejudice can cloud our judgment. I suspect that this story was much more significant 50 years ago than it is today. There have been a number of very public trials (e.g. OJ Simpson) where most of the evidence appeared to point to guilt, but a jury returned a 'not guilty' verdict because of reasonable doubt. However it remains part of the foundation of our legal system, that a person is innocent until proved guilty, even if it means some guilty persons will go free.Although only Lee J. Cobb stands out, as the angry juror who was the last hold out, this contained a fine ensemble cast. Martin Balsam, E.G. Marshall, Jack Klugman, Jack Warden, Henry Fonda, Ed Begley are others who are prominent in my mind."},{"username":"Quinoa1984","userUrl":"https://www.imdb.com/user/ur0453068","reviewLink":"https://www.imdb.com/review/rw1308347","warningSpoilers":false,"date":"6 March 2006","rate":"10","helpful":"23 out of 36 found this helpful.","title":"a tight ball of male-dominated classic cinema","content":"It's tough sometimes to translate a stage production- which 12 Angry Men essentially is- into a feature film, with in this case one cramped room and a dozen characters with totally varied ideals. In a way this is like the textbook example, however, of how to do a film like this. You see how the situation unfolds into something more, about the act of telling a story and finding all the pieces. That it has such a powerhouse of an ensemble doesn't hurt it at all, and the little surprises in how the casts acts and reacts works great on repeat viewings. The basic premise only needs brief mention, as the 12 men (totally angry may be disputed by some, though I'm sure not one is left without raising their voice), all white, are judging the case of a Hispanic charged with killing his father. The deliberation room becomes a kind of boiler room where Henry Fonda's juror #11, the only un-sure one, sets the stage for a something more to be revealed- human nature when on a judgment day, with all its intelligence, ignorance, hate, and seeking objectivism.Sidney Lumet, on his very first feature-film, does a really professional (in a good way) job of directing the picture, by which a) letting the actors, who among the great lot include Lee J Cobb, John Fiedler, E.G. Marhall, Martin Balsam, Jack Klugman, Ed Begley, and in maybe the most under-rated role of the 'old man', Joseph Sweeney, just do their work and try to just make sure no one over-steps their ability in their strengths; b) using the atmosphere to high effect. Like he would later do with Network, Lumet uses the camera to add some level of subjectivity to the storytelling, being careful with choosing close-ups but using them very wisely (i.e. a surprise close-up on Sweeney), and here and there making it feel like the walls are just closing in a little more. But, at the same time, Lumet's making a studio picture, with the all-around good-guy Henry Fonda (in one of his best roles), and dealing with a story that's, when it comes down to it, just the details of a crime examined over. But the real strength of the film comes in a quality that it shares with Rashomon (different in structure to be sure), that the idea of looking for the truth is just a guise in a way to examine the people who are looking at what the truth is. It's a nifty movie that has deservedly stayed firm through the decades, not showing its age bad at all."},{"username":"JohnHowardReid","userUrl":"https://www.imdb.com/user/ur12596887","reviewLink":"https://www.imdb.com/review/rw4000554","warningSpoilers":true,"date":"13 December 2017","rate":"8","helpful":"1 out of 1 found this helpful.","title":"Watch it at home!","content":"As a theatrical movie, 12 Angry Men, hemmed in by its extremely scant production values, holds only mild interest at best. As a DVD, however, in any of the excellent versions marketed by M-G-M, 12 Angry Men comes across as an engrossing and tense drama that keeps the viewer's eyes fixed on the TV screen for every second of its 95 minutes. Why the difference? Simply the movie's genesis in a TV play and the rigid intention of producers Rose and Fonda to keep strictly within the play's one-room setting, aside from a brief prologue and epilogue, and an inconsequential scene in a washroom. As a TV play, 12 Angry Men is such an expertly crafted drama, it justifiably ranks as one of the best ever presented. As a movie, however, it's close to a no-show.I wonder how many of its thousands of ecstatic admirers have actually seen 12 Angry Men presented in a real cinema on a real 1.85:1 theater screen? Including me, it's my guess you could count that number on your fingers. The picture just doesn't work half as effectively on a cinema screen. It's too confined. True, it still has some emotional highs, mostly due to the very clever interpretations by both Jack Warden and Joseph Sweeney, who contrive to steer a charismatic middle course between the stridently way over-the-top yelling and screaming by Begley and Cobb and the frozen-faced, overly unemotional Fonda, Klugman, Webber and Voskevec. Actually, on a theater screen, Warden actually comes across with much greater impact than he does on TV. In a cinema, he and Sweeney play the characters with whom audiences most identify. Fonda seems too cold. Yet on TV, he's perfect! True, hats-off reviews ensured the movie sold a lot of tickets, but theater patrons were often disappointed."},{"username":"edwagreen","userUrl":"https://www.imdb.com/user/ur2542703","reviewLink":"https://www.imdb.com/review/rw1762998","warningSpoilers":false,"date":"13 November 2007","rate":"7","helpful":"5 out of 18 found this helpful.","title":"12 Angry Men Cliché Ridden **1/2","content":"The film may be described as a good one due to the outstanding ensemble cast of actors in it.I found that the film is definitely liberal-slanted. Conservatives are depicted as bigoted idiots. Henry Fonda, the juror who swayed all eventually, has a liberal, creative mind. He is really able to come up with creative ideas that leads to the acquittal of the defendant. Fonda is the dream juror for every defense attorney, as well as a nightmare for prosecuting attorneys.Lee J. Cobb steals the film with an outstanding performance as a hateful juror who allows his personal problems with an alienated son to feel that the accused is guilty. Ditto for Jack Warden, who really switched his vote in order to get to that baseball game.When viewing E.G. Marshall's performance, I could not help think back about his acting in the television series-\"The Defenders.\" He is really the opposite hereEd Begley really spews out bigoted ideas that most of \"these people\" aren't any good and think nothing of a life. We are constantly reminded about the downtrodden, the abused child, slum and poverty living in relation to crime and other factors. The film is really a good psychological-sociological drama if anything.It seems as though the violent thunderstorm signaled a break in the action. When the lights were put on, the fan worked. Why didn't someone in the court tell the jurors about the fan and the light? Especially, as it was a sweltering day.As the jury foreman, Martin Balsam is supposed to conduct the agenda in order. Instead, he really allows the other jurors to dominate.Wouldn't you love to see the reaction in court when the verdict was read? How did the accuse react? The judge? The courtroom spectators?"},{"username":"wes-connors","userUrl":"https://www.imdb.com/user/ur15896852","reviewLink":"https://www.imdb.com/review/rw2162329","warningSpoilers":false,"date":"22 November 2009","rate":"10","helpful":"3 out of 4 found this helpful.","title":"The Power of Persuasion","content":"An outstanding reenactment of writer Reginald Rose's superlative 1954 \"Studio One\" drama. Director Sidney Lumet shows how the boundaries in cinematic art can be stretched both ways; necessarily minimalist, he moves the actors and cameras in the jury room like a finely tuned ballet. Dependable Henry Fonda gives his best, and it's one of the most convincing \"Best Actor\" performances ever committed to celluloid. The supporting cast is perfect.No matter how you feel about the film's thought-provoking thesis, you are captivated by juror Fonda's determination. When he introduces a switchblade into evidence - during deliberations! - like the pounding of a gavel, you know Fonda's intentions are premeditated; and, watching him unravel each juror's mind - along with your own - is truly stunning. Anyone interested in becoming a lawyer should consider Fonda a study model. The defense rests.********** 12 Angry Men (4/13/57) Sidney Lumet ~ Henry Fonda, Lee J. Cobb, Ed Begley, E.G. Marshall"}],"errorMessage":""}