{"imDbId":"tt0071562","title":"The Godfather: Part II","fullTitle":"The Godfather: Part II (1974)","type":"Movie","year":"1974","items":[{"username":"MartinHafer","userUrl":"https://www.imdb.com/user/ur2467618","reviewLink":"https://www.imdb.com/review/rw2774910","warningSpoilers":false,"date":"30 March 2013","rate":"10","helpful":"22 out of 31 found this helpful.","title":"My review of this film is pretty unimportant.","content":"\"The Godfather: Part II\" is seen, by many, as the greatest sequel in movie history and one of the best films of all time. Some even think it's better than \"The Godfather\". As for me, who am I to argue?! The film IS great--and deserved the Best Picture Award and its placement at #3 on IMDb's Top 100 list! And, since there are over 500 reviews for it on the site, I can't think of why I am even bothering to review it. After all, what's one more review that sings its praises?! The acting, writing, direction and entire production is perfect. What more can you say? If you do see the film (and you MUST), try to watch the version that combines the first two films into one--and adds additional story to make it one huge and perfect epic. You simply can't be a film buff without seeing this picture."},{"username":"TheLittleSongbird","userUrl":"https://www.imdb.com/user/ur20552756","reviewLink":"https://www.imdb.com/review/rw2343316","warningSpoilers":false,"date":"24 November 2010","rate":"10","helpful":"21 out of 26 found this helpful.","title":"One of the best sequels ever made","content":"I do have to agree that calling Godfather Part II a sequel is rather insulting. It is one of those rare sequels that almost outdoes the first, and considering how amazing the first Godfather was that says a lot. The Godfather Part II is longer, but in some ways it is also richer. People may say like with the first it is slow and takes a while to unfold. Of course, but I think that was deliberate. Both this and the first Godfather have an elegiac quality to them that makes them even more compelling.For one thing, the film is very well made. The cinematography is simply gorgeous, whether it is dark or autumnal or picturesque, and the settings are wondrous. The music once again is outstanding, it is haunting and sticks in your head for a very long time. Then there is a brilliantly written screenplay that is intelligent and thoughtful, masterly direction from Francis Ford Coppola and a fabulously constructed story. The film does have some wonderful scenes-: the scenes where Vito flees Sicily has the grandeur of a silent movie, while the scenes in Cuba actually avoid being clumsy and confusing and the climax is extremely chilling. Not to mention the Pop Goes the Weasel scene, which was very funny.The acting is superb once again. Vito is brilliantly portrayed by Robert DeNiro in one of his better performances. I was also taken with Robert Duvall as loyal Tom, John Cazale and Diane Keaton. But the picture belongs to Al Pacino. He was great carrying the first Godfather movie, but he is even better here. He is simply phenomenal, and to be honest I think he should have won that Oscar. Overall, an amazing film and one of the best sequels ever to be conceived. 10/10 Bethany Cox"},{"username":"bkoganbing","userUrl":"https://www.imdb.com/user/ur2483625","reviewLink":"https://www.imdb.com/review/rw1841853","warningSpoilers":false,"date":"17 March 2008","rate":"10","helpful":"14 out of 19 found this helpful.","title":"The Continuing Saga Of The Corleones","content":"Although most movie sequels never equal the original this is certainly not the case of The Godfather: Part II. Many would argue it surpasses the original. With both films declared the Best Picture by the Motion Picture Academy in their separate years, I'd hate to argue the difference.In this case we should thank the executives at Paramount for retaining both director Francis Ford Coppola and the original The Godfather author Mario Puzo to put their talents to this film. I'd hate to think what would have happened in other hands. Certainly these two men knew their characters and knew how to expand on them. And the best thing about The Godfather: Part II is that one can pick up the story, at least the modern portion of this one without reference to the original. In fact viewing this film will give you a burning passion to see the first.Unlike The Godfather and The Godfather: Part III, this film runs on two parallel tracks. The modern story is a continuation of Al Pacino as Michael Corleone now residing on the shores of Lake Tahoe and now directing the family affairs from Nevada where the Corleone family is heavily into gambling as we well know organized crime was back in those days of the Fifties and Sixties. He's going into partnership with Lee Strassberg playing Hyman Roth, a thinly veiled portrait of Meyer Lansky. But there are a lot of things making Pacino hesitant about this move into Cuba under the Battista dictatorship.The prequel parallel story is how young Vito Corleone came to this country as an orphan and worked his way up to establish himself as a crime boss. Here Coppola does a brilliant job in capturing the flavor of pre-World War I New York in the Italian ghetto. Robert DeNiro is young Vito Corleone and won a Best Supporting Actor Oscar. Remarkable when you consider that two of his rivals were Lee Strassberg from this film and Michael V. Gazzo playing Frankie Pantangeli from this film as well, the Mafia kingpin turned Senate witness modeled on Joe Valachi. DeNiro and Marlon Brando have the unique distinction as players of winning an Oscar for playing the same role.The woman do better in this film as in the original. Talia Shire got an Oscar nomination in the Supporting Actress category as Connie Corleone Rizzi. You remember her husband betrays the family and is killed in the original. She now is a drunken dependent on Pacino. Diane Keaton's character of Kay Adams Corleone is expanded here as well. She's a cultural outsider and the Sicilian vendetta code that she's expected to approve without comment becomes too much to bare. Her scene with Pacino when she tells him she's leaving him is one of the best for both in their respective careers.Overlooked unfortunately at award time was John Cazale as Fredo Corleone. He's the middle son who's passed over for succession after eldest son James Caan is killed in The Godfather. Fredo's big moment in The Godfather is being unable to fire his weapon in defense of his father being shot and how he breaks down.Fredo's got feelings as John Cazale dramatically points out. He does something really stupid in this film and it costs him dear. Cazale has some of the best moments in this film.If the first Godfather film doesn't do it, The Godfather: Part II will have you permanently hooked on the inner workings and dynamics of the Corleone family both in the criminal and personal sense."},{"username":"Leofwine_draca","userUrl":"https://www.imdb.com/user/ur0482513","reviewLink":"https://www.imdb.com/review/rw2993743","warningSpoilers":false,"date":"7 April 2014","rate":"8","helpful":"17 out of 25 found this helpful.","title":"Good, but not as good as the first","content":"A lot of people seem to consider THE GODFATHER PART II to be the best film ever made, a film that's even better than it's already excellent predecessor. Unfortunately, I have to disagree. While this movie is very good, and as well made as the original, I think the original has the edge.The reason for that is the script, which was just better, and more involved, the first time around. Here, there are dual narratives, one of which follows the traditional sequel route of showing that happened to the Corleone family after the events of the first movie, while the second is a prequel revealing how Vito Corleone became the mafia boss he ended up as.While I love Robert De Niro and I enjoyed the flashback scenes, I felt this whole sequence was slightly unnecessary. From the material given, the viewer can already guess how the De Niro character rose through the ranks and the events we witness feel a little bit superfluous. Sure, the pair of assassination scenes are excellent, but the rest just feels obvious and expected.Meanwhile, the Pacino narrative also has its problems, although cast and director aren't at fault; Coppola reunites many of his principals here and to excellent effect. However, there isn't nearly as much incident in the narrative and the whole story feels a little dragged out, a little over-emphasised. In the first film, the Pacino character had three or four major plot points to deal with, whereas this time the events are limited; for example, the entire film focuses on the situation with Roth, whereas in THE GODFATHER that would have just taken up half an hour or so. Therefore the ending, when it comes, is admittedly powerful, but not as effective in comparison to the genuinely amazing things we saw in the first film. It's been done before, and apart from a little more depth and character focus, we can't take much more away from this sequel. So it's very good, but not quite up there to the level of the first."},{"username":"Michael_Elliott","userUrl":"https://www.imdb.com/user/ur13134536","reviewLink":"https://www.imdb.com/review/rw2606472","warningSpoilers":false,"date":"3 May 2012","rate":"","helpful":"10 out of 13 found this helpful.","title":"Rather Amazing How Perfect This Turned Out","content":"The Godfather Part II (1974) **** (out of 4) Francis Ford Coppola's masterpiece shows the early life of Vito Corleone (Robert DeNiro) who tries to rise in power and seek revenge after his parents are murdered. In the current times, Michael (Al Pacino) survives an assassination attempt and goes to find out who was behind it as well as destroy anyone who might be trying to do the family any harm. There's always going to be a debate on whether this film or the first is the best but for my money I have to hand it to this sequel. While both movies are great, I think this one works so well for numerous reasons but the biggest being that not only is a great sequel by continuing the events of the first film but it's also a great prequel by showing the life of Vito.I've always had a few minor problems with the original movie but I think it would be fair to say that this one here is flawless in every way. Coppola does such a masterful job at making sure everything was on par with the original but you can tell he knew people were going to be questioning him attempting to do a sequel so he wanted to make sure that he delivered even more. As with the first film, this one here has that very slow pace that wouldn't be allowed in any movie today but thankfully the 70s were a much different time. Coppola perfectly uses this slower pacing to really get inside the heads of these people and he really delivers so much character development that you're amazed that so much is able to be done in its epic 200-minute running time. Even more amazing is how quickly the film flies by, which is saying a lot of consider the length and pace.Of course, no one could ever say a negative thing about the performances and they're all masterful. I had really forgotten how wonderful Pacino was here but he's so chilling, cold and deadly quiet that you really do begin to fear him. I'm certainly not going to spoil anything but if you've seen the movie then you know what happens at the end and how Pacino plays this was just a masterful touch. DeNiro, picking up his first Oscar, does a wonderful job too. Doing the Italian language and mastering is obviously impressive but so are the small touches that he brings that connects the character to the later one played by Marlon Brando in the previous film. John Cazale is often overlooked but he has some terrific moments here as does Talia Shire, Robert Duvall and especially Diane Keaton.THE GODFATHER PART II contains all the greatness of the first film and it's a real miracle that Coppola was able to match it and deliver even more. The film works on so many levels but being able to pretty much see two movies rolled into one is something of a lost art. Even rarer is how perfectly both parts are as the drama, tension, violence and pain are all on full display and there's no question that this film deserves its reputation as one of the greatest ever made."},{"username":"SnoopyStyle","userUrl":"https://www.imdb.com/user/ur2898520","reviewLink":"https://www.imdb.com/review/rw2913089","warningSpoilers":false,"date":"28 November 2013","rate":"9","helpful":"4 out of 6 found this helpful.","title":"Michael takes over","content":"The saga continues with Michael Corleone (Al Pacino) fully in charge as the unflinching leader. The family drama just gets more and more darker. We are seeing the moral disintegration of Michael. The movie also gets a separate timeline for young Vito Corleone (Robert De Niro). While that is interesting at times, it is very disruptive especially since it's all in Italian.Meanwhile, Michael's story keeps getting better. How could you forget \"I know it was you, Freddo. you broke my heart.\" or \"Keep your friends close, and your enemies closer.\" And John Cazale shines as Fredo. His exchanges with Al Pacino are epic. And the emotional grenade tossed by Kay (Diane Keaton) is absolutely stunning. All in all, it is a great effort for a sequel to a masterpiece."},{"username":"Hitchcoc","userUrl":"https://www.imdb.com/user/ur0278527","reviewLink":"https://www.imdb.com/review/rw1600097","warningSpoilers":false,"date":"16 February 2007","rate":"10","helpful":"10 out of 13 found this helpful.","title":"No More a Sequel that the Odyssey is to the Iliad","content":"It's only a sequel because of the Part II thing. This simply fills in the spaces with one of the greatest characters of all time. Remember, the two were put together in an incredible sage, putting things in chronological order. Talk about your psychological studies. Inside the head of Michael Corleone is a sense of power at all costs. Yet, he sees himself as a moral man. I wonder if one could look at organized criminals like one might look at a mideast country, because they have their own principalities, their own history, almost their own religion. They have parceled out their land and protect against invaders. They fear and react to threats from the outside, from \"non-family\" members.The product they sell is terror. Of course, all participants live on the edge. Their human failings are dismissed and magnified as weakness and disloyalty. Brothers kill brothers. I haven't a lot to add because I am not a film expert. As uncomfortable as this film makes me (like the first one), I continue to watch. And in my heart of hearts I wonder if I were cast into this setting, could I stand up to the expectations of my culture?"},{"username":"Kirpianuscus","userUrl":"https://www.imdb.com/user/ur61197531","reviewLink":"https://www.imdb.com/review/rw5026507","warningSpoilers":false,"date":"29 July 2019","rate":"","helpful":"5 out of 6 found this helpful.","title":"more than masterpiece","content":"To define it as a masterpiece is easy, fair and silly. Because it is obvious - it is a masterpiece. But for each viewer, for specific reasons. Sure, the duel between Al Pacino and Robert de Niro is the key. For me, splendid is the job of John Cazale. The embroidery of the life of father and son, the metamorphose of Michael Corleone, the pressure of past, the air of nostalgia , the details as large mosaics and the cold feeling of a story about everything. A gangster movie ? Maybe not exactly. Because, at the each new view, it gives more than a story about Mafia. But universal history of mankind as a sort of parable."},{"username":"Horst_In_Translation","userUrl":"https://www.imdb.com/user/ur3914439","reviewLink":"https://www.imdb.com/review/rw7926568","warningSpoilers":true,"date":"7 March 2022","rate":"8","helpful":"1 out of 1 found this helpful.","title":"Continues even better","content":"This is \"The Godfather: Part II\", an American movie mostly in the English language, but there are segments in Italian included too. And even a few other languages. I think nothing really needs to be said about the film's status. Way over a million ratings here on imdb are self-explanatory and so are over a thousand reviews. I will happily add mine now and I hope you will like the read. This was by far not the first time that I watched this film, maybe third or fourth, so it was not new or refreshing to me, but this film is certainly also still a high-quality watch the tenth or twentieth time. It's also been quite a long time since I saw this film before yesterday, so I cannot really elaborate on stuff I perceived differently. One aspect, however, is that I remember liking the De Niro parts a lot more on first or second viewing than I did now. No contest for me now that Pacino is the heart and soul of the film and I think most people agree. I have read many film buffs even say that Pacino is better than Brando in the first. The makeup sure helped the latter with the epic status of his role there. Still a bit sad that Pacino did not get the Oscar here, but no offense to Art Carney. Of course, it is also always about the competition. Look at the supporting players from the first Godfather film coming short against Joel Grey. I doubt De Niro would have won there, but it's all speculation anyway. Probably the best picture win was even more obvious for this sequel. Best Director sure was. I got to watch this film at the big screen the other day which had of course to do with the 50th anniversary of the first Godfather movie. They did not show the third though, just the first and second, maybe also because of the big time gap between the second and third film.Anyway, let's look at the plot now. This is to some extent two films in one because a lot of the film takes place before thre first film even while other parts show us what happened after the death of Vito Corleone. It's also not chronological. I remember that I thought De Niro was lead here, but his scenes are so rare in the film's first half that I agree now that probably Pacino is the only lead here. In the second half, there was a lot more De Niro, which helped him with his awards ambitions too I guess. Of course, we also never see De Niro and Pacino on the screen together because there's decades between their characters. We do see De Niro's character though with young Michael when he was a baby. And with young Fredo as well. It's a pity Cazale did not manage to score a nomination for his work here. His scene when he complains about his brother that he was overlooked was one of the finest from the entire film. Maybe his other scenes were not significant enough. Same can be said about Diane Keaton here, who plays Michael's wife. The scene in which she confronts Michael with the unborn's death being an abortion was among the very best from the film, but other than that her screen time was limited. Must also mention Pacino in this scene. Of course, there is a lot of anger with his character, but you will never see him more angry than in this exact moment. He also never really physically attacks people, but there it had to come out. His speech about how it is just not an option that she will get the children was also very haunting. Just like the moment in which he closes the door later on right into Keaton's face. There are so many memorable and haunting moments in here that I cannot mention them all. You just have to experience them and I definitely think you should watch the other film first to really understand the story.Comedy is something you will not find in here at all and if maybe very briefly (you think) you do, then it has a bit to do with Fredo's character like how he will not let go of the suitcase containing the money. You can also wonder if Fredo knew what was about to happen to him in the spectacular finale. There you see how Michael really gets his will again. One antagonist commits suicide. Another is murdered by a contract killer and his own brother also has to pay for what he did, even if it was a long time ago. This killing stays of course maybe most in the mind with how Michael thinks about Fredo and talked about him before that, how he understand that it was Fredo, the kiss, how he confronts him, how he talks to his mother on one occasion. Another brilliant scene. His mother is not a factor otherwise, even if she is a character who is part of both seperate story lines, once as a young woman, once being close to her death. Her being alive was also a guarantee for Fredo to stay alive. I also liked the way the film ended. The setting is basically between both story lines. The boys are grown-up and they tried their best with makeup to have them look young. Especially interesting to see Michael there telling his plans to his brothers and how he is not 10% of the alpha he is for the rest of this film. Briefly before Brando/Vito enters. Even one of the actors from the first film is brought back for that. One who died there in a pretty spectacular sequence. But this sequel here is not chronological at all and does not have to be to fully succeed. My review is not particularly chronological either. I must say the truly great moments from De Niro's character's story here are missing if there is anything to criticize. It is still interesting to watch how he rises, also to see the (familiar) characters he surrounds himself with. How he takes care of the one bullying the neighborhood to kinda become a more distinguished, more dedicated version of him. Also interesting to see how Vito ends up being called Vito Corleone. Very brief moment early on. Actually, there was some comedy to how he dealt with a greedy landlord and this showed us how important loyalty is to him. I mean the comedy included mostly the scene in which the landlord returned.Back to the other scenes again, I must also mention Michael V. Gazzo. Would have loved to see him win the Oscar here. I definitely preferred his antagonist portrayal over Hyman Roth, although it is probably almost impossible to compare those two because their characters could not have been any more different really. Both really good for different reasons. Also interesting to see Lee Strasberg in here with his famous acting institute of course. One of Gazzo's character's most memorable scenes included his brother, but how he unleashed early on against everything non-Italian, no matter if we are talking \"Pop goes the weasle\", Jews or Black people, was also highly entertaining. Nothing against a good tarantella I suppose. As for Roth, I found his most memorable scene was maybe the one from New Year's Eve, even if his character was basically just sleeping there or being in a coma. This was when a hit actually did go wrong, although I wonder where those saviors suddenly came from. The talk between him and Michael (Strasberg's first scene) was good too though. Another hit that went wrong involved Pentangeli (Gazzo). I am not sure I got this right, but it was not Michael's folks behind that one there. Sure turned out clumsy. One character I have not talked about at all was the Corleone sister played by Talia Shire. She had her own agenda and the guy she chose as husband did not make Michael happy. Not much else to say about her. I am surprised Shire was nominated for an Oscar honestly. But yeah all is possible when somebody who is considered (one of) the greatest lead performance(s) in film history does not win his category. Also I must mention Robert Duvall (Tom Hagen). Hagen is still loyal to the family, but his bond to Michael is just not as strong as his bond to Michael's father. Not even close. There are steady conflicts between these two, but they kinda overcome them without their relationship really improving, even if there's moments in which Michael tells Hagen that he is the only one he can trust now. No Fredo, nobody else.You can surely say that Michael also has a tendency to not trust anybody. There was a good quote on that too. I think it came from Pentangeli about the difference in how Michael dealt with the Jews and how Vito did. Speaking of Vito again, as I am getting close to the end of my review, let me of course mention his moment of great revenge when he kills the man who is responsible for murdering his father, his mother and his brother. That had to be included 100% and you simply knew it was going to happen, even if the bad guy was very old at that point already and Vito literally opens his chest with a massive knife. Disguised as a potential olive oil deal. So yeah, also some Italian cuisine aspects included here. No pizza really though. But politics and law. A senator has to find out what happens when he makes an enemy in Michael Corleone. And there is a fairly lengthy courtroom trial too that culminates basically in the scene with Pentangeli's brother that I mentioned earlier already. So many great metaphors and symbolisms in here. Look at Fredo acting almost like a dad towards Michael's son before his demise and how he can finally say that (with the help of God) he was more gifted than his brothers. Even if it was only about fishing. How he talked about fishing being a family tradition etc. How De Niro's character pretty much won over the bad guy in his story line thanks to his grit and courage. And then still proceeded to kill him in the following scene. Sneaky over the rooftops. There's really too much to choose from what your favorite scenes could be. Or favorite shots too. I mean look at the very final shot with Michael having succeeded with every plan of his. How he sits there. This would have been amazing ultimate closure too without a third film happening 15 years later. Back when this was made, Coppola was just in his early 30s. What an achievement for a pretty young filmmaker! Now he is in his early 80s. \"The Godfather: Part II\" is a must see. Huge thumbs-up. (tt0071562)"},{"username":"bob the moo","userUrl":"https://www.imdb.com/user/ur1002035","reviewLink":"https://www.imdb.com/review/rw0135733","warningSpoilers":false,"date":"13 April 2004","rate":"","helpful":"15 out of 23 found this helpful.","title":"A rich epic based on great performances - a little too lush but still a great tale of the corrupting nature of power","content":"Michael Corleone continues his rise within organised crime in 1950's America, by expanding his family's empire across hotels and casinos. When an attempt on his life fails Michael proceeds with his dealings in Cuba with Hyman Roth, a deal that will not be as straightforward as it appears. Meanwhile we are told the story of a young Vito's move to American and his rise from the ghetto up into the world of organised crime.I don't know what I can actually add to the sheer weight of praise that has been heaped onto this film - it is as accomplished a film as everyone says and is rightly one of the few examples of a sequel improving and building on a film. The plot follows two separate strands, the continuing rise of Michael that is as much detrimental to his family as it is beneficial to his pocket; the other thread being Vito's arrival in America as a child and his rise up within the Italian ghettos. The two stories are not as intertwined as I had remembered - they are very separate and the film can go for quite a while before it switches over. In a way this works better as it allows both stories to go ahead without fragmenting either too much.This film, as with many gangster films, has been accused of glamorising the life of crime and those involved in it, however, if anything Godfather II does this even less than the original did. The film shows the moral collapse of Michael in the same way as the first showed his power. In fairness it does contrast the rise of the two dons - showing how Vito manages to keep his family together. Despite this I would still argue that Michael's path is far from glamorous.The two narratives are both excellent but for different reasons. Vito's rise is very interesting and provides solid back story to the first film and we can clearly see the change in Vito from a quiet young man to the influential powerbroker that he became - we also sadly see the rise in his demons and his viciousness. Meanwhile Michael's tread sees more powerful deals and double crosses as he continues to gain more power. This was overly complicated for me the first time I saw it but, with reviewing it I have gotten more from it each time - more understanding and more enjoyment. The twin stories are both engaging and the three hour plus running time passes effortlessly - this is a saga and it never feels like the running time was anything more than what was necessary.The cast are fantastic. Naturally the kudos go to the two leads, and they deserve it. Pacino has a less showy role than in the first film as he has already done his falling - here we only see further proof of the corrupting nature of his power. De Niro steals the film this time with a measured performance that parallels Michael's change in the first film - it is a performance that lacks a certain amount of personality but shows us the traits that the film is interested in. As before the support cast are great, Duvall is reliable as ever, while the most improved role goes to Cazale, who's Fredo becomes more important to the story and almost becomes a biblical character. Quality comes in waves with Shire, Strasberg, Spradlin, Kirby and many others with solid performances. Keaton is good but she is not given as much time as I would have liked, even if her scenes are important and powerful.Overall this is a great film that is based on a classy pair of stories that bring the subtexts with them and a collection of characters that are well developed by a script and some great actors. It may be a little too lavish and plush for my own personal tastes, but it is a rich story. To a certain degree the production values and sheer class of this film could be accused of glamorisation, but generally those who say this have managed to totally miss the fact that this is a cautionary tale that shows the corruption of power."},{"username":"kosmasp","userUrl":"https://www.imdb.com/user/ur5876717","reviewLink":"https://www.imdb.com/review/rw2748208","warningSpoilers":false,"date":"4 February 2013","rate":"9","helpful":"2 out of 5 found this helpful.","title":"Back and forth","content":"Not only the arguments if this one is better than the first Godfather (Godfather II has been used by many as an example that sequels can be better than the original movie), but also the time line of the movie. So while this is the first movie that includes Al Pacino and Robert De Niro in one movie, the time line constraints did not allow for them to be in the same scene (wouldn't make any sense, you'll understand when and if you have watched the movie). Also De Niro won an Oscar (funny fact, for the same role/character Marlon Brando won one in the first Godfather, must be a first and I don't know if it happened again, doubt it though) while Al Pacino didn't. And while it may seem unfair to Pacino, it was more than well deserved for De Niro, who really merged himself into the character that Brando created. From the way he talked, to gestures to mannerisms. Everything is there!But the movie won a few Oscars and the acting was really good too. The story continues (though gives us a few flashbacks) from the ending of part 1. So while the first one is conclusive and has a satisfying ending itself, the story could be continued. Especially with the original author on board (Mr. Puzzi). There are new themes introduced in this movie. One big one is loneliness. And it's not only about being alone when you have power or being the Godfather. As with the first movie this explores quite a lot of things in Gang related family living.A great movie that was even longer than the first one (and the sequel that came after it). But you probably won't mind the length. Especially if you buy into the drama, that really works. And even without it stating the time jumps/leaps it makes, you'll get the (time) change on your own. A great sequel to a great movie"},{"username":"classicsoncall","userUrl":"https://www.imdb.com/user/ur2707735","reviewLink":"https://www.imdb.com/review/rw2234078","warningSpoilers":true,"date":"10 April 2010","rate":"10","helpful":"8 out of 11 found this helpful.","title":"\"I came here because there's going to be more bloodshed\".","content":"It's difficult to imagine that \"Godfather II\" could trade punches with the original and still remain standing, but this is one brilliant film. Masterfully tracing the history of the Corleone Family from Vito's arrival at Ellis Island in 1901 to the Lake Tahoe empire of 1958, the story is a decades spanning saga that makes you wonder how almost three and a half hours can blow by so quickly. The picture's numerous flashback scenes work well to establish the beginnings of Don Corleone's rise to power, and Robert de Niro's portrayal of the young Vito effectively allow us to forget about asking why Marlon Brando didn't show up even once. Pacino is no longer the fresh faced kid home from the military who takes up the family business, but the brooding, brutal leader of a crime syndicate with a chessboard strategy of staying two and three steps ahead of his enemies at all times.If you haven't seen the movie in a long time, you might be surprised like I was while watching today. It's easy to recall the highlights like Frank Pentangeli's courtroom scene and subsequent suicide, and the way Fredo met his timely demise. What I had long forgotten was the way the picture opens with the Sicilian back story, and the way the New York neighborhood flashback thread literally runs throughout the entire picture. It's funny how I recall those scenes as a single sequence leading up to the murder of Don Fanucci, but it just goes to show you how faulty memory can be.You know, it's hard to believe that the first two Godfather movies are nearing the forty year mark since their original release. They've become American classics that have well withstood the test of time, and will continue maintain their appeal. It's fair to say that seeing both of these iconic films are a must for the true cinema fan."},{"username":"lee_eisenberg","userUrl":"https://www.imdb.com/user/ur4888011","reviewLink":"https://www.imdb.com/review/rw1135903","warningSpoilers":true,"date":"26 July 2005","rate":"10","helpful":"4 out of 7 found this helpful.","title":"an equal sequel","content":"Everyone has probably heard that \"The Godfather: Part II\" is as good as the original, and it's true. Perhaps it's better, that's debatable. Picking up where the first film left off, we see the Corleones' control over Las Vegas. Also, Michael (Al Pacino) gets involved with Hyman Roth (Lee Strasberg), one of his father's former cohorts. Meanwhile, in flashbacks, we see young Vito Andolini immigrate from the town of Corleone, Sicily, to New York City in the early 20th century. As he ages (the adult Vito is played by Robert DeNiro), Vito becomes increasingly involved in Mafia business.The climax (at least in my opinion, it was the climax) happens in Cuba on New Year's Eve in 1958. You may recall that the Mafia helped prop up Fulgencio Batista and his reign of terror. Anyway, while Michael and Fredo (John Cazale) are at a party at the Presidential Palace, Michael angrily yells at Fredo \"I know it was you, Fredo! You broke my heart!\" At that moment, just as it turns into 1959, the revolutionary forces enter Havana, proclaiming the revolution's victory. The combination of these two events shows that things won't be the same anymore, whether in the Corleone family or in Cuba. To be certain, Kay (Diane Keaton) has some unexpected news for Michael when he returns home.The point is, this movie disproves the notion that all sequels suck. This sequel is a masterpiece, with splendid performances by Pacino, Keaton, DeNiro, Cazale, Strasberg, Robert Duvall and Talia Shire. But of course, most of all, this movie's superbness owes to director Francis Ford Coppola. He knows exactly how to make a movie, and don't let anyone tell you otherwise. 10/10."},{"username":"gavin6942","userUrl":"https://www.imdb.com/user/ur1234929","reviewLink":"https://www.imdb.com/review/rw1499159","warningSpoilers":false,"date":"16 October 2006","rate":"9","helpful":"9 out of 13 found this helpful.","title":"In Some Ways Even Better Than the First One...","content":"Seven years after the first film, Michael Corelone (Al Pacino) continues his family's quest to become legitimate. Also, more on his father's growing up in Sicily and coming to America. With Vito being played not by Marlon Brando, but Robert DeNiro.) If you liked the first film, you will like this film. If you didn't, you won't. It's really that simple, since you have all the same great people coming together for this film with just as solid a script and acting as you did the first time. You lose Marlon Brando, but you get Robert DeNiro. I consider that a fair trade.This film has two things going for it: it has the early years of Don Corleone, which really fills in the missing mythos around the family. Without this, the film would appear to show the Corelones were always powerful, which is far from the truth. It does not explain how Don Corelone grew to talk in such a mumbled voice, though.Also, I really enjoyed the entire Cuba sequence, because it put the film in a historical time frame (and I like Cuba). I was never fully sure when the first film was taking place, but this one made sure I knew the years when Don Coreleone was growing up and that the present day was not 1974, but rather in roughly 1958-1959. That changed my perspective on things completely.If you have invested three hours in the first film, invest three more in this one. Why only get half the story of Vito Corleone? I cannot make any suggestions for part three, though, one way or the other."},{"username":"jboothmillard","userUrl":"https://www.imdb.com/user/ur4248714","reviewLink":"https://www.imdb.com/review/rw1038297","warningSpoilers":true,"date":"13 March 2005","rate":"10","helpful":"5 out of 11 found this helpful.","title":"The Godfather Part II","content":"This is equally as great as the first, and another success for Oscar and Golden Globe winning director Francis Ford Coppola (he could have won the Oscar for the first). This film tells two stories of the Corleones, it tells the current events of the new Godfather, Michael Corleone, and the story of young Vito Corleone. BAFTA winning, and Oscar and Golden Globe nominated Al Pacino is brilliant at being a villain, the worst thing he did as the character was to kill his own brother. But it's Oscar and BAFTA winning Robert DeNiro as young Vito that's my favourite of the whole film, because he is very good at impersonating Brando, and being just as mean as him. He is just as good at being the Godfather as the late, great Marlon Brando was. Also starring Diane Keaton as Kay Corleone, John Cazale as Fredo Corleone, Oscar nominated Talia Shire as Connie Corleone, Oscar and Golden Globe nominated Lee Strasberg as Hyman Roth and Oscar nominated Michael V. Gazzo as Frankie Pentangeli. A lot more interesting and complex than the first, a masterpiece sequel, I only wish it was left here and there was no third film. It won the Oscars for Best Art Direction-Set Decoration, Best Music for Nino Rota, Best Writing, Screenplay Adapted From Other Material and Best Picture, and it was nominated for Best Costume Design, it was nominated the BAFTAs for the Anthony Asquith Award for Film Music and Best Film Editing, and it as nominated the Golden Globes for Best Motion Picture - Drama, Best Original Score and Best Screenplay. Robert De Niro was number 2, and Al Pacino number 1 on The 100 Greatest Movie Stars, De Niro was number 50, and Pacino number 26 on The 100 Greatest Pop Culture Icons, and Pacino and De Niro together were number 5 on The World's Greatest Actor, Michael Corleone was number 11 on 100 Years, 100 Heroes & Villains, the film was number 58 on 100 Years, 100 Quotes (\"Keep your friends close, but your enemies closer.\"), and along with the first film, both were number 2 on The 100 Greatest Films. Outstanding!"},{"username":"rmax304823","userUrl":"https://www.imdb.com/user/ur0819382","reviewLink":"https://www.imdb.com/review/rw2071795","warningSpoilers":true,"date":"25 May 2009","rate":"8","helpful":"3 out of 6 found this helpful.","title":"Excellent dramatic story.","content":"I suppose everyone already knows the story -- Al Pacino as Michael Corleone rises to power in 1958, with multiple flashbacks to Robert DeNiro as his father Vito in the 1920s -- so we can dispense with a summary. Actually, the story itself is less important than the fact that the film naturally divides itself in two -- its execution and its moral message.The execution is splendid in every regard. Coppola's direction is deliberately paced. There is a conspicuous absence of unsubtle and dizzying directorial razzle-dazzle, thank God -- a movie that doesn't give you a headache.The performances are nearly flawless. There isn't a sour note in the entire cast, and especially outstanding is the acting of Lee Strasberg, Michael V. Gazzo (author of \"A Hatfull of Rain\"), and Gastone Moschin as Don Fanucci, who tackles the role with an understated grandiosity -- what operatic flourishes! But everyone is good.The photography by Gordon Willis, as in its predecessor, is dominated by a burnished amber except for wintry Lake Tahoe where various shades of blue and a steely gray predominate. The production designer deserves credit. Nino Rota's orchestral score is memorable, a folksy melancholic tune. The script has some neat tag lines. When Strasberg and Pacino meet, they shake hands and exchange warm wishes, then when Pacino admits that he's going to kill a colleague of Strasberg, the latter shrugs, turns to his tuna fish sandwich, and says, \"He's small potatoes.\" It's a chilling moment. The avuncular, sentimental old man is a ruthless murderer. That's the execution. The -- I don't know what to call it. I don't like the term \"moral of the movie.\" Sounds like a high school term paper. And I'm not sure exactly what \"intentionality\" means in phenomenology, so I'll just say \"intention.\" The intention of the film is thoroughly corrupt. Maybe Puzo and Coppola realized it, maybe not.I think the director did, though. That's why he splices so much carnage into the rituals. Almost every scene of violence takes place during some sort of party or religious festival. I think -- I HOPE -- that Coppola was aware of the irony between the rites of intensification and the fact that the principles they embody are ignored almost at will. It's important to have your baby baptized as soon as possible, just as it's important to shoot a miscreant in the chest.In a sense all the rituals, all the religion, are fakes. There is no license permitted, unlike Irish wakes, Polish weddings, or Russian parties. If, like Gazzo, you have too much wine and accidentally spill some on the vast tablecloth at an al fresco party, the glances are severe. No sexy dancing either. In a way, despite the faux gaiety, it's something like living in a prison, especially for women.We're supposed to feel sorry for Michael who, at the end, is seen sitting alone in solemn grandeur, emotionally bankrupt. But Michael is really a rat who deserves everyone's contempt and execution by the state. It doesn't matter that he's young, handsome, well-spoken, powerful and rich. He's broken more laws than anyone can count. He lies, cheats, and murders at will. Those murders include an innocent whore who is horribly butchered simply in order to entrap the Senator from Nevada in Michael's thrall. He betrays his friends. He throws out his wife and prevents her from taking \"his\" children. He murders his own brother for a past mistake for which he's already been punished.The original Don Corleone, Marlon Brando, had a set of allegiances extending outward from the family at its center -- to his ethnic group, his neighborhood, his co-conspirators in the business, and beyond that to some vague construct called \"the nation.\" Al Pacino's Don has whittled it all down. At the center is ego, and beyond that, business. He's become a classical villain, a Richard III who has plucked down that crown, and if he now has buyer's remorse -- well, he should have thought things out earlier. His tragedy is nothing compared to mine, which has been Shakespearean in its grandeur, really. In my adolescence, the love of my life, Juliet, poisoned herself. And when, in all modesty, I tried to become Emperor of Rome, the treacherous bastards assassinated me."},{"username":"ccthemovieman-1","userUrl":"https://www.imdb.com/user/ur4445210","reviewLink":"https://www.imdb.com/review/rw1332298","warningSpoilers":false,"date":"3 April 2006","rate":"9","helpful":"24 out of 38 found this helpful.","title":"Not Far Behind The First Film","content":"This isn't quite as powerful as the first Godfather, done two years earlier, but it isn't far behind. It's another magnificently filmed effort, wonderfully acted and a hard film to stop once you've put it in your tape or DVD player.What makes this a notch below the first Godfather is the absence of Marlon Brando and a little too much disjointedness with flashbacks. Also missing from this film was the volatile James Caan. He was shown in a flashback scene near the end, and that was it.One thing was just as good if not better than the first film, and that was the cinematography. The browns, blacks, greens and yellows are just great treats for the eyes. I especially love the Italian houses and scenery. Why this was not even nominated for an Academy Award in cinematography is mind-boggling.The story centers around the brutal vengeance of youngest brother Michael (Al Pacino). It also gives a good demonstration of how the gangster lifestyle may look attractive on the outside but really is an unhappy one despite the wealth.There are some excellent supporting performances in this film, too. I especially would cite the roles played by Michael Gazzo and Lee Strassburg."},{"username":"BA_Harrison","userUrl":"https://www.imdb.com/user/ur0945066","reviewLink":"https://www.imdb.com/review/rw3427562","warningSpoilers":false,"date":"7 March 2016","rate":"6","helpful":"35 out of 63 found this helpful.","title":"It's-a not so good.","content":"The Godfather Part II is one of those rare sequels that is regarded by many to be as good as, if not better than, the original. I'm guessing that much of its popularity lies in the fact that it is not just a sequel, following Michael Corleone (Al Pacino) as he continues to expand his family's 'business', but also a prequel, charting Vito Corleone's life from a child in Sicily at the turn of the 20th century to powerful New York mafia don. Two films for the price of one!Unfortunately, as far as I'm concerned, only half of this 'double-bill' is really worth the time and effort. The flashbacks are great, with Robert De Niro superb as the young adult Vito, rising from shop assistant to mob boss; these parts reminded me of the excellent Once Upon A Time In America, which also charted the early lives of young gangsters (and which also starred De Niro). In contrast, the scenes featuring Michael's continuing underworld activities in the '50s are far too convoluted and slow for their own good, making keeping up with the Corleones more of a chore than a pleasure.8/10 for the flashbacks; 4/10 for the rest. That's a disappointing average of 6/10."},{"username":"Quinoa1984","userUrl":"https://www.imdb.com/user/ur0453068","reviewLink":"https://www.imdb.com/review/rw0135567","warningSpoilers":false,"date":"21 February 2000","rate":"10","helpful":"6 out of 7 found this helpful.","title":"One of the best sequels ever made","content":"The Godfather part 2 gets very close to the title for best sequel ever made, but not quite. Even so, I would rank this among the superior films to follow up on another and still be as strong and appealing and dramatically satisfying as the former. The structure of the film is also very important as it jumps back and forth between two stories of Corleone's without any disconnected feelings for the audience. Both could work as perfect single films on their own; together it's like a double album of the dark side of crime and the perilous nature of rising up in America as an immigrant. It's spectacular in many ways, masterpiece in fact, and has become as important as the first one (it is the only sequel to win an Oscar for best picture in those terms) and the acting all around is well-knit (even the pioneer himself Lee Strasberg is on hand as Roth), the score is possibly better in some ways to the first film, and most of the scene work is fantastic. One thing that attracted me to this film is also what I believe is one of the all-time great breakthrough performances in any film, as Robert De Niro as Vito Corleone has all of that confidence as an actor without channeling too much Brando. If there would be one reason to see the film and recommend it it would be because of him, as he gives one of his tour de force career turns in that streak of one after another in the 70s. Pacino is practically as good with enough lines that are realistically grounded but also highly quotable at times (the \"in my home\" bit is priceless). John Cazale, by the way, is also an element to make the film work as one of two performances that he'll be remembered for twenty years down the line (the other being Dog Day Afternoon). In short, it's just a very well done picture."},{"username":"tavm","userUrl":"https://www.imdb.com/user/ur11228318","reviewLink":"https://www.imdb.com/review/rw4819425","warningSpoilers":false,"date":"1 May 2019","rate":"10","helpful":"2 out of 5 found this helpful.","title":"The Godfather: Part II is even better than its predecessor","content":"Three years ago, I watched The first Godfather and while I enjoyed it, I didn't think of it as such a great film, partly citing the roles of Diane Keaton and Talia Shire. Here, they're both still being somewhat underused but Ms. Keaton has a great scene when she reveals what really happened to her upcoming baby and Ms. Shire has a nearly as such scene when she mentions Fredo near the end. Speaking of whom, John Cazale is fine in reprising the role as the weak Corleone brother. And Al Pacino was probably at his very best in this, his second feat at portraying Michael Corleone especially during scenes with his mentor Lee Strasberg as Hyman Roth. Francis Ford Coppola is aces as both the co-writer (with creator Mario Puzo) and director as he handles scenes from both the late '50s concerning Michael and the early 20th century concerning his father Vito, here played in an Oscar-winning turn by Robert De Niro speaking mostly in Italian. So on that note, I highly recommend The Godfather: Part II."},{"username":"bevo-13678","userUrl":"https://www.imdb.com/user/ur76062573","reviewLink":"https://www.imdb.com/review/rw5587368","warningSpoilers":true,"date":"29 March 2020","rate":"10","helpful":"1 out of 3 found this helpful.","title":"As good or better than the first","content":"I like the bit where he shot that man. This movie was awesome just like the first. I can't wait till part 3 it must be awesome"},{"username":"Doylenf","userUrl":"https://www.imdb.com/user/ur1048771","reviewLink":"https://www.imdb.com/review/rw1849843","warningSpoilers":false,"date":"31 March 2008","rate":"7","helpful":"4 out of 10 found this helpful.","title":"Not quite up to the first Godfather film--but chilling enough...","content":"\"I don't feel I have to wipe everybody out. Just my enemies.\" So says Michael Corleone (AL PACINO) in THE GODFATHER: PART II.Pacino plays the part with somber seriousness that becomes a bit one dimensional by the time the film is midway over. Nor is the story as compelling as the first Godfather film. But you have to hand it to director Coppola, he keeps the viewer glued to the screen even when the pauses between dialog is a bit longer than needed. (No wonder the film is so long!!). And with the risk of being politically incorrect, you can almost smell the garlic in every scene, so realistic are the accents and the background flavor of the entire film.So many plot developments are almost throwaways because the screenplay seems to be deliberately ambiguous about certain plot elements. And yet, the film has a certain holding power and all of the performances are more than competent. Especially poignant--and chilling--is the scene where Fredo's fishing expedition takes place with stormy looking clouds setting the eerie scene to perfection as the expected murder takes place.With murderous intentions just around the corner in practically every scene, it's a fascinating film to watch, especially since the murders themselves are so deftly handled by the actors involved. DIANE KEATON is especially convincing in the final confrontation with Pacino.I don't think GODFATHER II compares favorably to the original film with Brando, particularly since it's not always successful in telling two stories--the one involving the young Vito (ROBERT DeNIRO) and the present story--but it still packs a wallop when it gets to the intense moments. The double strand of stories doesn't always mesh well, a weakness of structure that hurts the film. Despite this major flaw, it's a superior piece of film-making."},{"username":"LeonLouisRicci","userUrl":"https://www.imdb.com/user/ur33374263","reviewLink":"https://www.imdb.com/review/rw2827035","warningSpoilers":false,"date":"7 July 2013","rate":"10","helpful":"4 out of 6 found this helpful.","title":"If You Liked the First One! You'll Love the Sequel!","content":"You must have heard the raves...\"the best Sequel of all time\", well, Star Wars Fans may disagree but it is a valid argument. This surpasses a Great Film with an even greater Film. It is certainly broader in Scope and even more lavish in its Production. The Flashback New York Scenes are a standout.The warm, rich Cinematography remain and the sharp Characters with a wider palette to add even more richness to proceedings. It is more edgy and is less likely to linger with Portrait like introductions to already known participants. There are more interesting themes here like the expansion to Las Vegas, and the formation of the Family's Patriarch and sensibilities, and the Senate Hearings.This one moves quite a bit faster than the original because it has much more to say. It says it and then some. Michael's descent into internal Madness is not a pretty sight and the Inheritor to all that is Corleone becomes a very unlikable Tyrant and shows virtually no signs of Humanity as the Modernity of events that take place have no place for that sort of thing."},{"username":"utgard14","userUrl":"https://www.imdb.com/user/ur1896124","reviewLink":"https://www.imdb.com/review/rw3050800","warningSpoilers":false,"date":"15 July 2014","rate":"10","helpful":"6 out of 9 found this helpful.","title":"\"If anything in this life is certain, if history has taught us anything, it is that you can kill anyone.\"","content":"Phenomenal sequel to The Godfather is split between two stories. One follows the events of the first movie as Michael Corleone (Al Pacino) deals with strife inside and outside the family as he works to expand the business. The other tells the story of a young Vito Corleone (Robert De Niro) and his rise to power.The greatest sequel of all time? Yeah I can't see many doubts about that. It's often said to be even better than the first movie. I don't see the point in splitting hairs over it. I'll just say that I love both films a lot, though I rewatch the first one more often than this one. For the optimum experience you should watch both movies back-to-back like they're one long film. As with the first movie, this is pretty much flawless. I can't think of a thing about it I would change."},{"username":"grantss","userUrl":"https://www.imdb.com/user/ur2860723","reviewLink":"https://www.imdb.com/review/rw3477688","warningSpoilers":true,"date":"28 May 2016","rate":"9","helpful":"1 out of 2 found this helpful.","title":"Great follow-up to one of the greatest movies ever made","content":"The continuation of the Godfather saga with two focuses: the ongoing story of the Corleone family, and Michael in particular, and Vito Corleone's (Michael's father) backstory. Regarding the ongoing Michael Corleone story, it is about seven years since the events that concluded The Godfather. With the murders of the heads of the other four New York / New Jersey families, the Corleone family has unassailable control in New York. The move to Nevada went smoothly and Michael Corleone controls several hotels and casinos in the state. Frank Pentageli, the man who runs Michael's interests in New York, comes to Michael, asking if he can take out the Rosato Brothers as they are infringing on Pentageli's turf and business interests. However, the Rosatos are backed by Hyman Roth, a business partner of Michael's and a long- time ally of Michael's father, Vito Corleone, and Michael refuses. An attempted assassination attempt is then carried out on Michael's life, in his own home. Michael investigates who is trying to kill him, and suspects that there is a traitor in his family. Meanwhile. Michael and Hyman Roth fly to Cuba to finalise some business deals there. The Cuban trip reveals all. In a story interwoven with the present day, we see the backstory to Vito Corleone. From how his parents and brother were murdered by a Don in their home town of Corleone in Sicily, to his escaping, as a boy, to New York, his adult life and his rise to Don Corleone.A great follow-up to one of the greatest movies ever made. Gritty, solid plot, superb direction by Francis Ford Coppola and excellent performances. The closing scenes are incredibly powerful, showing just how much Michael has changed from the innocent man we met at the start of the first movie.Six Oscar wins, including Best Picture, Best Director and Best Adapted Screenplay. Robert De Niro won a Best Supporting Actor for his performance as Vito Corleone, making two Oscar wins for two different actors playing the same character (Marlon Brando got a Best Actor Oscar for his performance in the first Godfather). Al Pacino, Michael V Gazzo, Lee Strasburg (of method acting fame) and Talia Shire also received acting Oscar nominations.Not quite in the same league as the first movie though. The first one had a much tighter plot and better pacing: this does feel a bit padded and slow at times. Not as enthralling and tension-filled as the first. Then again, we are comparing this movie to one of the greatest films of all time..."}],"errorMessage":""}