{"imDbId":"tt0060196","title":"The Good, the Bad and the Ugly","fullTitle":"The Good, the Bad and the Ugly (1966)","type":"Movie","year":"1966","items":[{"username":"MartinHafer","userUrl":"https://www.imdb.com/user/ur2467618","reviewLink":"https://www.imdb.com/review/rw1456301","warningSpoilers":false,"date":"23 August 2006","rate":"10","helpful":"21 out of 32 found this helpful.","title":"Among the finest Westerns, though not for all tastes","content":"While I have given some pretty long reviews to Clint Eastwood's Westerns--particularly the wonderful FISTFUL OF DOLLARS and FOR A FEW DOLLARS MORE, I will only give a brief review of this movie because there are so many reviews already I doubt if my pontificating will actually influence many people. After all, this is widely seen as one of the greatest Westerns ever made and since I liked it immensely, there isn't much need to say more.Well, there are actually a few Westerns I liked a bit more--I am a HUGE fan of THE BIG COUNTRY. But, when it comes to style, originality and the epic proportions of this film, none can match it, though ONCE UPON A TIME IN THE WEST comes very, very close. The acting and script are just fine and the music is intensely weird but effective. Of all the films I have seen with music by Ennio Morricone, this is his most intense and strangest. And it works perfectly in this film, but I also appreciate much of his more restrained work in other films and would never want all Westerns to have such distinctive and bizarre music as in THE GOOD, THE BAD AND THE UGLY--it would just lose its magic and might even tend to overwhelm the film.About the only negatives about this film are the title and it is a pretty violent film that the little ones probably shouldn't watch. There is a lot of blood and violence and you do get to see (yuck) Eli Wallach's butt. As for the title, sure, Lee Van Cleef was truly \"BAD\" and Eli Wallach was cure \"UGLY\", but Clint as \"the GOOD\"? Well, his character was far from good--but of course, who would like the title to be \"The Kinda Good, The Bad And the Ugly\"?! Not to be missed by any serious fan or the genre."},{"username":"TheLittleSongbird","userUrl":"https://www.imdb.com/user/ur20552756","reviewLink":"https://www.imdb.com/review/rw2366480","warningSpoilers":false,"date":"9 January 2011","rate":"10","helpful":"10 out of 16 found this helpful.","title":"Nothing bad or ugly about this movie, all is good","content":"Well what do you know? Another amazing movie from Sergio Leone. The Good, The Bad and the Ugly has so much good about it, and quintessentially it is one of the best westerns ever made. There may be nothing new about the story at first glance, but that's the point, Leone is paying homage to the Hollywood western, and despite the initial simplicity there is also a complexity mainly in the film's characters. Regardless of whether simple or complex it is, The Good, The Bad and the Ugly does have a compelling and brilliantly written story.But there are other assets that make The Good, The Bad and the Ugly so good. The dialogue is always excellent, while Leone's direction is superb once again. The characters are great and are superbly played. Clint Eastwood gives one of his best performances ever here, and Eli Wallach is perfectly cast and more than a match for him. I was also very impressed with Lee Van Cleef, who I recognised from High Noon and such, but he makes a bigger impression here. The Good, The Bad and the Ugly is also the most violent of the trilogy, and one of the most violent of the genre, not a bad thing whatsoever.The pace was spot on too, even though the film is nearly three hours long, it is never boring or dull. The best things though about The Good, The Bad and the Ugly are the visuals and Ennio Morricone's score. The film looks amazing, the cinematography is gorgeous and the sweeping images and scenery are very lovingly crafted. Morricone's score is even more impressive than that, it is simply one of the best film scores I've ever heard, and if I had to say which was Morricone's best score, I would immediately say this.Overall, there is nothing bad or ugly about the film. The film is amazing. 10/10 Bethany Cox"},{"username":"bkoganbing","userUrl":"https://www.imdb.com/user/ur2483625","reviewLink":"https://www.imdb.com/review/rw3330601","warningSpoilers":false,"date":"7 October 2015","rate":"6","helpful":"12 out of 49 found this helpful.","title":"So who's who?","content":"Bearing in mind that I think westerns are an American art form and I have an aversion to the European made ones, Sergio Leone's The Good The Bad And The Ugly has a lot to recommend it. Not the least of which the impact it had on Clint Eastwood's career making him an American icon.The Good The Bad And The Ugly follows an odyssey of three men, two of them a pair of lowlifes and the third no better than he ought to be in a search for buried gold. It's quite the odyssey that Clint Eastwood, Eli Wallach, and Lee Van Cleef in those title roles have in search of the loot. A minor theater of the Civil War is operating in the west and all of them get caught up in it as well.Clint Eastwood developed and honed his laconic and cynical character who was in fact a good guy. Which gives you some idea of the bad guys he faced in his western films. Note that Clint Eastwood also never returned to the spaghetti western after this film.Van Cleef is his usual mean self, perhaps exponentially so. One thing about him is that he's a hired killer with a strong work ethic so I guess that counts for something. When he takes a contract he follows through. As for Wallach he dusts off his Mexican bandit characterization that served him so well in The Magnificent Seven is dusted off and embellished. At one point he's got Eastwood at his sadistic mercy, but when he learns of the loot, Wallach's greed gets the better of him.I don't consider this the great classic that many do, but The Good The Bad And The Ugly will satisfy most western fans."},{"username":"Leofwine_draca","userUrl":"https://www.imdb.com/user/ur0482513","reviewLink":"https://www.imdb.com/review/rw3510161","warningSpoilers":true,"date":"23 July 2016","rate":"10","helpful":"8 out of 14 found this helpful.","title":"Epic spaghetti western with the best set-piece climax ever","content":"Leone's conclusion to his DOLLARS trilogy once again shows how he had progressed as a director from the previous two films - with his style now evident and developed, his pacing slowed down to a gentle speed and exactly the right combination of editing, photography, and art direction, Leone was ready to make what many consider to be his greatest film - ONCE UPON A TIME IN THE WEST. Unfortunately, THE GOOD, THE BAD AND THE UGLY is sometimes overlooked in place of that film, and although it's only the third of a trilogy, the film still has an epic feel to it.This film's main benefit over the previous two is Ennio Morricone's score. While his music was very good in A FISTFUL OF DOLLARS and FOR A FEW DOLLARS MORE, here it becomes the stuff of legend and one of most recognised western tunes ever written; it's also by and far Morricone's best ever work, to this day. Leone retains the solid Eastwood from the previous two films and also brings back Lee Van Cleef, this time playing a bad guy (unfortunately - I prefer his heroes to his villains as I like the guy). Most screen time, though, is given to THE MAGNIFICENT SEVEN's Eli Wallach, who is also excellent as the wanted criminal Tuco, a man who lives by his wits and courage and isn't afraid to take risks.Eastwood plays his role to perfection, as he should with so much practice. He gets to say some well-remembered lines such as \"There are two kinds of people in this world, my friend...\" Van Cleef is exceptionally evil and sadistic as the villain of the piece, my only complaint is that he has relatively little screen time in comparison to the other two main stars and thus feels slightly underused. Also appearing are some familiar faces like Luigi Pistilli and Rada Rassimov.The plot is a wider and more political one than before, as it shows how the Civil War intruded upon the quiet serenity of the Old West. The brief battle scenes we do see are sweeping and epic, up there with the best put on film. Leone's direction is stylish and a work of genius, and he serves up a number of odd, memorable situations. These include a shoot-out in a bombed town, complete with blackened smoking ruins; an ingenious way to remove handcuffs; and the blowing up of a bridge. The scene is also set for one of the best sequences in cinema; the confrontation between Wallach, Van Cleef, and Eastwood in the cemetery at the film's end. Here, the music, quick photography (close-ups of people's eyes, etc.) and acting combine to make this one of the coolest, most tense showdowns in history. One must not forget the element of comedy which Leone also uses to make the film lighter and more enjoyable; he succeeds well. Definitely one of the best spaghetti westerns out there."},{"username":"Michael_Elliott","userUrl":"https://www.imdb.com/user/ur13134536","reviewLink":"https://www.imdb.com/review/rw2738161","warningSpoilers":false,"date":"16 January 2013","rate":"","helpful":"1 out of 7 found this helpful.","title":"Classic End to the Trilogy","content":"The Good, the Bad and the Ugly (1966) *** 1/2 (out of 4) The final part in Sergio Leone's trilogy has three men racing against one another to locate $200,000 in Confederate gold. THE GOOD, THE BAD AND THE UGLY has become one of the most loved Spaghetti Westerns out there and it's easy to see why because it contains all the style and violence that the genre has become known for. It's also easy to see why this film gained so many negative reviews when it was originally released but I think it's safe to say that its reputation of a classic isn't going anywhere. As with the previous two installments, Leone does a masterful job with the style of thing and especially the ending, which is clearly one of the greatest ever filmed. It's really amazing to see what Leone was able to do with the budget he had and the fact that he constantly tried to top the previous film in the series is something mighty impressive. I think most directors would have been happy with A FISTFUL OF DOLLARS but Leone managed to build on that and then build on FOR A FEW DOLLARS MORE. Clint Eastwood, Lee Van Cleef and Eli Wallach are all wonderful in their parts and there's no question that the three of them and their chemistry is now legendary. The violence in the film is often graphic but it's also very realistic and fitting for the subject matter. Then there's Ennio Morricone's score, which is so iconic yet it still sends shivers down your spine each time you hear it. The action scenes are excellently put together including the terrific battle on the bridge as well as some of the comedy relief early on dealing with hangings. If there's one problem with the film I think it runs on way too long for its own good. Yes, I know many love the epic feel of the picture but I still think it runs on way too long in its extended version."},{"username":"SnoopyStyle","userUrl":"https://www.imdb.com/user/ur2898520","reviewLink":"https://www.imdb.com/review/rw2873397","warningSpoilers":true,"date":"21 September 2013","rate":"9","helpful":"9 out of 13 found this helpful.","title":"Eli Wallach steals the movie","content":"The Good Blondie (Clint Eastwood), The Bad Sentenza (Lee Van Cleef), and The Ugly Tuco (Eli Wallach) are racing to find buried gold during the civil war. Blondie and Tuco had a scam where Blondie would bring in Tuco for the reward. Just when Tuco is about to be hanged, Blondie would shot Tuco down off the noose. Except the last time when Blondie double crossed Tuco and left him behind. So comrades in crime turn into enemies. Just as Blondie is about to be killed by Tuco, Blondie hears a name from a dead soldier. That name leading to the buried gold. So enemies become comrades in crime once again.The action is bigger than before. The scale of the movie is bigger. The number of people is bigger. The sets are bigger. The battle scene is gigantic. But it's Eli Wallach that steals the show. He is able to bring humor into this movie. He and Clint really have great chemistry together."},{"username":"Hitchcoc","userUrl":"https://www.imdb.com/user/ur0278527","reviewLink":"https://www.imdb.com/review/rw5059483","warningSpoilers":false,"date":"14 August 2019","rate":"10","helpful":"9 out of 13 found this helpful.","title":"The Absolute Essence of Film","content":"Since there isn't much original that I can add, I just want to make sure that no stone is unturned. The three principles in this epic are so well developed. There are no really \"good\" guys, despite the title. But they are so well drawn that we are intrigued by the clash of spirits. It is very much like reading the Iliad. When Achilles dons the armor, he is going after another hero and must defeat one he respects. Here, respect may be the wrong word, but viable adversaries have a kind of sense of immovable object and irresistible force. There is so much violence and so many confrontations, it works so well. It, of course, got us away from the horse opera, or even the white hat of John Wayne (not to diminish the joy of those films) and created an opening for the anti-hero. What a piece of cinema."},{"username":"Kirpianuscus","userUrl":"https://www.imdb.com/user/ur61197531","reviewLink":"https://www.imdb.com/review/rw5919329","warningSpoilers":false,"date":"19 July 2020","rate":"","helpful":"3 out of 4 found this helpful.","title":"useful.","content":"First, for a long time, it was the music of Ennio Moriccone. Obsessive, preserving , like a flavor, the essence of the story. The second - Lee Van Cleef. And, sure, the great job of Eli Wallach. I am not an admirer of western genre and I saw this film few couple days ago. The last virtue, not the least remains the fine refference to the Civil War, smart, precise, real useful. The basic scene - the first. It is a film with many admirers , a classic and more than te familiar western. But its virtue , the great virtue , is to be the perfect caleidoscope. A good film, maybe a masterpiece, for many reasons, many , so different categories of public, in impecable craft, with a powerful message. The humor, the tension and, yes, especially the high inspired sound are the great - unique , in my opinion, motifs to see, time by time, this splendid film."},{"username":"Horst_In_Translation","userUrl":"https://www.imdb.com/user/ur3914439","reviewLink":"https://www.imdb.com/review/rw5036066","warningSpoilers":true,"date":"2 August 2019","rate":"8","helpful":"3 out of 6 found this helpful.","title":"The good, the better and the best","content":"\"Il buono, il brutto, il cattivo\" or \"The Good, the Bad and the Ugly\" is an Italian co-production that is in the original also in the English language and was released back in 1966, so this one is over half a century old now already, which sadly means that almost all of the people working on it are (long) gone. But first things first. The director here is Sergio Leone and he is also one of many people working on the screenplay here. The movie runs for considerably over 2 hours and there are many versions out there, one of them even crossing the 3-hour mark. The cast includes many well-established actors and the big name by today's standards is of course Clint Eastwood who was in his mid-30s when this was made. Maybe Eli Wallach (who almost turned 100 before his death not too long ago) is also still known to many and maybe even Lee Van Cleef, who did not get as old as the other two. These three play the main characters in this movie we got here, the three mentioned in the title. And there is a nice introduction so we know who is who. And the ugly even gets another quick mention near the end, maybe because his one at the beginning was so short. Honestly we learn a lot more about the ugly in the introduction of the good than in his own introduction. Or maybe he gets the one at the end because in my opinion he was just the most memorable of the three and Eli Wallach also gave the best performance in the movie. Already how effortlessly he looked like a Hispanic was impressive because he really was a Jew. And he is also the one who kept this film from becoming too serious because his character always brought in some comedy value and even during these moments when Eastwood makes a short funny one-liner like along the lines of \"idiots they are talking to you\" Wallach is present and his body language adds a lot to the fun element. But people should not mistake Tuco for a fool. He may not be educated or a leader, but he makes up for it with grit determination and also ruthlessness. And there is also a soft side to him, he is not as cold-blooded as Sentenza, who would kill anybody if he had to. Tuco's soft side is especially brought out by his brother as we see during one scene and despite being a ruthless killer he believes in God and salvation it seems. He also mostly really only kills those who did something bad to him first, such as Eastwood's character, but also Sentenza's big henchman.Sentenza really has no mercy for anybody and he is also a schemer unlike Tuco. A really dangerous man, who still is a man of his word. When he makes a contract, he fulfills it. You could also call him talented when it comes to upping the ranks as you see when the two more central characters get caught in a funny sequence that involves a lot of dust. But like I said nobody here delivers the comedy as good as Tuco/Wallach. Even if he goes over the top, it is still hilarious to watch and never feels out of place. The best example is really the scene when he all of a sudden acts like a best friend to Blondie to find out the name of the grave where the treasure is hidden. By the way, I also liked at the very end that there was an actual treasure and not just some meaningful message à la \"the biggest treasure is friendship\" or so. There is none of that anyway. The three-men shootout shows it best. It is a matter of life and death. Honestly if the other two, especially Tuco, had been as smart as Blondie they could have guessed where the treasure really is. There must be a reason he knows the name and surely it is not that the name he mentions was a deceased friend or so. Also makes sense Blondie does not tell Tuco the real name, he is too smart for that, just like the empty name on the stone. Also pretty fitting that the treasure is in the grave of an unknown soldier in terms of the political message the movie sends. It takes place during the days of the Civil War and there is one lengthy sequence when Tuco and Blondie are led along by a captain and this is the one occasion during which the focus is not really on these two, but on the pointlesssness of war back then just like today. The bridge is the best example. They won't fight for it, but just go elsewhere and fight if it is gone. It's pretty deep and telling how the captain waits for the bridge to be destroyed and smiles before he passes. So yeah this was interesting because the sequence felt so different compared to the rest of the movie, but still it felt like an essential inclusion nonetheless.Basically I could really write a novel about every single scene here. Other people have said it correctly that each and every one of them adds a lot. Also the small characters are memorable like the fat henchman I already mentioned. Or the guy who lost a hand and wants his revenge on Tuco and probably half a dozen other characters who maybe would have deserved their own movie. But good that these three got it. Actually, in the German title there are only two characters mentioned and called something like crooks. I still prefer the three, even if Sentenza / Angel Eyes is not as much in the center as the other two. Now finally a few words on Blondie as a big Eastwood fan. He was coolness personified, but not an invincible superhero as you see from how he is tricked by Tuco during the spikes scene and even if he gets away there, Tuco gets him again, which shows you he knows how to get his revenge. During the lengthy desert scene he really suffers badly, but still most of the time he is nicely in control of it all. A really memorable character we got here, even if maybe how he is depicted with baby kittens was slightly too much. We get it he's the good guy, the only one really with morals and nonetheless as relentless and determined as the other two. That he cares at least a bit for other people is shown in the scene when he has too say goodbye to Shorty when he found another partner in crime for his bounty hunting scam. He was not as blond as I thought he was though that he deserved the nickname. I watched this movie as part of a retrospective on Ennio Morricone and it was a truly nice experience. It was not the first time I saw it and honestly it did not take away any of the quality, or almost none, that I basically knew the key plot points, even if it has been a long time since I saw it. So yeah I already mentioned Morricone, his soundtrack here is really as defining as it gets for the western genre which was also proved by the people dancing and moving in their seats in my showing every time the soundtrack was heard and so is the movie itself. No doubt most people consider this one of the five finest western movies ever made, if not the number one even. And I can see where they are coming from. Really almost everything works out about this one, also the sound side away from the music, be it the effects of running horses or gunfire you just really felt inside the movie. What did not work out was Wallach's and everybody else's glaring omission from awards bodies. Oh yeah also this is one of the westerns that has no female love interest for the protagonist(s). The woman you see in Bad's presentation for example is all you get. And that is perfectly fine and enough. I give it a big thumbs-up and it is a definite contender for best film of 1966. Highly recommended."},{"username":"claudio_carvalho","userUrl":"https://www.imdb.com/user/ur2488512","reviewLink":"https://www.imdb.com/review/rw0092820","warningSpoilers":false,"date":"16 November 2003","rate":"8","helpful":"8 out of 18 found this helpful.","title":"A Classic Western Movie With an Unforgettable Soundtrack","content":"Three bad guys \u0096 the chaser of rewards Joe (Clint Eastwood), the outlaw Tuco (Eli Wallach) and the very bad assassin Angel Eyes \u0096 become aware of a fortune of US$ 200,000.00 in golden coins, hidden in a cemetery. Only Joe knows the name of the grave, therefore there is a great dispute between the two gunmen, but always keeping Joe alive. This is a really classic western movie. This movie has never been released on VHS in Brazil, and only now the distributor Fox do Brasil' released on DVD format. I am a great fan of Sergio Leone, and the first DVD I bought for my collection was 'Once Upon the Time in America'. 'The Good, the Bad and the Ugly' is great in all aspects: the story is very funny, the actors have great performances, and the soundtrack from Enio Morricone is unforgettable: it is certainly one of the most beautiful and known in the cinema history. This movie is really a great entertainment. My vote is eight.Title (Brazil): \"Três Homens em Conflito\" (\"Three Men in Conflict\")"},{"username":"bob the moo","userUrl":"https://www.imdb.com/user/ur1002035","reviewLink":"https://www.imdb.com/review/rw0092812","warningSpoilers":false,"date":"5 October 2003","rate":"","helpful":"9 out of 32 found this helpful.","title":"Stylish and entertaining but drags badly too often","content":"Two men have a partnership \u0096 one (the good) pretends to capture the other (the ugly) claiming the reward before rescuing him from his sentence. When the two have a falling out they spare each other simply because they both know part of the location of hidden confederate gold. Meanwhile a corrupt soldier is also hunting for the location of the gold or anyone who may know where it is.Routinely heralded as one of the greatest westerns ever made, I must admit to always feeling a little disappointed by this film whenever I watch it. However I always then assume that it is a classic and come back to watch it again! There is no denying that the film is very stylish and very memorable but it's main problem is in it's basic plot not being long enough to justify such a luxurious running time. This results in the film really dragging at several points \u0096 this is not a major problem but I did wonder why it could not have been edited to suit it's spaghetti style.The music and action is much imitated and well known to even those who have not yet seen the film. The closing stand-off is fantastic and the music throughout can only be described as iconic. The film does manage to cover 180 minutes well but I just had an issue with it's very wandering nature and the fact that it does drag a bit.The cast is all good. Some of the support is badly dubbed but I always found that to add to the character of the film rather than be an annoyance. Eastwood had a hard time on the set but still delivers a really good performance \u0096 the type which made his name in this type of film. Wallach has the biggest role as Ugly and is very good in an unsympathetic role. Van Cleef is a good Bad and is a cool foil for Eastwood.Overall I always enjoy this film but would draw the line at putting it as high up the top 50 list as it usually appears to be. The film is iconic in so many ways but I just don't like the way that it seems to drag at several points \u0096 it could easily benefit from losing 20 minutes."},{"username":"classicsoncall","userUrl":"https://www.imdb.com/user/ur2707735","reviewLink":"https://www.imdb.com/review/rw1733255","warningSpoilers":true,"date":"20 September 2007","rate":"8","helpful":"4 out of 9 found this helpful.","title":"\"I'll dress, I'll kill 'em, I'll be right back.\"","content":"I guess I find myself somewhat in the middle on this film, I enjoyed it to a point, but I don't get the sense that this is one of the greatest Westerns ever, and the Western is my favorite movie genre. I much prefer a good psychological Western between complex antagonists, Eastwood's own \"Unforgiven\" would be an example. This was more a straightforward tale of three desperadoes consumed by greed who attempt to outwit each other on the trail to an unknown grave containing two hundred thousand dollars in gold coin. Each though, earns their respective title credit in the story, even if Eastwood's Blondie might be the 'good' simply based on his classically rugged features.More on the plus side, it was really cool to hear the title theme music expressed in a handful of different ways throughout the story. The picture also captured the gritty realism of what the 1860's wild west was probably a lot like. You know, the more films I see of cowboys out in the desert days at a time with no access to soap and water, I start to wonder if they'll ever produce a picture that captures the fresh aroma of that experience. It's one thing to hear Tuco accused of smelling like a pig, but to actually get the full flavor of that would really be something. Then again, theater goers would never make it to the end of the picture - oh well for that idea.As for the film's length, I too side with those that feel it took a long time to get from Point A to Point B. I'm really wondering if it was necessary to bring in the Civil War battle for that bridge, but it did give rise to perhaps the most meaningful scene in the picture for me. Watching Blondie try to ease the soldier's death with his coat and a smoke was a masterful touch.You know, I could probably go so far as to put this film in the top twenty Westerns of all time, but it's position at #4 in the IMDb top rankings of ALL pictures (as I write this) is just too much of a stretch. That's probably the reason I find myself going to that page less and less, and watching movies of all types more and more."},{"username":"lee_eisenberg","userUrl":"https://www.imdb.com/user/ur4888011","reviewLink":"https://www.imdb.com/review/rw7261429","warningSpoilers":false,"date":"23 August 2021","rate":"10","helpful":"6 out of 11 found this helpful.","title":"Clint, Lee and Eli get serious","content":"The conclusion of the Dollars trilogy lets Eastwood, Van Cleef and Wallach get tough. \"Il buono, il brutto, il cattivo\" (\"The Good, the Bad and the Ugly\" in English) is more of an epic than the first two, but no less intense. Is there a way to watch the whole end sequence and not feel your heart flutter?Even if you haven't seen the movie, you've probably heard the pulse-pounding theme song. It's one of the most iconic pieces of music ever (not surprisingly, Quentin Tarantino hired Ennio Morricone to do the music for \"Django Unchained\"). It matches up perfectly with the setting and action. That plus the subtle performances and Sergio Leone's masterful direction make this one movie that everyone should see."},{"username":"gavin6942","userUrl":"https://www.imdb.com/user/ur1234929","reviewLink":"https://www.imdb.com/review/rw2233616","warningSpoilers":false,"date":"9 April 2010","rate":"6","helpful":"10 out of 32 found this helpful.","title":"A Good Movie, But Had Some Annoying Flaws","content":"I just want to make a quick few comments here. I know this film is highly rated and people love it. And yeah, I found it enjoyable. I like a good shooter film with Clint Eastwood. But it seemed flawed and people are quick to forgive here where they don't elsewhere.The historical accuracy of the film is the biggest problem, with guns that are incorrect for the period, and the really strange suggestion that the North fought the South in this region... which, really, just didn't happen. I liked the drunk military man, but it wasn't realistic.The dubbing was annoying. Clint Eastwood speaks English and he speaks to a variety of characters who are speaking Italian. Okay, one or the other. Hire actors who speak English or get Italians and subtitle the film. It's awkward to have Eastwood talking to people who, on the set, who probably didn't understand.Lastly, I need more Lee VanCleef. If he's \"the bad\", he should have a bigger role. Instead you have mostly Eastwood, who is \"the good\", being just as bad as the villain. I respect the idea that good and evil are not clear-cut, but why do I side with Eastwood if he's no more good than VanCleef? That being said, the film had a lot going for it. Very fun shooter, great bridge explosion scene (possibly better than \"River Kwai\") and the very memorable theme song. As far as Westerns go, I don't know that it was really much more advanced than \"Stagecoach\". Maybe more epic and longer, and Eastood can out-act John Wayne any day, but there wasn't much new here.I recommend this and feel I need to see it again, but perhaps see \"For a Few Dollars More\" first... that will give you some VanCleef action and Klaus Kinski."},{"username":"jboothmillard","userUrl":"https://www.imdb.com/user/ur4248714","reviewLink":"https://www.imdb.com/review/rw1216426","warningSpoilers":true,"date":"15 November 2005","rate":"10","helpful":"4 out of 11 found this helpful.","title":"The Good, the Bad and the Ugly","content":"I had not seen the \"Spaghetti\" Western Trilogy, directed by Sergio Leone (A Fistful of Dollars, Once Upon a Time in the West, Once Upon a Time in America), for many years, and it made perfect sense to watch them again during the 90th birthday of the leading star. Basically, set during the American Civil War, a trio of bounty hunters attempt to kill fugitive Mexican bandit Tuco Ramírez, \"the Ugly\" (Eli Wallach). Tuco shoots the three bounty hunters and escapes on horseback. Elsewhere, mercenary Angel Eyes, \"the Bad\" (Lee Van Cleef) interrogates former Confederate soldier Stevens (Antonio Casas), to find out about the new name of Jackson, a fugitive who has stolen and hidden bags of gold. Steven tells Angel Eyes that Jackson is using the new name Bill Carson. Stevens offers the bounty hunter $1,000 to kill Baker (Livio Lorenzon), his employer. Angel Eyes takes the money, but kills Stevens, fulfilling his contract. He then returns to Baker, collects his fee for killing Stevens, and then, shoots Baker. Meanwhile, Tuco is rescued from three bounty hunters by a drifter, a \"Man with No Name\" to whom Tuco refers as \"Blondie\" (Clint Eastwood), who takes him to the local Sheriff (John Bartha) to collect his $2,000 bounty. As Tuco is about to be hanged, Blondie sets Tuco fre, shooting the noose. The two escape on horseback and split the bounty in a lucrative money-making scheme. They repeat the process in another town for more reward money. Blondie grows weary of Tuco's complaints and abandons him without horse or water in the desert. Tuco manages to walk to a village, and tracks Blondie down. He plans to force him to hang himself before Union forces distract him, and Blondie is able to escape. Tuco manages to recapture Blondie and forces to walk across the desert until he collapses from dehydration. As Tuco prepares to shoot him, he sees a runaway carriage. Inside are several dead Confederate soldiers and a near-death Bill Carson (Antonio Casale), who promises Tuco $200,000 in gold, buried in a grave in Sad Hill Cemetery. Tuco demands to know the name on the grave, but Carson collapses from thirst before answering. When Tuco returns with water, Carson has died, but Blondie, slumped next to him, reveals that Carson told him the name on the grave before dying. Tuco is now motivated to keep Blondie alive, he gives him water and takes him to a nearby mission to recover. After Blondie's recovery, the two leave in Confederate uniforms from Carson's carriage, but Union soldiers capture them and take them to the prisoner of war camp of Batterville. Tuco answers to the name \"Bill Carson\" during roll call, gaining the attention of Angel Eyes, disguised as a Union sergeant. Angel Eyes tortures Tuco, who reveals the name of the cemetery, but confesses that only Blondie knows the name on the grave. Knowing he will not talk if tortured, Angel Eyes offer Blondie an equal share of the gold and a partnership. Blondie agrees and rides out with Angel Eyes and his gang. Tuco is packed on a train to be executed, but escapes. Blondie, Angel Eyes, and his henchmen arrive in an evacuated town; Tuco eventually makes his way to the same town. Tuco takes a bath, during which he is surprised by one of the earlier three bounty hunters, Elam (Al Mulock), but he manages to shoot him dead. Blondie investigates the gunshots and finds Tuco, they agree to resume their old partnership. The pair kill Angel Eyes's men, but Angel Eyes himself has escaped. Tuco and Blondie travel toward Sad Hill, but their way is blocked by a battle between Union troops and the Confederates. Blondie decides to destroy the bridge to disperse the two armies and allow them access to the cemetery. As they wire the bridge with explosives, Tuco suggests they share information, in case one person dies before he can help the other. Tuco reveals the name of the cemetery, while Blondie says \"Arch Stanton\" is the name on the grave where the gold is buried. After the bridge explodes, the armies disperse. On their way, Blondie finds a dying soldier, but is unable to help him, he takes a poncho following the young man's death. Tuco steals a horse and rides to Sad Hill to claim the gold for himself, but Blondie fires a cannon, causing him to fall, and fires further to intimidate him. Tuco eventually makes it to the cemetery and runs, passing the various graves, to find the named grave marker. He finds the name Arch Stanton and begins digging, and Blondie arrives and encourages him at gunpoint to continue. Moments later, Angel Eyes surprises them both. Blondie opens Stanton's grave, revealing only a skeleton, no gold. Blondie states that he lied and offers to write the real name of the grave on a rock, placing it face-down in the courtyard of the cemetery, challenging Tuco and Angel Eyes to a three-way duel. The trio stare each other down in a Mexican standoff. Everyone draws, and Blondie shoots and kills Angel Eyes, while Tuco discovers that his own gun was unloaded by Blondie the night before. Blondie reveals that the gold is actually in the grave beside Arch Stanton's, marked \"Unknown\". Tuco digs and elated to find the six bags of gold pieces, but Blondie holds him at gunpoint. He orders him into a hangman's noose, standing balanced precariously on top of an unsteady grave marker beneath a tree. Blondie takes half the gold and rides away. As Tuco screams for mercy, Blondie returns into sight. From the distance, Blondie fires a rifle shot at the rope, dropping Tuco, alive but tied up, onto his share of the gold. Tuco curses loudly while Blondie rides off into the horizon. Eastwood as the iconic \"Man with No Name\" is cool, looking steely eyed, smoking cigars, wearing a few different costumes, ending in his iconic poncho, it is said most of his dialogue was cut to make him more mysterious, this third and final film cemented him as an international superstar. The film does have lip-sync and dubbing issues, it is admittedly long, but for Eastwood, the likeable Wallach, the Civil War battle sequence, the violence, the final showdown, and the memorable score by Ennio Morricone, this is a fantastic classic western. Clint Eastwood was number 18 on The 100 Greatest Movie Stars, and he was number 61 on The 100 Greatest Pop Culture Icons, and the film was number 46 on The 100 Greatest Films. Outstanding!"},{"username":"ccthemovieman-1","userUrl":"https://www.imdb.com/user/ur4445210","reviewLink":"https://www.imdb.com/review/rw1821688","warningSpoilers":false,"date":"17 February 2008","rate":"5","helpful":"23 out of 77 found this helpful.","title":"Just Isn't The Same Now, But Still Love The Soundtrack","content":"Usually, the more I see a film the more I learn to appreciate it. Here's the opposite: I really enjoyed this when it came it at the theater. It made such an impression that I remember where exactly I saw this film, and I enjoyed it on TV a few other times afterward. Now, 40 years later my opinion of it is not the same. The only aspect that I still have a high regard for in here in the music, now considered probably one of the \"classic\" soundtracks.However, the three main characters - the men who dominate this film - played by Clint Eastwood, Eli Wallach and Lee Van Cleef - are really nothing but overly crude and excessively violent morons. The worst, of course, is Wallach's \"Taco.\" He makes me want to take a shower after watching this film! He and Eastwood's \"Blondie\" just take turns brutalizing each other through much of the film. Van Cleef's role is considerably less, as \"Sentzenza\" or \"Angel Eyes.\"Wallach's character is just plain insulting. He is a real lowlife and a horrible witness for anyone of the Catholic faith, which is why they probably emphasize the latter with him genuflecting throughout the film while acting like a complete degenerate. It's another slam on that denomination (of which I am not a member, by the way).I usually like Director Sergio Leone's long, dramatic, slow shots and good facial closeups Leone keeps his camera so long on one subject that it gets boring. So, there is a rarely a happy medium in this movie: it's either too violently stupid or too slow. What was once \"good\" has now turned \"bad\" and \"ugly.\""},{"username":"Tweekums","userUrl":"https://www.imdb.com/user/ur13977076","reviewLink":"https://www.imdb.com/review/rw3361108","warningSpoilers":true,"date":"25 November 2015","rate":"10","helpful":"5 out of 10 found this helpful.","title":"The Good, the Bad and the Ugly","content":"This classic spaghetti western follows three men as the search for a quarter of a million dollars during the American Civil War. The first 'Angel Eyes' is a gun for hire who learns the name of the man who stole the money from one of his victims. The other two are Tuco and 'Blondie' have been working a scam where Blondie turns in Tuco for the reward money then rescues him to do it again in another town till they have a falling out. Shortly afterwards they come across a Confederate coach that just happens to contain the man Angel Eyes was looking for; he tells Tuco about the gold and the name of the cemetery where it is buried then, while Tuco is getting him water he tells Blondie the name on the grave if either of them are to get their hands on the money they will have to work together. Things don't go according to plan and they have a run in with Angel Eyes; he gets the name of the cemetery from Tuco then offers Blondie the same 50/50 deal he had with Tuco. Ultimately the three of them will be reunited in the cemetery but which of them will get the gold.This is probably the best known of the spaghetti Westerns and deservedly so. It starts with a quiet menace as we are introduced to Angel Eyes (The Bad) then shows a touch of cynical humour as we are introduced to Tuco (The Ugly) and Blondie (The Good). The plot is fairly simple but the journey for our protagonists will be anything but as the travel through the war torn American South West towards a grave in a remote cemetery. Their journey will be full of betrayals as each tries to get the information that will cut the others out of the deal. People who are used to classic American made westerns may be a little surprised that there are no heroes here; all three protagonists are venal, cynical and would happily kill the others for the cash this of course is what makes the film so refreshing! It is also quite violent for a film of its time with numerous shootings and plenty of blood.Director Sergio Leone captures the action perfectly and the cast do a fine job. Clint Eastwood brings a dry humour to the role of Blondie, Lee van Cleef is delightfully unpleasant as Angel Eyes and Eli Wallach is great as Tuco. The story has plenty of action, some amusing moments and even a few touching scenes such as when Tuco meets his brother. The Spanish scenery looks spectacular and more like the 'Wild West' than many westerns churned out in California. It is impossible to comment on this film without mentioning Ennio Morricone's score; it is brilliant throughout but there are some scenes that will have the viewer reaching for the remote to crank up the volume; not only does it sound great it also fits with the action. Overall I heartily recommend this; it is deservedly considered a classic."},{"username":"ma-cortes","userUrl":"https://www.imdb.com/user/ur3270789","reviewLink":"https://www.imdb.com/review/rw0092856","warningSpoilers":false,"date":"19 July 2004","rate":"9","helpful":"14 out of 24 found this helpful.","title":"A revolutionary and exciting Spaghetti Western","content":"This is a bemusing, violent and stylish Western, it's the best Sergio Leone . The film takes part of ¨the man without name¨ trilogy united to ¨For a fistful dollars¨, and ¨ A few dollars more¨.The movie centers about the ugly (Eli Wallach) , the bad (Lee Van Cleef) and the good (Clint Eastwood) in search for a Confederate treasure buried on a cemetery whose tracks have got the three enemies and is set during American Civil War.It's too much violent but is neither tiring, nor boring, but entertaining. The film mingles noisy action , impressive battles, shootouts, violence with strong tortures, tongue in cheek, satire and a little bit of humor.The final showdown between the three contenders is breathtaking.In spite of the fact the runtime is overlong , nevertheless isn't dull . Direction by Sergio Leone is magnificent. Ennio Morricone musical score is extraordinary , the soundtrack has been imitated and copied by thousand occasions. Morricone's iconic theme music was designed in places to mimic the sound of a howling coyote . Production design by Carlo Simi and cinematography by Tonino Delli Colli is riveting . Shot in the deserts and landscapes of Spain : Burgos and Almeria , with 1,500 Spanish soldiers as extras .Eli Wallach is very well , as he steals the show , he interprets a humorous and greedy murderous thief , Lee Van Cleef plays a villain and ominous killer and Clint Eastwood makes a dirty and wry 'man without name'.This quintaessential 'Spaguetti' originated great influence of wide range in Western . It was such a good picture that had a great success. Followed by ¨ Once upon a time in West¨and ¨Duck you sucker¨.Rating: very nice, above average 8'5/10"},{"username":"paul_haakonsen","userUrl":"https://www.imdb.com/user/ur22654354","reviewLink":"https://www.imdb.com/review/rw7883986","warningSpoilers":false,"date":"20 February 2022","rate":"8","helpful":"0 out of 1 found this helpful.","title":"Very entertaining Western...","content":"Oddly enough I have only seen the 1966 classic spaghetti Western movie \"The Good, The Bad and the Ugly\" (aka \"Il buono, il brutto, il cattivo\") once before sitting down in 2022 to watch it again. Sure, I could remember the general outlay of the movie, but I have to say that it was a blast to sit down and watch Sergio Leone's classic Western movie once again.It is easy to see why Sergio Leone's \"The Good, The Bad and the Ugly\" is a classic Western in every aspect, from the narrative storyline, the acting performances, the cast, the atmosphere, and of course the music.Now, the storyline, as written by Luciano Vincenzoni, Sergio Leone, Agenore Incrocci and Furio Scarpelli certainly is an interesting and entertaining one, as there are lots of great moments throughout the course of the 2 hours and 41 minutes that the movie run for. And I will say that I was genuinely entertained from start and up to the very end of the movie.They certainly had an intersting cast ensemble for this movie, and of course the likes of Clint Eastwood and Lee Van Cleef needs no introduction, as they are iconic actors in themselves, but I will say that Eli Wallach was actually also adding a good portion of character building to the storyline with his performance and role in the movie.As a Western movie, then \"The Good, The Bad and the Ugly\" takes the audience on a wild horseback chase, as we go through a lot of Western tropes as the movie progress. But it works out well, because the storyline is so nicely constructed and brought to life on the screen.The music in \"The Good, The Bad and the Ugly\" is iconic. And I am sure that just about everyone is familiar with the classic melody that dominates the movie.\"The Good, The Bad and the Ugly\" is Western done right, and it certainly is a movie that you should watch if you enjoy Western movies, or if you're a fan of Clint Eastwood or Lee Van Cleef. This is certainly a movie that I can warmly recommend.My rating of \"The Good, The Bad and the Ugly\" lands on a well-deserved eight out of ten stars."},{"username":"BA_Harrison","userUrl":"https://www.imdb.com/user/ur0945066","reviewLink":"https://www.imdb.com/review/rw3246730","warningSpoilers":false,"date":"28 May 2015","rate":"6","helpful":"22 out of 46 found this helpful.","title":"Leone overcooks his spaghetti.","content":"'The Good' is sharp-shooter Blondie (Clint Eastwood), although how someone who runs a bounty racket, betrays his friend, and shoots numerous people dead can be deemed good is beyond me. Bandit Tuco (Eli Wallach) is 'The Ugly', which I think is a little unfair to the bloke: he's no George Clooney, but he's not Quasimodo either. That leaves cold-hearted killer Angel Eyes (Lee Van Cleef) as 'The Bad', which he most definitely is, even going so far as to kill a child in order to achieve his goals. After Blondie and Tuco chance upon a dying Confederate soldier who reveals to them the whereabouts of a fortune in gold, the pair come to the attention of Angel Eyes, who will do anything to lay his hands on the treasure.The Good, The Bad and The Ugly, the third film in Sergio Leone's Dollars trilogy, is an epic spaghetti western that benefits from iconic central characters, an undeniable sense of cool, and, of course, that classic Ennio Morricone soundtrack (Waaawawah, waa waa waa!). Where the film doesn't fare quite so well is in the pacing and storytelling, the basic plot—three guys go in search of hidden treasure—stretched painfully thin, particularly in the Extended Cut, which clocks in at approximately three hours. The expansive historical backdrop—the American Civil War—frequently detracts from the flow of the story and Leone has a tendency to labour a little too much over his style, lingering on his characters for an eternity and repeating similar shots ad nasueum, all of which causes scenes to drag. Fortunately, some nice touches of humour and a couple of neat plot twists help to make matters a little easier to digest.6/10. Not quite as hard-going as Once Upon A Time In The West, but not a patch on the earlier Dollars movies, or indeed, Leone's underrated A Fistful of Dynamite."},{"username":"TxMike","userUrl":"https://www.imdb.com/user/ur0438066","reviewLink":"https://www.imdb.com/review/rw1922392","warningSpoilers":true,"date":"1 August 2008","rate":"","helpful":"0 out of 0 found this helpful.","title":"Fabulous 'spaghetti western' filmed in Spain.","content":"This is a long movie, at a shade over 2 hours and 40 minutes, but it needs to be long, unhurried, with lots of closeup shots and no dialog, relying on mood and expressions. In fact there is a key scene near the end that goes for 5 minutes with just 3 men standing in a triangle, looking at each other, no dialog, tension building, and it doesn't seem over long.. The 'ugly' is Eli Wallach as Tuco. He has no morals, will steal, rape, or kill on a whim, and with a smile on his face, if it suits him. He is good with a gun and has the ability to survive and come back under extreme adversity. The 'good' is Clint Eastwood as Blondie. But 'good' is relative. He and Tuco form a sort of partnership. Tuco is wanted for various crimes and the reward on his head is $2000. So Blondie turns Tuco in, and as he is strung up and about to be hanged, Blondie from a distance shoots the rope so that Tuco can get away. They split the $2000 and run their scam again in a different area.Lee Van Cleef is the menacing Angel Eyes. His motive is only money, as in a stash of gold worth $200,000. He has to track down the man who knows where the gold is buried.The story is set during the Civil War. In their strange association, Tuco and Blondie take turns turning on each other. One of those times as Tuco is forcing Blondie to march through the hot desert without water, they come upon a military wagon. All but one are dead, but the one still alive is the man Angel Eyes is looking for. He manages to tell Tuco the cemetery where the gold is buried, but when Tuco goes for some water to save the man long enough for the whole location, Blondie hears the dying man name the grave, but Blondie did not know the location of the cemetery. So the two men need each other, each with half of the information.With that the rest of the story unfolds. There is lots of gunfire and explosions, and lots of characters die. But in its essence the whole movie is a type of Western Comedy, and very enjoyable."},{"username":"Quinoa1984","userUrl":"https://www.imdb.com/user/ur0453068","reviewLink":"https://www.imdb.com/review/rw0092829","warningSpoilers":true,"date":"1 January 2004","rate":"10","helpful":"184 out of 221 found this helpful.","title":"Sergio Leone's penultimate Italian-western; a film that gets better with each passing year...","content":"...and though those last several words could also be attributed to Leone's \"Once Upon a Time\" films (West and America) as well as the other pieces in his trilogy of films with Clint Eastwood- Fistful of Dollars and For a Few More Dollars- arguably this is the most ambitious and spellbinding one of the bunch, and one that has inspired (i.e. Quentin Tarantino, Sam Raimi, Robert Rodriguez) and will most likely continue to inspire filmmakers and fans into the 21st century. There's something in The Good, the Bad, and the Ugly that's nearly (or perhaps is) mythical in it's craft, certain scenes come off as being more than relevant and exquisite for that scene/sequence- it transcends into aspects of humanity.For example, in the first part of the film (this is after the extraordinary introductions to Tuco, played by Eli Wallach, Sentenza or 'Angel Eyes', played by Lee Van Cleef, and as Blondie by a 35/36 year old Clint), Joe gets Tuco out of a hanging, which is something of a regular practice for them, but Joe decides to leave his 'buddy' out in the desert to walk the rest of the way back into town. A little later, the situation gets reversed, as Tuco has a horse and water and Joe doesn't, and they both go to cross the desert. Leone decides to not follow Tuco coming back to town as much as he follows in earnest Tuco and Joe going across that desert, as Joe starts to burn and dry up, going towards a story that will soon unfold. There is something to these scenes that I can barely describe, that they're executed in the mind-set of a Western, but in the abstract Leone lets the audience know this is a story that is bold and bigger than life.What makes much of the Good, the Bad, and the Ugly such a huge success is the trust Leone had in his own style he spun into his own after the first two westerns, his trust in his collaborators, and in his leading players as well. I, for one, had to mistakenly figure out that it is near depressing to watch this film on a regular VCR tape due to the pan & scan process. There is such a clear, distinct visual scope that Leone and camera director Tonino Delli Colli achieve that it's practically a must to get the DVD (preferably the extended version, which was Leone's original cut more or less). The editing, too, is unique in many sequences (the climax is the most noted and memorable). The score, with usual collaborator Ennio Morricone, is one of the landmark movie scores, and themes, of not just in the western genre but in all movie history. And the three main players who take on the screen have their own chops to show off: Eastwood, technically, was playing a Joe that took place before Fistful of Dollars, yet by this film had it down to a T (it's still my favorite performance from him, despite having few words and reactions); Cleef's cold, cunning Angel Eyes steals the scenes he's in; ditto for Wallach, who gets under the skin of his co-patriots as much as he sometimes does under the viewer's. If anyone really stays in the mind, at least for me, it's Wallach - especially as he gets the most 'character', and one of the very best scenes is between Tuco and his religious brother. Without that scene, the movie actually wouldn't work quite as well, surprisingly enough. Overall, The Good, the Bad and Ugly, is an entirely satisfying western, at least one of my five favorites ever made, and it's an endearing bravo to all who were involved."},{"username":"JohnHowardReid","userUrl":"https://www.imdb.com/user/ur12596887","reviewLink":"https://www.imdb.com/review/rw3600989","warningSpoilers":true,"date":"17 December 2016","rate":"8","helpful":"1 out of 2 found this helpful.","title":"Harks back to the days when Westerns were super-popular!","content":"Director Sergio Leone allows his big budget to dictate to him here. Filmed on a smaller scale and shorne of its irrelevant episodes, this movie most likely would have emerged as a compulsively fascinating and admirably taut western of classic simplicity. As if to compensate for all the film's irrelevancies, Leone often adopts a style of filming in extreme close-ups, but he tends to draw these scenes out too long to sustain suspense. Still, thanks to superb photography by Delli Colli, music by Morricone and an inspired performance by Eli Wallach – added to a plot that is basically interesting – it would have been difficult to go too far wrong."},{"username":"edwagreen","userUrl":"https://www.imdb.com/user/ur2542703","reviewLink":"https://www.imdb.com/review/rw3067460","warningSpoilers":true,"date":"12 August 2014","rate":"10","helpful":"0 out of 8 found this helpful.","title":"Good,Bad,Ugly=Great ****","content":"Magnificent character study is depicted in this 1966 memorable Sergio Leone western.With the always menacing Lee Van Cleef, the sarcastic Clint Eastwood and a totally memorable, brilliant performance by the recently departed Eli Wallach, we have much to cheer for here. The film unfolds with a backdrop of the civil war and some of the battle scenes are beautifully shown with great cinematography,how much more may one ask for?Wallach steals the acting here as a cunning, sly, vicious character who along with the Van Cleef character, see killing as nothing providing they can get their hands on the $200,000 quantity of gold. Wallach, with the look of a ferret, is most convincing here."},{"username":"michaelRokeefe","userUrl":"https://www.imdb.com/user/ur0449021","reviewLink":"https://www.imdb.com/review/rw1234583","warningSpoilers":true,"date":"9 December 2005","rate":"8","helpful":"3 out of 9 found this helpful.","title":"There is a fortune in gold to be found.","content":"THE GOOD, THE BAD AND THE UGLY is the final and finest of director Sergio Leone's 'dollar' trilogy. The good: Joe(Clint Eastwood). The bad: Sentenza or Angel Eyes(Lee Van Cleef). The ugly: Tuco(Eli Wallach). Joe, also known as Blondie, is a shiftless gunman with a touch of honor. Angel Eyes, is a hit-man who always gets his assignment done...usually in a sadistic manner. Tuco is a Mexican bandito always looking out for his own interest...without a conscience. These three are looking for Confederate gold worth $200,000. The cache is buried in a nameless grave...but who will be the first to get his hands on it? The finale proves borderline hypnotic as Tuco pathetically runs in circles through the graveyard looking for the hidden treasure. This surely ranks with the best westerns of all time. Other cast members: Claudio Scarchilli, Benito Stefanelli, Livio Lerenzon and Aldo Giuffre. Ennio Morricone's wonderful score will echo in your mind long after the final credits roll."}],"errorMessage":""}