{"imDbId":"tt0076759","title":"Star Wars","fullTitle":"Star Wars (1977)","type":"Movie","year":"1977","items":[{"username":"TheLittleSongbird","userUrl":"https://www.imdb.com/user/ur20552756","reviewLink":"https://www.imdb.com/review/rw2162174","warningSpoilers":false,"date":"22 November 2009","rate":"10","helpful":"33 out of 43 found this helpful.","title":"A milestone in film-making- a superlative sci-fi movie","content":"I couldn't have asked for anything more. Star Wars: A New Hope had it all. If I had to sum it up in one word, superlative would be my answer. I saw the film for the first time three months ago and loved it, and since then I have watched all the Star Wars movies. I was disappointed with the prequels (Attack of the Clones was my least favourite), but this, Return of the Jedi and Empire Strikes Back were perfection.I have to say that the film looks absolutely amazing even after thirty plus years, with highly imaginative sets and dazzling special effects. And the action sequences were superbly choreographed and brisk, the Death Star climax was a knockout. The music by John Williams is absolutely outstanding, by far one of his more exciting and rousing scores. The story is fast-paced, intelligent and has an essence of sophistication, and the screenplay is sharp and decisive.And the performances were flawless. In the prequels I had problems relating to some of the performers, namely Hayden Christensen as Anakin. Here, all the actors played their parts with superlative skill. Alec Guiness, one fine actor and will be sorely missed was a standout, likewise with Peter Cushing and Harrison Ford(hilarious here). Carrie Fisher was a fine Princess Leia, spunky, beautiful and sexy, and Mark Hamill was a completely likable Luke. And the villain Darth Vader, without doubt one of the best and in-depth villains in cinematic history, and James Earl Jones's deep booming voice was perfect for the character.All in all, a definite sci-fi classic, that blew me away. 10/10 Bethany Cox"},{"username":"bkoganbing","userUrl":"https://www.imdb.com/user/ur2483625","reviewLink":"https://www.imdb.com/review/rw2313319","warningSpoilers":false,"date":"20 September 2010","rate":"10","helpful":"11 out of 14 found this helpful.","title":"In A Galaxy Far Away................A Franchise Was Born","content":"The awesome special effects and the creation of creatures that are part of the vivid imagination of George Lucas are not the reason for the enduring popularity of Star Wars and the franchise it spawned. Rather it is because of the characters Lucas created that will live as long as we have cinema and the means to display it.The spectacle is behind some real, but simple people. No shadings of gray in the first Star Wars we know without any doubt who the heroes and villains are of this piece. On an isolated planet a galaxy wide dictatorship called the Empire and the revolt against come to wear young Luke Skywalker as played by Mark Hamill and his family reside. So does Alec Guinness, a reclusive and mysterious hermit. An escape pod crashes there with two androids, C3PO and R2D2 and in the latter is a message for Guinness who was at one time a Jedi Knight, fiercest of a warrior class, from Carrie Fisher playing Princess Leia. Also in R2D2 are the schematics for the Empire's ultimate weapon the satellite size death star that can deal killing out on a planetary scale. This starts an adventure with young Hamill who teams up with futuristic soldier of fortune Harrison Ford as Han Solo and his simian like sidekick Chewbacca to rescue the Princess and defeat the Death Star.Those are the good guys. The bad guys are the blackest of black villainy. Peter Cushing cold bloodedly commands the Death Star, but the mysterious Darth Vader, clad in black with a helmet completely covering his head, has mysterious powers and even his superiors are wary of him. The voice of James Earl Jones is unforgettable as the black prince of the galaxy.These are characters that bring out the kid in all of us. The ones who claim the most sophistication in their lives will cheer on for Hamill and Ford and will be fascinated by the double dyed villainy of Darth Vader.Perhaps the most interesting aspect of Star Wars and I speak now of all the films is the way such non-humans as the robots and Chewbacca the Wookie became characters. C3PO had dialog, but R2D2 had a few clicks and bleeks and all Chewbacca did was grunt, still they became as identifiable as the human characters.Star Wars set the standard for science fiction films to come for the next several generations. It was given six Oscars in a bunch of technical categories and it's got a re-release value that Gone With The Wind used to have.The Force Will Be With Us Always."},{"username":"Leofwine_draca","userUrl":"https://www.imdb.com/user/ur0482513","reviewLink":"https://www.imdb.com/review/rw3611979","warningSpoilers":true,"date":"3 January 2017","rate":"8","helpful":"3 out of 6 found this helpful.","title":"It is what it is, and who am I to disagree?","content":"Okay, so as a kid this was one of my favourite films. But as you grow up things change and on second viewing, I found this film to be surprisingly slow in places and actually comes close to outstaying its welcome towards the end. These aren't big flaws, mind you, but ones which niggle at me and make me feel as if I'm betraying a universal dream in some way. The truth is that I far prefer the second and third entries in this series, as they don't have to go through the troubles of introducing all the characters, and instead can simply continue the action at a fast speed.There are many good things about this film to make it worthwhile, though. This is one of those movies with a comic book feel to it which can appeal to adults and children alike. There's a sufficiently 'epic' nature to the film, in that a whole other universe has been created and we are merely viewing a part of what happens in it. There's plenty of action, ranging from the traditional light-saber fights to some exciting space skirmishes. The huge budget allows for many, many different special effects. Some of these look a little ropey today but they're all infinitely superior to the overblown, laughable CGI antics in THE PHANTOM MENACE, where all touch with reality was lost.The characters are likable and clear-cut; you've got heroic heroes and evil villains. Mark Hamill is fine as Luke Skywalker, although it's sad that he never achieved success in any other movies NOT in the STAR WARS series. Harrison Ford provides a clean, charismatic action man in Han Solo. Carrie Fisher is pretty and funny as Princess Leia, and Alec Guinness lends heavyweight support to the whole affair with his Obi-Wan Kenobi. The only downside to the cast are the inclusion of the robots C3P0 and R2-D2 and Chewie, who are, seen today in an adult light, pretty irritating, it has to be said. But for kids, they're funny.The villains always tend to be the best guys in these films and this is no exception. Darth Vader is THE king of cool, and I always wanted to be him when I was younger. It's strange to think how strongman Dave Prowse when from being the monster in Hammer's lame HORROR OF FRANKENSTEIN to becoming one of the biggest screen villains of all time. One also mustn't forget the contribution of Peter Cushing in what was his most popular movie; he lends gravity to the movie and is excellent as the icy commander of the Death Star, mainly through his voice alone.Although this is a long film, the action is split up across a number of different planets in order to make it more interesting. There are laser battles, lots of shooting, brief gore (an arm-lopping), and all manner of weird and wonderful rubbery alien creatures to make it enjoyable. I especially loved the scene in the garbage disposal unit which uses the old \"closing walls\" routine on our heroes to great effect. This is a deservedly famous movie which kick-started a whole new mythos, brought a legion of movie nerd fans together and harked back to the great days of the sci-fi serials of the late '30s and '40s. Not the best of the series, but pretty darned good going."},{"username":"Michael_Elliott","userUrl":"https://www.imdb.com/user/ur13134536","reviewLink":"https://www.imdb.com/review/rw3374700","warningSpoilers":false,"date":"18 December 2015","rate":"","helpful":"5 out of 7 found this helpful.","title":"Deserving of Its Reputation","content":"Star Wars (1977) **** (out of 4) Luke Skywalker (Mark Hamill) joins forces with Obi-Wan Kenobi (Alec Guinness) as they plan to go after Princess Leia (Carrie Fisher) who is being held hostage by Darth Vadar.Whether people like it or not, STAR WARS is one of those ground-breaking movies that became a massive hit and it eventually took over the world. Watching the film so many years later it really is amazing what George Lucas was able to do with this film and what would follow. I will gladly admit that I'm not a fanboy of this series and in fact this recent viewing was the first time I had seen this since it was released in its Special Edition form. With that said, even though I'm not a \"fanboy\" it's impossible to deny that power that this film contains.Storywise there's really nothing overly ground-breaking here but in my opinion that's what makes the film so darn good. There's no long-winded or drawn-out story to drag things down. The basic premise is rather simple as an up-and-coming fighter gets his opportunity to be great and sets out to do so. I think this simple story makes the characters stand out all the better because it really gives them a chance to shine and come to life. It certainly also helps that Lucas was clearly a fan of those cliffhangers from previous decades because he knows how to build up scenes and milk them for everything they're worth.It's really hard to say anything fresh or new about this film but watching this first one it's easy to see why people like Hamill and Fisher became iconic in these parts. Both are quite good in the film as are Alec Guinness and Peter Cushing, the two veterans of the picture. With that said, I think it goes without saying that it's Harrison Ford who really stands out in the role of Han Solo. His comic timing with Chewbacca has made for some of the most memorable moments of this film and he's simply delightful to watch in the role.Of course, fans will debate the tinkering that Lucas has done with the picture but I think both versions hold up extremely well. I understand the purist who want to view what they originally saw in theaters and I understand those who defend the updating of the effects. Either way, STAR WARS is a rare blockbuster that also manages to be extremely well-made and deserving of its reputation."},{"username":"SnoopyStyle","userUrl":"https://www.imdb.com/user/ur2898520","reviewLink":"https://www.imdb.com/review/rw2878091","warningSpoilers":false,"date":"29 September 2013","rate":"10","helpful":"9 out of 11 found this helpful.","title":"Not just a great movie. It's important","content":"This story happened 'A long time ago in a galaxy far, far away'. The galaxy is under the dictatorship of the emperor. Princess Leia (Carrie Fisher) is part of the rebellion but is capture by the evil Darth Vader. Luke Skywalker (Mark Hamill) the young hero, Han Solo (Harrison Ford) the brigand, his sidekick Chewbacca, and the wise master Jedi Ben Obi-Wan Kenobi (Alec Guinness) must together rescue the princess and save the galaxy.The characters are icons pulled from classic storytelling like Akira Kurosawa's \"The Hidden Fortress\". George Lucas was able to assemble such iconic characters into a well told story. Rarely is a movie change the nature of movie-making, and even the wider culture. This may be on the list of the most important movie ever. It changed the tone of movies from the gritty morally-confused 70s to the popcorn selling blockbusters that are soon to come."},{"username":"Hitchcoc","userUrl":"https://www.imdb.com/user/ur0278527","reviewLink":"https://www.imdb.com/review/rw0155937","warningSpoilers":false,"date":"16 November 2001","rate":"9","helpful":"5 out of 11 found this helpful.","title":"Maybe I Never Got It","content":"I will never forget the hoopla associated with this movie. Having seen articles in Time and Newsweek, my friend and I took off early from work and made our way to the one theater in the Minneapolis Metro area that was showing \"Star Wars\" (boy have times changed!). There were local news stations, reporters, models, everywhere. How we were able to just walk to the window and purchase tickets, I don't know, but we did. I still have my blue button with \"May the Force be With You\" emblazoned on it. I'm told it's pretty valuable. A reporter approached us and asked my friend, \"What do you expect.\" He responded in his sort of wise ass way, \"A sprawling intergalactic epic.\"That was all very interesting, but when we finally sat down and the movie began, I found it was less than I had hoped for. Part of my problem was that at that time, most of what I read was science fiction. As I watched the events unfold, I realized that this movie wasn't really science fiction--it was a Western. It was the good guy versus the bad guy and an effort to save the old ranch that the bad guys have pillaged. Take out the awesome special effects and the cool aliens and it just wasn't very interesting. I realize that most of the people that have seen this consider it just slightly below the second coming--nearly a religious experience--but it wasn't for me. I saw nothing new or complex about the character or the themes in the movie. As far as speculative science fiction it is barren. Don't get me wrong, I still think that there are amazing things to watch, but I can't get past the fact that the storm troopers can't hit the broad side of a barn with laser weapons but the good guys can pick off about a dozen from behind a post. Where did these guys get their training? How has the Empire survived so long with these incompetents. Having read \"Dune\" years before this film came out, I have to be brutally honest--how George Lucas didn't get sued for stealing from that book, I'll never know. I always wondered if he made a deal with Frank Herbert.The worlds are exotic. The aliens are wonderful (although, I thought the second and third movies were much better), especially that bar scene. But the bottom line is that it's an adventure movie. Maybe someday someone will convince me otherwise (I have had about 50 people try). If I'm going to watch a Western, I prefer the Earps and Doc Holliday."},{"username":"Kirpianuscus","userUrl":"https://www.imdb.com/user/ur61197531","reviewLink":"https://www.imdb.com/review/rw3338921","warningSpoilers":false,"date":"20 October 2015","rate":"","helpful":"1 out of 2 found this helpful.","title":"beginning of a legend","content":"first stone for a pop culture monument. not impressive. but nice and useful for its profound innocence. an old fashion Star Wars, full of secrets, naive like its heroes, mixture of Medieval stories and Sci Fi, mirror for teenager 's ambitions, dreams and fantasies, proposing interesting characters and fight scenes who seems be more than fireworks. the fight between Good and Evil. start of a legend. and beautiful slices of humor in different forms. a film who preserves the emotion and fascination of its first public. and, sure, the crazy risks for George Lukas. story of three heroes and exotic in admirable manner, it is always fresh. or, maybe, evergreen. for the small details, for the acting - Han Solo could be different? Luke Skywalker is not the best image of the boy from each from us ? and maybe, as more than piece from large puzzle, a wonderful story about courage. and about Force."},{"username":"Horst_In_Translation","userUrl":"https://www.imdb.com/user/ur3914439","reviewLink":"https://www.imdb.com/review/rw3347910","warningSpoilers":true,"date":"2 November 2015","rate":"6","helpful":"52 out of 87 found this helpful.","title":"A great movie - for its time","content":"\"Star Wars\" is a 2-hour science fiction movie from almost 30 years ago written and directed by George Lucas. There really needs nothing to be said about how good this is for a 1970s movie, especially in terms of technical aspects. The Academy certainly got it right by giving them all these Oscars for it. However, it lacks in certain other areas unfortunately. First of all, the acting isn't too great. That is not really a problem of the characters though, but rather of the way they were written, which simply offered no room for outstanding performances. And Peter Cushing's character was downright forgettable despite being the main antagonist. Instead people remember Darth Vader obviously. Why? Because this film is all about the way the characters look and not what they do or say. A bit style over substance. Apart from that, I am quite surprised Alec Guinness scored an Academy Award nomination for his turn here.The script is not the greatest achievement in general. It's the usual black-and-white characterization with good vs evil and the characters have no real shades, no facets. This was made up again by the strong work in other departments as it's not too memorable what they say and do, but what they look like, especially the non-human characters who are all somewhat considered legendary today. I am not saying the characters are written badly. Not at all. But it's just other contributions that made them what they are today. Not the script. And while I enjoyed most of the film, I cannot see it as an epic or a cult classic as so many people do to this date. \"Star Wars\" is bound to rise again with the new film coming out soon and featuring the original cast again. It should be interesting what they make out of it. Until then, feel free to watch the old films like this one, but not too many. The very first Star Wars film here is not a great achievement in terms of story, only in terms of all visual and audible aspects."},{"username":"claudio_carvalho","userUrl":"https://www.imdb.com/user/ur2488512","reviewLink":"https://www.imdb.com/review/rw3370840","warningSpoilers":false,"date":"13 December 2015","rate":"10","helpful":"11 out of 17 found this helpful.","title":"The Unforgettable Episode","content":"During the attack of the Empire's forces under the command of Darth Vader (David Prowse) to her spacecraft, the rebel Princess Leia Organa (Carrie Fisher) hides in the memory of R2-D2 the plans of the powerful Empire's Station Death Star that spies from the Rebel Alliance have stolen. She assigns the droid to deliver the plans to Obi-Wan Kenobi with a message to give the plans to the rebels. R2-D2 flees to the Planet Tatooine with his fellow C-3PO in a space pod and land on the desert, but they are captured by Jawa traders. They are sold to Owen Lars (Phil Brown) and when his nephew Luke Skywalker (Mark Hamill) is cleaning the droid, he accidentally activates part of the message and he wonders whether it would be addressed to the old Ben Kenobi. On the next morning, Luke discovers that R2-D2 is seeking out Obi-Wan Kenobi and he goes after him with C-3PO. They are attacked by the Tusken Raiders and saved by a drifter, who is Ben Obi-Wan Kenobi (Alec Guinness) that tells part of his past as Jedi to Luke. He also tells that his father was a Jedi Knight and gives a light-saber that belonged to his father to Luke. Obi-Wan invites Luke to travel with him to Alderaan and when he finds that his family was killed by the Imperial soldiers, he decides to join Obi-Wan in his quest. They head to Mos Esley to hire a skilled pilot and they team-up with the smugglers Han-Solo (Harrison Ford) and Chewbacca (Peter Mayhew). Meanwhile the evil Grand Moff Tarkin (Peter Cushing) orders to destroy the planet Alderaan to show the power of the Death Star to Leia and the rebels. Obi-Wan feels the impact in the Force and when the Millennium Falcon arrives at the destination, the group finds only debris. Further, a tractor beam pulls the spacecraft to the Death Star. What will happen to the group and Princess Leia? Will they succeed in delivering the information to the rebels?\"Star Wars\", later retitled \"Star Wars: Episode IV - A New Hope\" is the unforgettable and charming sci-fi adventure that surprised the world in 1977. The strategy of George Lucas that claimed that there was no technology available to the cinema industry in 1977 to produce the three first chapters was part of a marketing strategy that kept alive the interest of fans fro the whole six chapters, In sequence, great part of the mystery would not have raised. All the films are engaging, but none of them can beat this one rated #19 in IMDb. Harrison Ford in the top of his career and the cast show a wonderful chemistry. My vote is ten.Title (Brazil): \"Star Wars: Episódio IV – Uma Nova Esperança\" (Blu-Ray) (\"Star Wars: Episode IV – A New Hope\")"},{"username":"bob the moo","userUrl":"https://www.imdb.com/user/ur1002035","reviewLink":"https://www.imdb.com/review/rw0156151","warningSpoilers":false,"date":"30 June 2002","rate":"","helpful":"19 out of 28 found this helpful.","title":"Classic bit of fun sci-fi \u0096 a space western!","content":"The Republic has fallen and the Empire rules the galaxy as a dictatorship, seeking to destroy dissenting voices. The Empire's ultimate weapon, the Death Star, is fully on line and capable of destroying whole systems. The Jedi have been destroyed, save a few living in hiding, unable to compete with the force of the Empire. However Princess Leia has the plans showing a weakness within the Death Star. Before she is captured by Darth Vader she gives them to droids C3PO and R2D2 and they escape. When they land on a nearby planet they find Luke Skywalker and set out to find the owner of the droids Obi Wan Kenobi, or Old Ben Kenobi. Obi Wan begins to train Luke in the way of the force as they try to get the information to the Rebellion before the Death Star can be used at full power.It's not a brilliant piece of filmmaking \u0096 lets be honest, Lucas isn't the Shakespeare of our generation. However what it is, is a good story of good v's evil, a western of goodies v baddies set in space. The story is simple but contains clear characters. The thing that sets it apart is the fun \u0096 the sense of wonder for kids but also the enjoyment it brings to adult. The story is good for a sci-fi with a lot of history and back-story clearly set out up front. The action scenes are mostly great \u0096 not dry effects but with a real sense of action and excitement too.This may be the 4th part but it's also our first chapter, it is light and enjoyable but hints that this is only part of an ongoing battle. The way it relates to kids and adults is obvious as it broke records and everyone of a certain age knows about Star Wars! The effects still look good today \u0096 in many ways the model work looks better than all digital effects simply because they are `real' and don't just exist within a computer. Sound effects, comedy, music \u0096 it's all pitch perfect and sets up the rest of the series really well.Hamil is ok as Skywalker (`Blonde hair, blue eyes' \u0096 Chasing Amy!). He is suitable for a kids film and he does well with his role. However like part 1 has Anakin at his least interesting, part 4 has Luke yet to develop into darker areas. Ford is perfect as Han Solo \u0096 he adds character and flair to some dry performances. Alec Guinness adds maturity to the whole film and is so good is Obi Wan that even Ewan McGregor just does an impression rather than recreate the role. Darth Vader is just the right side of silly camp villain, Jones' voice is a perfect fit and he has real menace and power. Bits players such as Chewie, C3PO, R2D2 etc all add comedy in spades.Overall this film is even better now that we know how it all fits together in Star Wars `history'. But even without all the hype this is a really fun sci-fi that is enjoyable, simple and really good fun to watch if you're in the mood. Having a deeper perspective on it just makes it all the better."},{"username":"classicsoncall","userUrl":"https://www.imdb.com/user/ur2707735","reviewLink":"https://www.imdb.com/review/rw1669270","warningSpoilers":true,"date":"6 June 2007","rate":"10","helpful":"5 out of 5 found this helpful.","title":"\"May the Force be with you.\"","content":"I couldn't let the thirtieth anniversary season of \"Star Wars\" slip by without a commemorative viewing today to remind me of the start of this hugely successful franchise. Though it's not one of my own personal Top Ten films of all time, I can understand how so many fans come to see it that way. At the time it was a seminal film that reinvigorated the sci-fi genre; my first viewing when it debuted in theaters garnered more than a single 'Whoa' with each new scene and concept that hadn't been done before. I was particularly intrigued with the names of the characters George Lucas created for his heroes, sounding uniquely original and matching their physical description and characters. Could Luke Skywalker, Han Solo, or Princess Leia have been called anything else? How about Jabba the Hutt; he looks exactly how a Jabba the Hutt would look if there was a Jabba the Hutt. Makes sense, doesn't it? I get a kick out of the nay sayers on this board who have such a fierce guttural reaction to the success of the entire Star Wars franchise, never missing an opportunity to thrash it unmercifully. The best response to that I guess would be that they represent a mere six and a half per cent minority of the IMDb voting history for this film that give it less than a 6.0 rating. It reminds me of that joke about the one in three people who might be crazy, and your two best friends seem alright. Something to think about.Anyway, there's no point in detailing the film since virtually every one on the planet has probably seen it at least once, even my wife. My son, who was born in 1977, has probably seen it thirty times a year every year since he started watching movies, kind of a record in itself I would think, allowing him to quote virtually every line of dialog from the movie. Such is the compelling nature of true Star Wars fans, who while watching, find themselves in a galaxy far, far away."},{"username":"lee_eisenberg","userUrl":"https://www.imdb.com/user/ur4888011","reviewLink":"https://www.imdb.com/review/rw1180654","warningSpoilers":false,"date":"26 September 2005","rate":"10","helpful":"4 out of 8 found this helpful.","title":"What more to say? I guess, may the force be with it, always.","content":"Well, everyone knows \"Star Wars\": a long, long time ago, in a galaxy far, far away, Luke Skywalker (Mark Hamill), Princess Leia (Carrie Fisher) and Han Solo (Harrison Ford) battle Darth Vader's evil forces. Obviously, this is probably one of the top five most famous movies of all time, and it has truly withstood the test of time. It doesn't suffice to call \"Star Wars\" a sci-fi, a fantasy, or anything really; it is everything that a movie could be. Looking back on it, we notice that it was actually pretty low tech (which is part of why \"Episode 1\" was so bad).Well anyway, the point is that George Lucas created the ultimate masterpiece here. This movie will live on forever."},{"username":"jboothmillard","userUrl":"https://www.imdb.com/user/ur4248714","reviewLink":"https://www.imdb.com/review/rw1032830","warningSpoilers":true,"date":"4 March 2005","rate":"10","helpful":"4 out of 9 found this helpful.","title":"Star Wars: Episode IV - A New Hope","content":"This is where it all started, the original trilogy and saga of science-fiction epic adventures, from Oscar and Golden Globe nominated writer/director/creator George Lucas. \"A long time ago, in a galaxy far, far away\" the universe in ruled in fear by the Empire, and a new threat has been completed, the Death Star battle station. The rebels however have managed to capture the plans for the station, and Senator Princess Leia Organa (introducing Carrie Fisher) places them into the memory of droid R2-D2 (Kenny Baker). R2 with companion droid C-3PO (Anthony Daniels) escape the ship and land the desert world Tatooine, the Princess meanwhile is held captive by the Emperor's trusted servant Darth Vader (acted by David Prowse, voiced by James Earl Jones) and battle station leader Grand Moff Tarkin (Peter Cushing). R2 and 3PO meanwhile eventually end up with farm boy Luke Skywalker (introducing Mark Hamill) who lives on the planet with his Aunt and Uncle. While cleaning R2, he comes across the message from the Princess, mentioning Obi-Won Kenobi (Oscar and Golden Globe nominated Sir Alec Guinness), an former Jedi Knight who they find in the desert. After his relatives are killed, Luke wants to learn the ways of the Force and become a Jedi. They contract pilots of the Millennium Falcon, Han Solo (introducing Harrison Ford) and Wookie Chewbacca (Peter Mayhew) to take them across the galaxy at light speeds. They travel to what was the Princess's planet, Alderaan, but they are pulled in by tracker beam by what destroyed it, the Death Star. After avoiding the stormtroopers, and rescuing the Princess, they eventually escape after removing the beam, but Obi-Won was killed (and became one with the Force) after being killed by his former pupil, Vader. The concluding scenes are the craft and laser battles with the Rebels and the Empire, Darth Vader escapes (giving way to the sequel), and Luke eventually blows up the Death Star (with a great explosion), and the heroes are rewarded, a happy ending. It won the Oscars for Best Art Direction-Set Decoration, Best Costume Design, Best Visual Effects, Best Film Editing, Best Music for John Williams and Best Sound, and it was nominated for Best Picture, Best Writing, Screenplay Written Directly for the Screen and a Special Achievement Award (for creation of alien, creature and robot voices), it won the BAFTAs for the Anthony Asquith Award for Film Music and Best Sound, and it was nominated for Best Costume Design, Best Film Editing, Best Production Design/Art Direction and Best Film, and it won the Golden Globe for Best Original Score, and it was nominated for Best Motion Picture - Drama. Harrison Ford was number 5 on The 100 Greatest Movie Stars, Sir Alec Guinness was number 12 on The 50 Greatest British Actors, he was number 2 on Britain's Finest Actors, and he was number 11 on The World's Greatest Actor, Obi-Wan Kenobi was number 37, and Han Solo number 14 (Heroes), and Darth Vader number 3 (Villain) on 100 Years, 100 Heroes & Villains, Star Wars was number 24 on The 100 Pop Culture Icons, the film was number 1 on 100 Years of Film Scores, it was number 8 on 100 Years, 100 Quotes (\"May the Force be with you.\"), it was number 91 on The 100 Greatest Scary Moments (Darth Vader), it was number 27 on 100 Years, 100 Thrills, it was number 9 on The 100 Greatest Family Films, it was number 4 on The Ultimate Film, it was number 39 on 100 Years, 100 Cheers, it was number 15 on 100 Years, 100 Movies, and along with Episode V: The Empire Strikes Back, both were number 1 on The 100 Greatest Films. Outstanding!"},{"username":"ccthemovieman-1","userUrl":"https://www.imdb.com/user/ur4445210","reviewLink":"https://www.imdb.com/review/rw1389975","warningSpoilers":false,"date":"10 June 2006","rate":"7","helpful":"24 out of 45 found this helpful.","title":"Primitive-Looking By Now, But A 'Must\" To Set Up The Series","content":"After seeing all six episodes of the Star Wars saga several times apiece, I still think this initial entry is interesting but one of weaker ones in the series. Perhaps that's because by now, the special-effects look primitive but also because it's a little slow in parts, slower than the other five films. Sometimes, though, it's nice to have more lulls as these modern-day action films many times overdo the violence. This one, however, is just a bit too slow overall.The first hour of this film sets up the second hour plus the two sequels that followed in the 1980s, showing how the principal characters were united, who they are fighting against and what mystical powers they have at their disposal. Note: it was even interesting to watch this film decades later after the final installment, episode 3, was viewed. It made this first entry make a little more sense, knowing the complete story (who was related to whom, how some died, etc.). It was also a shock to go back and see the special-effects in here after viewing those final three films issued in recent years.I always got annoyed, to be honest, at two things in this initial Star Wars film I felt were overdone: the \"Rambo\" mentality in which hundreds of shots are fired at the good guys and never hit them and the constant arguing between Carrie Fisher (\"Princess Leia\") and Harrison Ford (\"Han Solo\"). By the third film, thankfully, that bickering stopped and everyone was \"on the same page.\"Despite how old this film is, it's a \"must\" for this collection since it sets up so much of what is to follow. It's also kind of fun to look at this again and see how young everyone looks!"},{"username":"Tweekums","userUrl":"https://www.imdb.com/user/ur13977076","reviewLink":"https://www.imdb.com/review/rw1956581","warningSpoilers":true,"date":"6 October 2008","rate":"9","helpful":"9 out of 10 found this helpful.","title":"A long time ago in a decade without CGI...","content":"When I first watched this in the cinema I was ten, it was 1977 and I'd never seen anything like it. It had me gripped from the start when a small spacecraft flew past being fired upon by another much larger one that was so big that it seemed to take ages to pass over the viewer. Unlike the recent prequels scenes such as this weren't cluttered with excessive CGI activity but instead showed what was needed in a way that hadn't been seen before. The special effects used throughout the film were ground-breaking for the time and still look great to this day, there is something more real looking about the models used when compared to today's CGI.The main character are all interesting and likable and the acting was all pretty good both from veteran actors like Alec Guinness and Peter Cushing who brought a suitable gravitas to the film and from younger actors Harrison Ford, Mark Hamill and Carrie Fisher who brought a sense of youthful energy.In the unlikely event that somebody doesn't know what the film is about I'll give a brief synopsis; Set in a distant galaxy the forces of the evil galactic empire are hunting down the rebels who are attempting to restore the old republic. They are about to capture a rebel ship which has the stolen plans to the empires latest weapon, the Death Star, when they are hidden in a small robot (droid) by the name of R2-D2 by Princess Leah, he escapes in one of the ships escape pods along with his companion C3PO. They escape to the desert world of Tatooine where they are swiftly captured by strange creatures called Jawas who sell the pair to a farmer who gets his nephew Luke to clean them. While doing so he stumbles across a holographic message addressed to one Obi-Wan Kenobi. While Luke is off having his dinner R2-D2 escapes seeking Obi Wan.The next day Luke sets off to find him but shortly after doing so he is ambushed by Sand People who start ransacking his vehicle till they are disturbed by a robed figure who turns out to be Obi-Wan. He explains to Luke that he was once a Jedi knight and friend of his late father who had been killed by another Jedi called Darth Vader who had turned to the dark side of the force, they also see the full message that R2 is carrying which requests that Obi-Wan takes R2 to the planet Alderaan to get the plans to the rebels. While this is happening Vader who is on the ship searching for the plans dispatches troops to search for the two missing droids. By the time Luke returns home it is too late, the place is a burn out ruin and his aunt and uncle are dead. He decides that he will join Obi-Wan on his mission to Alderaan.They hire a ship, called the Millennium Falcon, from a smuggler called Han Solo who needs the money to pay off a debt and avoid the various bounty hunter who are after him. When they arrive at Alderaan they find it is no longer there, it has in fact been destroyed by the Death Star in an attempt to get Princess Leah to tell them where the rebels are based. Soon after arriving the Millennium Falcon is captured after it goes to investigate a small moon that turns out to be the Death Star. While Obi-Wan is off trying to disable the tractor beam that captured them Han and Luke discover that Princess Leah is being held in the detention area and set off to rescue her... I won't say any more as I don't want to spoil the ending.I think this is a film every body should see at least once, it might not be perfect but if it wasn't for this recent cinematic history would be quite different; it kick-started a revival in science fiction that lead to things like Battlestar Galactica, the return of Star Trek and Alien and was possibly the first \"block-buster\" film. In many ways it was more than just a film it was an event; everybody at my school was talking about it and little else, till one watched it you were completely out of the loop. The characters and there adventures in this and the other films in the franchise have become part of modern folklore.These comments were made based on the video released in the '80s... so no extra CGI and Greedo didn't even attempt to fire before Han killed him."},{"username":"ma-cortes","userUrl":"https://www.imdb.com/user/ur3270789","reviewLink":"https://www.imdb.com/review/rw7523327","warningSpoilers":false,"date":"7 November 2021","rate":"9","helpful":"1 out of 1 found this helpful.","title":"Stunning and fascinating fantasy tale in which some valiant heroes battle the Galactic Empire","content":"Riveting first entry George Lucas's Stars Wars from a fantastic trilogy proved to be one of the biggest boxoffice successes of all time . This super-colossal Sci-Fi epic , it is a real and spectaculat pantomime .And , like most pantomimes , it is a lot of fun and extremely entertaining . Concerning a young heroe named Luke, a hot-shot, cocky aircraft pilot, Han Solo, a captured princess and a mysterious Jedi Knight, Ben Obi Wan Kenobi , all of them blend together against the tyrants of the Galactic Empire . As the team attempting to save the galaxy from the Empire's World by destroying a battle station, and fighting to rescue Princess Leia kidnapped by an ominous enemy , Darth Vader . May the Force be will you!. ¨Somewhere, in space, this could all be happening right now\" .¨A long time ago in a galaxy far, far away\". It's Back ! .The Force will be with you for three weeks only. May the Force be with you. One year old today !.The plot is well known , a group of heroes join forces to combat evil forces , they are the following ones : the brave Luke Skywalker : Mark Hamill , a sly , likeable pilot : Harrison Ford, a shaggy Wookie, Chewbacca : Peter Mayhew , a Jedi Knight, Obi Wan Kenobi : Alec Guinness, and two endearing pair of droids , C3PO : Anthony Daniels and R2D2 : Kenny Baker, both of whom accompany the hero on his exploits and other rebel forces engaged in a life and death struggle, while trying to save the abducted heroine in distress , princess Leia : Carrie Fisher , from the claws of the mysterious Darth Vader : David Prowse, voice by James Earl Jones and other enemies as Grand Moff Tarkin : Peter Cushing who provides the class enough , as usual . Set a new cinematic standard for realistic but at the same time traditional special effects, including overwhelming battles , impressive monsters , groundbreaking aerial scenes galore , though subsequently several frames were digitalized by I. L. M. (Industrial , Light and Magic) , making many pre-Stars Wars flicks seem almost laughlable in retrospective.Writer/filmmaker George Lucas mixed the best of classic Science Fiction of the Fifties , pulp literature, old-fashionable cliff-hungers , comic books, Akira Kurosawa films and vintage fantasy to come up with the ultimate adventure . It displays wonderful settings, glamorous production design by John Barry, monumental art direction by Norman Reynolds and splendid set decoration by Roger Christian. As well as colorful and brilliant cinematography by Gilbert Taylor. And a vibrant and rousing musical score by the great John Williams, including the classic leitmotif . The movie's adrenaline-raising drive makes it irresistible. Being essential and indispensable watching it . Followed by \"The Empire strikes again\" by Irvin Keshner considered to be the best of the exciting trilogy and \"Return of the Jedi\" by Richard Marquand with similar artistic and technician team."},{"username":"paul_haakonsen","userUrl":"https://www.imdb.com/user/ur22654354","reviewLink":"https://www.imdb.com/review/rw3384638","warningSpoilers":false,"date":"31 December 2015","rate":"10","helpful":"5 out of 6 found this helpful.","title":"The classic...","content":"Having grown up with the \"Star Wars\" trilogy, then \"Star Wars: Episode IV - A New Hope\" is a classic in every sense of the word. This is the epic story of good vs. evil and of light vs. dark. But it is also a story of heroism, bravery and adventure. I am an fan-boy, yes, but what is there not to love about \"Star Wars\"?George Lucas really managed to piece together a timeless classic that stands its own even today. And even with effects from 1977 it was light years ahead of its time, no pun intended. And the effects stand their ground even by todays standards.There is something uniquely amazing about the atmosphere and feel of the \"Star Wars\" universe. And it doesn't require much to be swept away and carried along to a galaxy far, far away...The cast in \"Star Wars: Episode IV - A New Hope\" did a good and memorable job with their individual roles and characters. And with this movie George Lucas established some characters that instantly became well-known and well-loved.\"Star Wars: Episode IV - A New Hope\" is a movie of high space adventure with vibrant characters, creatures and spaceships. It is an enjoyable movie for the entire family, space nerds or not.If you are not already familiar with the legendary \"Star Wars: Episode IV - A New Hope\" movie, then it is more than due time to get to it."},{"username":"BA_Harrison","userUrl":"https://www.imdb.com/user/ur0945066","reviewLink":"https://www.imdb.com/review/rw1606997","warningSpoilers":false,"date":"25 February 2007","rate":"10","helpful":"10 out of 14 found this helpful.","title":"I get all choked up just thinking about it.","content":"There was no way my review of this classic slab of pulp sci-fi was ever going to be anything but glowing; as a nine year old I saw George Lucas' space opera on its original release and instantly became one of a legion of fans who spent the next twenty years worshipping at the altar of the great turkey-necked director (until The Phantom Menace shattered all of my illusions).Thirty years on, and I'm revisiting Star Wars with my two children, hoping that they will fall in love with it as much as I did, way back when all that seemed important was having a bag-full of marbles and a decent sized pile of comics to read.I'm not going to describe the plot (surely you know that!), nor am I going to go into great detail about how Lucas borrowed elements from the movies he loved to bring us his epic about a farm boy who becomes a legendary warrior; all I can say is that the film has lost none of its ability to astound and my kids sat entranced (despite not being able to follow the story without the benefit of some additional info from their sci-fi geek dad). My son (who is only three and a half ) might not understand what a 'rebellion' is, and my daughter (nearly six) may struggle with the concept of 'the force', but both got a kick from witnessing the whole Star Wars universe for the very first time.Chewbacca was an instant hit with my boy, whereas my girl identified with Leia, the gutsy princess. Both of them loved the brilliantly realised landscapes, aliens, robots and spaceships that have wowed film-fans for three decades (and who can blame them\u0097the attention to detail and sheer creativity in design, costume, and make-up is staggering).It has since become evident that old George ain't always the greatest writer or director in the world (the last three Star Wars movies are proof of that); however, when he does get it right, he works miracles (he wrote Raiders of the Lost Ark too\u0097another solid gold movie).Star Wars is perfect family entertainment that delivers amazing spectacle, unforgettable characters and enough movie magic to last a lifetime. In fact, why not do yourself a favour: get off the internet and go watch it right now (even if you have seen it hundreds of times before)."},{"username":"TxMike","userUrl":"https://www.imdb.com/user/ur0438066","reviewLink":"https://www.imdb.com/review/rw0943054","warningSpoilers":false,"date":"7 October 2004","rate":"","helpful":"3 out of 4 found this helpful.","title":"A classic when it first came out and now, still a 'classic' almost 30 years later on DVD.","content":"My five children were all under the age of 10 when Star Wars came to the theater. While there had been other Sci-Fi movies with a theme of conflict in outer space, 'Star Wars' filled our imaginations like no other movie before it. The fantastic, strange worlds were presented almost like we were there too. Aliens sitting around a tavern, enjoying drinks and speaking in all sorts of languages. Nothing before had approached the sheer size of the space ships depicted here, huge cities traveling all over the galaxy. And how about the jump to hyper speed, then disappearing from the screen as the speed exceeds light speed! And the light sabres of the Jedi Knights. The Jedi Knights, a striking parallel to the Japanese Samurai.The Star Wars movies also were responsible for jump-starting the career of Harrison Ford, and today he is probably better known for his next trilogy, as Indiana Jones. The DVDs finally came out last month, and they are near perfect, as we should expect from Lucas Films and THX. The bit rate is high, and the picture is nothing short of superb. As is the Dolby EX surround track. My wife and I watched all three of the movies on DVD this week -- Star Wars, Empire Strikes Back, and Return of the Jedi -- compliments of our local public library. It was an appropriate reminder how good these movies are, and still ahead of their time. Nothing else has been made to compare to them."},{"username":"dbdumonteil","userUrl":"https://www.imdb.com/user/ur1219578","reviewLink":"https://www.imdb.com/review/rw0155904","warningSpoilers":false,"date":"8 August 2001","rate":"6","helpful":"7 out of 18 found this helpful.","title":"Sci-fi is now kiddies' world.","content":"From \"Star Wars \" onwards,sci-fi became the most popular genre for a while.It as a return to simplicity,in spite of the huge special effects.Actually,the screenplay could have been written by a ten-year old,and the characters ,stereotyped and Manichean ,will not do any harm,will not raise intellectual dilemma.Princess Leia Organa is totally sexless and seems to come from some forgotten fairy tale.Luke is a pale shadow from a knight of the round tables without a Graal to conquer,and Han Solo is the masculine raider we've already seen in a lot of movies. Humor,like in Fredric's Brown tales?none,unless the two robots count. Mystery ,like in AC Clarke's 2001?none,unless Darth Vader 's hidden identity counts? The last quarter of the movie recalls a giant video game. After \"star wars\"(and close encounters of the third kind) ,intellectual sci-fi was over the hill;now two kinds would share the market between them:the harmless sci-fi for toddlers and brats(Star War saga,ET,the black hole)and the horrific ,brainless and witless sci-fi (Alien and sequels)\"2001\" became an ET movie and its overwhelming genius did not influence anymore,alas."},{"username":"Quinoa1984","userUrl":"https://www.imdb.com/user/ur0453068","reviewLink":"https://www.imdb.com/review/rw0155719","warningSpoilers":false,"date":"19 February 2000","rate":"10","helpful":"4 out of 6 found this helpful.","title":"A Terrific space age epic","content":"Star Wars is a film that started it all. Not only the beginning of a 6 movie saga, but many other things as well. The film takes many things as influence (Shakespeare's Hamlet, Flash Gordon serials, old voodoo stuff, and Stanley Kubrick's 2001) and it turns it into a terrific movie experience. Some scenes are not all there, but they are made up for the extraordiary space fights and great quotes \"May the Force be With You\". So, all hail to George Lucas for creating a timeless masterpiece such as this and for many other things (by the way though, even though I think this film is well done, Episode 5 is my favorite)."},{"username":"studioAT","userUrl":"https://www.imdb.com/user/ur23359813","reviewLink":"https://www.imdb.com/review/rw3353187","warningSpoilers":false,"date":"11 November 2015","rate":"4","helpful":"6 out of 15 found this helpful.","title":"The 1st/4th film in the Star Wars saga","content":"'The New Hope' is the one that started them all for Star Wars back in 1977. It is only due to the prequels that we see its real place within the whole saga.It's a decent enough film, ground-breaking at the time.If you're going from prequels to this one you might find the opening 30 mins a little slow, but the pace really builds after the entry of Obi Wan and never really lets up from there.I find Mark Hamill a little too meek and wooden at times but Harrison Ford more than makes up for it, stealing every scene he's in as the brilliant Han Solo. His chemistry with Carrie Fisher's Princess Leia also adds to the fun.Start at Episode 1 and work up to this smart and funny sci fi film."},{"username":"tedg","userUrl":"https://www.imdb.com/user/ur0643062","reviewLink":"https://www.imdb.com/review/rw0156183","warningSpoilers":false,"date":"29 September 2002","rate":"","helpful":"15 out of 26 found this helpful.","title":"The Evil Force","content":"I recently revisited this, and remembered first seeing it. It wasn't the first movie to be heavily hyped. But I recall it as the first one to appeal to kids as a big adventure.In a couple ways, what's come since have ruined this. Lucas himself ruined it by deciding to make all those extra ones, making up the story as he went. And of course, every month on average we now have a new special effects movie that matches the star wars franchise in visual ambition. Many of these in fact are fueled by Lucas' several companies.So its impossible to recapture that thrill. At the time, yes we knew he stole from Kurosawa, and leaned heavily on Joseph Campbell's notions of myth. But it all seemed so fresh, and Lucas himself came across as a visionary genius. And we needed that more than we needed entertainment.Remember, the US had just been through its first sleazy republican scandal and the nation as a whole was discouraged. But the world of movies was exploding. Woody Allen gave us \"Annie Hall.\" Scorcese became known. And then this. The thing that impressed us at the time was how seriously it took itself, despite how childishly goofy that intergalactic bar was. Also how powerful the sounds and images were.The mythology was so clear. We had it for decades in science fiction and fantasy novels, indeed much better. But this was the first time we had them cinematically, and cinema when it works may be the most powerful of packaged imaginations. Oh how I wish we could see it as we did then.Now we notice, for instance, how ordinary the dogfights are. These used to thrill. We don't have all the mystery that made the thing deep. Now we know who everyone is and what is going on, and it is all so much more ordinary than what we imagined at the time as possibilities.In later years, Lucas would let us down, as a person and in this saga. In fact, I think he ruined some things. But for the year of this event, he was the most celebrated singer in the choir. And by me as well.What do I mean about ruining? Things evolve. When one thing finds a niche and flourishes, it pinches off other things. When \"Birth of a Nation\" became a huge success, it froze movies as filmed plays with a larger stage instead of one of the several other directions it could have taken. Again, there was a period after talkies reinvented the medium where there was a struggle among various different directions. This you can clearly see in the period. In retrospect, it appears as if the world could have only turned out the way it did. But the trends that win aren't the best at all.So \"Star Wars\" opened up a gateway for how effects could transform cinema into something far beyond what we had before. And then it closed that gateway, so that effects now cannot show you something unfamiliar. Instead, it all has to be the familiar taken to some extreme.Yes, it was a goose at the time. But Star Wars killed the greater possibilities of science fiction. In film, at least, and because books are inherently cinematic now, in books too.Ted's Evaluation -- 3 of 3: Worth watching."},{"username":"hitchcockthelegend","userUrl":"https://www.imdb.com/user/ur16161013","reviewLink":"https://www.imdb.com/review/rw2044516","warningSpoilers":false,"date":"29 March 2009","rate":"10","helpful":"12 out of 16 found this helpful.","title":"A long time ago in a childhood not too far away...","content":"Princess Leia is captured and held hostage by the Imperial Army as it seeks to rule the Galactic Empire. An old Jedi Knight by the name of Ben \"Obi-Wan\" Kenobi may just be hers, and the rebels only hope. Teaming up with farm boy Luke Skywalker, scoundrel Captain Han Solo, and a couple of quirky droids, Kenobi sets off on a mission that could well shape the destiny of the Galaxy, and all who dwell within it.Back in 1977 I was but a wee 11 year old boy, weened on films from all genres by my movie loving parents, I had no idea that Star Wars was to have the same impact on me as Jaws had two summers previously, where yet again I found myself queueing around the block for two whole hours to see a film in a one screen theatre. My love of cinema firmly cemented, Star Wars was the start of a love affair that lasts to this very day.As the years have rolled by and my love of cinema has taken on more in-depth and serious tones, I have come to realise that Star Wars proves to be a far from flawless picture. Certainly its detractors do point to some frayed acting and call the plot structure a jazzed up good versus evil axis, while the charge of George Lucas referencing many prior pictures most assuredly stands, but really do those things matter? No they do not, because Star Wars opened up a new world of cinema, something of a portal to youngsters such as I, it got people talking and debating about the merits of model work in films (which is of an extraordinary high standard here), it nudged film makers to explore being bigger and bolder in their approach, and crucially, above all else, it got film goers hungry again, a hankering for more please if you may. Now it has to be said that all that followed 20th Century Fox's historic blockbuster didn't run with the baton, in fact most pale into comparison on impact value, but for better or worse (depending on the discerning viewers peccadilloes), Star Wars stands as a bastion of adventure laden entertainment.It is by definition one of the most successful films in history, George Lucas perhaps didn't know it at the time, but in what was to become an almost operatic anthology, he didn't just make a movie, he created a whole new world seeping with style and rich texture. Almost as amazing as the success of the series, is how it has become part of modern day pop culture, anything from religion to everyday speak has at some time or another referenced Lucas' baby. Ultimately, though, it's one single thing that made (and still does make) Star Wars so great, it's that it has the ability to lift the audience into a rousing united feel good cheer; and that is something that few films can ever lay claim too. In 1977 it was an awe inspiring event to watch in the theatre, now here in my middle age it's an event that is like hugging a dear old friend, a friend that I know will never ever let me down no matter how many times I turn to it. 10/10"},{"username":"Theo Robertson","userUrl":"https://www.imdb.com/user/ur1532177","reviewLink":"https://www.imdb.com/review/rw0156319","warningSpoilers":true,"date":"20 February 2004","rate":"7","helpful":"5 out of 19 found this helpful.","title":"Lucas Has Obviously Read Tolkien","content":"I`ve never really thought much of STAR WARS . I remember when it was released in 1977 everyone was going bannanas as to how good it was . I finally managed to see it when it was broadcast on television in 1982 and was very disappointed with what I saw , okay it was entertaining to a certain degree but I didn`t believe for one moment it deserved the hype or massive audience figures . One other thing that sprung to my mind many years later is that it`s unoriginal!!!! SPOILERS TO THIS AND LOTR !!!!I can`t help thinking that Obi Wan Kenobi has been based on Gandalf from LORD OF THE RINGS . They`re both wise old men , they both \" die \" a heroic death and both come come back as etheral beings in the trilogy and both are played in the films by Knights of the stage. However whereas Ian Mckellan gives an outstanding performance as Gandalf Alec Guinness has little impact as Obi Wan . I do not say this lightly as I rate Guinness as the greatest actor of the 20th century . In fact as one reviewer has already pointed out none of the actors give much of a performance except Harrison Ford who is the only member of the cast who went onto become a household name . Compare the performances of the cast of the LOTR trilogy who could all easily pass as Knights of the stageI`m not saying this is a bad movie - it`s not . It is entertaining and does have a sense of humour and the costume design is excellent especially the stormtrooper uniforms but what I`m saying is it`s not a great one either and certainly doesn`t deserve to be in the IMDB top ten movies . And as a footnote is it just coincidence that Christopher Lee was cast in ATTACK OF THE CLONES after appearing in LORD OF THE RINGS ?"}],"errorMessage":""}