{"imDbId":"tt0110912","title":"Pulp Fiction","fullTitle":"Pulp Fiction (1994)","type":"Movie","year":"1994","items":[{"username":"MartinHafer","userUrl":"https://www.imdb.com/user/ur2467618","reviewLink":"https://www.imdb.com/review/rw2220181","warningSpoilers":false,"date":"13 March 2010","rate":"10","helpful":"27 out of 57 found this helpful.","title":"Brilliantly constructed.","content":"\"Pulp Fiction\" is a brilliantly crafted film. The many separate vignettes all are quite compelling and fit together wonderfully. And, on top of that, the script and acting are exceptional. And, most importantly, the film is wildly original and very, very stylish. The only reservations I have are minor. First, while this is a very, very good film, I can't see why it is ranked #5 all-time on IMDb. This seems wildly overrated and too often more recent films seem to dominated IMDb's Top 250. Second, this film is certainly NOT for everyone, as in spots it is tremendously violent (like any Tarantino film) and should not be viewed by kids or the overly sensitive.Because there are so many reviews for the film already, I won't bother to try to give a synopsis of the film or do an in-depth analysis."},{"username":"TheLittleSongbird","userUrl":"https://www.imdb.com/user/ur20552756","reviewLink":"https://www.imdb.com/review/rw2350396","warningSpoilers":false,"date":"9 December 2010","rate":"10","helpful":"17 out of 37 found this helpful.","title":"One of the best films of the 90s","content":"What can I say? This film is amazing, and I would go further and say it is my favourite Quentin Tarantino film, and one of my favourites of the 90s. The cinematography and scenery are spellbinding, and the soundtrack is brilliant, one of the best soundtracks in a Tarantino film actually. The plot is every bit as compelling as that for Reservoir Dogs, while the dialogue is endlessly quotable and quite hard-boiled. The direction is superb, as are the performances. As excellent as Uma Thurman, Bruce Willis and Christopher Walken are, the film's best actors are John Travolta and Samuel L.Jackson who are unforgettable. Pulp Fiction also has a wealth of characters and crossplots that is really quite astonishing. All in all, brilliant. 10/10 Bethany Cox"},{"username":"Leofwine_draca","userUrl":"https://www.imdb.com/user/ur0482513","reviewLink":"https://www.imdb.com/review/rw3564284","warningSpoilers":true,"date":"18 October 2016","rate":"9","helpful":"6 out of 11 found this helpful.","title":"Worth the hype","content":"Quentin Tarantino's gallery of grotesques is definitely a strange film to watch. Breaking many of the modern rules of a film - there are four interlocking stories instead of one, the subject matters tackled are extremely adult and may not be to everybody's taste - it's a wonder that the film succeeds, but in the end PULP FICTION has to be one of the best films of the 1990s. As much as we would like to ignore it, this is what the world is like today, full of drugs, violence and hostility, and it's about time a film faced up to the real world. PULP FICTION does just this.I liked three of the stories, but the one involving Travolta and Thurman left me cold I'm afraid. For a start, it's far too long and needlessly talky (about nothing in particular), and could have been cut down a lot. It seems to take ages to get to the actual horror of the piece (Thurman's drug overdose and subsequent heart injection), and when that moment comes, it's over extremely quickly. There is no particularly memorable dialogue here, either.The surrounding story, where the couple hold up a restaurant, is perfectly set up, and the final moments, where Jackson holds up the robbers himself, does show some of Tarantino's genius as Jackson quietly discusses the situation with his would-be robbers in a matter-of-fact way. The story of Travolta and Jackson trying to clear up their 'mess' is an excellent piece of black comedy, well-timed and with a scene-stealing performance from Harvey Keitel as the Wolf. Bruce Willis' story is very good too, with some unexpected twists in the tale and some harrowing scenes.There's a catchy jukebox score and an ensemble cast to liven things up too. The cast list is a reading of '90s talent: John Travolta in his comeback film; Samuel L Jackson was relatively unheard-of then; Uma Thurman proved herself as a woman to be reckoned with; Bruce Willis lent another world-weary performance to his CV, and none the worse for it; Ving Rhames also proved himself as an up-and-coming actor; Tim Roth and Amanda Plummer were cool and hysterical in equal measures; Harvey Keitel stole the show as clear-up man; Quentin Tarantino put in a twitchy cameo appearance which wasn't as nearly as bad as everybody said; Eric Stoltz was memorable as a stoned drug addict...the list is endless, really. There are other names I miss out in the interests of space.While Tarantino's rapid-fire dialogue is as sharp as ever (his decision to have the hit men talk about normal, everyday things like Quarter Pounders and Big Macs instead of \"gangster stuff\" was very clever), it is the succession of odd images which really stay in the mind, such as Travolta accidentally blowing apart someone's head; Willis and Rhames fighting, escaping into a spare-part shop and getting attacked; Thurman's adrenaline injection and the hysteria surrounding it; and finally Roth and Plummer getting the tables turned on them. All of these moments help to make PULP FICTION an endearing slice of cinema, which I'm sure will be remembered as a minor classic in years to come."},{"username":"Michael_Elliott","userUrl":"https://www.imdb.com/user/ur13134536","reviewLink":"https://www.imdb.com/review/rw2476625","warningSpoilers":false,"date":"19 August 2011","rate":"","helpful":"11 out of 23 found this helpful.","title":"Masterpiece of Characters and Dialogue","content":"Pulp Fiction (1994) **** (out of 4) Quentin Tarantino's breakthrough about the underside of the L.A. crime scene and focuses on stories involving a couple hit men (John Travolta, Samuel L. Jackson), a down and out boxer (Bruce Willis) and the big man's wife (Uma Thurman). Over the course of a matter of days their lives all get connected in this roller coaster ride of a movie. If you're looking for warmth or heart then it's best you stay away from this movie but if you want a brilliantly constructed story dealing with people who often don't get movies made about them then PULP FICTION is just for you. Yes, crime movies have always featured these type of violent men and women but no screenplay has ever gotten inside their head or tried to show what killers talk about while they're on the job. The dialogue is what really seals the deal on this film and it certainly deserved the Best Screenplay Oscar that it won. The stories are told out of order, which is always a tough way to tell a story because you can often confuse the viewer or make it so frustrating that the viewer just gives up. Tarantino's stories are so well structured that you never get confused as to what's going on and being able to see how some characters end up before we get to the actual ending, which in fact takes place earlier than the \"real\" ending works very well. There are so many classic scenes to be found in this movie but some of the highlights include a terrific dance sequence between Travolta and Thurman to a Chuck Berry classic, an adrenaline shot sequence and of course the classic Biblical quote delivered by Jackson. As great as the screenplay is it offered many people a jump to their career and this was certainly true for Travolta who really gets to shine here. When this movie was released it was considered his first great film in years and it gave that career and major boost but it's a shame he hasn't done more with it over the years. Jackson became known as that \"Bad Motherf&*&er,\" which perfectly sums up his performance. Both Thurman and Willis do a great job with their roles and the supporting players are all extremely good as well. PULP FICTION truly is a cult classic that delivers on the suspense, the laughs and it really just makes you feel as if you're looking in on a group of people who you'd normally never be in the same room with. Add the great soundtrack, the wonderful cinematography and some terrific homages to older movies and you've really got something original and special. Tarantino's influence of the crime flicks from the 70s and the Europeon crime films is so apparent yet he takes these moments and makes them his own. PULP FICTION really did change the way movies were made and it was a real eye-opener when it was first released but like most masterpieces it also keeps getting better with age."},{"username":"SnoopyStyle","userUrl":"https://www.imdb.com/user/ur2898520","reviewLink":"https://www.imdb.com/review/rw3374272","warningSpoilers":false,"date":"18 December 2015","rate":"10","helpful":"7 out of 14 found this helpful.","title":"Quentin Tarantino breaks out","content":"Ringo (Tim Roth) and Yolanda (Amanda Plummer) robs a diner. Vincent Vega (John Travolta) and Jules Winnfield (Samuel L. Jackson) are thugs working for Marsellus Wallace (Ving Rhames). They pick up a mysterious briefcase but an incident requires cleaner the Wolf (Harvey Keitel). Marsellus is paying Butch Coolidge (Bruce Willis) to throw a boxing match. Vincent is told to entertain the bosses' woman Mia (Uma Thurman).This is Quentin Tarantino's big breakout. I saw this in the theater and probably even before 'Reservoir Dogs'. I definitely saw 'True Romance' before this but I had no clue who to praise for the dialog in that movie until I put two and two together. This is a cinematic explosion. Many tried to copy his style but none exceeded him. It is super cool. It's got the time jumble that adds so much fascination to the movie. Again many films try to copy it but few succeeds like this. It has to be one of the iconic movies of the 90s."},{"username":"Hitchcoc","userUrl":"https://www.imdb.com/user/ur0278527","reviewLink":"https://www.imdb.com/review/rw2170128","warningSpoilers":false,"date":"7 December 2009","rate":"10","helpful":"14 out of 22 found this helpful.","title":"One of the Funniest Movies Ever","content":"It took fifteen years and a subscription to Netflix to finally get around to seeing this film. It was well worth the wait. If all one were to see is the byplay between Samuel L. Jackson and John Travolta, it would be worth the price of admission. But this is only part of the incredible effect this film has. I don't even like gore in movies; I avoid it. But Tarentino weaves a culture of violence where there is actual humanity. We care about these bad guys. There is scene after scene of people being pushed to the limit. The very idea that the boxer, played by Bruce Willis, would risk everything to retrieve a watch that has been transported on two occasions, shove up someone's ass, is amazing. And very, very funny. I can't begin to list all the wonderful scenes. The opening dialogue is incredible as Trovolta and Jackson are on their way to do a hit. They have virtually no respect for human life, yet they, themselves, are very human. The date scene with Uma Thurman with the adrenaline shot. The crazy's in the pawn shop. And, the effort to clean up the car after blowing away a kid in the back seat, the issue being that a guys wife would come home and be very unhappy to find a dead body and a blood filled car in the garage. It sounds horrible and makes me sound sick. I found Fargo to be a hilarious film as well. Is there something wrong with me?"},{"username":"Kirpianuscus","userUrl":"https://www.imdb.com/user/ur61197531","reviewLink":"https://www.imdb.com/review/rw4316382","warningSpoilers":false,"date":"1 September 2018","rate":"","helpful":"1 out of 3 found this helpful.","title":"memorable Tarantino","content":"It seems escaping any definition. It is pure Tarantino. Or, more precise, one of the most Tarantino films. For the reasons who determs you see again , time by time. For stories and characters and dialogues and memorable scenes. For the music and for high performances. And for the unexpecting turns. And for the illusion to be an ordinary chain of stories. For emotions. And for the manner to tell them. And, sure, for the fascinating magic. And for too many others."},{"username":"Horst_In_Translation","userUrl":"https://www.imdb.com/user/ur3914439","reviewLink":"https://www.imdb.com/review/rw5297766","warningSpoilers":true,"date":"3 December 2019","rate":"6","helpful":"6 out of 21 found this helpful.","title":"Occasionally great, overall a genuinely entertaining movie","content":"\"Pulp Fiction\" is an American film from 1994, so this one has its 25th anniversary this year and the director here is of course Mr. Quentin Tarantino, who made this film around the age of 30 and it was his 3rd filmmaking effort already, although most people have not really heard of his first work and only know Reservoir Dogs from his very early years. Anyway, this one here is the one that not only brought him a Palme d'Or, but also introoduced him to and kept him at the Oscars for years, no decades to come. Until this day, in fact. So lets take a look at what is most memorable about Pulp Fiction. I think last night was maybe the third time I watched this movie and the first time at a theater. It's a really long film at over 2.5 hours, but it does feel shorter for sure and that is almost a given as this film is still in the imdb top10 hightest-rated movies, currently at #8, but it was even top5 a few years ago I think. Anyway, by now it's been rated by 1.7 million voters. Enough said about the movie's popularity. So many have seen it.As for the film's success with awards bodies, I already mentioned something, but it also needs to be said that Tarantino won a Screenplay Oscar, Golden Globe and BAFTA for his writing and that is of course a huge trifecta achievement and he was really young back then, so truly nice that he certainly delivered in the decades afterwards. I cannot really think of one filmmaker these days around the age of 30 with such a bold unique approach to filmmaking. You can really see in almost every scene how big of a film nerd Tarantino is. And his cast here profited a lot from that too. Travolta got an Oscar nomination. He deserved it. Uma Thurman did too and I am not so sure about her. Love her in Kill Bill and recent films where she is a scene stealer with very little screen time when working with Lars von Trier, but I don't know if her performance here is really good enough for a nomination, even if I am quite fond of her in general. And then there is Samuel L. Jackson of course. Everybody who knows him (only) as Nick Fury needs to see his works with Tarantino. He is so good in here, such a memorable character, easily the best from the film. And he worked a lot with Q afterwards too. His turn in the Foxx/DiCaprio/Waltz western is also magnificent. But back to this one here: I would say basically the first scene when he and Travolta enter the apartment is when the film is at its best. Judging from this one only, I would have given 4 stars out of 5 and said it is one of my favorite films of the year, but sadly it does not stay that great when we have the Butch scenes (even if also for Willis, it is a contender for career-best) and also the long sequence with Travolta and Thurman and also the final scene at the restaurant again with SLJ.Now I would like to speak about a few very specific scenes and moments and, in general, inclusions that stayed in my mind here. First of all, the restaurant with all these waiters in costume was amazing. I totally wanna go there. Did not even recognize Buscemi as Buddy Holly, even if I knew he worked with Q in Reservoir Dogs. Another great actor. Same for Harvey Keitel, even if he is not one of my favorites like Buscemi. Still Mr. Wolf is such an icon. When SLJ's character hears Marsellus is sending the Wolf, it is so hilarious. We know immediately that dude is a respectable fella who knows exactly what he is doing. I'd be happy to have Mr. Wolf bark orders at me and he also would have deserved his own film. I think he had a little cameo in another Tarantino work. This character has aged really well, just like the film as a whole. Then the food: The Kahuna Burger even makes me as a vegetarian immediately wanna take a bite. And that milkshake at the restaurant! Totally worth it. Kinda hilarious by today's standards how five bucks is a lot of money for a milkshake back then. But boy is it worth it. Even Vincent agrees. Speaking of Vincent, there is a lot I can say about him. Not just his funny posture at the Wallace residence that has been used for many memes, but also for example how keeping stuff secret when everybody goes their own way is something that occurs twice after somewhat memorable events during which characters are in life-threatening situations. You will know what I mean when you see the scenes. But an act of courage and integrity by one character (even if it is indirectly also about saving one's own life in both scenarios) saves the other person too.As for Tarantino: He once again also acts in here just like he did in some of his movies, also the much later one with Waltz, SLJ and Leo I mentioned earlier. There his inclusion is probably even more fun than here. But I still loved how he makes fun of himself directing in this one we got here during the water splashing scene near the end when he is basically directing Keitel in-character. Hilarious moment. Coincidence is also a big factor in this film we have here. What if... can be asked on so many occasions. What if the girl (the stunning Maria de Medeiros) had not forgotten the ring? Vega would not have been killed and actually this really put major emphasis on SLJ's character's decision. Had he not retired, could he have been there too, killed Butch and saved Vega? What if Vega had not left the gun in the room? What if Butch had never run into Marsellus when driving back to his girl. What if all these bullets had not missed the two during the apartment? What if Vega had not accidentally killed the boy in the car. No Tarantino and Keitel in this film then. And they would not have ended at the restaurant where in the end the circle really closes and even if I do prefer chronological films most of the time, there is no denying the lack of chronology here works very well. For example we see Vega knowing he is going to die later on. Charming moment also between Willis and Travolta when they meet for the first time.Okay, now one aspect and recurring joke I want to talk a bit about too.: Vincent Vega's toilet breaks. Every time he takes a bathroom break, catastrophe ensues outside really. Be it Mia ODing, the guys at the restaurant launching their robbery or Butch entering the apartment making toast for himself. Or indirectly also the guy at the apartment who storms outside. Okay this is not Vega taking a toilet break, but still the bathroom is really an aspect there too. This really shows you the bizarre humor Tarantino includes in his movies all the time. Kinda symbolic how toilets are significant here. And Vega apparently also does not have the best bladder or bowel movement with hof often he goes. He even asks for a toilet break at his dealer's apartment after they reached an agreement. Hilarious stuff. There are many other scenes about which you will laugh. Like for example when we see Marsellus with heavy injuries from the accident \"walk\" towards Butch in order to kill him and he walks like a zombie basically firing left and right. Or the toast moment I just mentioned giving us a parallel on what/who is finished that very moment. Or also the anecdote told by Walken's character about the gold watch. I mean it is meaningful, even historically meaningful in a sense, but at the same time it is also a reference on a guy hiding a watch for years in his butthole. It's kinda gross humor, but never childish fart humor or something like that. There is so much creativity and even intellect to it that it is a really great achievement and I am happy Tarantino received all this awards recognition for his work here. By the way, it is also a rare occurence that he is not the only one credited with the script.Finally, still one minor scene that stayed in the head for me, namely how they say when they enter the apartment (where a familiar face from NCIS is in btw.) they should have brought bigger guns because there are many thugs inside (also referenced later when there was one more than they expected, so Q even delivered in terms of mathematics) and with how Vega actually brought a big gun for one enemy (i.e. for a big gun) to Butch's apartment, but it wasn't enough, so taking care of your gun and situation is eventually more important than what kind of firearm(s) you bring. And the (non-chronological) ending scene is also memorable not just again for Jackson (even if I prefer him laying actual gun vengeance on people), but also because it is pretty much the only scene and sequence in which nobody is injured and people leave the restaurant all safe and sound, despite all the potential violence that could have happened in this scene, which also shows again that SLJ's character has sort of found his path to God. And there is no bloodshed. This would be all for my review then. I am a bit sad the film did not stay as strong as it started, but it is still a big fun ride and I recommend checking it out to everybody, even if it is not one of my favorites from Tarantino. SLJ's portrayal alone makes it worth watching I think and if you are one of the 3 or 4 on this planet who haven't seen it yet, then totally go for it or I will lay my vengeance upon you! Thumbs up."},{"username":"claudio_carvalho","userUrl":"https://www.imdb.com/user/ur2488512","reviewLink":"https://www.imdb.com/review/rw3001869","warningSpoilers":false,"date":"20 April 2014","rate":"10","helpful":"31 out of 61 found this helpful.","title":"One of My Favorite Movies Ever","content":"The hit-men Vincent Vega (John Travolta) and Jules Winnfield (Samuel L. Jackson) work for the powerful mobster Marsellus Wallace (Ving Rhames). Vincent has lived in Amsterdam for three years and is assigned with Jules to retrieve a suitcase that belongs to their boss. There is a shootout and Vincent and Jules do not die because the shots of one gangster fails the target. Jules believes that God's hand has interfered in the bullets and he decides to redeem himself from his life of gangster. Vincent is assigned by Marsellus to go out with his wife Mia (Uma Thurman)while he is traveling and he is scared when she has an OD. Marsellus pays the boxer Butch Coolidge (Bruce Willis) to lose his fight on the fifth round, but Butch wins the fight. He flees from Marsellus and his gangsters but his girlfriend Fabienne (Maria de Medeiros) forgets to bring his golden watch that belongs to his family for many generations. Butch returns to his apartment and he faces Vincent first and Marsellus later. But an incident with sadistic perverts brings Marsellus and Butch side by side. \"Pulp Fiction\" is one of my favorite movies ever. I had seen this movie for the last time on 11 January 2002 and today I have just watched it again. When we compare the nominations for Best Picture in the 1995 Oscar (\"Pulp Fiction\", \"The Shawshank Redemption\" and the winner and weakest \"Forrest Gump\") with the movies nominated this year we can see that the Oscar winners are not necessarily the best movies of the cinema history. \"Pump Fiction\" saved the career of John Travolta that was in the ostracism and put on the spot Quentin Tarantino after the cult \"Reservoir Dogs\". The complex screenplay with four entwined story has shown to the world the brilliance of Quentin Tarantino. My vote is ten.Title (Brazil): \"Pulp Fiction – Tempo de Violência\" (\"Pulp Fiction: Time of Violence\")"},{"username":"bob the moo","userUrl":"https://www.imdb.com/user/ur1002035","reviewLink":"https://www.imdb.com/review/rw0346598","warningSpoilers":false,"date":"28 January 2004","rate":"","helpful":"18 out of 38 found this helpful.","title":"Energetic and imaginative - making up for it's lack of real heart with a great wealth of dialogue and characters","content":"Pumpkin and Honey Bunny are thieves who plan their next job whilst drinking coffee in a diner. Jules and Vincent are hitmen in the employment of top man Marsellus Wallace who must retrieve a stolen suitcase for him. Butch is a boxer near the end of his career who is ordered to take a dive by Wallace. Mia Wallace is Marsellus' wife who Vincent must show a good time while her husband is out of town. In a flurry of violence, double crosses and accidents their stories collide in their world of murder, theft and drugs.It is perhaps easier to view this film now than it was when it first came out in the cinema. At that time the TV schedules were full of interviews with Tarantino and lots of hype. While it is still considered one of the best films of the 1990's, it is easier to watch it with a fresh eye now. The best film about the film is just how striking each part of it is. The plot is well constructed in a weave of stories that all stand up well on their own but support other strands. Often films that jump around within time will be hard to follow but here Tarantino does a great job of not only avoiding this but actually using his structure to propel the film forwards to good effect.The stories are never dull and, although some are better than others, they all pretty much stand up well. The dialogue in the film could have been annoyingly inane - indeed at points I did tire of the constant pop culture references, but it mostly manages to engage and add to the characters. It is consistently witty but open to sudden moments of action or violence that are all the more shocking for their suddenness. There is a point where the film could have been better in the area of emotional involvement. Most of the violence is met with laughter or interest by the audience rather than real shock or loss; the reason for this is simply that we don't ever really care about the characters on that emotional level - they are players rather than friends. This is not a major problem as it is something that the pulp genre is happy without and in fairness Tarantino never pretends he is trying to do that.The only other problem with the film is it's glamorisation of both drugs and crime. This would be a bit of a problem if I wasn't aware of the type of film it was, but I was and I just accepted it; like the man himself said `you don't go to a Metallica gig and tell the f**kers to turn the volume down', so too you don't watch this film expecting it to be anything other than darkly funny, violent and so on.The cast are very good in their various roles; nobody plays it totally straight and they all seem aware that they aren't playing this story in the real world but in a trashy world of pulp fiction hitmen, gangsters and their molls and so on. Travolta is very good, it's easy to forget now that he had been in the wilderness before this film. He gives a good performance and manages to make his character likeable without making him pleasant. Jackson impresses more in support and he deserved to win the Oscar that alluded him (`sh*t' he was seen to mouth in place of the usual `oh well done' fake smile!). His character drive the main part of the film well and is enjoyable. Willis actually acts here and does well despite not having that much of a range to deliver across. Thurman is much better here than in Kill Bill and she brings her character to life reasonably well. Rhames is imposing in his small role and the rest of the cast includes actors such as Whaley, Arquette (times two!), Stoltz, Gallagher, Buscemi, Walken, Greene and a wonderfully enjoyable turn by Keitel. Tarantino makes a cameo himself and reminds the world why we prefer him not to act, but in fairness he is not as bad as he can be.Overall this is a great film. It may be a little soulless and cruel if you are not expecting it to be a film that lives up to it's title and is `pulp fiction' but if you know what to expect then you will enjoy it a great deal. The interweaving stories and witty dialogue all keep the film moving forward and, while not a serious or worthy film in any way, it has a great narrative to it and is exciting and enjoyable."},{"username":"classicsoncall","userUrl":"https://www.imdb.com/user/ur2707735","reviewLink":"https://www.imdb.com/review/rw2401457","warningSpoilers":true,"date":"20 March 2011","rate":"10","helpful":"1 out of 5 found this helpful.","title":"\"That was f----n' trippy\"!","content":"Quentin Tarantino may have broken the mold with \"Pulp Fiction\". Great actors in great performances, smart dialog, and an eclectic ensemble cast make this one of the rare gems in cinematic history. As a fan of non-linear story telling in movies, I found this one a unique challenge, as you get so absorbed in each of the vignettes that it's difficult to double back and figure out where the circle got broken. You'll have to watch this one more than once, and even so, it never gets boring, with mind blowing sequences like those at Jack Rabbit Slim's and Mia's hypo in the chest cure - Whoa!!! But don't take my word for it. You'll have to view the film with sufficient time set aside for liberal use of the re-wind button because it's so unlike anything you're likely to see short of another Tarantino flick."},{"username":"lee_eisenberg","userUrl":"https://www.imdb.com/user/ur4888011","reviewLink":"https://www.imdb.com/review/rw1198263","warningSpoilers":false,"date":"21 October 2005","rate":"10","helpful":"5 out of 11 found this helpful.","title":"There's nothing fictional about this movie's high quality.","content":"\"Pulp Fiction\" has partly gone down in history as the movie that revived John Travolta's career, but it's more than that. A look into the lives of several criminals, it's likely to shake up almost anyone. The first time that I ever saw the movie, my dad (who'd already seen it) sent me out of the room for the scene where Bruce Willis...well, I won't spoil it in case you haven't seen it. Also, while we were watching it, I was cracking up at the language - I can't even count how many curse words they used. This is one movie that will probably never get shown on network TV - they would probably have to cut more than half the movie (including Samuel L. Jackson's wallet).All in all, director Quentin Tarantino created a real masterpiece here. Top-notch acting (that spawned some famous lines) and a great script combined for a real treat. Uma Thurman's scene might make some people's skin crawl, but if not, then enjoy."},{"username":"gavin6942","userUrl":"https://www.imdb.com/user/ur1234929","reviewLink":"https://www.imdb.com/review/rw1895316","warningSpoilers":false,"date":"18 June 2008","rate":"9","helpful":"4 out of 8 found this helpful.","title":"Considered Tarantino's Masterpiece... Set a New Standard","content":"Quentin Tarantino presents his masterpiece: interwoven tales of a washed-up boxer, some bodyguards to powerful crime kingpin, and others who cross their path on this fateful day. Featuring an all-star cast: John Travolta in his best role (relaunching his dead career), Sam Jackson in his defining role (still trying to outdo himself fourteen years later), Christopher Walken, Uma Thurman, Bruce Willis, Ving Rhames, Steve Buscemi, Tim Roth and more. (Many of these being Tarantino regulars, who work well with his idiosyncratic style.) How do I review a film so many people have praised, including my hero Roger Ebert? I could be a detractor and say its a bad film, but I'd be lying. I love the story and how it all plays out. I still prefer Tarantino's \"Reservoir Dogs\", but this comes in a close second. (Sadly, I don't think he ever recovered after he became famous. Subsequent films -- \"Jackie Brown\", \"Kill Bill\" and \"Death Proof\" -- all have a certain charm to them, but are not close to being on the level of \"Dogs\" or \"Pulp\".) Although I've seen this movie, or at least bits of it, a dozen times, I think the most recent may be the most interesting. I watched it with a young woman who saw Bruce Willis and asked who he was. I said, \"Bruce Willis.\" She asked who that was. I listed a few of his bigger films (\"Die Hard\", \"Armageddon\", etc.) but she said she had not seen them. How a woman in her 20s does not know Bruce Willis or any of his movies is beyond me, but it got me wondering: would \"Pulp Fiction\" be a different film if I didn't recognize the majority of the actors? Walken, for example, appeals to me because he's Walken. Would his monologue be as good if delivered by someone else or by Walken when I didn't know him by name? Curious thought.If you haven't seen \"Pulp Fiction\", see it. Tarantino is a better writer than a director, but this film offers probably his best directing to date and some superb writing. He is very dialogue-intensive, which I think alienates some viewers (particularly in \"Death Proof\"), but give him a fair shake. This film defined the 1990s and continues to be influential in film today. Pay attention and you'll be sure to see why."},{"username":"jboothmillard","userUrl":"https://www.imdb.com/user/ur4248714","reviewLink":"https://www.imdb.com/review/rw1041065","warningSpoilers":true,"date":"17 March 2005","rate":"10","helpful":"2 out of 12 found this helpful.","title":"Pulp Fiction","content":"I think the title of the film relates to foreign New Wave film, and magazines, well the film starts with the definitions. Anyway, this is a brilliant crime drama from Oscar winning writer (along with Roger Avary) and Oscar, BAFTA and Golden Globe nominated director Quentin Tarantino. The story begins with what will be a continuing scene towards the end where Pumpkin (Tim Roth) and Honey Bunny (Amanda Plummer) plan the robbery of the cafeteria they are in. After the opening credits, with the song \"Jungle Boogie\" we see hit men Vincent Vega (Oscar, BAFTA and Golden Globe nominated John Travolta) and Jules Winnfield (BAFTA winning, and Oscar and Golden Globe nominated Samuel L. Jackson) on their way to see one of their boss's associate's to retrieve the stolen valuable briefcase (we never see what it is, but from the reflecting colour it looks like gold), asking questions about their boss, Marsellus Wallace (Ving Rhames), and after Jules popular bible passage recitation killing two of the double-crossers. It then skips to Butch Coolidge (Bruce Willis) who is paid to throw a boxing match, and Vincent comes in, leading to another story. Vincent is taking Marcellus's wife Mia (Oscar, BAFTA and Golden Globe nominated Uma Thurman) for the evening, in which they win a dance contest, she snorts what she thought was cocaine, but it was heroin, and she is revived with adrenalin at the house of drug dealer Lance (Eric Stoltz). It then flashes back to (what would be the opening of the film) young Butch receiving his father's watch from Capt. Koons (Christopher Walken) who tells him they both shoved it up their arses to keep it safe. Then it forwards to Butch's fight, and he did not throw it, and he escapes the city, there is a moment where Butch has to go back to his house when his girlfriend Fabienne (Maria De Medeiros) forgot his watch, and he kills Vincent who was waiting for him. Driving back though, he also encounters Marcellus himself, but before they can kill each other, they are kidnapped and tied up by two homosexuals, one is Zed (The Mask's Peter Greene). Butch manages to escape and save Marcellus from continued torture and male rape, and this is when their dept is settled, as long as Butch leaves town for good. The final flashback goes back to just after Jules has killed Lance, and another guy from the cupboard comes out shooting, but no bullets hit. After killing him, and taking Marvin (Phil LaMarr) with them, they have another problem where Vincent accidentally shoots their hostage. To help clear up the mess they go to the house of Jimmie Dimmick (Tarantino) and call for help from the guy who can \"solve problems\", Winston 'The Wolf' Wolfe (Harvey Keitel). They manage to clear up the mess, and have to wear new, dorky clothes, and going to a cafeteria everything seems fine, till Pumpkin and Honeybunny start the robbery (that you saw at the beginning), and eventually after a long chat and guns pointing Jules and Vincent stop them, before leaving, and that is the end. Phew! I would have explained it all in the chronological order, but that would be complicated for those who don't know it. Also starring Rosanna Arquette as Jody and Steve Buscemi as Buddy Holly. Tarantino's direction and script, where characters seem normal, e.g. talking about popular culture (like burgers) is brilliant, all actors are perfectly cast, and it is just an unmissable mainstream film. The memorable quotes, besides Jules's bible recitation, \"Bring out the Gimp\" and \"They call it a \"Royale with Cheese\".\" (both nominated to be in 100 Years, 100 Quotes), are \"Zed's dead baby. Zed's dead.\" and \"Oh man, I shot Marvin in the face\" - \"Why the f*** d'you do that!\" Oh. It was nominated the Oscars for Best Film Editing and Best Picture, it won the BAFTA for Best Original Screenplay, and it was nominated for Best Cinematography, Best Editing, Best Sound, the David Lean Award for Direction and Best Film, and it won the Golden Globe for Best Screenplay, and it was nominated for Best Motion Picture - Drama. Uma Thurman was number 95, Harvey Keitel number 53, John Travolta number 46, Bruce Willis number 35, and Samuel L. Jackson number 11 on The 100 Greatest Movie Stars, Travolta was number 38, and Thurman number 15 on The 100 Greatest Sex Symbols, Travolta was also number 63 on The 100 Greatest Pop Culture Icons, and he was number 46 on The World's Greatest Actor, the film was number 53 on 100 Years, 100 Thrills, the film was number 15 on Film 4's 50 Films To See Before You Die, it was number 95 on 100 Years, 100 Movies, and it was number 4 on The 100 Greatest Films. Outstanding!"},{"username":"ccthemovieman-1","userUrl":"https://www.imdb.com/user/ur4445210","reviewLink":"https://www.imdb.com/review/rw1322843","warningSpoilers":false,"date":"23 March 2006","rate":"6","helpful":"21 out of 52 found this helpful.","title":"Love-Hate: Been There/Done That","content":"From what I gather, and my own reaction, people either love this movie or hate it. Strangely, I have been on both sides of the fence with this film. I never look at it in the same light, for some reason. At first I hated it and on a second chance, really liked it. Then the same two things happened on the third and fourth viewings until I finally stopped.This is an extremely profane film laced with a lot of dark humor. I have a machine that can filter out much of the profanity and I often appreciate dark humor, but blowing a guy's brains out in the back seat of a car is funny? What am I missing?Two things I will say: the film doesn't lose me despite being two-and-a-half hours. There are no boring lulls and the dialog is fascinating in parts, mainly between John Travolta and Samuel L. Jackson. Their discussions are unique, to say the least, and one certainly remembers Uma Thurman's role and Travolta slamming a syringe into her chest. With 240 f-words and the Lord's name in vain 28 times, I miss a lot of sentences with the filter. It's still an interesting film.....in a perverse way. The other thing: yes, there is some dark comedy in here but overall this should NOT be labeled a comedy, or God help us all."},{"username":"Tweekums","userUrl":"https://www.imdb.com/user/ur13977076","reviewLink":"https://www.imdb.com/review/rw3526309","warningSpoilers":true,"date":"16 August 2016","rate":"9","helpful":"1 out of 3 found this helpful.","title":"A slice of LA gangster life","content":"This film from Quentin Tarantino tells the intertwining stories of a couple of gangsters, their boss's wife, Mia, and a boxer who is meant to throw a fight. There is little in the way of plot; we just observe their lives for a few days. The two gangsters are Vincent Vega and Jules Winnfield and they work for Marsellus Wallace; early on Vincent and Jules discuss an incident where Marsellus threw another man out of a fourth floor window for allegedly giving his wife a foot massage something that makes Vincent nervous as Marsellus has asked him to take Mia out for the night while he is out of town. The evening goes well until they get back to Mia's house and she overdoses on Vincent's heroin while he is in the bathroom. The second story follows Butch the boxer who rather than throwing a fight for Marsellus beats his opponent to death. He knows he has to get out of town but first he must return home to retrieve his watch that has been in the family for generation. This puts him in a dangerous place when he bumps into Marsellus. Finally we see events that took place earlier after Vincent accidentally shoots somebody in a car and he and Jules have to get some help from 'The Wolf'.As I said earlier this isn't about plot; that isn't to say nothing happens though quite the opposite. There is a decent amount of action; some of it sudden and shocking as well as great characters. It is these characters that the film is really about. The cast does a fine job; most notably John Travolta and Samuel L. Jackson who are on top form as Vincent and Jules; Uma Thurman is also impressive as Mia Wallace as is Ving Rhames as her husband. Bruce Willis does a fine job as Butch and Harvey Keitel puts in a memorable performance as 'The Wolf'. The non-linear way the story is told isn't confusing; I rather liked how the opening and ending scenes were concerned with the same event and chronologically took place in the middle of the story. Quentin Tarantino's dialogue is realistic but cool; I liked how the characters talked about mundane things; it made them feel far more real than if they had only talked about things relevant to the plot as characters in most films do. Overall I'd definitely recommend this film; it is gripping, full of great characters and dialogue and contains many unforgettable scenes it does however contain material that will offend many people; most notably a lot of swearing and liberal use of 'The N-Word' as well as some shocking moments."},{"username":"BA_Harrison","userUrl":"https://www.imdb.com/user/ur0945066","reviewLink":"https://www.imdb.com/review/rw2980273","warningSpoilers":false,"date":"16 March 2014","rate":"10","helpful":"1 out of 1 found this helpful.","title":"Tarantino's magnum opus.","content":"Have you read my IMDb review of Quentin Tarantino's Reservoir Dogs? The one where I say that, although the film is far from what I would class as original, the director unashamedly plundering the annals of obscure/cult/foreign cinema, the manner in which it is presented makes it a marvellous work of art in its own right?Same thing applies here. Only more-so.Pulp Fiction is an exquisite patchwork-quilt of a movie, stitched together from ideas, elements and scenes gathered together by Tarantino during his formative years as a movie-obsessed video store clerk. Assembled with an unerring eye for detail and the vision of a true artist, the film is a marvel to behold—over two and a half hours of pure cinematic brilliance which proves just as captivating for me now as when I first clapped eyes on it almost two decades ago.Bold and bloody, with stunning performances from a wonderful ensemble cast, a flawless soundtrack, witty (and highly quotable) dialogue, and even a character called Brett, this impeccable slice of gritty neo-noir is fully deserving of top marks. 10/10."},{"username":"moonspinner55","userUrl":"https://www.imdb.com/user/ur0989035","reviewLink":"https://www.imdb.com/review/rw1642286","warningSpoilers":false,"date":"22 April 2007","rate":"7","helpful":"7 out of 11 found this helpful.","title":"Kinetic and sneaky, narcotizing and primal...","content":"Quentin Tarantino co-wrote, directed and co-stars in this flamboyant, literate, byzantine drama which is structured like a dime-store novel. John Travolta and Samuel L. Jackson are Los Angeles hit-men, Uma Thurman is a gangster's girl whom Travolta is asked to entertain, Bruce Willis plays a boxer on the run after one of his fights ended in death. Critically-acclaimed picture caught fire with audiences as well, resulting in more show-biz success stories than any other film of the 1990's. Is it really that good? Yes, the verbal interplay and canny, cheeky handling is quite often exhilarating, and the performances by Travolta, Jackson and Willis (and Harvey Keitel as a low-keyed Mob kingpin) are near-perfection; however, the film's mixture of queasy, bloody violence (undermined by the jokey tone) and the barrage of foul-mouthed, low-life characters can easily become wearing. It won't be to everyone's taste, surely, but it's a visceral, gripping cinematic experience nevertheless, one with a knockout soundtrack and an Oscar-winning screenplay. *** from ****"},{"username":"TxMike","userUrl":"https://www.imdb.com/user/ur0438066","reviewLink":"https://www.imdb.com/review/rw0346080","warningSpoilers":false,"date":"15 November 2000","rate":"","helpful":"9 out of 24 found this helpful.","title":"Love it or hate it, but I give it \"5\" of 10 for style!","content":"Read the external reviews, like Ebert's or Barardinellis', if you want to know more about \"content\" of Pulp Fiction. Following is my personal take on the film.Many have praised this film for \"interweaving 3 different stories.\" Ever watch the TV series \"Northern Exposure?\" Every episode consists of 3 different, interwoven stories, and done much better than Tarentino does here. What this film does well is poke fun at the gangster movies, and does it with very witty writing. I especially liked the way these sordid characters got into various \"philosophical discussions\", like why in France a quarter-pounder cannot be called that, because of the metric system. Or why Jackson's character would not eat pork, because it is a dirty animal.To really enjoy this film, you have to numb yourself to all the filthy language and the gratuitous violence. However, it is neither an innovative film nor one with lasting meaning. That is why I rate it 5 of 10, and only that high because of the clever screenplay and direction.That reflects my own preference in movies. I give my highest ratings to such films as \"Longitude\", \"Nixon\", \"Apollo Thirteen\", \"Amistad\" - films based on great true stories. Or just entertaining but inoffensive ones like \"Raiders of the Lost Ark\" and \"The Matrix\". Or thought-provoking ones such as \"Shawshank Redemption\", \"American History X\", \"Lone Star\", or \"Good Will Hunting\".I give low ratings to such films as \"The Game\", \"The Usual Suspects\" - films which on the surface seem to dazzle, but in final analysis simply try to fool us into thinking they are something special. I don't think \"Pulp Fiction\" exactly does this, but its fans have given it high praise that I'd bet even its creator would hesitate to do."},{"username":"BandSAboutMovies","userUrl":"https://www.imdb.com/user/ur69172350","reviewLink":"https://www.imdb.com/review/rw5011887","warningSpoilers":true,"date":"22 July 2019","rate":"10","helpful":"7 out of 11 found this helpful.","title":"Still perfect","content":"There are movies and then there are forces of pop culture nature. Pulp Fiction is just such a film. While so much before influenced it, nothing after would ever be the same. In its wake, so many films tried to xerox its non-linear narrative, ultraviolence and wildly veering plot points. Pretty much not a single one of them is halfway decent by comparison.Tarantino took some scenes that Roger Avery intended for True Romance and decided that none of the film would appear in true order. For many, it was the first film they had ever watched that had monologues and conversations that were at the same time about everything and nothing all at once. While TriStar Pictures turned down the film, it became the first movie that Miramax would fully finance.Why would TriStar not want to make this film, particularly after Tarantino had become so big after Reservoir Dogs? Roger Avary said that the studio had issues with nearly every part of the movie, as they basically said, \"This is the worst thing ever written. It makes no sense. Someone's dead and then they're alive. It's too long, violent and unfilmable.\"I wonder how the person that said that felt after Pulp Fiction was voted as the winner of the Palme d'Or at the 1994 Cannes Film Festival and was nominated for seven Oscars. Obviously, this film was also a commercial success, remaking the career of John Travolta and causing people to take notice of the acting skills of Uma Thurman and Samuel Jackson.There's a moment in this film that determines whether or not you like and understand Tarantino. Before they enter Jack Rabbit Slim's, Mia Wallace (Thurman) asks if Vincent Vega (Travolta) is square and she illustrates that point with her fingers. Suddenly, the movie becomes animated and dashed lines illustrate her point and realism fades away. In this small moment, you either think that this is the dumbest thing you've ever seen, totally pretentious or completely and utterly awesome. I fall into the latter category and began cheering the moment it happened on screen.Pulp Fiction begins with a diner being held up by Ringo (Tim Roth, who was in Tarantino's Reservoir Dogs) and Yolanda (Amanda Plummer, So I Married an Axe Murderer) before we move into Jules Winnfield (Jackson) and Vega (Travolta, in a role originally intended for Michael Madsen, who had played the other Vega brother, Mr. Blonde, in Reservoir Dogs) taking a briefcase back for their boss Marcellus Wallace (Ving Rhames, Con Air), after a long discussion of what McDonald's calls their food in Europe.What's in that briefcase? All that we learn is that the lock for it is 666, but it's a MacGuffin - a term invented by English screenwriter Angus MacPhail and popularized by Alfred Hitchcock. The case was originally going to have diamonds in it, but that's kind of boring. Instead, it opens to have a strange glow. Tarantino has been very coy about what it really is, even doing an interview with his friend Robert Rodriguez where they cut out the real answer before his fellow Grindhouse director says that the knowledge of what is really in the case radically changed how he saw the film.There are plenty of theories of what's really in that case. If we extrapolate that Tarantino was influenced by Kiss Me Deadly, then it's a nuclear device. It's been compared to the trunk in Repo Man. And an internet rumor began that it's really Marcellus Wallace's soul as evidenced by the band-aid on the back of his neck which is supposedly where the Egyptians believed the soul resided.The two bring the briefcase to their boss, Marsellus, but first, he bribes Butch Coolidge (Bruce Willis) to do the job in his next match. Then, the boss goes out of town but asks Vega to show his wife a nice time. How nice of a time? After all, he threw a man out a window just for giving her a foot massage.About feet - this is the movie where Tarantino reveals his foot fetish. I'm not being rude or sly; it's 100% obvious upon watching the film.Before the date, Vega buys heroin from Lance (Eric Stoltz), who is out of balloons, so he puts it in a baggie. This will be important after the date of dinner and dancing at the aforementioned 1950's pop culture diner Jack Rabbit Slim's. Their dance scene here - taken almost move from move from Fellini's 8 1/2 scene where Barbara Steele dances with Mario Pisu - is more than just a simple physical scene. For a moment in time, it freezes reality and makes us think back to why we love Travolta the actor and not just Vincent the character that he is portraying. When we see him, we don't just see every role that he has ever played. We are fixated on the role that we first fell in love with, Tony Manero from Saturday Night Fever, bringing back fond thoughts of what it was like when to see the actor on the dance floor.Vega is obviously enamored of Mia and feels that things could feel the same with her, so he plans on simply leaving. However, she snorts the heroin - thinking it's coke - and nearly dies. It takes a needle of adrenaline right to her heart to fix things, as much as they can be fixed.While all this is going on, Butch wins the fight and kills his opponent. As he escapes in a taxi, its driver (Pittsburgh native Angela Jones, who graduated from the same college that I did, Point Park, and would go on to play the same character in the film Curdled, as well as date Slash) asks him what it's like to kill a man.Butch has told his girlfriend Fabienne (Maria de Medeiros, who was Anais Nin in Henry and June) to get everything ready to run away, but she forgot his gold watch, which we learn his father smuggled in a very uncomfortable place, along with Captain Koons (Christopher Walken), who tells him the story of the watch in a flashback. Butch must go back home, where he encounters Vega reading Modesty Blaise on the toilet. One barrage of bullets later and he's on the run, but when Marcellus Wallace crosses his path, he decides to hit him with his car.Both injured, Marcellus begins shooting at Butch, who runs into a pawnshop. Maynard (Duane Whitaker, one of the racist cops in Tales From the Hood), the owner, ends up taking both by gunpoint and ties them up in a room where his partner Zed (Peter Greene, who was in The Mask) takes Marcellus from behind while the gimp (Stephen Hibbert, who was married to Julia Sweeney at the time, who also shows up briefly as the daughter of Monster Joe; Joe was going to be played by Dick Miller, but that scene was cut) watches over Butch.Butch overpowers the man in the bondage suit and decided to go back and save his enemy, using a sword to kill Maynard while Marcellus grabs a shotgun and shoots Zed, wounding him just enough so that he can call some of his worst men to get revenge. They agree that Butch can leave, but can never come back to Los Angeles. He grabs Zed's bike, gets his girl - who really has caused so much of this mess because she acts like a child - and gets out of town.Why does Butch save the man who made his life hell? Because in Tarantino's mashup universe, protagonists live in the symbolic universe of the Japanese samurai, where honor is more important than anything. Leaving Marcellus to have his manhood further destroyed and then killed isn't the death that a warrior deserves. It's no accident that of the weapons offered, which also include a hammer, a chainsaw and a bat, he takes the sword.Back in time, as they get the briefcase, Jules and Vincent surviving an attack at Brett's apartment when a man somehow misses them every single time. They argue over whether this was a miracle or not, which leads to Vincent accidentally shooting Marvin (Phil LaMarr, the voice of Green Lantern John Stewart on the Justice League cartoons). They decide to visit Jules' friend Jimmie (Tarantino), who is stressed about his wife coming home from work. That means that the cleaner, Winston Wolfe (Harvey Keitel), must come and do his work by disposing of the evidence.That issue dealt with, the dup come back to the diner at the beginning of the film. Jules decides that he's going to retire and walk the earth like Kane from Kung Fu, which Vincent finds ridiculous. As he goes to the bathroom, the couple we met earlier start to rob the place. Vincent returns and this leads to a Mexican standoff, but Jules successfully uses his newfound love of peace to diffuse the situation and everyone leaves alive.The Bible passage that Jules quotes isn't exactly from the Good Book. It's more paraphrased and also harkens back to the lessons that Sonny Chiba would deliver before vanquishing evil in his films.Pulp Fiction got its start as a trilogy that would be written by Avery and Tarantino, but would also have a third director. It was inspired by Mario Bava's Black Sabbath, which is another portmanteau film. Tarantino's original story, Black Mask, ended up becoming Reservoir Dogs. Avery's story Pandemonium Reigns is the gold watch story within this film.There's no score to the film, but instead a pastiche of near underground American music. There's a ton of surf rock in this film, as Tarantino felt that it sounded like the themes of Italian spaghetti westerns.This is also the beginning of the incredibly self-referential universe of Tarantino films. Vincent Vega and Mr. Blonde being brothers, Red Apple cigarettes and Big Kahuna burgers show up in many of his films and Mia Wallace's TV pilot Fox Force Five is either a tease for Kill Bill or places that film as a fictionalized part of an overall narrative. For kids that grew up reading comic books or loving when TV shows crossed over, this would become an entirely new obsession. Throw in the fact that this movie references every movie that came before it and you get the reason why we're devoting an entire week to these films.Pulp Fiction is 25 years old this year. It doesn't feel that way. It achieves that rarest of movie dreams - utter timelessness."},{"username":"Quinoa1984","userUrl":"https://www.imdb.com/user/ur0453068","reviewLink":"https://www.imdb.com/review/rw0345952","warningSpoilers":false,"date":"20 January 2000","rate":"10","helpful":"376 out of 678 found this helpful.","title":"One of the Best Film's I've Seen In A LONG Time... and still is","content":"Quentin Tarantino's Pulp Fiction is a terrific film. It also gets better with each viewing, especially if one of those happens to be on a big theatrical screen where all of the BIG compositions get bigger and more detailed. How much else is there to talk about it after all these years? It's filled with dynamite, sudden and always interesting action, great and naturally clever dialogue, and memorable characters. Also, the acting is always something to behold as by turns straightforward, over the top, subtle, and just downright menacing and spot-on. The directing is one of the strongest that we've seen from Tarantino, as he makes his choices in pacing with shots in unconventional ways but never in a way that would be distracting. And writing, already noted, has been copied by many, and only equaled by a select few. The dance sequence. Samuel L. Jackson's superlative monologuing. It has loyalty among low lifes, and many other odd characters that are all bad and not one is a villain or hero. And somehow even after years of parody and terrible rip-offs, it holds its own and- as one can say after seeing it at a midnight screening- holds its audience as much as it had the countless times before they saw it (or if they are, the first time). The first time you're surprised, the second time you look for the clues or other ambiguity, and then the third time you laugh you head off. The fourth time... I'll leave to you."},{"username":"edwagreen","userUrl":"https://www.imdb.com/user/ur2542703","reviewLink":"https://www.imdb.com/review/rw3357093","warningSpoilers":true,"date":"17 November 2015","rate":"6","helpful":"2 out of 7 found this helpful.","title":"**1/2","content":"You know that the several supposed unrelated stories are going to connect and some point and connect they do as the film reaches it climax.The stories of a gangster's wife, a boxer, two hit-men and others have a way of blending in at the end that actually makes sense.This is also a story of redemption and how a perceived miracle affected our story in a way that when a young couple take place, a character such as that of Samuel L. Jackson seeks redemption by handing over the loot to Tim Roth and Amanda Plummer during their bold restaurant robbery.It is also the story of a redeeming Bruce Willis who makes it out safely only to return to rescue leader Victor Rhames, who he had been shooting it out with when the two were captured by a white supremacy group ready to inflict severe pain on Rhames for being black.An interesting premise nicely done, but the film is overly violent and you really don't know in the end if all concerned have learned their lessons."},{"username":"hitchcockthelegend","userUrl":"https://www.imdb.com/user/ur16161013","reviewLink":"https://www.imdb.com/review/rw2565432","warningSpoilers":false,"date":"13 February 2012","rate":"10","helpful":"29 out of 50 found this helpful.","title":"Ah, so by that rationale, if a pig had a better personality, he would cease to be a filthy animal. Is that true?","content":"It kind of feels redundant trying to write a review for Pulp Fiction as it approaches its 20th birthday. As a film it needs no introduction, it won the Palme d'Or at Cannes, won a BAFTA and Academy Award for Best Original Screenplay (Tarantino), and garnered a whole host of other awards and nominations. Box office beef was meaty and its reputation even now shows no sign of waning (it currently sits at number 4 on the IMDb top 100 list), it is by definition one cool MOFO of a movie, a picture loved by a cross section of demographics. But why?Pulp Fiction oozes humour, romance, violence and stylish flourishes. It remains compulsive viewing throughout; even as it threatens to get submerged in its own complex structure. Film lover Tarantino takes a number of low life and unfortunate characters from Los Angeles, mainlines then with movie clichés, and then amazingly breathes new life into them. It knowingly winks at B movies from the past yet always remains fresh on its own terms. I myself having just revisited the film after a 5 year gap can attest to just how well it holds up, laughing at the dialogue, perched on the edge of the seat as violence starts to rumble, and yes, singing along with that most catchy of soundtracks.Yet for all its flashiness and hipster chattering, there's one thing that often gets overlooked when talk of Pulp Fiction's greatness arises. That of a basic human urge to survive or find salvation, Tarantino's main characters may be bottom feeders or scummy operatives of the underworld, but there's love and needing beating slowly in its dark heart before the drugs and violence take a hold. Neat trick that from Tarantino, brilliant in fact. 10/10"},{"username":"bevo-13678","userUrl":"https://www.imdb.com/user/ur76062573","reviewLink":"https://www.imdb.com/review/rw5590710","warningSpoilers":false,"date":"30 March 2020","rate":"10","helpful":"7 out of 8 found this helpful.","title":"Shotguns","content":"I like the bit with the cheeseburger. It makes me want to go and get a cheeseburger"},{"username":"Doylenf","userUrl":"https://www.imdb.com/user/ur1048771","reviewLink":"https://www.imdb.com/review/rw1730605","warningSpoilers":false,"date":"15 September 2007","rate":"7","helpful":"1 out of 3 found this helpful.","title":"Darkly humorous tale laced with profanity and corruption...","content":"PULP FICTION is the sort of tale right up Quentin Tarantino's dark alley of a fictional mind. All of his criminals speak the profanity-laced dialog with such effortless ease that it seems perfectly natural after the first five minutes to hear the \"f\" word and the \"n\" word spoken with regularity by a very competent cast of actors. There is no such thing as political correctness in his vocabulary, so it's an audacious piece of work.Tarantino weaves the tales of several characters, not all of whom are related, until eventually the tales do dovetail together to make a common pattern out of the jumbled narrative. It's all done in brisk, good story-telling style to keep the viewer interested throughout the two-and-a-half hour running time.The dark humor is present in almost every situation you can think of involving murder and mayhem and somewhere, in all the Bible readings that SAMUEL L. JACKSON quotes, there's a message about redemption that seems to be the raison d'etre for the final scene in the diner.UMA THURMAN has delicious fun with the role of a gangster's moll who sniffs a little too much white powder in the ladies room while on a date with JOHN TRAVOLTA. The two of them get a chance to demonstrate their prowess with romantic comedy in this wonderful sequence where they go to a '50s-theme restaurant with an art deco ambiance and some '50 icons like Marilyn Monroe, Ed Sullivan and Mamie Van Doren doing their stuff while platters are served. They also indulge in a twist dance contest which, naturally, they win.It's the lightest moment in a film with plenty of dark twists and unpredictable shoot-outs that are a blend of violent gore and gales of laughter. HARVEY KEITEL has a fine time with the role of a \"cleaner-upper\" who gives instructions on how to wipe the blood off messy crime scenes. BRUCE WILLIS is excellent as a boxer who fails to lose the match and has to go on the lam to escape the wrath of a crime boss. His brutal treatment at the hands of a sadistic hardware store owner and his sick pals is one of the most lurid episodes of the many layered story. They don't call this \"pulp fiction\" for nothing!! Despite the disturbing scenes of violence, it manages to be a highly entertaining mix of crime and comedy that keeps rolling along toward a satisfying ending in the diner where the first scene involving TIM ROTH and AMANDA PLUMMER took place.Summing up: More likely to have broadest appeal for young male viewers who like their crime stories raw, real and unpredictable. Original, inventive and understandably awarded a great many honors when released."}],"errorMessage":""}