{"imDbId":"tt0102926","title":"The Silence of the Lambs","fullTitle":"The Silence of the Lambs (1991)","type":"Movie","year":"1991","items":[{"username":"MartinHafer","userUrl":"https://www.imdb.com/user/ur2467618","reviewLink":"https://www.imdb.com/review/rw2660008","warningSpoilers":false,"date":"17 August 2012","rate":"7","helpful":"20 out of 100 found this helpful.","title":"Well made but yecch.","content":"I should probably mention right up front that I am not a huge fan of thrillers and, in particular, I don't care for violent or gory films. Because of this, I have waited a very long time to finally getting around to seeing this film. The idea of a film about serial killers just doesn't appeal to me. However, there is also an obsessive part of me--the part of me that wants to see all the Best Picture Oscar winners. Apart from this film, there are maybe two others I need to complete this...until next year! And, my daughter assured me that the movie wasn't too gory. So, this film review is best appreciated by others who just aren't into gore, serial killings and cannibalism--though, oddly, a very high percentage of viewers DO like such plots.First, the bad news. I sure as heck thought it was a gory film...a very gory film. You see people with huge chunks of skin ripped off, a guy's face ripped off and lots of blood. I don't know how my daughter would think this isn't gory! Second, the not so bad news. Although I really didn't like the film very much, it was interesting and different. Anthony Hopkins did a nice job playing a psycho murder--though I also felt this performance was anything but subtle--but it was entertaining. So did the film change my mind about the genre or this film in particular? No. But, apparently I am in the minority here.UPDATE: I recently began watching the TV show, \"Hannibal\", and although I also think it's way too graphic, I much prefer Mads Mikkelson's version of Dr. Lecter. It's much, much more subtle and creepy--without the over the top theatrics of the movie version of the guy."},{"username":"TheLittleSongbird","userUrl":"https://www.imdb.com/user/ur20552756","reviewLink":"https://www.imdb.com/review/rw2458788","warningSpoilers":false,"date":"15 July 2011","rate":"10","helpful":"20 out of 30 found this helpful.","title":"Truly enthralling film and not one to forget","content":"I have seen some great movies, old or new. The Silence of the Lambs is an amazing one, while not my personal favourite of the year of 1991 it was a well deserved Best Picture win in my opinion.Jonathan Demme's direction is superb, the film is shot in a ceaselessly atmospheric manner and Demme never lets the suspense drop. The story from start to finish is enthralling, and the script is tense and thought-provoking.The Silence of the Lambs is wonderfully acted as well. Jodie Foster is the one who holds the film together and her performance here is one of her most excellent, and I mustn't forget Ted Levine who is very chillingly effective as Buffolo Bill. Anthony Hopkins however steals the film, it is his perhaps most iconic character and he proves that although he is in only a portion of the film his performance lives long in the memory.All in all, amazing. 10/10 Bethany Cox"},{"username":"bkoganbing","userUrl":"https://www.imdb.com/user/ur2483625","reviewLink":"https://www.imdb.com/review/rw1705644","warningSpoilers":false,"date":"3 August 2007","rate":"9","helpful":"9 out of 18 found this helpful.","title":"Getting A Good Consultant","content":"It seems as though there is a serial killer out there who's grabbed the daughter of a United States Senator and this guy has zoomed right to the top of FBI's Most wanted. This man's modus operandi is to keep the victims alive for a while before killing them so they're racing against time to find him. Desperate situations call for desperate measures.The desperate measure is, you want to catch a serial killer, bring in one as a consultant. That's why FBI trainee Jodie Foster goes to visit Anthony Hopkins in prison. Hopkins is not just a killer who eats his victims, he's a brilliant psychologist himself with insights maybe no one else has.Of course his price are some cheap insights into Jodie Foster's soul, thrills he probably got when he was in practice.The Silence of the Lambs in less capable hands could have just been another cheap slasher flick. Instead the leads who walked off with the Academy Awards for Best Actor and Best Actress give riveting performances of a sick twisted psycho and a woman who became the biggest feminist icon since Sigourney Weaver by confronting some demons of her own. It's the best work that Anthony Hopkins and Jodie Foster have ever done and let's not forget the Oscars won by Director Jonathan Demme and the Picture itself for being the Best in 1991.A couple of players who made their marks on television later on also score well here. Anthony Heald who was Buffy the Vampire Slayer's handler plays the psychiatrist in the institute where Hopkins is incarcerated and who Hopkins makes a fool of and says at the end he's far from done with. Also Ted Levine who is Captain Stottlemeyer on Monk plays the serial killer the FBI is trying to catch. Also look for a good performance by Brooke Smith as Levine's potential victim.The Silence of the Lambs with its taut direction and riveting performances has an appeal far beyond the horror genre. See it and you'll know what I mean."},{"username":"Leofwine_draca","userUrl":"https://www.imdb.com/user/ur0482513","reviewLink":"https://www.imdb.com/review/rw3013712","warningSpoilers":false,"date":"11 May 2014","rate":"10","helpful":"13 out of 27 found this helpful.","title":"The granddaddy of all serial killer flicks","content":"THE SILENCE OF THE LAMBS is, quite simply, a breathtaking movie. It's the granddaddy of all serial killer flicks, a film that even the almost-as-good SE7EN can only aspire to, a movie that gets into the mind and soul of a serial killer like few others. It inspired a huge sub-genre of similar movies that came out during the 1990s and 2000s, and it's up there with Hitchcock's PSYCHO as one of the most gripping looks at the subject matter of all time.Where to begin? There's a pitch-perfect Jodie Foster, gradually leading us into the depths of the storyline as the naive FBI agent, and the oft-overlooked Ted Levine who excels as the supremely skin-crawling Buffalo Bill. Of course, the film is dominated by Anthony Hopkins, giving the best and most memorable performance of his career in just 16 minutes of screen time. Hopkins chills you to the bone in this, and Jonathan Demme's direction is a perfect match for his talents.The storyline is engaging, ably mixing the criminal investigation strands with scenes involving the killers themselves. There are gory and monstrous set-pieces which make your flesh crawl while watching, yet it's all rather restrained and intellectual, a surprise given the subject matter. Most importantly, it's never less than gripping and completely frightening. A true masterpiece of a movie."},{"username":"Michael_Elliott","userUrl":"https://www.imdb.com/user/ur13134536","reviewLink":"https://www.imdb.com/review/rw2504649","warningSpoilers":false,"date":"17 October 2011","rate":"","helpful":"8 out of 17 found this helpful.","title":"One of the All-Time Great Thrillers","content":"Silence of the Lambs, The (1991)**** (out of 4) Intense masterpiece about an FBI trainee (Jodie Foster) who is tracking down a perverted serial killer and must receive help from Dr. Hannibal \"The Cannibal\" Lector (Anthony Hopkins). THE SILENCE OF THE LAMBS is a rare example of a film picking up Oscars for Best Picture, Best Director, Best Actor, Best Actress and Best Screenplay. It's a very rare thing for any film to do that but once you see this film it's easy to see why it was such a hit back in the day and why it hasn't lost a bit of its impact in the years since. I've always felt that the film was about as close to flawless as any film could get and it's strongest aspect is the brilliant performances mixed in with some of the greatest characters ever written. The film really is a mechanical workshop for how to build up suspense and beat the viewer over the head each step of the way. I've heard many people say they love the film but felt that it was just too intense for its own good, which I think is almost fair to say. Director Jonathan Demme does a masterful job at building all of this tension up and I really love how they pretty much try to make each and every scene something very creepy. This film has rightfully become legendary over the years and many of the best scenes contain some of the greatest suspense. The early scene where we first see Lector looking out at us. A wonderful sequence where Foster must crawl into a garage not knowing what she's going to find. There's a creepy autopsy sequence. Then, there's the famous scene with Lector inside the \"new\" jail cell and of course the perfect ending. The movie certainly doesn't throw in cheap humor to try and break the tension and instead it just continues to assault the viewer. The violence, while graphic at times, never takes away from what you're viewing and the film is so classy that it never falls into some sort of cheap exploitation flick. The performances really bring the characters to life and the way Foster and Hopkins play against one another has rightfully put them as some of the most memorable of all time. The way the two play their little chess match while trying to gather information from the other perfectly adds to the creepy atmosphere and you really do feel as if you're watching something very special. Scott Glenn is also very effective as Foster's mentor. Ted Levine plays the serial killer and I've always felt that he's the one who most often gets overlooked. There's no question that this film belongs to Hopkins and Foster but Levine is just so terrific in his part of Buffalo Bill that I've always been somewhat shocked that he doesn't get more attention. The tense music score, masterful cinematography and wonderful dark look just adds to what really is the perfect thriller. Since the release of this movie there have been many sequels, rip-offs and countless other films inspired by this one but nothing has come close to the perfection which is this movie. THE SILENCE OF THE LAMBS is a rare example of a blockbuster actually delivering the goods and it's clearly not only one of the best films of the decade but also one of the greatest ever made."},{"username":"SnoopyStyle","userUrl":"https://www.imdb.com/user/ur2898520","reviewLink":"https://www.imdb.com/review/rw3367004","warningSpoilers":false,"date":"5 December 2015","rate":"9","helpful":"5 out of 9 found this helpful.","title":"iconic villain","content":"Trainee Clarice Starling (Jodie Foster) is recruited right out of Quantico by Jack Crawford (Scott Glenn) of the Bureau's Behavioral Science Services. He's investigating serial killer Buffalo Bill who skins his female victims. He's interviewing imprisoned killers but Dr. Hannibal Lecter (Anthony Hopkins) refuses to cooperate. Starling is sent to talk to Lecter.Director Jonathan Demme takes the serial killer genre onto another level. It is brilliantly intense and brutal. It's a solid entry but then there is Hopkins' Lecter. It is an iconic villain for all times. From the moment he first appears, he steals the movie. It's rare that somebody can produce a character that is so original and so memorable. He is so impressive that he actually overshadows the penis-tucked human-skinning lotion-basket transvestite serial killer. Foster is also pretty solid. She brings a competence to the role that is needed for the outrageous villains to shine."},{"username":"Hitchcoc","userUrl":"https://www.imdb.com/user/ur0278527","reviewLink":"https://www.imdb.com/review/rw1334058","warningSpoilers":false,"date":"5 April 2006","rate":"9","helpful":"3 out of 7 found this helpful.","title":"Maybe a Little Too Much","content":"Though there are few films so outwardly violent, the real gold in this film comes from the interaction between Anthony Hopkins and Jodie Foster. He prowls like a lion, back and forth in his glass cage, muzzled, dangerous. Foster reacts to him as you would someone who could kill you if you looked away for a second. Parry and thrust. As the film develops, a charming kind of standoff occurs. The FBI agent begins to see some humanity in this monster. She needs him, but she needs to trust him first. There are the scenes with the mask and the biting off of noses and other violence, but these show that he is in many ways a cunning beast. He is also a genius. As the profiling goes on, more and more layers of the mystery are cleared and the quarry knows the quarry. Hannibal Lecter is a celebrity brutalizer, and, of course, a cannibal. Hopkins knows few peers in contemporary cinema. His films are almost always worth the time. I doubt if he has ever created anyone like this before."},{"username":"Kirpianuscus","userUrl":"https://www.imdb.com/user/ur61197531","reviewLink":"https://www.imdb.com/review/rw3381152","warningSpoilers":false,"date":"26 December 2015","rate":"","helpful":"2 out of 3 found this helpful.","title":"definition for a decade's cinema","content":"the film of a decade. expression of a new cinema. because it impose new standard and impress for the splendid chemistry between Hopkins and Foster but, in same measure, for high importance of the details. a film about a dark world. and about the force of a vulnerable investigator who gives new perspective about a type of character. a film who becomes, scene by scene, fascinating for the viewer. because it is more than a crime movie. for the courage and science to be a complete story, with delicate , precise nuances and beautiful tricks for the tension. a film who defines a decade. in a beautiful manner. because, out of subject, it could be considered almost a legend."},{"username":"mark.waltz","userUrl":"https://www.imdb.com/user/ur0968789","reviewLink":"https://www.imdb.com/review/rw7352320","warningSpoilers":true,"date":"17 September 2021","rate":"10","helpful":"3 out of 6 found this helpful.","title":"Sheri Lewis need not worry. Lambchop the puppet will not be served with chanti and Fava beans.","content":"Lots of jokes have been made over the years of the only horror film to win best picture at the Academy Awards. Its also one of the few times and that the stars of a horror film went home with the awards, in this case Anthony Hopkins as serial killer Hannibal Lechter and Jodie Foster as FBI agent Clarice Starling out to interview him so she can try to capture another serial killer named Buffalo Bill. You miss out on the fun if you take this film completely seriously even though it is a horrific subject. But the imagery is memorable in so many ways, and unintentional laughter did erupt when the film first came out. Like \"Fargo\", it takes a serious subject and almost turns it into a black comedy, something that \"Fargo\" did intentionally but something that happened to \"Silence\" quite accidentally.So you get to serial killers for the price of one and you get to go into the minds of both. The character of Buffalo Bill is indeed disgusting. He is presented as a deranged man who tortures heavy set women, starving them so their skin will loosen and then kills them and uses their skin for his cross-dressing fetish. Lechter was a genius, a well noted psychiatrist who got into the minds of his patients in order to use their thoughts against them, and he also uses that when being interviewed by Agent Starling. Initially, he is repulsed by her for her unadvanced intelligence but as he gets to realize her seriousness of succeeding in her job, he begins to admire her but of course cannot help but use his genius to torture her through memories of her past that brings her to her own terror.At times, the relationship between the two is touching as part of him begins to think of her like a surrogate daughter and she begins to see a Sweetness in him that others are petrified of. She has been warned of his genius, doesn't heed the advice, and that brings her childhood fears to life and allows him to manipulate her. When he is transferred to a private facility oh, he uses this as a means of escape, and of course that is going to bring more terror to the world and give her more to put on her place as she tries to pinpoint where Buffalo Bill is and bring the madman's repulsive actions to an end. Psychological horror transfers into physical horror as Hopkins commits several vile acts, and as Agent Starling moves in on her target, Lechter moves in on his.This is probably not a film that movie fans will watch more than twice, because the imagery is very disturbing and the same is very dark even though there are unintentional comedic elements about it. Veteran actress Diane Baker is seen as the United States Senator, mother of one of the kidnapped victims being held by Buffalo Bill, and when Lector gets to meet her in one sequence, he provides a wisecrack so hysterically funny and cutting that you can't help but soak your screen if you are drinking at that moment. Scott Glenn as Foster's boss, is also quite memorable.There were certainly controversies over this film during the day because of the nature of Buffalo Bill's motivation for torture and murder, but now, he is simply just viewed as a psychopath whose sexual fetish goes beyond all mental reason. In fact, his character is so repulsive to look at that you can't help but laugh at him. One of the weak moments of the film is Foster's talking of him as she becomes closer, and it certainly was not intentional that it came off as laughable. The growing understanding between Starling and Lechter is much more memorable than the scenes involving Buffalo Bill. Foster gets a glimpse into Lechter's head when she visits his storage unit, a truly disturbing moment. Director Jonathan Demme does present an atmosphere constantly creepy which shows us a correlation between horror and comedy. I don't know that Foster's performance was Oscar worthy, but Hopkins, really in a supporting role, does command his way to winning Best Actor, and he joins Lugosi and Karloff in the list of movie monsters where you begin to understand why certain actors are associated with one role even when there were a ton more."},{"username":"Prismark10","userUrl":"https://www.imdb.com/user/ur4569900","reviewLink":"https://www.imdb.com/review/rw7975925","warningSpoilers":false,"date":"16 March 2022","rate":"10","helpful":"0 out of 0 found this helpful.","title":"The Silence of the Lambs","content":"So far, The Silence of the Lambs is the last film to win the big 5 Oscars. Best actor, actress, screenplay, director and film. The first since One Flew Over the Cuckoo's Nest in 1975 to win that grand slam.There was nothing about this film in advance where anyone thought it would become so iconic.The movie had a troubled production history. The film Manhunter based on Red Dragon by Thomas Harris was a flop. Several people tried to bring Silence to the screen including Gene Hackman who intended to direct and play Hannibal Lecter.When The Silence of the Lambs was released in the cinemas. It was in February, well outside of the Oscar season and when movies were not expected to do big box office. It was a sleeper hit that became a global phenomenon.Catherine Martin, the daughter of Tennessee Senator Ruth Martin is kidnapped by a serial killer known as Buffalo Bill (Ted Levine.)Trainee FBI agent Clarice Starling (Jodie Foster) is assigned by Jack Crawford (Scott Glenn) of the Bureau's Behavioral Science Unit to seek the advice of the imprisoned Dr Hannibal Lecter (Anthony Hopkins.) A brilliant intelligent psychiatrist and a dangerously unhinged criminal. A cannibalistic serial killerLecter gives clues about Buffalo Bill in exchange for personal information about Clarice. The FBI are in a race against time to save Catherine.The movie is a grim but taut psychological horror thriller. Director Jonathan Demme uses his exploitation and B movie roots to chilling effect.What makes the movie is the memorable and wicked performance from Hopkins. He is magnetic from his very first appearance. He and Foster dazzle in their mentor/apprentice relationship.Hopkins was fortunate to win the Best Actor Oscar as he was only on the screen for about 20 minutes in total. Hopkins made Lecter into an icon. The role bought him worldwide fame.Foster provides the empathy as well as a strong female role. You see the naive Clarice in a scene where she is a lone woman in a sea of policemen at the autopsy of one of Buffalo Bill's victims. Yet she grows as a character and realises that both Buffalo Bill and Hannibal Lecter provide her a once in a lifetime opportunity.Levine manages to hold his own for the extended periods where Lecter is not on screen. He gives a scary and bizarre performance that reflects Buffalo Bill's psyche.The movie is unsettling as well as engrossing with several spellbinding set pieces. A modern classic."},{"username":"classicsoncall","userUrl":"https://www.imdb.com/user/ur2707735","reviewLink":"https://www.imdb.com/review/rw2448518","warningSpoilers":true,"date":"24 June 2011","rate":"9","helpful":"4 out of 9 found this helpful.","title":"\"They don't have a name for what he is\".","content":"It's hard to believe this film is twenty years old, having seen it when it first came out and not again till now. The movie lived up to it's opening hype as a masterful thriller bordering on horror. Anthony Hopkins' portrayal of serial killer Hannibal Lecter defines the story, but when all is said and done, his character doesn't appear in the picture very much at all. However when he does, one's attention is riveted to the screen, attempting to outguess director Jonathan Demme's next move in a deadly cat and mouse game between Lecter and his adversary, be it FBI Agent Clarice Starling (Jodie Foster), or hapless security guards caught unaware by a scheming mad man.The larger plot involves the chase after a serial killer known as Buffalo Bill, named after a penchant for skinning his female victims after he murders them. To say that the picture has it's grisly moments would be an understatement. There are more than one scene that require caution for the faint hearted, visualizing grim aspects of brutality that don't leave much to the imagination. Buffalo Bill himself (Ted Levine) is an inspired piece of work, a monster that could have stood alone as a title character if not part of this larger story.Without giving it away entirely, I have to say that the hunt for Buffalo Bill gives rise to a clever gimmick that will catch you off guard for a moment, only to redirect itself very quickly to it's suspenseful conclusion. This one's recommended for fans of psychological thrillers who'll try to guess the ending only to be set up for one more neat twist at the finale. Anyone for a glass of Chianti?"},{"username":"lee_eisenberg","userUrl":"https://www.imdb.com/user/ur4888011","reviewLink":"https://www.imdb.com/review/rw1198238","warningSpoilers":false,"date":"21 October 2005","rate":"10","helpful":"8 out of 22 found this helpful.","title":"A most unusual treat.","content":"\"The Silence of the Lambs\" will have to go down in history as one of the most ingenious movies of all time. After a string of bizarre murders, FBI agent-in-training Clarice Starling (Jodie Foster) is hired to interview psychopath Hannibal \"The Cannibal\" Lecter (Anthony Hopkins) to find the perpetrator. In the process, we get to learn some very interesting things about both Starling and Lecter. The main thing is that, despite how vile Lecter is, we can't help but admire him. And I don't mean just because he's helping Clarice; something about the guy, you just gotta love him.In case you're squeamish, I should remind you that this movie contains some very ugly scenes. But don't worry, director Jonathan Demme knows how to handle them. This masterful combination of acting, directing and writing helped \"The Silence of the Lambs\" win the top five Academy Awards, putting it in a league with only \"It Happened One Night\" and \"One Flew Over the Cuckoo's Nest\". Watching the movie, you will agree that the movie deserved these awards. In fact, you just might want to have an old friend (over) for dinner."},{"username":"gavin6942","userUrl":"https://www.imdb.com/user/ur1234929","reviewLink":"https://www.imdb.com/review/rw1895320","warningSpoilers":false,"date":"18 June 2008","rate":"8","helpful":"1 out of 4 found this helpful.","title":"Modern Masterpiece and For Good Reason","content":"Agent Clarice Starling (Jodie Foster) enters into a relationship with Dr. Hannibal Lecter (Anthony Hopkins), a brilliant but deranged flesh-eating psychiatrist. He may be her only hope in catching Buffalo Bill (Ted Levine), a new serial killer who strips women of their skin for his own nefarious purposes. Can she trust him? \"Silence of the Lambs\" won a few Academy Awards, and it's plain to see why. Everyone involved does a wonderful job, and even after several viewings the movie remains fresh and enjoyable. I still haven't figured out what kind of accent Jodie Foster has, and I probably never will. Anthony Hopkins is perfect as Lecter, and I think it goes without saying that this will be the role he is remembered for. Maybe not his best role, but certainly his most widely received.The film has a timeless quality to it. Of course, we can tell the year the film was made from the clothing styles and production quality of the film. But there's nothing glaringly time-specific about it (compare it to \"Manhunter\" with the pastel jackets). Some things may seem silly and unintentionally comedic (there are excessive amounts of close-ups on Lecter that make me chuckle) but overall it's a good, smooth showing.I'm not going to get into detail about the film, director Jonathan Demme's vision or the changes from book to film (such as the number of Lecter's fingers). The film has been combed through a hundred times by critics and fans, and I'm merely adding an opinion that's been voiced before. But I will say this: as of 2008, the film retains all the qualities and positive aspects attributed to it when it first arrived in theaters. One suspects it always will."},{"username":"jboothmillard","userUrl":"https://www.imdb.com/user/ur4248714","reviewLink":"https://www.imdb.com/review/rw1041764","warningSpoilers":true,"date":"18 March 2005","rate":"9","helpful":"15 out of 42 found this helpful.","title":"The Silence of the Lambs","content":"This is often cited and one of the greatest in its genre, more a thriller than a horror, featuring one of the most recognisable villains of all time, based on the book by Thomas Harris, directed by Oscar and BAFTA winning, and Golden Globe nominated Jonathan Demme (Married to the Mob, Philadelphia, The Manchurian Candidate). Basically young FBI trainee agent Clarice Starling (Oscar, BAFTA and Golden Globe winning Jodie Foster) is assigned by Jack Crawford (Scott Glenn), of the Behavioral Science Unit, to interview former psychiatrist and incarcerated cannibalistic serial killer Dr. Hannibal Lecter, aka Hannibal the Cannibal (Oscar and BAFTA winning, and Golden Globe nominated Sir Anthony Hopkins). Lecter, being held in Baltimore State Hospital for the Criminally Insane, has information about serial killer Buffalo Bill (Ted Levine), who skins the corpses of his female victims, Lecter is courteous, but hates Starling trying to dissect him. Lecter does tell Starling to seek out an old patient of his, later a cocoon containing a sphinx moth is found lodged in a victim's throat. Starling returns to Lecter, he agrees to give a physical description of Buffalo Bill, in exchange for him being transferred to a new facility, and away from Dr. Frederick Chilton (Anthony Heald), whom he detests. Crawford authorises a fake deal to be made with Lecter, meanwhile Buffalo Bill has kidnapped Catherine Martin (Brooke Smith), daughter of U.S. Senator. Lecter demands a quid pro quo (\"something for something\" in Latin) from Starling, in exchange for personal information about herself he will give her clues, so Starling tells him about her childhood and the murder of her father. Lecter is later flown to Memphis, Tennessee, there he verbally torments Senator Ruth Martin (Diane Baker), before giving information about Buffalo Bill, some misleading, including the name \"Louis Friend\", an anagram of \"iron sulfide\", meaning fool's gold. Starling realises Lecter's deceit and asks for the truth from Lecter, now held in a cage-like cell, he tells that all information she needs is in the case file, rather than give a name. Lecter insists they continue quid pro quo, she recounts her traumatic childhood where spring lambs were being slaughtered, Lecter speculates saving Catherine will help her end the nightmares and the \"screaming of the lambs\". Lecter gives Starling back the case files on Buffalo Bill before they are interrupted and she is escorted out by police, later that night Lecter has taken a paper clip, uses it to uncuff himself, kills the guards, escapes from his cell and disappears, in fact using a guard's face and uniform to disguise himself. Starling examines the files and realises Buffalo Bill knew his first victim personally, going to the victim's hometown she discovers Buffalo Bill was a tailor, recognising his dress patterns as identical to his victims skins removed, she calls Crawford to inform him Buffalo Bill is fashioning a \"women suit\" of real skin. Crawford is already en route to make an arrest on a man named Jame Gumb, referenced in Lecter's notes and hospital archives, who once unsuccessfully applied for a sex-change, while Crawford leads an FBI tactical team to Gumb's address in Illinois, Starling interviews friends of Buffalo Bill's first victim in Ohio. The house in Illinois is empty, while Starling finds the house of \"Jack Gordon\", this is in fact Jamie Gumb, she recognises him as Buffalo Bill seeing a sphinx moth, she pursues him through the rooms of the basement, discovers Catherine alive, trapped in a dry well, then Starling is trapped in the dark, Gumb stalks her with night-vision goggles, but cocking his gun Starling instantly reacts and fires at Gumb, killing him. In the end Starling is given an FBI Academy graduation party, she is shocked to receive a phone call from Lecter, calling from an airport, he promises not to pursue her and asks she returns the favour, before hanging up he says he is \"having an old friend for dinner\", and follows newly arrived Chilton before disappearing into the crowd. Also starring Candyman's Kasi Lemmons as Ardelia Mapp, Lawrence T. Wrentz as Agent Burroughs, Frankie Faison as Barney Matthews, Charles Napier as Lt. Boyle, singer Chris Isaak as SWAT Commander, Roger Corman as FBI Director Hayden Burke and George A. Romero as FBI Agent in Memphis. Hopkins deserved his Oscar for his brilliantly sinister 24 minutes on screen as the intelligent serial killer; Foster deserved her Oscar as the young agent slowly toughening up following the clues, and Levine is splendidly disturbing as the killer taking skins for his demented pleasure. The relationship between Starling and Lecter is wonderfully twisted, and the mystery element to find the killer works well, this film became a big hit, legendary for many reasons, it is definitely a great psychological thriller. It won the Oscars for Best Writing, Screenplay Based on Material from Another Medium and Best Picture, and it was nominated for Best Film Editing and Best Sound, it was nominated the BAFTAs for Best Cinematography, Best Editing, Best Original Film Score for Howard Shore, Best Adapted Screenplay, Best Sound and Best Film, and it was nominated the Golden Globes for Best Motion Picture - Drama and Best Screenplay. Jodie Foster was number 23, and Sir Anthony Hopkins number 7 on The 100 Greatest Movie Stars, he was number 1 on The 50 Greatest British Actors, he was number 1 on Britain's Finest Actors, and he was number 3 on The World's Greatest Actor, Clarice Starling was number 6 (Hero) and Hannibal Lecter was number 1 (Villain) on 100 Years, 100 Heroes & Villains, the film was number 5 on 100 Years, 100 Thrills, it was number 28 on The 100 Greatest Scary Moments, it was number 21 on 100 Years, 100 Quotes (\"A census taker once tried to test me. I ate his liver with some fava beans and a nice Chianti.\"), it was number 65 on 100 Years, 100 Movies, and it was number 37 on The 100 Greatest Films. Very good!"},{"username":"rmax304823","userUrl":"https://www.imdb.com/user/ur0819382","reviewLink":"https://www.imdb.com/review/rw1820133","warningSpoilers":true,"date":"15 February 2008","rate":"7","helpful":"3 out of 10 found this helpful.","title":"Surprisingly Effective Thriller","content":"Jodie Foster, in a fine performance, is FBI-trainee Clarice Starling. She is assigned by the chief of the Behavioral Sciences Division (Scott Glenn) to interview the brilliant and cannibalistic mad psychiatrist Hannibal Lecter (Anthony Hopkins) in prison and try to enlist his help in capturing a currently active serial murderer, Buffalo Bill (Ted Levine), who skins his victims and sews the patches of skin into a kind of integumental suit made of women.When Starling first visits Lecter, the chief psychiatrist ( the eminently hatable Anthony Heald) escorts her down into the bowels of the institution and cautions her about approaching Lecter too closely, although they will be separated by a wall of bullet-proof plastic.Lecter DOES in fact help her. Buffalo Bill had once been a patient of his. But Lecter wants something too, in return. \"Quid pro quo,\" he tells her, showing off his Latin clichés. For every hint he gives to her and to the FBI, he demands some sort of present, such as a room with a view and, most important, some personal details about Starling's earlier life, the events in her past that brought her from a one-horse town in Appalachia to the FBI. He gets it. And she gets Buffalo Bill. And Lecter escapes in order to carry on his own cannibalistic career, beginning with the eminently hatable Anthony Heald. (His last line: \"I'm having an old friend for dinner tonight.\") It doesn't sound too promising, does it? Still ANOTHER serial killer on the loose? With a puzzling modus operandi? Which the FBI must figure out in order to track him down and shoot him dead? But I described this as an effective thriller, not an ordinary one that serves as one more opportunity for Stallone to strip off his clothes and bulge his muscles at the camera. It's functionally directed by Jonathan Demme, based on Thomas Harris's novel. Only one incident involves a stunt man. There isn't a car chase in sight, nor an exploding fireball, nor a slow-motion shot of violence. There is one lethal beating and only a single shoot-out -- with pistols, not Uzis or 40 mm. Bofors cannons.The three threads of the story involve Glenn's avuncular relationship with the younger Starling, the flirtation (for that's what it amounts to) between Lecter and Starling, and the pursuit of the twisted Buffalo Bill. The stories mesh very well, and one scene in particular, linking the FBI's attack on a suspect's house to Starling's casual and apparently post-climactic ringing the doorbell of a house belonging to an old lady, is masterfully done.Tak Fujimoto's camera work could hardly be improved upon. He paints for us a wintry Middle-Atlantic setting with ice-cold rivers and stark, bare deciduous trees. There is a scene with a decomposing corpse that makes your skin crawl, although it is handled matter-of-factly, or even in such good taste as such a scene allows for. Original, too, is the character of Buffalo Bill's last intended victim, a large young lady kept prisoner in a basement pit. With Bill still darting around in the shadows somewhere, the lone Starling yells down to her and tells her she's safe now that the FBI is here. We're wrong if we expect the captive to pull the usual response. She doesn't break down and sob with relief. She screams back, \"**** that, you b****! Get me out of here!\" It was a nice touch in the novel too, which is written in lean, functional, and artless prose.All of the performances are quite good, with Hopkins outstanding as the crazy genius. The character became something of an icon in vernacular culture, which I guess is why audiences find it satisfying and amusing that he should be left on the loose to kill still more people. It adds a new dimension to films -- the serial killer who deserves to be let free because he's polite and has visited Florence. The writers help bring this story above average. When Foster explores the house of an earlier, almost forgotten victim, there is a touching moment when she discovers some hidden photos the girl had taken of herself posing coyly in her underwear, although she's too plump to be conventionally attractive. A music box plays in the background while Foster goes through these pitiful remnants and we can sense the life behind the death. The direction isn't free of conventions though. Foster is blinded in darkness and the murder's hand reaches out from behind the camera and traces her contours without touching them. Every horror movie must have such a scene. And earlier, when Scott Glenn realizes he's sent Foster into a dangerous, potentially lethal circumstance without any warning, the camera moves in quickly to a close up of his startled expression as he says, \"Clarice!\" These clichés are available in finer B-grade slasher movies everywhere.The conventions are aptly deployed though and the movie succeeds in what it's trying to do."},{"username":"ccthemovieman-1","userUrl":"https://www.imdb.com/user/ur4445210","reviewLink":"https://www.imdb.com/review/rw1575333","warningSpoilers":false,"date":"17 January 2007","rate":"10","helpful":"217 out of 295 found this helpful.","title":"A Story And A Character That You Can't Forget","content":"I'll never forget my first viewing of this movie at the theater and will always look back fondly on it for one reason: helping me quit smoking cigarettes.I read the book first, was fascinated by it, and couldn't wait for the film to come out. That was the day I picked to quit smoking and I knew this movie would take my mind off that matter. I was expecting an intense movie and I got it. Little did I realize how well-received this film would be and how it propelled Anthony Hopkins to super-stardom.Although entertaining, this is not always a fun movie to watch, especially with the scenes with Ted Levine who plays the killer, \"Buffalo Bill.\" \"Bill\" and his kidnapped young woman are sick and profane people, respectively, and their scenes are very unpleasant. This movie is not for the squeamish with those and other scenes involving the infamous Dr. Hannibal Lecter (Hopkins). There also is some extreme crudeness in the jail/dungeon where Lecter and other inmates are held.Jodie Foster is excellent as the FBI agent \"Clarice Starling\" and Scott Glenn is low-key and effective as \"Jack Crawford.\" A major part of the film is psychological more than violent as Lecter constantly taunts \"Clarice,\" while she tries her best to manipulate him to help with a case. The by-play between the two is a game in itself.Hopkins, however, is the actor people remember best from this movie. His portrayal of the refined-yet-cannibalistic serial killer-doctor is one viewers will never forget. I've enjoyed watching him in the sequels, too. The looks on his face, his fascinating vocabulary with intelligent sarcasm and frankness, never ceases to entertain.\"Silence Of The Lambs\" has turned into a modern-day \"classic.\" If by some odd chance you have never seen this movie, be warned it is a dark, difficult story to watch at times....but it will get your mind off other things."},{"username":"Tweekums","userUrl":"https://www.imdb.com/user/ur13977076","reviewLink":"https://www.imdb.com/review/rw3546305","warningSpoilers":true,"date":"18 September 2016","rate":"9","helpful":"1 out of 2 found this helpful.","title":"Talk to a serial killer to catch a serial killer","content":"A serial killer, dubbed Buffalo Bill, has been murdering and skinning young women and the FBI are getting nowhere. Jack Crawford, the agent leading the investigation, decides to try something different; he sends trainee agent Clarice Starling to talk to incarcerated serial killer Hannibal 'The Cannibal' Lector hoping that he might provide some insight; it won't be easy though; Lector likes to play mind games with people and he is soon trying to get young Clarice to reveal some personal secrets. Soon another body is discovered then Buffalo Bill kidnaps another victim; this time the daughter of a US Senator; with the clock ticking before he kills her the FBI offer Lector a deal; unfortunately the doctor in charge of the facility housing Lector tells him the deal isn't real he then arranges another deal and Lector is transferred to Tennessee. Here Clarice sees him one last time and, after revealing details of a childhood trauma, is put on the trail of Bill and into a potentially deadly situation.This is an impressive thriller that is still effective after a quarter of a century and numerous spoofs of some of its most famous scenes. While the story is ostensibly about the hunt for Buffalo Bill it is as much about the growing relationship between Clarice and Lector as he gets her to open up about herself; something she has been warned about doing but does to gain his trust. Jodie Foster and Anthony Hopkins are both impressive in these roles. The rest of the cast, most notably Scott Glenn as Crawford and Anthony Heald as Dr Chilton are pretty good too. While there aren't a lot of violent scenes those that there are are particularly brutal. As the story approaches its conclusion the tension rises until the conclusion that remains very tense even after several viewings of the film. Overall I'd certainly recommend this to those wanting a solid thriller; just be warned it isn't for the faint-hearted."},{"username":"ma-cortes","userUrl":"https://www.imdb.com/user/ur3270789","reviewLink":"https://www.imdb.com/review/rw6475291","warningSpoilers":false,"date":"14 January 2021","rate":"8","helpful":"1 out of 2 found this helpful.","title":"Stunning and competent film with over-the-top performances and well-paced by Jonathan Damme","content":"Excellent movie in which a FBI agent needs a cannibal murderer to crack a twisted criminal case with a series killer who goes on his ugly rounds . Jodie Foster is FBI cadet Clarice Starling , an obstinate , fledgling woman with a cum laude degree in psychology . When a serial killer starts his criminal spree , FBI chief : Scott Glenn wants psychological profiles and Clarice is sent to collect a profile from one who's exceptionally intelligent , Hannibal Lecter , an ominous killer prone to dining his victims and considered to be America's most feared criminal . Meanwhile , the other cruel killer nicknamed Buffalo Bill : Ted Levine , continues skinning his victims alive and Hannibal little by little providing enigmatic clues about the nefarious killer . Compelling and nail-biting movie with fine characterizations , thrills , chills , intrigue , tension , and lots of grisly killings . Impresive and Oscarized thriller based on Thomas Harris novel and nice script by Ted Tally , concerning the popular psychologist turned mass murderer . At the end takes place a creepy and scary confrontation climax in the basement at a house which seems to have interminable doors with full of darkness and endless terror. Here Agent Clarice and the famous killer Hannibal have a history and developing a troublesome relation , as Sterling asking for help Lecter to crack the grisly criminal issue. Jodie Foster gives a top-notch acting as a rookie agent with ambition , as well as an expert profiler holding a traumatic childhood . The great Anthony Hopkins is sensational as Hannibal Lecter, the psychiatrist and clever vicious murderous with his particular habit of eating parts of his victims . Anthony Hopkins makes Hannibal the Cannibal at once an almost likable and frightening character locked-up from the world until interviewed by the stubborn agent Clarice . They are well accompanied by nicely detailed secondary cast , such as : Scott Glenn, Anthony Heald , Ted Levine , Diane Baker and bit parts and cameos from Charles Napierr, Frankie Faison , Brooke Smith , Chris Isaak and Roger Corman . The motion picture was stunningly directed by Jonathan Demme who provides an elegant pacing being highly effective in its best scenes and several thrilling moments , adding some brutal visual effects .It was followed by a sequel : \"Hannibal\" by Ridley Scott with Anthony Hopkins , Julianne Moore , Gary Oldman , Giancarlo Giannini , Francesca Neri . And \"Red Dragon\" 2002 by Brett Raner with Anthony Hopkins , Ralph Fiennes , Edward Norton , Harvey Keitel, Bill Duke . Besides , a first rendition about Hannibal in 1986 titled \"Manhunter\" by Michael Mann with William H Petersen, Brian Cox , Tom Noonan, Joan Allen, Frankie Faison ."},{"username":"BA_Harrison","userUrl":"https://www.imdb.com/user/ur0945066","reviewLink":"https://www.imdb.com/review/rw2563341","warningSpoilers":true,"date":"9 February 2012","rate":"7","helpful":"1 out of 11 found this helpful.","title":"Not quite as baarilliant as ewe might have herd.","content":"Five times Oscar winner The Silence of the Lambs is a class act in many respects, but there are several factors—issues with the script that many fans seem to have happily chosen to ignore—which prevent me from finding the film such a wholly satisfying experience.With a little suspension of disbelief, I can accept that FBI boss Crawford (Scott Glenn) might believe that Hannibal Lecter (Anthony Hopkins) could help in profiling serial killer Buffalo Bill (Ted Levine), but what are the chances of him knowing the killer's actual identity? Pretty damn slim if you ask me—almost as unlikely as Crawford assigning a rookie agent like Clarice Starling (Jodie Foster) to interrogate a manipulative psychopath in the first place!Swallow all that, and you'll probably have no problem with Lecter's escape, but I know I'm not alone in finding this pivotal scene far-fetched in the extreme. Even if I let the whole 'pen thing' slide (Hannibal's a master of sleight of hand and a whizz at picking locks–fair enough), I still struggle to believe that it is possible to fool an entire team of highly trained cops and medics by slipping a dead man's face over your own. Just ain't going to happen.And then there's the ending, which after all of the slow-burn psychological games between Lecter and Starling, suddenly goes into over-drive, glossing over details in a hurry to get to the typically tense Hollywood-style finale: all of a sudden, the FBI have Buffalo Bill's true identity, Clarice Starling has tracked the nut-job to his lair, and it's all on for an exciting climax inside the pitch black, labyrinthine basement where the psycho skins his victims.Thankfully, even with these frustratingly ill-considered moments taking the film down a peg or two in my opinion, Silence of the Lambs is still well worth a watch thanks to director Jonathan Demme's slick handling of the material, and career defining turns from several of his standout cast. Hopkins iconic performance as Lecter is mesmerising, the actor deeply menacing even behind a sheet of unbreakable glass or completely immobile, securely fastened to a trolley in his iconic face-mask; Foster is also memorable as Clarice, who unwisely allows Hannibal inside her mind to exploit her emotional fragility. But it is Ted Levine who steals the show: as sexually confused, mumbling maniac Buffalo Bill, whose goal is to make himself a suit from women's skin, Levine is absolutely superb, providing the film with many of its most memorable moments and delivering several of my favourite quotable lines of dialogue.All together now: 'It rubs the lotion on its skin...'"},{"username":"moonspinner55","userUrl":"https://www.imdb.com/user/ur0989035","reviewLink":"https://www.imdb.com/review/rw0299472","warningSpoilers":false,"date":"27 March 2002","rate":"6","helpful":"12 out of 35 found this helpful.","title":"It tries to build a crawling sense of dread and menace, but...","content":"Jonathan Demme's \"The Silence Of the Lambs\" is a grisly spook show, and one without any sympathy for its victims (or for the audience, who get a good hammering on the head). Yes, the Oscar-winning performances by Anthony Hopkins and Jodie Foster have become legendary (and for good reason, they are both intensely focused and driven), but the picture leaves scummy feelings in its wake, as if Demme had suddenly turned carnival barker for the ultimate freak show. FBI trainee Foster, invited into the gruesome investigation of a serial killer, seems to climb the ranks awfully easily, being allowed to do potentially dangerous work on her own as well as going mano a mano with Hopkins' Dr. Hannibal Lecter, an imprisoned cannibal who may hold the key to the crimes. There's chilly art in Demme's presentation--it's a polished piece of work--but I soon tired of the Woman as Hero underlying theme, complete with a who's-in-the-dungeon finale that doesn't work at all, the sacrificing of real human drama for shock value and lots of outlandish violence (such as a mutilated security guard hanging from the top of a prison cell like an angel). The black-humored kicker is that all this perverseness is good for a raunchy thrill, and what better way to arouse a stultified audience than to give us two psychopaths--one who eats his victims, the other who carves up women. **1/2 from ****"},{"username":"TxMike","userUrl":"https://www.imdb.com/user/ur0438066","reviewLink":"https://www.imdb.com/review/rw0299436","warningSpoilers":true,"date":"8 October 2001","rate":"","helpful":"1 out of 4 found this helpful.","title":"This is \"Buffalo Bill's\" story, why is he a serial killer?","content":"SPOILERS - The movie's title comes from a reference to an experience Clarice (Jodie Foster) had when she was 10, living with relatives on a sheep ranch in Montana, after her policeman father was killed. She awoke to some terrible screaming and in the barn found they were slaughtering lambs. Afterward she had dreams, and Lecter (Anthony Hopkins) wonders aloud if catching the serial killer, Buffalo Bill, will \"Silence the Lambs\" in her dreams.Clarice is a student assigned to try and get Lecter to help figure out who the killer is, after he kidnaps a politician's daughter. Lecter likes Clarice, ends up giving her clues which allow her to find \"Bill\" and in a thrilling dance of death in the dark, she shoots him. Lecter had escaped as a result of police bungling, and in the last scene we see him talking by phone to Clarice, saying he's \"having an old friend for dinner\", then we see him following the dastardly Dr Chilton (Anthony Heald). I haven't seen the sequel yet.Heald is now the unpopular assistant principal in the fine TV series \"Boston Public\", playing essentially the same character he did in this movie. Daniel von Bargen, that fine character actor, played one of the cops looking for Lecter right after his escape.Right now \"Silence of the Lambs\" has an average Imdb rating of 8.5, and is listed as the #19 film of all time. It IS a pretty good thriller, and Foster and Hopkins are at their bests in this film."},{"username":"dbdumonteil","userUrl":"https://www.imdb.com/user/ur1219578","reviewLink":"https://www.imdb.com/review/rw0299405","warningSpoilers":false,"date":"2 April 2004","rate":"8","helpful":"1 out of 5 found this helpful.","title":"the intense humming of evil","content":"With \"Silence of the Lambs\" (1991), Jonathan Demme achieved a masterstroke and his movie became one of the landmark movies made in the nineties. The reward of his efforts were the following ones: 5 Oscars in 1992 including Best Movie and a widely deserved blockbuster.This is a movie that enjoys a performance of a high quality with, of course Jodie Foster and Anthony Hopkins who dominate the cast. The former is absolutely convincing in her role of ambitious trainee who gradually realizes that if she wants to nab \"Buffalo Bill\", she has to face and overcome her fears. All this with \"a little help\" from Hopkins who finds in this movie one of his best roles and offers a remarkable and especially unforgettable composition of his character: Hannibal Lecter. Besides, concerning this character, more than fascination, this is nearly liking that we feel for this monster. On another hand, his confrontations with Clarisse are the key-moments of the movie where we can notice a careful work on the light, the scenery and the framing.In \"Silence of the Lambs\", Demme plays with the spectator's nerves, avoids as much as possible the bloody sequences and creates suspense the following way: throughout the movie, there's a constant tension that starts with the warnings given to Clarisse before her first meet with Lecter. Then, it becomes more marked with Lecter's escape and it reaches a peak with Clarisse's final dual with \"Buffallo Bill\". The whole is well-orchestrated by Demme thanks to a witty making. At last, even if the end reveals an inevitable happy-end, the very last sequence is here to remind us that one of the two monsters in the movie is still alive and he will keep on getting himself talked about (Hannibal, 2001).A terrific and terrifying thriller. Highly recommended and this is one of the very few movies that will haunt you for a long time after you watched it."},{"username":"Quinoa1984","userUrl":"https://www.imdb.com/user/ur0453068","reviewLink":"https://www.imdb.com/review/rw0299361","warningSpoilers":false,"date":"9 February 2001","rate":"10","helpful":"3 out of 6 found this helpful.","title":"One of the best suspense films of the early 1990's","content":"Silence of the Lambs is a film that will always be memorable because of 2 things (in my mind)- 1, Hopkins brilliantly mixed type of Socrates meets Dawn of the Dead zombie charicature and 2, an argument will go on like who was the better Darren on Bewitched, Jodie Foster playing Clarice Starling (and version of herself in 10 years Julianne Moore). I feel that Jodie Foster is very good here as a FBI agent who has to get in the mind of Dr. Lecter (Faba beans and all) to find a killer. Story latter patterned out in The Cell, which while that was better, this film is a tad better than the sequel by having you sqeam in your seat while getting memorable catch phrases and (dare I say) laughs. A little note (and not too uncoincidentally)- Dead Director George A. Romero appears briefly as a Memphis agent. A"},{"username":"Coventry","userUrl":"https://www.imdb.com/user/ur2020269","reviewLink":"https://www.imdb.com/review/rw1261651","warningSpoilers":false,"date":"10 January 2006","rate":"10","helpful":"4 out of 14 found this helpful.","title":"Everything you could possibly look for in cinema!","content":"To keep up the goody goody cannibal spirit: \"Silence of the Lambs\" is a finger-licking GREAT thriller and one of the most righteous Academy Award winners in the history of cinema. Maybe I'm just saying that because I'm a big fan of nerve-racking thrillers and, let's face it, nerve-racking thrillers hardly ever win any Oscars, but apparently all audiences as well as all critics seem to agree that \"Silence of the Lambs\" is the worthy conquerer of 5 awards in the most eminent categories. The foundations of this cinematic milestone couldn't have been better, of course, with Thomas Harris' intriguing characterizations and basic story-idea (the efficiency was already proved in 1986, with \"Manhunter\") but really a lot of the film's brilliance is added by the Jonathan Demme and his outstanding cast. Despite not having directed a lot of horror/thriller films before this, Demme's knowledge of the genres is impressive and he terrifically manages to bring a constant level of tension without ever resorting to graphic violence or explicit gore. And that's quite an accomplishment because, primarily, \"The Silence of the Lambs\" handles about a sadistic serial killer, who eats his victims, who's recruited to assist in catching another sadistic serial killer, who skins his victims! Young FBI-trainee Clarice Starling is sent to Dr. Hannibal Lector's isolated prison cell to profile the new killer Buffalo Bill. But the highly intelligent and sophisticated Lector is only prepared to reveal clues about Buffalo Bill's modus operandi in exchange for answers to personal questions regarding Clarice's childhood.Apart from being a truly exciting and rather educational serial-killer chase, \"The Silence of the Lambs\" also definitely is a compelling psychological drama-triumph! The 'Quid Pro Quo' conversations between Clarice and Dr. Lector are portrayed like highly competitive duels in which the young FBI agent isn't necessarily the weakest party! These conversations revolve on how determined both of them are willing to go in order to find out what they need to know and, simultaneously, we get to know how vulnerable Clarice actually is. These marvelous sequences appear to be even stronger thanks to the genuinely eerie and cold setting of Hannibal Lector's old, windowless cell. The camera perspectives throughout the whole film, as well as the cinematography in general, are impeccable and often trend-setting! Particularly classic is the \"parallel\" climax, which actually is a ridiculously simple and misleading trick but increases the suspense to an unprecedented high point. And then, of course, there are the acting performances but what praise can I possibly add that hasn't been said before? Anthony Hopkins is in one word hypnotic, Jodie Foster is pragmatic but truly overpowering and Ted Levine is genuinely terrifying as the personification of human complexity!"},{"username":"Gordon-11","userUrl":"https://www.imdb.com/user/ur0035842","reviewLink":"https://www.imdb.com/review/rw1981000","warningSpoilers":false,"date":"26 November 2008","rate":"","helpful":"0 out of 2 found this helpful.","title":"Repulsive and yet captivating","content":"This film is about a cannibalistic criminal helping the FBI to catch a sadistic serial killer.I thought \"The Silence of the Lambs\" would involve a lot of gory scenes or scenes chilling body parts, but I was wrong. \"The Silence of the Lambs\" is an intelligent thriller, well paced and well developed. It creates an atmosphere of suspense, urgency and fear throughout the film. Anthony Hopkins is chilling as Hannibal Lecter. His sick mind is chillingly portrayed, it repulses and yet captivates me. My heart was pounding, and my palms were sweating throughout the whole film. No wonder this film got so hyped when it was released years ago. I am looking forward to watch the other Hannibal Lecter films."}],"errorMessage":""}