{"imDbId":"tt0110357","title":"The Lion King","fullTitle":"The Lion King (1994)","type":"Movie","year":"1994","items":[{"username":"MartinHafer","userUrl":"https://www.imdb.com/user/ur2467618","reviewLink":"https://www.imdb.com/review/rw2688054","warningSpoilers":false,"date":"13 October 2012","rate":"8","helpful":"6 out of 65 found this helpful.","title":"A lovely but completely unoriginal film.","content":"Aside from the folks at Disney, anyone else my age who saw both the Japanese series \"Kimba\" and \"The Lion King\" could easily see that the Disney film was based almost completely on the earlier Japanese cartoon. Now I am no lover of \"Kimba\"--its American version was rather insipid. But the plot was clearly 'borrowed' by Disney to make \"The Lion King\". And, there are so many similarities that I cannot rate this wonderful film any higher than an 8--as it lacks originality. Sure, I loved Ed and felt my heart tugged by the film and loved the music--but it was a ripoff, ur....I mean 'very similar'. Not a bad film at all, but I recommend you try seeing the Japanese show if you can find a copy. Even the main character's names are practically the same!"},{"username":"TheLittleSongbird","userUrl":"https://www.imdb.com/user/ur20552756","reviewLink":"https://www.imdb.com/review/rw2024643","warningSpoilers":false,"date":"17 February 2009","rate":"10","helpful":"19 out of 26 found this helpful.","title":"This is my sister's favourite film, and one of mine!","content":"This is a fantastic movie, and I am not lying! my 13 year old sister loves this movie, and I can't fault this either. It was one of the first movies I ever saw, so that accounts for how much I love it. The animation is superb, the backgrounds look so rich, and for once, there are no stiff movements. The highlights were the stampede and the fight between Scar and Simba. The music by Hans Zimmer is outstanding, a perfect mix of African chants and pure Hollywood. The songs are absolutely great, I had no idea that Elton John could write like that. The best song is \"Can you feel the Love Tonight?\" but the others go without fault, \"Circle of Life\" is so spirit rousing especially. Likewise with the voice overs. Jonathan Taylor Thomas is very likable as Young Simba, and Matthew Broderick, while not as good, is above average too. James Earl Jones lends his booming voice to the majestic King Mufassa, and Nathan Lane, Rowan Atkinson and Whoopi Goldberg provide flawless comic relief. The vocal standout is Jeremy Irons as Scar, who frightened me when I was little. Scar is up there with the best Disney villains, like Jafar, Malificent and Frollo. The humour here is fantastic, and you cry here a bit here as well. I highly recommend the stage version in the West End, and the sequels are actually two of the better DTV sequels.10/10. Bethany Cox"},{"username":"Leofwine_draca","userUrl":"https://www.imdb.com/user/ur0482513","reviewLink":"https://www.imdb.com/review/rw3686764","warningSpoilers":true,"date":"17 April 2017","rate":"4","helpful":"11 out of 65 found this helpful.","title":"An example of everything I hate about Disney","content":"I'm not a Disney convert. I didn't like what I saw of Disney movies as a kid and by the time THE LION KING came out in 1994 I was 13 and couldn't be less interested in kid's films anymore anyway. Decades later, I've finally watched it for the first time and the experience has reaffirmed all of the negativity I associate with Disney animation.This is over-simplistic, spoon-fed pulp for the masses. The story is copied from HAMLET and simplified to get rid of all the complexity. The characters are trite and one-dimensional without anything in the way of depth or motivation. Jeremy Irons' bad guy is that just because. The positive thing about this is that the character animation is very good indeed, although I found the backdrops simplistic in the extreme. The comedy relief is laboured and the songs trite. The whole experience washed over me without touching or involving me once, and don't get me started on the exaggerated voice acting."},{"username":"SnoopyStyle","userUrl":"https://www.imdb.com/user/ur2898520","reviewLink":"https://www.imdb.com/review/rw3239210","warningSpoilers":false,"date":"15 May 2015","rate":"6","helpful":"5 out of 11 found this helpful.","title":"great songs in Shakespearian epic","content":"King Mufasa and Queen Sarabi have a new son Simba. Mufasa's younger brother Scar is jealous of the new heir to the throne to rule the African plains. Scar tricks Simba to go to the elephant graveyard. Simba takes Nala despite Zazu's warnings. They are set upon by hyenas Shenzi, Banzai and Ed. Mufasa rescues them. Scar comes up with a scheme to kill Mufasa and Simba. Scar places Simba in the middle of a wildebeest stampede herded by the hyenas. Scar kills Mufasa while he's rescuing his son. The hyenas chase Simba away. Scar claims the throne with Simba assumed to be dead. Meerkat Timon and warthog Pumbaa befriends the lost Simba and teach him their motto \"hakuna matata\".Simba is an annoying brat. He's my main problem in this movie because he annoys me even as a self-obsessed cub. It is the point of the movie so I do have to overlook it somewhat. I just don't care enough about Simba. Although, I don't know how I would feel about an animated Hamlet. The songs are iconic. The drama is Shakespearian. There is a lot to like about this classic but not necessarily Simba."},{"username":"Hitchcoc","userUrl":"https://www.imdb.com/user/ur0278527","reviewLink":"https://www.imdb.com/review/rw1327689","warningSpoilers":false,"date":"28 March 2006","rate":"9","helpful":"6 out of 8 found this helpful.","title":"Wonderful Music and Rhythms","content":"This is an outstanding work of animation. I realize that it has been criticized for political incorrectness. The fact of the matter is that it has strong female characters as well as male, and it's about a vision of monarchy. I have the greatest respect for female role models but I really don't see this as a worthy criticism. It's a great story of defeat and betrayal and renewal. It has delightful individual characters, dressed up to show their beings in a clever way. It has the most despicable villains with Scar and the Hyenas. It has the Henry II thing about duty. It doesn't glorify fooling around as one of my colleagues told me. The free life is OK but at some time you must follow your heart and redeem yourself. The music is outstanding; another triumph or the Disney team. There are three or four numbers that are so critical to a complete understanding of the events of the story. The sound effects person should have been rewarded because sound is so critical in this. From the stampede to the forbidden areas of the kingdom. I watched this about sixty times with my small children and never really tired of it. I would put this at the top of any list of animated adventures."},{"username":"Kirpianuscus","userUrl":"https://www.imdb.com/user/ur61197531","reviewLink":"https://www.imdb.com/review/rw3660291","warningSpoilers":false,"date":"12 March 2017","rate":"","helpful":"0 out of 2 found this helpful.","title":"an experience","content":"it has many gifts. but one remains fundamental - it is a wise and convincing rehabilitation of the basic role of animation : to be tool of education. to give values and examples of honest life. not in didactic manner but as the old stories from the Middle Orient, like the epics or the fairy tale of grandparents. because the technology, the love stories, the invincible heroes, the beautiful young girls are only a side of animation purpose. the essence is the profound change of the viewer to be better man. and \"Lion king\"did it. in admirable manner. using the story of Hamlet and the technique of fable, it becomes a personal experience. sure, for entire family. and this is the best fact about it - to open a large window. to yourself."},{"username":"kosmasp","userUrl":"https://www.imdb.com/user/ur5876717","reviewLink":"https://www.imdb.com/review/rw6008644","warningSpoilers":false,"date":"19 August 2020","rate":"10","helpful":"1 out of 2 found this helpful.","title":"Classic stuff","content":"There's a reason this is considered a classic. And while that term has been used or rather missused over at least the last couple of years or decade(s), this is one of those times it really fits. The movie is an animated fairy tale, that is also a bit grim at times. Still this is the circle of life ... and has so many memorable songs. Listening to the audio commentary, you come to realize how many things were in the balance while making this. How many things that are being considered genius now, were last minute decisions or things that they were doubting themselves (or the studio did).So it is a fine line, between making somethinng reat and failing at making something at all. Fortunately for us (and Disney of course) they really hit the ball out of the park (which is a baseball metaphor as I understand and is something good). This being so short (considereing the additional 30 minutes I think of the remake), make it a fast and enjoyable ride.Apart from the fine animation (the remale looks photorealistic and can almost not be considered animation, both look awesome), you have fantastic voice actors. This is true for both films, but it was way more difficult in the 90s to convince actors to lend their voice to an animated movie. Known \"regular\" actors that is, because apparently it was all an imaging/marketing thing for them too. Which is understandable - but anyone who didn't get on board with this, might have many regrets now. Good thing they were able to convince the cast they ended up using. The voices add to the overall feeling.There is something for the whole family here - and hopefully you can see that too - no pun intended"},{"username":"classicsoncall","userUrl":"https://www.imdb.com/user/ur2707735","reviewLink":"https://www.imdb.com/review/rw3126089","warningSpoilers":true,"date":"17 November 2014","rate":"8","helpful":"3 out of 5 found this helpful.","title":"\"...we are all connected in the great circle of life\".","content":"If this came out when I was a kid it would have been my favorite Disney film. My generation had \"Lady and the Tramp\" (1955) and \"101 Dalmations\" (1961). Me, I was always fascinated by wild animals and when it comes to lions, the idea that they were the 'King of Beasts' was icing on the cake. That's why I never missed a Tarzan or Jungle Jim flick when they came on TV back in the day.Well I'm not a kid anymore, so I guess there's no reason to qualify it. This can still be my favorite Disney movie. There are some good lessons here for youngsters, the whole circle of life business and the idea that being brave doesn't mean you have to go looking for trouble. Animation wise it resembles a lot of the older Disney pictures, only natural since it was the last of their hand drawn features. There's a simplicity to the style that's missing from the high tech wizardry of present day animated films. I don't think that means there's a better or worse here, times and technology change so why not movies.Cool comical characters like Timon and Pumbaa, and regal heroes like Mufasa and the adult Simba make this a fun picture. I especially liked the scene where Simba as a cub stepped in his father's footprint making him realize he had big paws to fill someday. The conflict with Scar and the hyenas was positioned well to help Simba understand that early failure is not indicative of future success. Colorful, quick paced and energetic, \"The Lion King\" is a delightful film experience."},{"username":"gavin6942","userUrl":"https://www.imdb.com/user/ur1234929","reviewLink":"https://www.imdb.com/review/rw3127641","warningSpoilers":false,"date":"20 November 2014","rate":"7","helpful":"1 out of 2 found this helpful.","title":"One of the Great Disney Films of the Early 1990s","content":"Tricked into thinking that he caused the death of his own father (James Earl Jones), a young lion cub (Jonathan Taylor Thomas) flees and abandons his destiny as the future king.Disney's strongest period in recent history was the late 1980s and early 1990s. They consistently released hits: \"Little Mermaid\", \"Aladdin\", \"Beauty and the Beast\". The princesses from these films have taken their place alongside the classics (Snow White and Cinderella). Until \"Frozen\" twenty years later, this success would not be repeated.\"The Lion King\" came at the end of this cycle, and did not feature a princess (at least not in human form). But it is still a great tale of loss, redemption, triumph. Many would place it among the top three Disney cartoons ever made."},{"username":"jboothmillard","userUrl":"https://www.imdb.com/user/ur4248714","reviewLink":"https://www.imdb.com/review/rw5015755","warningSpoilers":true,"date":"24 July 2019","rate":"9","helpful":"2 out of 4 found this helpful.","title":"The Lion King","content":"This Disney animated favourite was a big box office hit, it spawned a successful worldwide stage musical, and got a photorealistic remake twenty-five years later, the original remains a crowd-pleasing cartoon. Basically, in the Pride Lands of Africa, at Pride Rock, the lions rule over the animal kingdom. There Simba, the new-born son of King Mufasa (James Earl Jones) and Queen Sarabi (Madge Sinclair), is being presented to the large gathering of animals by Rafiki the mandrill (Robert Guillaume), the kingdom's shaman and advisor. Mufasa shows young Simba (Jonathan Taylor Thomas) the Pride Lands, explaining his responsibilities as king, and the \"circle of life\", which connects all living things. Mufasa's younger brother Scar (Jeremy Irons) plots to eliminate Mufasa and Simba to become king himself. He tricks Simba and his best friend Nala (Niketa Calame-Harris), who are betrothed, into exploring the forbidden land. In the elephant graveyard, the lion cubs are attacked by three spotted hyenas, Shenzi (Whoopi Goldberg), Banzai (Cheech Marin), and Ed (Jim Cummings), who are in league with Scar. Mufasa rescues them after being alerted by his majordomo, the hornbill Zazu (Rowan Atkinson). Mufasa is upset with Simba, but forgives him, he tells him the great kings of the past are in the night sky, they will always be there to guide him, as he will be one day. Scar sets a trap for his brother and nephew, luring Simba into a gorge, while a stampede of wildebeest is driven by the hyenas to trample him. He informs Mufasa, who saves Simba but hangs perilously trying to climb out of the gorge. Scar refuses to save him and causes him to fall onto the stampeding herd. Simba finds Mufasa dead, Scar convinces him that this tragedy is his fault, and tells him to run away and never return. The hyenas are ordered to kill the cub, but Simba escapes. Scar tells the pride about the deaths of Mufasa and Simba, appoints himself as king, and allows the hyenas to live in Pride Rock. Simba has collapsed in the desert, he is rescued by friends and outcasts Timon the meerkat (Nathan Lane) and Pumbaa the warthog (Ernie Sabella). They take pity on him, telling him to put his past behind him, citing their motto \"Hakuna Matata\", meaning \"no worries\". Timon and Pumbaa allow him to live in their jungle paradise. Simba (Matthew Broderick) grows up as a carefree adult. Meanwhile the Pride Lands have been reduced to a wasteland under Scar's rule. Timon and Pumbaa are walking through the jungle singing \"The Lion Sleeps Tonight\", when a hungry adult lioness tries to attack them. Simba fights her, but realises it is Nala (Moira Kelly) grown up. She and Simba reunite and fall in love. She urges him to return home, telling him that Pride Lands have been destroyed, feeling guilty for his father's death he refuses and storms off. He then encounters Rafiki, who discovered he was still alive, he tells him that Mufasa's spirit lives on in Simba. Simba is visited by the ghost of Mufasa in the night sky, following this he decides to return home. Aided by Timon and Pumbaa, Simba sneaks past the hyenas and confronts Scar. He taunts Simba over his role in Mufasa's death and backs him to the edge of the rock, there he reveals to him that he murdered Mufasa. Enraged, Simba pins Scar to the ground and forces him to tell the truth to the pride. Timon, Pumbaa, Rafiki, Zazu, and the lionesses fight against the hyenas, Scar tries to escape, until he is cornered by Simba at the top of Pride Rock. Simba spares his life but orders him to leave and never return. Scar attacks his nephew, but Simba manages to throw him from the top of the rock. Scar survives the fall, but is attacked and killed by the hyenas, who overheard his attempt to betray them. Afterwards, the rain starts to fall, the other animals watch as Simba finally ascends Pride Rock and roars to announce his kingship. Later, Pride Rock is restored to its usual state, animals are gathered as King Simba and Queen Nala look over their kingdom, and Rafiki presents their new-born cub. Also starring Zoe Leader as Sarafina, Frank Welker as Lion Roars, Tony Jay as Hyenas, and B.J. Ward as Lions. The voice cast are all terrific, especially Jones as the father and Irons as the villain, the colourful animation is wonderful, the story inspired by biblical stories and Shakespeare's Hamlet is good, it makes you laugh and cry, and the songs composed by Sir Elton John and written by Sir Tim Rice are memorable anthems, a most satisfactory animated musical drama. It won the Oscars for Best Music for Hans Zimmer, and Best Song for \"Can You Feel the Love Tonight\" (also won the Golden Globe), and it was nominated for Best Song for \"Circle of Life\" (also nominated the Golden Globe), and Best Song for \"Hakuna Matata\", it was nominated the BAFTAs for the Anthony Asquith Award for Film Music and Best Sound, and it won the Golden Globes for Best Motion Picture - Comedy/Musical and Best Original Score - Motion Picture. It was number 14 on The 100 Greatest Musicals, it was number 99 on 100 Years, 100 Songs for \"Hakuna Matata\", it was number 94 on The Ultimate Film, it was number 6 on The 100 Greatest Family Films, and it was number 7 on The 100 Greatest Cartoons. Very good!"},{"username":"ccthemovieman-1","userUrl":"https://www.imdb.com/user/ur4445210","reviewLink":"https://www.imdb.com/review/rw1496057","warningSpoilers":false,"date":"13 October 2006","rate":"3","helpful":"20 out of 75 found this helpful.","title":"Un\\satisfying New Age Baloney","content":"Rarely have I watched a \"kids\" or \"family\" animated full-length movie and felt so unsatisfied, finishing the viewing with a frown on my face. This didn't happen the first time; just on the second and third looks. The film just got worse the more I watched it.Maybe I got more culturally aware. I saw how much New Age baloney was thrown into this film, with Elton John singing about the \"circle of life,\" and a bunch of other more subtle Left wing propaganda that is typical of the Disney company.The villain, and even the little hero, became more annoying in multiple viewings. Once again, the more I watched this, the more unappealing both the characters and the story became, not just the \"theology.\" Nothing in the story is boring, however. The characters are interesting, from the lions to the hyenas to the warthog and his buddy (who provide most of the comedy in here.) The graphics are top-notch with some of the animation - especially in the beginning - just gorgeous."},{"username":"Tweekums","userUrl":"https://www.imdb.com/user/ur13977076","reviewLink":"https://www.imdb.com/review/rw5047176","warningSpoilers":false,"date":"8 August 2019","rate":"10","helpful":"4 out of 5 found this helpful.","title":"A Disney classic","content":"In the African savannah King Mufasa, a lion, rules over the Pride Lands. He explains to his son, a young cub named Simba, that one day he will be the king... but before that he has a lot to learn. There are dangers, even for lions. The greatest danger comes from Simba's Uncle Scar; an embittered lion with a Machiavellian streak. Scar wants to rule but to do that he needs to rid himself of Mufasa and Simba... he has plans. One day Scar's plan works; Mufasa is dead and Simba leaves the Pride Lands believing he is to blame for his father's death. He grows up learning to take things easy with new friends Pumbaa and Timon, a warthog and meerkat. Scar now rules the pride with the help of the hyenas. When Simba learns of how bad things have got in the Pride Lands he will have to decide whether to continue the easy life or fight to make things better.This film is definitely one of Disney's classics; it has a fine story, some great characters and catchy songs. Simba is a decent protagonist even if the plot demands that he isn't too strong early on and Scar is a great villain; as are his trio of hyena acolytes. Given the film's 'U' certificate I was surprised at how dark it is in places; some scenes might disturb younger viewers as characters are often in real danger. The voice cast is very impressive; notably Jeremy Irons, as Scar, James Earl Jones, as Mufasa, and Rowan Atkinson, as Zazu the hornbill who is Mufasa's majordomo. As one would expect from Disney the animation and character designs are all really good. Overall I'd definitely recommend this for all but the youngest children and adults alike."},{"username":"moonspinner55","userUrl":"https://www.imdb.com/user/ur0989035","reviewLink":"https://www.imdb.com/review/rw1592184","warningSpoilers":false,"date":"5 February 2007","rate":"6","helpful":"6 out of 17 found this helpful.","title":"Exhilarating highs--preachy, syrupy lows...","content":"Great-looking but preachy, \"uplifting\" Disney animated opus from an original story concerns a young jungle lion who has gone into a sort of self-imposed exile after blaming himself for his father's demise, soon befriended by two clowning creatures who help teach the cub about Life. Fine voice-work from Jeremy Irons, Whoopi Goldberg, James Earl Jones and Nathan Lane, many exciting and amusing moments, but nearly left sodden by a cloying, sugary song-score by Elton John and Tim Rice, with every tune underlining the \"message\" inherent in each sequence. Much of the talk is just Psychobabble 101, making the last fifteen or so minutes a chore to get through. The craftsmanship of the film's designers is really something to see, despite the fact the picture only won Oscars for its music (the score and the song, \"Can You Feel The Love Tonight\", which sounds like a commercial jingle). **1/2 from ****"},{"username":"TxMike","userUrl":"https://www.imdb.com/user/ur0438066","reviewLink":"https://www.imdb.com/review/rw0342432","warningSpoilers":true,"date":"7 September 2004","rate":"","helpful":"2 out of 4 found this helpful.","title":"Great cast and beautiful animation, plus the \"circle of life\" story make this a winner.","content":"My comments may contain some SPOILERS. I believe everyone knows the story already, but please take note, you may not want to read further if you have not seen \"The Lion King.\"The Lion King follows a formula similar to other Disney animated movies, like Tarzan and Dinosaur. An orphaned baby is raised by a strange species, the baby eventually grows up to figure out what his real role is, then fights and beats an erstwhile 'leader' to claim the 'leader of the pack.' In this movie, Simba (voiced by Matthew Broderick) is next in line for king, after his father Mufasa (voiced by James Earl Jones). But evil uncle Scar (Jeremy Irons) wants to be king, cooperates with hyenas, causes a stampede forcing Mufasa to rescue young cub Simba, Mufasa dies at the paws of his brother Scar, who then tells Simba to run, assuming the hyenas will eat him. The cub eludes the hyenas through a brier patch, but almost dies in the desert, buzzards surround him, when a weasel and his warthog come along, the warthog butts the birds out of the way, yelling \"bowling for buzzards!\"So, the unlikely pair befriend young Simba, and he grows up into a magnificent young lion, spitting image of his dad. (The young Dinosaur had been raised by lemurs, the young Tarzan by apes, similar themes.) Meanwhile Scar as king causes all the animals but hyenas to leave, their home becomes a desolate wasteland. Simba is lured back by his \"duty\" after seeing an image of dad in the clouds, challenges Scar, mates with his cub hood girlfriend, and a new cub is presented. \"The circle of life.\" Symbolically, the moment Scar is chased away, rains begin, their homeland will become restored to its former glory, with Simba as king!"},{"username":"dbdumonteil","userUrl":"https://www.imdb.com/user/ur1219578","reviewLink":"https://www.imdb.com/review/rw1439464","warningSpoilers":false,"date":"5 August 2006","rate":"","helpful":"2 out of 4 found this helpful.","title":"King of the nineties!","content":"This is my favorite Disney movie in the nineties.I particularly dig the lines:-You're so weird uncle Scar!-You have no idea!Jeremy Irons lends his voice to the best villain in a Disney cartoon since Maleficent in \"Sleeping Beauty\" !It was reportedly inspired by \"Hamlet\" but who cares?All the characters are memorable,and the stampede is one of the Mouse House's finest achievements.Hats off to Elton John ,whose songs (circle of life\" \"can't youfeel the love tonight\") are perhaps the best since \"Snowwhite\".can appeal to children and adults."},{"username":"Quinoa1984","userUrl":"https://www.imdb.com/user/ur0453068","reviewLink":"https://www.imdb.com/review/rw0342243","warningSpoilers":false,"date":"1 January 2000","rate":"10","helpful":"426 out of 497 found this helpful.","title":"The Best Animated Film I Have Ever Seen","content":"The Lion King is a great film. Along with a great story (inspired by William Shakespeare's Hamlet), terrific animation, and an all star cast of voices, there are the lessons that are learned from this film (despite being a little rough for the younger children). Like responsibility and honor.I rank this animated film among the great films I have ever seen. It was part of my childhood and it is a film experience I will never forget. And hopefully, you won't either. A++"},{"username":"tavm","userUrl":"https://www.imdb.com/user/ur11228318","reviewLink":"https://www.imdb.com/review/rw2492310","warningSpoilers":true,"date":"22 September 2011","rate":"9","helpful":"3 out of 4 found this helpful.","title":"Finally, I got to experience The Lion King where it's meant to be and in 3-D, to boot!","content":"While I had previously seen long segments various times on VHS and theatre showings and was able to piece together the whole story that way, this was the first time I had watched the entire thing in one showing on a big screen and in 3-D, to boot! In short, it was a wonderfully magical time just seeing such a classically made drawn animated movie by the best artists Disney had to offer with great music and songs by Hans Zimmer, Elton John, and Tim Rice and perfect voices provided by James Earl Jones, Madge Sinclair, Rowan Atkinson, Whoopi Goldberg, Cheech Marin, Matthew Broderick, Robert Guillaume, Jeremy Irons as the villainous Scar, and especially, Nathan Lane and Ernie Sabella as the great comic relief of Timon and Pumbaa! If there was one slight flaw, it's that how stupid was Scar to reveal his role in killing his brother just as nephew Simba was at death's door. But it did provide Simba to get over himself quickly so maybe that was necessary. Otherwise, The Lion King is one of the greatest experiences I've had at the movies. P.S. If you don't stay for the closing credits and had wondered where the dedication to the late Disney head Frank Wells, previously printed before the film, had gone to-it's now at the very end."},{"username":"studioAT","userUrl":"https://www.imdb.com/user/ur23359813","reviewLink":"https://www.imdb.com/review/rw2357401","warningSpoilers":false,"date":"23 December 2010","rate":"7","helpful":"1 out of 2 found this helpful.","title":"Pure Disney magic","content":"Disney pull off another magical film with The Lion King. From great characters to superb music this film has it all. Despite telling a simple story Disney capture all the features and elements that make their films so beloved and loved. The voice cast is right on the money and the sentiment that can often cloud this type of film is subtle and emotional. If ever there was a Disney film that perfectly captured the spirit of pure family entertainment it was this one.This film was a huge success for Disney and catapulted them back to the top of their game which judging by this film is exactly where they deserve to be."},{"username":"Calicodreamin","userUrl":"https://www.imdb.com/user/ur29385135","reviewLink":"https://www.imdb.com/review/rw7529472","warningSpoilers":false,"date":"9 November 2021","rate":"10","helpful":"3 out of 5 found this helpful.","title":"The king has returned","content":"The best Disney movie ever made. The story is heartfelt, the animation beautiful, and songs fun. The lion king is a childhood favorite and I can't think of a way it could be better."},{"username":"bevo-13678","userUrl":"https://www.imdb.com/user/ur76062573","reviewLink":"https://www.imdb.com/review/rw5590771","warningSpoilers":false,"date":"30 March 2020","rate":"10","helpful":"2 out of 2 found this helpful.","title":"Lions","content":"Great movie. Great sounds track and some very realistic fight scenes"},{"username":"grantss","userUrl":"https://www.imdb.com/user/ur2860723","reviewLink":"https://www.imdb.com/review/rw3006123","warningSpoilers":false,"date":"28 April 2014","rate":"5","helpful":"4 out of 11 found this helpful.","title":"Cheesy and predictable, but has its moments","content":"Cheesy and predictable movie, but has its moments. Pretty standard plot, which, but for a few minor detours, can be foreseen from start to finish. Some of the detours are quite interesting though.The humour is mostly quite child-orientated and lame, but there are a few good lines.While most stuff is dumbed-down for kids, there are some decent edgier scenes. Most of Scar's scenes were worth watching. Basically the story was so syrupy-sweet, you got to support the bad guy (even the plot is so predictable you know it won't end well for him).Making it a semi-musical didn't help either. I dislike musicals intensely (though there are a few exceptions): all the music serves is to pad out the movie.Star-studded cast for the voices: Matthew Broderick, James Earl Jones, Jeremy Irons, Nathan Lane, Rowan Atkinson, Whoopi Goldberg, Cheech Marin. Pick of the bunch was Jeremy Irons as Scar - suitably evil voice, with gravitas.A kid's movie, and nothing more."},{"username":"Boba_Fett1138","userUrl":"https://www.imdb.com/user/ur1416505","reviewLink":"https://www.imdb.com/review/rw0342420","warningSpoilers":false,"date":"26 June 2004","rate":"9","helpful":"4 out of 5 found this helpful.","title":"An impressive animated movie.","content":"\"The Lion King\" is and will always will be regarded as one of the better Disney movies. And it deserves that!First of all the movie looks visually splendid! The African land scape's are beautiful and so are the animations of the animals itself.What makes \"The Lion King\" such a special movie is the emotional dept the story has. The story plays a significant role in the movie and it has some good adult moments. The entire movie has a more of an adult feeling, unlike earlier made Disney's that mainly focused on only young children. Still there also is plenty to enjoy for the young ones, especially the characters Timon and Pumbaa shall be loved by them.The story is filled with symbolism and reference to mainly the communist regime.The voice cast is good, mainly of course thanks to James Earl Jones who has an amazing good deep voice. Also the three hyenas are voiced perfectly by Whoopi Goldberg, Cheech Marin and Jim Cummings. Jeremy Irons who voices the main villain Scar really brings his character to live and makes the movie even more worth watching.There are some typical Disney songs that are good. Also surprising good is the musical score itself composed by Hans Zimmer who also received an Oscar for it. His first and only one but hopefully not his last. Also Tim Rice and Elton John received an Oscar for the song \" Can You Feel the Love Tonight\" and were nominated for two other songs from this movie.A must see animated movie with some scene's and songs that you'll not easily forget.9/10http://bobafett1138.blogspot.com/"},{"username":"TBJCSKCNRRQTreviews","userUrl":"https://www.imdb.com/user/ur2093818","reviewLink":"https://www.imdb.com/review/rw1811884","warningSpoilers":false,"date":"1 February 2008","rate":"8","helpful":"1 out of 4 found this helpful.","title":"Another of the Disney greats","content":"I've just watched this with the original voices, for the first time. Why is that, you ask, when there has been a purchased VHS copy of the film in my possession since around the time it was first released? The simple fact is that here in Denmark, we dub... anything that's made for children, or is considered \"family entertainment\"(which is really just a word used to mask that something is made for kids, enough so that the teenagers and possibly some of the adults won't make a run for it the moment the suggestion of viewing it is said out loud before the family members). I'm not really in favor of it, I prefer the originals(sub, don't dub... the voice is one of the tools that an actor has, the sound a major part of a film, and through that, the director's work, and the actors and crew, for that matter), but hey, at least we're not France or Germany(good luck watching *anything* on German television that isn't in German, regardless of whether they made it or not). For that reason, the voices were some of what I noticed the most, along with the original dialog and lyrics to songs. Jonathan Taylor Thomas isn't bad at all. Broderick does good, though were it not for the animated form of his character, I'm not sure he would come across as strong as he does when he needs to... seriously, who could ever be scared of him? Of course, it could be the roles he seems to play often. Marin, Goldberg and Cummings make good hyenas. Irons is great. Guillaume(try spelling *that* three times fast) is marvelous. I didn't personally care much for Atkinson, but hey, I've always preferred his Blackadder(in particular after the first season/show) to his Mr. Bean(a character I don't find funny), and this is clearly done after the latter, not the former. Fans of Bean may very well enjoy the character(much like how Robin Williams fans might enjoy at least his part in Aladdin), and he's not the only one(not only for this Disney film, either) who bears strong similarities to their character, to the point where in many cases, it would seem(and sometimes they even say so) that the animators and such based the look and mannerisms on the actual actor/performer. I saved what may very well be the best for last... James Earl Jones. What can I say? The man almost invariably(in anything he appears in) has an undeniably commanding presence, and that is arguably mainly due to his voice, so casting him was a smart choice, and it pays off. The plot is well-written. The animation is quite good, with a bright, varied, colorful palette, and lively movements both in the camera and in the players. I didn't find this as energetic or funny as Aladdin, but it was still enjoyable. The music is magnificent, Can You Feel The Love Tonight is a fantastic song, and it's not the only one in the feature(to which that adverb can be applied). The DVD has some marvelous material, including music videos, a few deleted bits, some games(one of which isn't half bad), a Virtual Safari and featurettes regarding... just about everything you could imagine, regarding the film, including the stage production based off it, the music in it, even the animals. I recommend this, and its DVD release, to fans of the Disney animated musicals, and/or of any or more of the actors. 8/10"},{"username":"evanston_dad","userUrl":"https://www.imdb.com/user/ur4532636","reviewLink":"https://www.imdb.com/review/rw2039025","warningSpoilers":false,"date":"17 March 2009","rate":"9","helpful":"3 out of 4 found this helpful.","title":"The Last Great Hand-Drawn Animated Film from Disney","content":"Throughout the early 1990s, Disney animation appeared to be unstoppable. \"The Little Mermaid,\" \"Beauty and the Beast,\" \"Aladdin\" and \"The Lion King\" in quick succession had set a new standard for animation. Unfortunately for Disney, \"The Lion King\" would be its last hurrah for a while, or really for good. Pixar would soon pick up the torch, and now Pixar is king of the jungle.But as for \"The Lion King\".......\"Beauty and the Beast\" is probably my favorite Disney animated film, but this one is a close second. It's the darkest and most ambitious and it's got superb animation. The song score by Elton John is the weakest in the above-mentioned string of films, but the orchestral score by Hans Zimmer is the best. The film doesn't shy away from the savagery of the natural world, or the difficult emotions surrounding life and death, and for that I applaud it.Grade: A"},{"username":"neil-476","userUrl":"https://www.imdb.com/user/ur7813355","reviewLink":"https://www.imdb.com/review/rw2396628","warningSpoilers":true,"date":"10 March 2011","rate":"8","helpful":"5 out of 9 found this helpful.","title":"Not quite there for me","content":"The Lion King is unquestionably a first rate animated film - my daughter counts it as one of her favourite films of all time (and pinched my copy of the DVD when she left home!). But something about it doesn't quite work for me.The story is excellent, and I love the way that Simba's story is effortlessly tied in to the (non-preachy) circle of life broader picture.The voice talent is all excellent, character design and animation first class, the emotional high (and low) points are all reached as planned.Maybe it's the songs. I like Hans Zimmer's score, but I must confess to not liking all of Elton John's songs (particularly The Circle Of Life itself).And maybe it's just because I am becoming a grumpy old curmudgeon. Because, without any doubt, it is an absolute classic children's film.Edited 10 October 2011 after seeing 3D version at the cinema.Am I correct that this reworking is the first full-length 3D film using traditional drawn animation? Whether it is or not, it is a terrific conversion: it adds an element of visual majesty to a film which is already very good."}],"errorMessage":""}