{"imDbId":"tt0133093","title":"The Matrix","fullTitle":"The Matrix (1999)","type":"Movie","year":"1999","items":[{"username":"MartinHafer","userUrl":"https://www.imdb.com/user/ur2467618","reviewLink":"https://www.imdb.com/review/rw4070412","warningSpoilers":true,"date":"22 February 2018","rate":"7","helpful":"39 out of 221 found this helpful.","title":"Too much action, too many stunts...yet still an interesting story idea.","content":"There are currently almost 2800 reviews on IMDB for this film....and so what I have to say about the movie really isn't all that important. It also is one of the highest rated films ever on IMDB. And, so much has been said about the film, I think I'll be rather brief.The plot involves a guy who learns that nothing be sees or does is real...and that the world is nothing like anyone thinks. This is because in the dystopian future, machines keep folks in pods and they live out their lives in a phony existence.The film's story is interesting...and very existential. I like that aspect of it very much. But the film has a weakness for me and I am sure some other folks might feel the same way...there is just too much action. The film is one scene after another after another--with lots of action, violence and CGI...so much that it boggles the mind. For me, that left me rather tired when the film was over. I liked it...but I also didn't want any more and can't see me watching any of the sequels."},{"username":"TheLittleSongbird","userUrl":"https://www.imdb.com/user/ur20552756","reviewLink":"https://www.imdb.com/review/rw3642963","warningSpoilers":false,"date":"20 February 2017","rate":"9","helpful":"39 out of 49 found this helpful.","title":"A sci-fi action thriller milestone","content":"'The Matrix' may not be one of the very greatest examples of its genre (like '2001', 'Metropolis', 'Blade Runner', 'Back to the Future', 'Star Wars Original Trilogy', 'Alien' and 'Aliens'), but that it is revolutionary in how its visuals and use of sound broke boundaries like had never been done before cannot be denied.It is not a film to be seen if people want character depth or relationship depth, with the forced and underdeveloped love subplot between Neo and Trinity being 'The Matrix's' sole weak spot. This ended up not being that huge a problem for me because everything else is so well executed.Particularly striking about 'The Matrix' is its production values. Simply put, the film looks amazing in its audacious production design, dazzling special effects that are some of the most ultra-cool and imaginative to exist, super slick editing and often jaw dropping cinematography. So much more than a film with ground-breaking special effects and use of camera work that broke boundaries.Use of sound was also striking, and how the pulsating and hypnotic music score was used. Andy and Larry Wachowski direct adeptly, while the script is an intelligent mix of complex and well-explored themes, mysticism, philosophy and even Lewis Carroll and the story is often invigorating and intensely taut with a smart concept brilliantly done.Action is superbly shot and edited, and the way it is choreographed is relentlessly intense and breathless in its energy, Kung Fu has rarely been more vertigo-inducing (despite how this sounds, this is not a bad thing as it added hugely to the intensity and paranoia of the story's atmosphere) on film.Keanu Reeves is in one of his best and most iconic roles and has never looked cooler, certainly has not looked this comfortable for a while before then. Carrie Anne Moss is strong. Even better are an imposingly charismatic Laurence Fishburne (also in one of his best roles), an amusing Joe Pantoliano and a deliciously wicked Hugo Weaving.Summing up, not one of the best of the genre but a mile-stone nonetheless and a great one. Followed by two sequels, both nowhere near in the same ball-park. 9/10 Bethany Cox"},{"username":"Leofwine_draca","userUrl":"https://www.imdb.com/user/ur0482513","reviewLink":"https://www.imdb.com/review/rw3532424","warningSpoilers":true,"date":"26 August 2016","rate":"9","helpful":"15 out of 22 found this helpful.","title":"Effects-fuelled sci-fi extravaganza","content":"What is THE MATRIX? Well, let me tell you: it's a crowd-pleasing science fiction adventure, which took audiences by surprise as it came out of nowhere and totally destroyed the year's other big sci-fi epic, THE PHANTOM MENACE. The reason for its success is quite obvious when you look at it. The film isn't just about special effects, although they do play a big part; it also has a rather complex and classic sci-fi set up. While STAR WARS was all bad special effects and little else, THE MATRIX is all good special effects and a lot more besides.Okay, so there are some obvious flaws: a lack of originality for one; the real futuristic world looks like something out of BLADE RUNNER and there are bits out of DARK CITY thrown in too. The story, too, once it has been set up, is dropped in favour of some increasingly outlandish action sequences. But when these action scenes are fantastic, then you just don't care. After all, I watch a film to be entertained, and fighting and explosions are the simplest source of entertainment around.The actors and actresses in the film are all okay, although you have to wonder if Carrie-Anne Moss was picked simply because she looks good in PVC. No matter, as it's left to Keanu Reeves in his best role for some time, to carry the film. While he may not be much of an actor (the sheer awfulness of his performance in BRAM STOKER'S Dracula is hard to forget), he just about manages to make his role as a mild-mannered computer operator who becomes a heroic saviour believable. Thankfully, there is some heavyweight support from Laurence Fishburne as the imposing leader of the rebels, and a wonderfully villainous performance from Hugo Weaving as the slimy villain. The costumes are great too - stylish leather and sunglasses making up the main attire.The film is not really about acting, though, or story. It's the special effects which make this, well, special. Without them, it would just be another average tale, but these CGI effects are truly outstanding, even on the small screen. For once, they do fit into the context of the story as well, as they are computer effects in a computer generated world. THE MATRIX has brilliant CGI, and has to join the ranks of TERMINATOR 2, JURASSIC PARK, and INDEPENDENCE DAY as a film which really sets the ever-changing standard on which all other films are to be based.Bullets fly in slow-motion, leaving trails in the air; characters can spin in the air, climb walls and jump huge distances; computer-generated villains morph into other people at will, fights are impossibly fast. Indeed, it is the fight scenes which are the most memorable, as they come across as a hybrid of the classic kung fu genre and the very best of style master John Woo. The best moments are the Fishburne/Reeves training fight, the moment where Reeves takes on Agent Smith in a subway, and the lobby shootout where plaster literally flies everywhere. You also have to love the ending, where Reeves finally wins over the baddies and manages to stop bullets mid-flight with his bare hand. A great image, just one of loads in this great film which has to be one of my favourite sci-fi films of the decade."},{"username":"SnoopyStyle","userUrl":"https://www.imdb.com/user/ur2898520","reviewLink":"https://www.imdb.com/review/rw2901955","warningSpoilers":false,"date":"9 November 2013","rate":"9","helpful":"13 out of 19 found this helpful.","title":"Ultra cool sci-fi","content":"The Wachowski brothers have created one of the more interesting sci-fi world. Neo (Keanu Reeves) is a computer hacker who has a nagging intuition that the world is wrong. He is literally Alice who goes down the rabbit hole and finds his world is actually Wonderland. It marries Lewis Carroll with HongKong Kung Fu wirework and the back trenchcoat. They invent bullet time and amp up the cool factor in gun fights.The story borrows heavily from a lot of different sources. Machines have taken over. The world is a computer construct. People fight using computer avatars. These are all ideas that have been done before. The Wachowskis have weaved it all together into a functional tapestry.But it is ultimately the cool visuals that makes this movie unique. For a relatively lower big budget, the production value is incredible. They have squeezed every movie magic out of all the visual and computer effects."},{"username":"Hitchcoc","userUrl":"https://www.imdb.com/user/ur0278527","reviewLink":"https://www.imdb.com/review/rw5071966","warningSpoilers":false,"date":"20 August 2019","rate":"9","helpful":"17 out of 23 found this helpful.","title":"Wow! I Finally Saw It!","content":"This is one of those movies that \"everyone\" has seen, except me. I tried to watch it with some friends about fifteen years ago, but they had two kids under five years old and I was only able to ingest it in five minute increments. So a friend lent me the video and I finally got a chance to see it. It's a pretty remarkable film. The premise of an alternative reality works here where it often fails. Keanu Reeves is a sort of messiah, not by his own choosing originally. He has been attacked and abused by men in sunglasses whom, we find out later, are a part of a representation of Artificial Intelligence. The side Neo ends up on are the original humans whose ranks have been nearly driven to extinction. Laurence Fishburne is the leader of the rebels and he believes the the Reeves character is \"the One.\" I thoroughly enjoyed it but would have like a little more creative final scene. Too many shell casings. Apparently, weaponry didn't advance much in twenty years. But, it keeps one on edge with its special effects and its non-stop action."},{"username":"Kirpianuscus","userUrl":"https://www.imdb.com/user/ur61197531","reviewLink":"https://www.imdb.com/review/rw3615776","warningSpoilers":false,"date":"8 January 2017","rate":"","helpful":"28 out of 33 found this helpful.","title":"a masterpiece","content":"and this is all. because each explanation sounds wrong. sure, the acting,, the plot, the fight/action scenes are great. maybe unique. but the essence, for me, remains the basic idea . a fake reality against the pure truth. and the magic as clothes of each character. because it is more than a film. it is a revolution in the way to see a film and to discover reality. you are Neo. and the mythological mix of symbols and cultural references and the simple story who seems have more and more levels are more than fascinating - it is real. sure, Matrix has a lot of reviews and around it is very easy to say hypothesis, verdicts, opinions or, maybe, critics. it is enough to say it is a masterpiece. or the perfect fascinating fairy tale."},{"username":"Horst_In_Translation","userUrl":"https://www.imdb.com/user/ur3914439","reviewLink":"https://www.imdb.com/review/rw3132774","warningSpoilers":true,"date":"29 November 2014","rate":"6","helpful":"17 out of 110 found this helpful.","title":"Good? Yes. Groundbreaking? Not really.","content":"15 years ago, back in the 20th century, the first of so far three Matrix films was released. It runs for roughly 2 hours and 15 minutes and was directed by the Wachowski brothers Andy and Lana (still Larry back then). The film stars Keanu Reeves with supporting performances by Carrie Anne Moss, Laurence Fishburne and Hugo Weaving.I cannot say I didn't enjoy this film as I really liked it to some extent, but I was not wowed either, maybe because science fiction is not exactly my favorite genre. My biggest problem was possibly Reeves in the lead role. I just fail to see him as a guy who brings the necessary toughness for his character here and in any other action movie. All this praise about him being the chosen one made me cringe occasionally. The dialogs about him being so grand were sometimes downright cheesy and same goes for the explosions coming with the final kiss between Reeves' and Moss' characters. Another criticism I had was the Oracle being wrong. She was presented as a know-it-all authority and in the end her prediction is simply disregarded with the explanation, Neo has to find his way and then he is the chosen one if he chooses to be. Oh and the song during the closing credits did not match my taste at all.What I did like about the film were basically all the supporting players, especially Fishburne and Moss also. The helper-turned-villain was creepy in his big scene and Weaving was a revelation. His antagonist really makes the film and the film was at its best during the scenes he was in. The camera shot with Weaving before the subway train runs over him was certainly the best shot of the movie, maybe the whole trilogy. His parallel on humans being the real virus of the planet makes you wonder too if he is maybe right. Other than that, I liked the pill reference from \"Alice in Wonderland\" early on and the green code on black ground is certainly memorable and immediately associated with this film.Finally, I would like to say that I recommend this movie, especially to sci-fi lovers although they probably have seen it already anyway. It is not a film I really want to rewatch anytime soon, but it starts okay and gets better during the second half. I don't think the second and third Matrix films are much worse, but that is maybe because I don't consider the first a masterpiece. All three are solid. \"The Matrix\" won four technical Academy Awards, all four categories where it was nominated. It's no \"Return of the King\", but still an admirable achievement."},{"username":"Prismark10","userUrl":"https://www.imdb.com/user/ur4569900","reviewLink":"https://www.imdb.com/review/rw3440977","warningSpoilers":false,"date":"28 March 2016","rate":"7","helpful":"14 out of 35 found this helpful.","title":"Life in reality","content":"What made The Matrix special was the groundbreaking visual effects such as 'Bullet Time' that have been often imitated in other films and video games. The Wachowski's simply knocked it out of the park when it came to the visuals.Keanu Reeves is Mr Anderson an ordinary computer programmer by day and secret hacker called Neo at night who is suddenly pursued by government agents led by a sinister Agent Smith (Hugo Weaving) after he is contacted by computer hacker Morpheus (Laurence Fishburne.)Morpheus believes Neo is the 'One.' Humans lives in a false reality that controls humans and Neo will lead the harvested humans to rebel against the machines creating the false reality.The film mixes cyberpunk science fiction with Hong Kong style martial arts and elements of Japanese manga type animation as inspiration.Keanu Reeves is in his element in a world where he does not understand what is around him. He looks cool and does well in the martial arts sequences. I guess revisiting this genre made up for the failure of Johnny Mnemonic.Laurence Fishburne is even more cooler as Morpheus guiding Neo in this hostile new reality and how to take down the system. Carrie-Anne Moss is kick ass sexy in black leather as Trinity who displays superhuman powers.The film has philosophical underpinnings as the Wachowski's ask us to think about the world around us and our place within it.The subtext of the film can be re-analysed in light of the personal journeys of the Wachowskis. Change and transformation. It is laughable to see the right wing attempting to co-opt the movie for their own agenda.The film is cool, it is hip but I felt slightly too long and little bit too po faced. However the Wachowskis did manage to catch lightning in a bottle which they did not manage to do with the following two sequels."},{"username":"bob the moo","userUrl":"https://www.imdb.com/user/ur1002035","reviewLink":"https://www.imdb.com/review/rw0510974","warningSpoilers":false,"date":"20 June 2002","rate":"","helpful":"13 out of 26 found this helpful.","title":"Perfect sci-fi, great action and perfect plot for the internet loser generation (like me!)","content":"Neo is a computer programmer by day and a internet hacker by day. When he is approached by the shadowy terrorist Morpheus he chickens out and gets caught by the secret police. However later Morpheus grabs him again and shows him the truth \u0096 that his life is a virtual reality provided by computers while his body, and the bodies of all other humans are harvested in pods for energy. Morpheus believes that Neo is the one who will bring down the matrix and return humans to the planet's surface, however the computers seek to kill the small group of humans who exist outside of the pods. Neo learns to control the matrix to battle the computers.Has anyone not seen this? The plot is a perfect set-up for all teenagers who believe their dull lives must be fake and that they can be a gun battling hero. That's the story of Neo and it's well told \u0096 we have Neo in the matrix, Neo getting trained by Morpheus and then returning to battle the computer drones. The story is involving and the effects make it totally convincing. The plot is clever and never totally falls into action for action's sake. Although the first half is far superior is better than the second which does tend to give into the rules of Hollywood excess.The action is fantastic. After so many spoofs and rip-offs of the effects and martial arts (Charlie's Angels etc) it's easy to forget how amazing it was when it was first done here. Here it is done well and isn't treated like a joke like it was in Charlie's Angels. The plot being set in the matrix means we can accept the effects as part of a VR creation and take them seriously without thinking they are OTT. The only thing is that the action is so attractive that it's almost sexy \u0096 but should we find two trench coating wearing people walking into a building and killing dozens attractive?That aside it's cool to see wire work put into Hollywood movies (and done well too). Reeves is cool and is suited to the role. Fishburne is even better \u0096 how does he keep those glasses on? Carrie Anne Moss is good but falls into the role of love interest later on. Pantoliano is good and Weaving is slimy as one of the computer sentinels.The plot is good and opens itself to a nice religious interpretation that isn't very well hidden. Neo is `the one' who has come to save mankind, Trinity is a character etc etc. How this sits with the violence is anyone's guess but it makes it quite a nice distraction.Overall this is very enjoyable and very well scripted. The only down side is that the fantastically choreographed fights and gun battles really glamorise violence to a worrying degree. However if you're watching an action movie then that's what you accept otherwise don't watch. For me \u0096 I can't wait for the sequels."},{"username":"kosmasp","userUrl":"https://www.imdb.com/user/ur5876717","reviewLink":"https://www.imdb.com/review/rw2099436","warningSpoilers":false,"date":"21 July 2009","rate":"9","helpful":"3 out of 8 found this helpful.","title":"Blender","content":"The Wachowsky Brothers took many elements, from different cultures, that they liked, put them in a blender and mixed them together. And the Matrix is what came out. A great sci-fi movie, that has many elements from other movies (and a theme we have also seen in horror movies), put well together.While I'm not a big Keanu Reeves fan, he does convince here (as he did in Speed). So while he is in action territory, there is always fun to be had with him. Carrie Ann Moss and Laurence Fishburne have great supporting roles, although of course it is more stylish adventure than anything else. And while the movie leaves quite a few questions open you might have, it works for the movie, being only told a minimum amount of plot. The Keanu Reeves character acts as the viewer as he is thrown in an unknown world. Being baffled and stunned by the whole thing, this might be the reason his casting works so good ...Apart from that, the action is amazing (Yuen Woo-Ping, very well known for his Asian/martial arts choreography's), the set pieces and the dystopia feel of the movie is pretty convincing ...Edit: the above review is from 21 July 2009 - before I went to watch the new (fourth) installment in this ... triolgy (?), I revisited the Matrix - Matrix revisited - to use the Matrix title name game. I stand by what I have written above. The cultural impact the movie had is enormous and that is putting it mildly. Back then nobody knew the brothers would become sisters, but I don't think that should play a role on what I wrote or what you think about the movie.If you watch it under that aspect and also including the rumor that the Neo character was supposed to also be female at certain realities (or worlds) - also considering how Trinity is more centred and more masculine in a sense .. and how some feel that the connection between Neo and Trinity is more like a brother and sister energy ... well in hindsight there may have been some things we could ascribe to the siblings Wachowski ... quite a few to be honest. Which might bring us to the whole Luke and Leia thing ... but let's not get too psychological here.As written above, I do not feel that Keanu Reeves is the strongest \"actor\". That being said, he is more than a cool Dude. Although even in this and having seen it a few times now, he does play quite the intriguing fool. No pun and no offense intended. Even a character tells him that he sure isn't the brightest. Again that is about the character he portrays and is not meant to describe Keanu or his intellectual abilities.The Matrix changed the game ... it was also the driver for the then new format, called DVD. It would have been quite something if the new Matrix would have made the 4k discs popular ... but you can't capture lightning in a bottle twice. More on this on the new films page though. This has its flaws for sure (inner logic and all that), but overall it is more than a winner. Bullet time, Hugo Weaving, Laurence Fishburn ... and the philosophical questions combined make for a great cocktail ... after they've been put in the blender with many other ingredients of course ... and the circle is completed once again."},{"username":"classicsoncall","userUrl":"https://www.imdb.com/user/ur2707735","reviewLink":"https://www.imdb.com/review/rw2493539","warningSpoilers":true,"date":"25 September 2011","rate":"9","helpful":"3 out of 6 found this helpful.","title":"\"...there's a difference between knowing the path... and walking the path\".","content":"I saw this movie when it first came out, and can't really grasp the idea that an entire decade has gone by since then. Watching today, it still holds up as an exciting sci-fi action thriller, with effects that still look relatively new even though many of them have been copied and even parodied since. I have to admit, time travel, dream stories and virtual reality films can leave you with your head hurting a bit, but if you watch this one attentively, you'll find that it was cleverly written leaving very little wiggle room for plot holes to creep through.Essentially, 'The Matrix' is a computer generated dream world which replaced the 'real' world that was destroyed at some point during the twenty second century in a battle between humans and an artificial intelligence. The AI won, and subsequently created an entire race of machines feeding off the living energy of humans kept alive in a state of suspended animation. The very few humans still alive wait for the day that 'The One' will destroy the Matrix and free those under it's control. To protect itself, The Matrix has created a race of machines called Sentinels who track down humans, be it in the real world or in The Matrix itself. This can all get a little confusing, so it's best to take this all in with no distraction, because things move back and forth between the two realms rather quickly.If you really want to take the concept of the picture a step further, there's plenty here to dissect and analyze. For some, the religious and philosophical elements conveyed by The Matrix and The One are quite overt. One of the immediate thoughts that struck me was the parallel of The Matrix to The Force in \"Star Wars\", an eternal and universal life energy that unites all living creatures. The One can be interpreted as The Savior, the Redeemer of Mankind who will set all of humanity free from the curse of original sin, or in this case, the slavery of the pods. I guess if you're skeptical of this philosophic/religious connection, this will all be a lot of mumbo-jumbo, but to me it's a lot more interesting to look at it that way than just seeing a bunch of special effects involving insane martial arts moves and time stopping bullets in flight.What I didn't care for so much was the make up of the Sentinels, not the human ones but the machines. Personally, I thought Hugo Weaving was great as Agent Smith in his relentless pursuit of Neo. But the idea of those squid-like battle ships attacking the Nebuchadnezzar seemed to defy a certain logic. Wasn't Zion, the last human city located underground? The concept of The Oracle also catches one a bit off guard as well. I mean, my idea of an Oracle, who was supposed to know everything about The Resistance since the beginning, wasn't exactly that of an old woman who smokes cigarettes and bakes cookies. This introduction of a bit of whimsy might have been intriguing to the Wachowski Brothers, so if that's the case, I guess I can go along with it.Anyway, I like the idea of The Matrix and I like the movie. I can't say as much about the sequels, and it's been some time since I've seen those as well. I'll get around to them again eventually."},{"username":"lee_eisenberg","userUrl":"https://www.imdb.com/user/ur4888011","reviewLink":"https://www.imdb.com/review/rw1198251","warningSpoilers":false,"date":"21 October 2005","rate":"8","helpful":"7 out of 23 found this helpful.","title":"Watch the original, but not the sequels.","content":"When \"The Matrix\" first came out, it looked like another cheap action flick, but turned out to be quite good. The premise suggests that everything that we see in life is false, and that we're all prisoners of something called the Matrix. So, software designer Thomas \"Neo\" Anderson (Keanu Reeves) is hired by rebel Dr. Morpheus (Laurence Fishburne) to break away from society. Lots of impressive things ensue.\"The Matrix\" was overall a good movie, but would have been better without all the violence. Still, the movie's a classic, with great support from Carrie-Anne Moss, Hugo Weaving, and Joe Pantoliano. Avoid the ridiculous sequels."},{"username":"jboothmillard","userUrl":"https://www.imdb.com/user/ur4248714","reviewLink":"https://www.imdb.com/review/rw1109674","warningSpoilers":true,"date":"23 June 2005","rate":"10","helpful":"11 out of 39 found this helpful.","title":"The Matrix","content":"This is considered by many to be a milestone of movies, that pushed the boundaries of imagination and digital-effects technology further, and I'm very happy I watched it to confirm this status, written, produced and directed by the Wachowskis (Bound, Speed Racer, Cloud Atlas). Basically, in an abandoned hotel in a major city, Trinity (Carrie-Anne Moss) is cornered by the police but overpowers them with superhuman abilities. He is chased whilst fleeing by the police and a group of black suited Agents, with similar superhuman abilities. She escapes by answering a ringing phone in a public telephone booth and vanishes. Computer programmer and hacker Thomas Anderson, known by his alias \"Neo\" (Keanu Reeves), is confused by repeated online encounters with something called \"the Matrix\", and seeing the phrase \"Follow the White Rabbit\". He is approached by Trinity in a rave bar, she tells him he is in great danger, that they are watching him and that he is searching for answers, particularly to the most important question of all: what is the Matrix? The following morning, at Neo's job at Metacortex, a leading software company, a team of Agents and police, led by Agent Smith (Hugo Weaving), arrive searching for him. Neo is contacted by Morpheus (Laurence Fishburne), an infamous hacker, who attempts to guide him to safety, but he surrenders rather than risking his life trying to escape. The Agents attempt to coerce Neo into helping them locate Morpheus, who they claim is a terrorist. When Neo refuses, the agents fuse his mouth shut and implant a robotic \"bug\" in his stomach. Neo awakens believing that he had a nightmare. Soon after, Neo is taken by Trinity to meet Morpheus, and she removes the bug from Neo, proving what he experienced was real. Morpheus offers Neo a choice between two pills: the blue pill will return him to his former life, the red pill will reveal the truth about the Matrix. Neo chooses to take the red pill, his reality begins to distort, and he awakens in a liquid-filled pod among countless others, containing other human beings. He is then brought aboard Morpheus' flying ship, the Nebuchadnezzar. As Neo recuperates from a lifetime of physical inactivity in the pod, Morpheus explains the situation: a war broke out between the human race and intelligent machines in the early 21st century, when the humans blocked the machines from accessing solar energy, the machines responded by capturing humans and harvesting their bioelectric power with their minds being trapped in the Matrix, a shared simulation of the real world that existed in 1999. The machines won the war, and the remaining free humans took refuge in the underground city of Zion. Morpheus and his crew are a group of rebels who hack into the Matrix to \"unplug\" enslaved humans and recruit them, and the Matrix's simulated nature allows them to bend its physical laws. Morpheus warns Neo that death within the Matrix would mean death to a real physical body, that the Agents are sentient programs that eliminate threats to the system, and, in the real world, machines called Sentinels are hunting the rebels. Morpheus virtually trains Neo with everything that is possible within the understanding of the Matrix, from kung fu fighting to firing weapons. Neo displays great ability and skill, cementing Morpheus' belief that he is \"The One\", a human prophesied to free humankind. The group enters the Matrix to visit the Oracle (Gloria Foster), the prophet who predicted that the One would emerge. She implies to Neo that he is not the One and warns that he will have to choose between Morpheus' life and his own. Before they can leave the Matrix, Agents and police have been tipped off by disgruntled crew member Cypher (Joe Pantoliano). He has tipped off the Agents to ambush the group in exchange to return to a comfortable life back in the Matrix. Morpheus buys time for the others by fighting with Agent Smith and is captured, while Mouse (Matt Doran) is shot to death. Cypher exits the Matrix and murders crew members Apoc (Julian Arahanga) and Switch (Belinda McClory), while they are unconscious and connected. Before he can kill Neo and Trinity, crew member Tank (Marcus Chong) regains consciousness and kills Cypher before pulling Neo and Trinity from the Matrix. The Agents interrogate Morpheus to gain the access codes to the mainframe computer in Zion, which would allow them to destroy it. Neo is determined to return to the Matrix to rescue him, as the Oracle prophesied; Trinity insists she goes with him. While rescuing Morpheus, Neo gains confidence in his abilities, performing feats comparable to those of the Agents. As Morpheus and Trinity safely exit the Matrix, Smith ambushes and kills Neo. While a group of Sentinels attack the Nebuchadnezzar, Trinity confesses her love for Neo and says the Oracle told her she would fall in love with the One. Neo is revived with newfound abilities to perceive and control the Matrix, he then leaps into Smith's body and causes him to explode, while the other Agents flee. He makes it out of the Matrix just as the ship's EMP (electromagnetic pulse) is activated and disables the attacking Sentinels inside the ship. Back in the Matrix, Neo makes a telephone call, promising the machines that he will show their prisoners \"a world where anything is possible\". He hangs up and flies away. Also starring Anthony Ray Parker as Dozer, Paul Goddard as Agent Brown, Robert Taylor as Agent Jones, David Aston as Rhineheart, Marc Aden Gray as Choi, Ada Nicodemou as Dujoir (White Rabbit Girl) and Deni Gordon as Priestess. Reeves gives a good performance as the recluse who may be saviour of humanity from cyberspace slavery, Fishburne is really likeable as the inspirational leader and teacher, Moss is terrific as the beautiful feisty love interest, Weaving enjoys himself being the snarling villain, and Pantoliano does well in his time onscreen. You can just about follow what's going on if you really concentrate (the colouring, green for the Matrix world and blue for the real world, it certainly helps you decipher), with complex theories of philosophy and ancient mysticism, otherwise you can just enjoy it for its thrilling fight and chase sequences, fast and slow-motion, spectacular special effects, and amazing visuals, an impressive and unmissable science-fiction action. It won the Oscars for Best Editing, Best Sound Effects Editing, Best Visual Effects, and Best Sound, and it won the BAFTAs for Best Special Visual Effects, and Best Sound, and it was nominated for Best Cinematography, Best Editing, and Best Production Design. It was number 66 on 100 Years, 100 Thrills, and it was number 15 on The 100 Greatest Films. Outstanding!"},{"username":"ccthemovieman-1","userUrl":"https://www.imdb.com/user/ur4445210","reviewLink":"https://www.imdb.com/review/rw1500632","warningSpoilers":false,"date":"18 October 2006","rate":"8","helpful":"19 out of 40 found this helpful.","title":"A Bit Confusing But A Big F/X Treat","content":"Special-effects were the drawing card when this came out at the end of the 20th century, and those effects were spectacular. They lived up to their billing. Unfortunately, the story was a bit confusing for much of the two hours, a bit too secular-minded for me, although others have viewed this with Biblical analogies. I do think the script could have used some humor here and there. It took itself a little too seriously. That was especially true for the four main characters.Nonetheless, because of the stylish visuals and effects, it entertained. I liked the monotone-speaking Hugo Weaver the best, or at least found him the most interesting. Lawrence Fishburne's character came in a close second in that regard. Once again here's a movie that made you glad VHS tapes were being phased out in favor of sharper, widescreen transfers."},{"username":"Tweekums","userUrl":"https://www.imdb.com/user/ur13977076","reviewLink":"https://www.imdb.com/review/rw2573123","warningSpoilers":true,"date":"28 February 2012","rate":"10","helpful":"7 out of 12 found this helpful.","title":"A cyberpunk classic","content":"Like many people I was fairly awestruck by the special effects when I first saw this film but was unsure how I would feel watching the film again several years after I last saw it; after all special effects are advancing all the time and this is over ten years old... I needn't have worried; I enjoyed it just as much as I did first time.The story begins with computer hacker Neo receiving strange message telling him somebody was about to knock on his door and that he should 'follow the white rabbit'; his door is knocked and his friends invite him to come out with him; he is about to refuse when he sees a white rabbit tattooed on one of their shoulders so goes with them. While out he meets another hacker, a woman called Trinity, who tells him that the legendary hacker Morpheus wants to meet with him. The next day at work he receives a call telling him the authorities want to take him into custody and he must follow precise instructions if he wishes to escape; he fails to do this and is arrested. During the interview with Agent Smith a strange bug is implanted and in a nightmarish manner his mouth becomes fused closed! The next thing he knows he is waking up in his apartment assuming it was just a strange nightmare but it soon becomes apparent that is was real. Taken to Morpheus by Trinity he learns that the world is not as it seems; he isn't in 1999 but 2199 and none of his life so far has been real; his body is plugged into a giant machine and he is experiencing something called The Matrix.Once woken he finds himself in a dead mechanical world with Morpheus, Trinity and a few other free people; they mention the last human city; Zion, but we never see it. Now he is free he must prepare to return to The Matrix which means learning the skills he will need to survive and gaining an understanding of what The Matrix really is. Once inside they will have to avoid Agents, parts of the program that will hunt them down as well as assuring that they stay hidden in the real world; if they die in either place their life is over.This is a must see for all science fiction and action fans; it has a fine story and spectacular action sequences; many of them reminiscent of those in Chinese Wuxia films with characters running up walls and doing impossible leaps... of course within The Matrix nothing is impossible if you believe you can do it. Keanu Reaves might not have the greatest acting range but he is just right for the role of Neo, a man understandably a little confused at finding everything he had experienced so far was unreal. Hugo Weaving is great as Agent Smith bringing a sense of menace to the role. Other main actors Carrie Anne Moss and Laurence Fishburne also perform well. Writer/directors the Wachowski brothers did a great job; the film is incredibly stylish without lacking substance. I can't imagine many people haven't watched this but if you are one of those I strongly recommend checking it out."},{"username":"ma-cortes","userUrl":"https://www.imdb.com/user/ur3270789","reviewLink":"https://www.imdb.com/review/rw2568888","warningSpoilers":false,"date":"20 February 2012","rate":"9","helpful":"11 out of 18 found this helpful.","title":"Top-notch movie with impressive production design , marvelous effects and incredible visual designs","content":"Overwhelming and spectacular first part from a trilogy with some of the best action scenes ever made . This excitingly original film is full of thrills , cutting-edge visuals, stylist innovations , fights , tension , suspense and groundbreaking races , but also several commercial elements , including computer-simulated violence . This is a dynamic, fast-paced and amusing movie , though overlong . It's an enjoyable , if somewhat light-headed piece of escapism with state-of-art special effects and straightforward screenplay . Big-budgeted film by the great producer Joel Silver led to break into the booming Sci-Fi/adventure/fantasy market plenty of inventiveness and imagination . Full of action, it's complemented by rousing scenes , breathtaking fights and struggles are spotlights . It deals with Neo (Keanu Reeves) ¨who is thought to be the chosen one¨ a computer hacker learns from mysterious rebels about the true nature of his reality and his role in the war against its controllers . One night, a mysterious woman named Trinity (Carrie-Anne Moss)seeks him out and introduces him to that faceless character he has been waiting for : Morpheus (Laurence Fishburne) who carries him to Oracle (Gloria Foster) . Then Neo is advised by the Oracle about his future . As Neo learns about Matrix , he aware all life on Earth may be nothing more than an elaborate masquerade created by a malevolent cyber-intelligence and he results to be the chosen one . The rebel leaders led by Morpheus estimate that they have little time until 250,000 probes discover Zion and destroy it and its inhabitants. During this, Neo has to decide how he can save Trinity , Morpheus and partners from a dark fate and taking on Agent Smith (Hugo Weaving) and his hoodlums . Meanwhile , a traitor betrays the group and the events get worse . It is a dark time for the world in this first adventure as the epic war between man and machine reaches a thundering crescendo : The group desperately battle to hold back the marauding Sentinel invasion from overtaking them . Neo, Morpheus and Trinity race against time to get their purports . While the human city of Zion is preparing for the oncoming war with the machines with very little chances of survival.This is an action-packed , booming following with some of the best action scenes ever filmed , plenty of bounds and leaps over buildings , including awesome visual effects by John Gaeta . This thrilling movie contains impressive fights , chills , breathtaking designs , dense philosophy and many other things . From the beginning to the end the comic-book action-packed and extreme violence is continued and it's fast movement ; for that reason the picture is pretty amusing ; furthermore contains lots of spectacular combats in mart arts style staged by Yue Woo Ping who also made ¨Kill Bill¨ and ¨Crouching tiger, hidden dragon¨ . Contrived beyond belief with spectacular struggles that play like video games , but slickly calculated to please 2000s audiences . Moving and pulsing musical score by Don Davis . Magnificent , glamorous production design by Owen Paterson . Colorful and imaginative cinematography by Bill Pope . The motion picture is stunningly written , produced and directed by Larry and Andy Wachowski-The Wachowski Brothers . It' s followed by ¨Matrix Reload¨ and ¨Matrix revolutions¨ with similar artistic team and cast adding Anthony Zerbe , Harry Lennix, Gina Torres , Harold Perrineau, Jada Pinkett Smith, Nora Gaye , among others in which the the city of Zion , the last outpost of humanity , is defended by valiant warriors against the massive invasion of the machines to save the humanity as Neo , Morpheus and Trinity fight to end the war at another front while also opposing the invasion on the hidden underground refuge ."},{"username":"paul_haakonsen","userUrl":"https://www.imdb.com/user/ur22654354","reviewLink":"https://www.imdb.com/review/rw7671094","warningSpoilers":false,"date":"22 December 2021","rate":"6","helpful":"5 out of 20 found this helpful.","title":"A watchable action sci-fi movie that was and still is over-hyped...","content":"I sat down here in 2021 to re-watch the 1999 action sci-fi movie \"The Matrix\". Of course I have seen it before, back in the day when it was newly released. But I can't claim to have been much of a fan of the movie or the whole franchise actually. But I opted to sit down and watch them again, prior to sitting down to watch the newest addition to the franchise. But more about that one later.I never got onboard the 'Matrix is an amazing movie' train. Sure, I found the movie to be watchable, but it just wasn't an impressive movie in terms of script and storyline. So writers Lilly Wachowski and Lana Wachowski didn't really impress me back in 1999, and nor was revisiting the movie here in 2021 an eye-opening experience. I just never could delve into that whole artificial reality where the laws of physics and such doesn't apply.Visually then \"The Matrix\" was impressive, no doubt about it. And even today, 22 years later, the movie is actually still rather enjoyable in terms of visual effects and CGI. But a movie can only be sustained so much on visual effects alone.Something that definitely was impressive about \"The Matrix\" was the cast ensemble, because they had gotten together a great cast for the movie. Of course, Keanu Reeves is excellent in the movie, but then again, he does tend to have a track record of that. The movie also have the likes of Laurence Fishburne, Carrie-Anne Moss, Hugo Weaving and Joe Pantoliano on the cast list. Now, back in the day I didn't really like Hugo Weaving, but I must admit that seeing the movie again definitely brings his monotonous performance of Agent Smith to a new light, because he did so rather phenomenally, and always was the star of the movie.I am not a fan of \"The Matrix\" franchise, nor will I ever become so. But I have to say that the amount of action in the movie and the execution of the action sequences was good, and the visual effects definitely helped to keep the movie afloat. But in terms of storyline and script, then \"The Matrix\" was sort of flawed and mundane.My rating of the 1999 action sci-fi from directors Lana Wachowski and Lilly Wachowski lands on a six out of ten stars."},{"username":"BA_Harrison","userUrl":"https://www.imdb.com/user/ur0945066","reviewLink":"https://www.imdb.com/review/rw2157668","warningSpoilers":false,"date":"14 November 2009","rate":"10","helpful":"8 out of 14 found this helpful.","title":"Whoa!","content":"With The Matrix having already received 3294 comments and 342,457 votes (with an average rating of 8.7), the last thing IMDb needs is another rambling review from an avid fan describing in precise detail why this film is such a revelation in terms of action and sci-fi cinema.What I will say is that the film is a stroke of genius that taps into the subconscious belief that our reality is not all it seems to be and mines it for all it's worth, developing a philosophical mythos of biblical proportions in the process, whilst introducing technical and directorial innovations that will be mimicked for years to come.It also features some kick-ass fight scenes (with jaw-dropping choreography by HK legend Yuen Woo Ping), a superb metal and techno soundtrack, and the awesome sight of Carrie Ann Moss almost completely clad in black PVC (or is it rubber? Oh, who cares... it looks great!!!).In short: with The Matrix, the Wachowski Brothers have given sci-fi fans one of the finest films of the genre ever.What a shame they had to go and make those sequels!"},{"username":"moonspinner55","userUrl":"https://www.imdb.com/user/ur0989035","reviewLink":"https://www.imdb.com/review/rw2032391","warningSpoilers":false,"date":"4 March 2009","rate":"4","helpful":"9 out of 45 found this helpful.","title":"\"After this, there is no turning back...\"","content":"Glorified martial arts movie masquerading as a science-fiction thriller, this blockbuster hit struck a nerve with the public, though it isn't as brainy (or as deep) as one might be led to believe. Keanu Reeves is typically one-note as a computer-hacking loner who finds his life may not be reality--and that an alternate reality introduced to him by guru Laurence Fishburne could destroy him. Written and directed by the Wachowski brothers, who seem to enjoy a twisting story--though at the expense of logic (forget credibility). A more engaging leading man might have made the technical asides easier to wade through, although most audiences didn't seem to mind. Followed by \"The Matrix Reloaded\" and \"The Matrix Revolutions\", both in 2003. *1/2 from ****"},{"username":"TxMike","userUrl":"https://www.imdb.com/user/ur0438066","reviewLink":"https://www.imdb.com/review/rw0508891","warningSpoilers":false,"date":"30 September 1999","rate":"","helpful":"13 out of 26 found this helpful.","title":"One of the best DVDs out so far, much more than just a movie!","content":"December 2019 update. My wife and I just watched this again on Blu-ray, even though we have seen it multiple times it still is captivating. Simply a marvelous movie, and some might make the case that this is the best movie ever made.This is a review of \"The Matrix\" on DVD.If you like sci-fi action movies, this is certainly one to watch, even to own. For what it is, I give it a \"10\". It kept me wide-eyed all the way through. I'm sure I'll be saying the same thing after my 20th viewing, sometime in the year 2015. (Update: it is now 2019, and I have seen it maybe 8 times, still a great, ground-breaking movie, I come away even more impressed each time. Simply one of the best and thought provoking movies ever made.)The DVD picture is perfect all the way through, and the 5.1 surround sound is quite thrilling. But, the \"extra\" features are a big reason to buy the DVD.One \"extra\" is the whole movie played at a subdued sound level while the editor, special effects supervisor, and actor comment on their own reactions and explanations of various scenes.Another \"extra\" is playing the movie in normal mode where a white rabbit appears during certain scenes. If you want to see how that scene was filmed, you can click when the white rabbit appears and it will take you to the \"behind the scenes\" shooting. Then the movie resumes.There also is a featurette which shows how the entire movie was filmed. Or, you can play the musical soundtrack alone.All in all, a great action sci-fi movie with the most interesting set of \"extras\" I have seen so far on a DVD. Isn't it amazing how much stuff they get on that small disc that only holds about 70 minutes of music in its CD version!!"},{"username":"dbdumonteil","userUrl":"https://www.imdb.com/user/ur1219578","reviewLink":"https://www.imdb.com/review/rw0511316","warningSpoilers":false,"date":"18 September 2003","rate":"5","helpful":"11 out of 48 found this helpful.","title":"What the hell is the \"Matrix?\"","content":"Launched in 1999 and one of the most successful movies of the year, \"Matrix\" is an amazing movie. It ranks among the movies that leave the spectator bemused, even after several projections.In a way, it's very similar to Paul Verhoeven's movie \"Total Recall\" (1990). The two movies have got a complicated but mesmerizing screenplay, astounding special effects and especially, a main character with two faces: Keanu Reeves. It means that at the beginning of the movie, he's introduced as someone who leads a peaceful but common life. But an unexpected event will transform his life and make him a hero.\"Matrix\" is also a very well stable movie that you can divide in two parts: the first one mainly focuses on long dialogs sequences that incline to reflection while the second one honors stunning action sequences.A remarkable performance crowns it all and Keanu Reeves finds here his best role to date. The sole weakness of the movie is the love affair between Reeves and Laurence Fishburne. The Wachowski brothers felt compelled to include this, maybe to give their movie, a Hollywood nature.An awesome science-fiction film that easily ranks among the best movies of the nineties."},{"username":"Quinoa1984","userUrl":"https://www.imdb.com/user/ur0453068","reviewLink":"https://www.imdb.com/review/rw0509589","warningSpoilers":true,"date":"5 October 2000","rate":"10","helpful":"24 out of 40 found this helpful.","title":"One of the greatest achievements in Science-fiction film history","content":"Andy and Larry Wachowski's The Matrix is an unbelieveable achievement. Not only in the visual sense, but in storytelling, the way society is, and much more. And, Keanu Reeves is almost good here.Reeves playes 2 people in one- Thomas A. Anderson, a regular Joe who is just working it today's society. The other is Neo, a comuter hacker who has broken every single known computer hacking law. But, he soon meets Morpheus, played with great mysticism and wiseness by Laurence Fishburne, who brings Neo down the rabbit hole to tell him the truth about the world; we are living in a world called the Matrix, which uses out brain energy to trun us into batteries. Unbelieveable to be sure, but it is incredibly original story wise, as it sprawls into something every average movie goer can appreciate- hard boiled, visually and bloody packed action, gore and violence.The best part though is that this film breaks many boundaries in technology and (with it's 4 Oscars for editing, sound, sound editing and visual effects) and deserves every bit of credit it gets. True, some might find the plot confusing and boring and true it isn't for all tastes. But if you can like the story and the action, you've got the key to a fantastic picture, otherwise it is another action flick (great action never-the-less). Kudos to everyone who worked on the film, making one of the best films of the year, decade and of sci-fi film history. A++"},{"username":"wes-connors","userUrl":"https://www.imdb.com/user/ur15896852","reviewLink":"https://www.imdb.com/review/rw1999621","warningSpoilers":false,"date":"1 January 2009","rate":"9","helpful":"5 out of 8 found this helpful.","title":"Keanu Reeves in Wonderland","content":"Insomniac computer hacker Keanu Reeves (as Thomas \"Neo\" Anderson ) lives a common and interesting life. Hugo Weaving (as Agent Smith) tells him, \"You've been living two lives. In one life, you're Thomas A. Anderson, program writer for a respectable software company. You have a social security number, pay your taxes, and you help your landlady carry out her garbage. The other life is lived in computers, where you go by the hacker alias 'Neo' and are guilty of virtually every computer crime we have a law for. One of these lives has a future, and one of them does not.\" That's a good description. Everything changes for Mr. Reeves when he is contacted by the intriguingly prophetic Laurence Fishburne (as Morpheus), through seemingly supernatural leather lass Carrie-Anne Moss (as Trinity). Mr. Fishburne believes Reeves just may be \"The One\". Mr. Weaving captures Reeves, and tells him Fishburne is the most dangerous man alive. Reeves instinctively distrusts Weaving and, with Ms. Moss' assistance escapes from him. Them, Reeves joins falls Through the Looking Glass, where he learns about and dreams, reality, and imagination, from the Wachowski brothers.\"Unfortunately, nobody can be told what 'The Matrix' is. You have to see it for yourself.\" I watched it with great curiosity to see what would happen next...A stunning audio-visual achievement.********* The Matrix (1999) Larry & Andy Wachowski ~ Keanu Reeves, Laurence Fishburne, Carrie-Anne Moss, Hugo Weaving"},{"username":"michaelRokeefe","userUrl":"https://www.imdb.com/user/ur0449021","reviewLink":"https://www.imdb.com/review/rw0509328","warningSpoilers":false,"date":"8 April 2000","rate":"7","helpful":"5 out of 13 found this helpful.","title":"A computer world Alice in Wonderland. Sci-fi greatness!","content":"A computer cowboy rides into a new realm of reality. Not to learn right from wrong; reality from the surreal. What is it like going too far into the looking glass? This movie sets new standards for science fiction and making movies period. Don't worry about trying to understand what you see. Just buckle up and endure. The special effects and sound are beyond compare. Keanu Reeves is really good. Laurence Fishburne, Carrie-Anne Moss and Joe Pantoliano are equally important to watch. A bucket of popcorn, a Payday and two Pepsi Colas....and nerves of steel. What a flick!!!"},{"username":"Calicodreamin","userUrl":"https://www.imdb.com/user/ur29385135","reviewLink":"https://www.imdb.com/review/rw5666273","warningSpoilers":false,"date":"22 April 2020","rate":"9","helpful":"3 out of 4 found this helpful.","title":"Awesome sci-fi flick!","content":"A great send off of the 90s, the matrix is a one of a kind sci-fi action movie. The cgi and stunts are amazing, the choreography of the fight scenes are crazy good. The acting is great from both the good guys and the bad guys, Keanu is amazing. The outfits are badass and really send this over the edge, who doesn't want to look like Carrie Ann moss?!"}],"errorMessage":""}