{"imDbId":"tt0109830","title":"Forrest Gump","fullTitle":"Forrest Gump (1994)","type":"Movie","year":"1994","items":[{"username":"MartinHafer","userUrl":"https://www.imdb.com/user/ur2467618","reviewLink":"https://www.imdb.com/review/rw1889260","warningSpoilers":false,"date":"9 June 2008","rate":"8","helpful":"35 out of 220 found this helpful.","title":"6 Oscars for this?!","content":"Please understand that despite my summary, I did enjoy this clever film. There was a lot to like. However, little of the film seemed Oscar-worthy and it probably should not be in the IMDb top 250. I think this is a great case of a very good film that has been prematurely elevated to greatness.As far as the plot goes, with zillions of reviews on IMDb for this film, I won't even bother. The acting was very good, the special effects ranged from freakin' amazing (such as digitally removing Lt. Dan's leg--quite an achievement for 1994) to very, very poor (inexplicably, despite Forrest being expertly inserted in many scenes, the one with John Lennon was very sloppy and the seams were very, very obvious on the big screen). The negatives included a few problems with continuity (such as the happy face being supposedly invented by Gump in the late 70s--it had been around for nearly a decade already) and perhaps too much emphasis on episodes as opposed to story. Still, it's a very enjoyable film and one you can't help but like. But winning 6 Oscars?! It must have been a very, very slow year."},{"username":"TheLittleSongbird","userUrl":"https://www.imdb.com/user/ur20552756","reviewLink":"https://www.imdb.com/review/rw2162181","warningSpoilers":true,"date":"22 November 2009","rate":"9","helpful":"31 out of 42 found this helpful.","title":"Beautiful film","content":"Forrest Gump, I think is a beautiful film. Never too schmaltzy, but there are some genuine tearjerkers like Forrest at Jenny's grave. The cinematography is stunning, the costumes are lovely and the scenery is gorgeous. The music is also very calm and relaxing, perhaps adding to the tone of this film. The screenplay is well crafted, and the story is simple. But what made this movie was its simplicity; it never tries to be too complex and is consequently moving. The acting is just as impressive; whilst Tom Hanks's accent is a little awkward in places, my only real criticism of this movie, he gives a truly remarkable performance, though I do think Morgan Freeman deserved the Oscar more for Shawshank. Robin Wright gives possibly the best performance of her career, and Sally Field is very dignified as Forrest's mother. The scene stealer though is Gary Sinise as Lieutenant Dan, a very moving and insightful performance. Overall, an extremely good movie, I will admit I wasn't sure whether I would like it, but the simple answer is this, I do. 9/10 Bethany Cox"},{"username":"bkoganbing","userUrl":"https://www.imdb.com/user/ur2483625","reviewLink":"https://www.imdb.com/review/rw2206818","warningSpoilers":false,"date":"13 February 2010","rate":"10","helpful":"28 out of 40 found this helpful.","title":"The Hand Of An Unseen Providence","content":"When Tom Hanks won his first Oscar for Philadelphia in 1993 the film received a total of five nominations. His second Oscar for Forrest Gump came in a film that received more than double that in nominations and awards. If Forrest Gump did nothing else it solidified Hanks's credentials as a serious actor. He would never be doing imitations of his Bosom Buddies character in films again.It also among other awards also won for Best Picture and Best director for Robert Zemeckis, richly deserved. The film is Huckleberry Finn like in its canny observations coming from the man who had an IQ we are told of 75. But as Forrest also tells us, \"stupid is as stupid does\". And Forrest with the hand of an unseen providence comes out a lot better than some of the clever people he meets in life.Watching the film once again it occurred to me that Mark Twain if he couldn't have written this himself would have loved the way Zemeckis handled the character of Forrest Gump. The beauty of Huckleberry Finn and the secret of its success is that Twain got into the mind of a child who recorded all the events around him, a child without too much education. What Zemeckis did was get Hanks into a child like mind who sees things with amazing clarity stripped of any veneer of pretense. Which Hanks observes in the people around him and in the events that shape America and himself from Eisenhower to Reagan.There are two prominent female parts in Forrest Gump. One is for Robin Wright who plays the abused child Julie as an adult. She is Forrest's love and best friend and she takes a different path of life one she chose with more deliberation than Hanks. Their fates though eventually entwined are radically different. The second major female role is for another two time Oscar winner Sally Field who now is playing matronly parts, a far cry from Gidget and the Flying Nun. She gives Forrest the maxims he lives by and in a crisis they turn out to be more than sound bite clichés.Another award that Forrest Gump won is for Special Effects and an award it didn't win was for Gary Sinise in the role of Lieutenant Dan Taylor, Forrest's commanding officer in Vietnam. That's something that does not compute because the special effects were to show Gary Sinise as a double amputee with both legs lost in Vietnam.It's some amazing bit of work no doubt about it, but to honor it without Sinise whose performance really brings it off is ridiculous. Sinise is the educated one who curses the fate that happened to him, but in the end by just going with the flow he does prosper in the end. Sinise lost that year in Best Supporting Actor category to Martin Landau for Ed Wood, but I think Sinise's performance has had a more lasting impact.To those Americans who serve our country it certainly has. Gary Sinise has devoted a great deal of his life and earned treasure to bring entertainment to our overseas troops in Iraq, Afghanistan, wherever, becoming a successor to Bob Hope in that regard. He's gone further than that though, setting up foundations to help civilians in both countries and contributing to numerous charities dealing with war and its aftermath. Doing that in my humble opinion Gary Sinise has become one of the great Americans of our brand new millenia, a lot more than just an actor. He's forever now known as Lieutenant Dan.In the end though the film belongs to Tom Hanks who joined with Spencer Tracy as the only two male actors to win back to back Oscars for Best Actor. Hanks fascinates us and guides us through this film and when we're done we've seen something very special.If you don't believe me about how good Forrest Gump is, then watch it for a few minutes and see if you're not sucked in. Like Forrest's mama says, the film's like life which is like a box of chocolates, you never know what you'll get until you open it.\""},{"username":"Leofwine_draca","userUrl":"https://www.imdb.com/user/ur0482513","reviewLink":"https://www.imdb.com/review/rw4197773","warningSpoilers":true,"date":"10 June 2018","rate":"5","helpful":"6 out of 71 found this helpful.","title":"Too sentimental","content":"FORREST GUMP is another of those American films that Americans seem to love while I feel like I'm missing out on something obvious. I fear that time hasn't been too kind to it since; I'm very much a fan of old-fashioned heartwarmers like IT'S A WONDERFUL LIFE, but I found this cheesy and far too obviously sentimental. I mean, the scenes in which Gump are inserted into history are very funny, of course, and it's nice to see Tom Hanks playing a very different kind of role. But everything else? Give me a break!"},{"username":"SnoopyStyle","userUrl":"https://www.imdb.com/user/ur2898520","reviewLink":"https://www.imdb.com/review/rw2905843","warningSpoilers":false,"date":"15 November 2013","rate":"8","helpful":"9 out of 14 found this helpful.","title":"Tale worthy of Frank Capra","content":"Forrest Gump (Tom Hanks) is a simple man with a sweet heart. It's his journey through American history. His childhood friend Jenny (Robin Wright) would travel the underbelly flipside of the same world. His journey is heavily influenced by his mama (Sally Field), Lieutenant Dan (Gary Sinise), and Bubba Blue (Mykelti Williamson).Director Robert Zemeckis has added another chapter to the American mythos. It is a magical tale where the good guys win out. That you can rise to the top no matter what handicap you have. That a good heart will enlighten all it touches. It is a tale worthy of Frank Capra.If I could have a wish, it is a deeper meaning to Gump's journey. For example, he's given a chance to comment on the Vietnam war but the sound goes out of his mike. I would have like to hear what he had to say. But that might have been asking too much. More than anything, Gump is not controversial."},{"username":"Hitchcoc","userUrl":"https://www.imdb.com/user/ur0278527","reviewLink":"https://www.imdb.com/review/rw1335559","warningSpoilers":false,"date":"7 April 2006","rate":"10","helpful":"14 out of 17 found this helpful.","title":"Pure Charm","content":"Every once in a while, something comes along that hasn't been done before. This movie is one of those things. First of all, we have a principal character whose take on life is one where you don't judge it; you live it. I know he's a film character. It doesn't matter because we use images such as these to inspire us and to give us our own way of treating each day. Forrest lets no grass grow under his feet. He is the consummate optimist. He doesn't complain because he sees early on that it does you no good. His life is one adventure after another, in and out of the public eye, but his shyness and demeanor don't ever get to his head. He is the epitome of patience, something sadly lacking in the lives of most Americans. He is pushed around by the gusts of time and always lands on his feet. His relationship with a troubled girl is the one consistent thing in his life, and that is also shows his pugnaciousness. There are some commentators and reviewers who call this character stupid. He is a slow processor, but his stability lies in his morality and his consistency. His mother raised him well.Tom Hanks has become our new Jimmy Stewart. His roles are about human emotion and dedication. He is the everyman in many ways. Obviously, the subject matter has changed, but you can bank on his decision making when it comes to film. The other heroes are the special effects people. They are able to make this work; to create an incredible world for him to function within. The news clips are quite marvelous. I usually put this film in my top ten."},{"username":"Kirpianuscus","userUrl":"https://www.imdb.com/user/ur61197531","reviewLink":"https://www.imdb.com/review/rw3378160","warningSpoilers":false,"date":"22 December 2015","rate":"","helpful":"5 out of 5 found this helpful.","title":"a box of chocolate","content":"more than adaptation , it is a visual parable. about vulnerability and its magnificent potential. about innocence and its importance to discover the real essence of life. about love, family, fight and courage. a film like a revolution. because it propose the best manner to be yourself and to not be a victim walking on that way. more than story of Forrest Gump, it is the story of people around him. a film like a Rubick cube - many faces, each for complete right color. and a image who remains its mark - the box of chocolate, the run, the ping - pong match. it seems be the best role of Tom Hanks. in fact, it is definition of a new period after the Cold War. a pledge. about the small things."},{"username":"Horst_In_Translation","userUrl":"https://www.imdb.com/user/ur3914439","reviewLink":"https://www.imdb.com/review/rw3131644","warningSpoilers":true,"date":"27 November 2014","rate":"8","helpful":"7 out of 9 found this helpful.","title":"Timeless masterpiece, very unique","content":"20 years after \"Forrest Gump\" came out, I decided to rewatch this one and it was even better than what I remembered from watching it the first time. The film won 6 Academy awards in 1995, including Best Picture, Best Director (Robert Zemeckis, \"Back to the Future\"-trilogy, \"Cast Away\" again with Hanks later on) and Best Actor (2nd win in a row for Hanks after \"Philadelphia\"). And even if it lost \"Best Score\" to \"The Lion King\", the music, especially the main theme, is nothing short of brilliant. It starts right away as we watch a feather fly towards the film's central character. Visually and acoustically a feast from minute one.Forrest sits on a bench waiting for the bus and tells his story to the other people who are waiting. Thank God he did not know that he could just walk to Jenny, otherwise we may have never found out about his stories. And as diverse as Forrest's life is, as diverse are also the reactions from those people. Some sit quietly, others accuse him of being a liar and the old lady finally is captivated by his story. The interesting thing is that Gump gets out the photo as evidence not before the man (who accuses him of lying) leaves. He could have proved it easily, but he has nothing to prove to anybody. This is the frame of the story. The real action takes place in the stories Gump tells. Some true emotional highlights are included: Bubba's death and the funeral eulogy to Jenny (great HI. reference by the way) at the end. Of course, all the moments with his son (played by the very young Haley Joel Osment) are very much worth watching too. And then there is Gary Sinise who was pretty much on par with Hanks during their comedic and dramatic moments together. He did not win the Oscar, but was at least as deserving as Landau and Jackson. With his character, early on, you could never say if he would develop into a friend to Gump or stay/become a big antagonist. Finally, it turned out to be the former. When they have prostitutes one night at their place, it becomes truly clear for the very first time. Gump serves as a great role model to Sinise's character for all he achieved despite his limitations.This is not the greatest movie ever made, but there is a certain charm to it that makes it so unique in movie history, possibly because the central character is at least as unique. And finally, there is the Forrest-Jenny love story which is sweet from start to finish and one of the main reasons why this film will make you laugh, will make you cry and will make you feel for Forrest for its almost 2.5 hours . And even in the almost impossible case that you will not remain interested in Forrest's story, this film is very much worth watching alone for all the references to past decades (most of all in terms of the movements in society, music and politics). \"Forrest Gump\" is a must-watch and that's all I have to say about that."},{"username":"bob the moo","userUrl":"https://www.imdb.com/user/ur1002035","reviewLink":"https://www.imdb.com/review/rw0339334","warningSpoilers":true,"date":"1 November 2003","rate":"","helpful":"39 out of 82 found this helpful.","title":"A reasonably enjoyable romp through recent history and pop culture \u0096 any more than that and it's a crass conservative message (spoilers)","content":"Sitting at a bus stop, Forrest Gump starts to take to those around him and tells a story of his life to date. His is a fairly unremarkable life that spans recent history. It begins with his childhood in Alabama and his growth from humble beginnings to take part in many memorable events in recent American history.I saw this when it came out and have seen it several times since then. I haven't reviewed it until now because I've always felt that my views of this film were pushed one way or another by a) it winning lots of Oscars and b) everyone hammering it in comparison to Pulp Fiction. It should be judged on it's own merits, so I watched it yesterday in an attempt to do that. I felt that I could view it in one of two ways \u0096 either as a comical walk through recent history or as a message.As a special effects driven walk through recent history it is actually quite enjoyable. It does get a bit tiresome to see Forrest meet one president after another, or invent popular songs/slogans/tee shirts/ bumper stickers etc but it still works quite well. The subplot of his love for Jenny doesn't work as well in this context and actually serves only to slow things down a little and to create the cheesy climax to the film. However this subplot is the basis for the film's `message'. Jenny and Forrest both start out in the same place. Forrest works hard without questioning anything, sure he gets some tough breaks but his dogged efforts eventually work out for him. Jenny, on the other hand, gets involved in the other culture of the times \u0096 be it political rebellion, drugs, music, extramarital sex etc. Her fate is less than Forrest's \u0096 she dies and realises on her death dead that she should have just been clean cut like Forrest. This side of the film smacks rather heavily \u0096 first of all it is all too sentimental but, more importantly, it is a clear attack on the counter cultures and a condemnation of those that are part of them.Of course the film's humour means that the two extremes of Forrest and Jenny are also played for laughs so even a flag burning, drug user may be won over by the film before it starts to deliver it's message drop and drop. I tried just to enjoy the comic side of the film but it wasn't enough to fill the 2 hour plus run time and I started looking at the sub plot \u0096 and didn't like what I saw.The cast are all pretty OK. I don't think for a moment that Hanks deserved his Oscar, but there's nothing more can be said of that. He does do good work to play his `dumb' character so well but it shouldn't really have won no matter who else it was up against. Penn is OK but only has to play `bad' for most of the film. Sinise is pretty good value and his character is a mix, with the bitterness writ large on his life. Williamson plays another `dumb' character but does OK and Field is alright as Forrest's Mom. To be honest the cast all match the tone of the film \u0096 all good people who just keep plodding along and get good results.Overall I should take the film to be praise of an America where even those with 75 IQ's can make it, however this simply isn't true. What remains once this is rejected is the comedy of seeing Hanks inserted into archive footage (to mostly amusing effect) and a crass and obvious attack on those who would go against whatever America stands for. It's worth a watch but the crude message and effect driven humour simply didn't help me understand where all those Oscars came from."},{"username":"kosmasp","userUrl":"https://www.imdb.com/user/ur5876717","reviewLink":"https://www.imdb.com/review/rw6588827","warningSpoilers":false,"date":"12 February 2021","rate":"10","helpful":"6 out of 7 found this helpful.","title":"Mama said ...","content":"Take this with a grain of salt and don't be mad about certain things. Like one of the first flashbacks to the very beginning that does not come over preachy when it talks about the Klan (Ku Klux Klan that is, just in case you think I'm talking about any other Klan). Maybe sometime in the near future there will be a disclaimer and someone giving this context. But until then, you have to be educated enough yourself to understand and comprehend certain things. And you have to have a certain sense of humor to dig all the coincidences that Gump comes across at. It's alike a marathon through many landmarks of the short US history we have behind us. Like the Watergate scandal, Vietnam War, Black Panthers and so much more.If you can dig all that and go with the flow, than the chocolate box this opens up for you, will taste quite delicious. It had been quite a while since I saw this the first time, but it still worked its charme to say the least. Great movie, great actors - you have to be in the right mind set and mood though. And be able to forgive certain things ..."},{"username":"classicsoncall","userUrl":"https://www.imdb.com/user/ur2707735","reviewLink":"https://www.imdb.com/review/rw2442544","warningSpoilers":true,"date":"12 June 2011","rate":"10","helpful":"12 out of 19 found this helpful.","title":"\"I just felt like running\".","content":"For anyone who grew up in the turbulent Sixties, \"Forrest Gump\" delivers a clever blend of nostalgia mixed with a uniquely creative view of history as experienced by a presumed to be simpleton. While Tom Hanks' character recalls his life with a slow tangy drawl, he variously entertains and educates a host of passengers waiting for the next bus to their intended destination. Some ignore him, some show interest, one even scorns Gump's tale of getting rich in the shrimping business, only to depart before Forrest has a chance to pull out his copy of Fortune Magazine. Life can be like that for those unwilling to listen and learn, casting doubt instead of exploring the truth and keeping an open mind.I got a kick out of Forrest's string of brushes with greatness - the way he taught Elvis how to shake his hips, his unquestioning response to LBJ's inquiry about his war injury, and the way his war time experience inspired John Lennon to write 'Imagine'. There was also that ingenious sequence in which he meets President Nixon, then inadvertently tips off the Watergate scandal. However the most understated and easiest reference to miss was the clever homage paid to the 1969 film \"Midnight Cowboy\", when Forrest wheels Lieutenant Dan (Gary Sinise) across busy city traffic, and is narrowly missed by a taxi cab. Lt. Dan's response was \"Hey, I'm walkin' here\", just the way Ratso Rizzo did in that earlier film. All that with the 'Everybody Talking at Me' movie theme seamlessly woven in as so many songs of that era were utilized with other aspects of the story.For Forrest Gump, life is not a pretentious path to wealth or fame, but a never ending quest to learn and be a productive human being. Not to mention finding one's own true love. For Forrest, life long friend Jenny (Robin Wright) represents an unfulfilled ideal, one he accepts into his heart while still a young schoolboy and nurturing that relationship platonically throughout his adulthood. For her part, Jenny represents a youthful quest for experiencing life to the fullest, only to make a series of wrong choices that lead her to the brink of suicide. It's fitting that Jenny eventually realizes what Forrest knew all along, that they were made for each other even if outward appearances seemed to dictate otherwise.I've seen this film only a couple times in the past, thinking it was good, but only considering it for it's entertainment value. I guess one of the benefits of getting older is the insight one gains with experiencing life a day at a time and steady as she goes. My viewing of the picture today gave me a greater appreciation for the subtleties offered in the film, and leads me to believe the world would be a better place if there were a little more of Forrest Gump in all of us."},{"username":"lee_eisenberg","userUrl":"https://www.imdb.com/user/ur4888011","reviewLink":"https://www.imdb.com/review/rw1094684","warningSpoilers":true,"date":"4 June 2005","rate":"6","helpful":"8 out of 24 found this helpful.","title":"unusual is as unusual does","content":"It seems that most people either love \"Forrest Gump\" or hate it. I am right down the middle. I didn't find this movie to be a masterpiece, but I thought that it was interesting how they did it. The title character (Tom Hanks) is of course a retarded Alabaman who grows up with his single mother (Sally Field). Throughout the movie, he plays a part in almost every major event of the post-WWII era, and in the process meets several distinguished personalities. All the while, he continues trying to get back together with his sweetheart Jenny Curran (Robin Wright Penn). Toeing the line between comedy (he shows his butt to LBJ) and drama (his friend Bubba gets killed in Vietnam), the movie never gets idiotic, although it was intermittently sappy.Either way, I liked \"Forrest Gump\". It was the first Best Picture winner that I saw in the theaters, but I didn't consider it the best movie of 1994. In my opinion, that distinction goes to the under-appreciated \"Shawshank Redemption\".Tom Hanks sure has come a long way since his debut, the slasher flick \"He Knows You're Alone\"."},{"username":"gavin6942","userUrl":"https://www.imdb.com/user/ur1234929","reviewLink":"https://www.imdb.com/review/rw3117438","warningSpoilers":false,"date":"4 November 2014","rate":"8","helpful":"3 out of 3 found this helpful.","title":"American History Through The Eyes Of A Simpleton","content":"Forrest Gump (Tom Hanks), while not intelligent, has accidentally been present at many historic moments, but his true love, Jenny Curran (Robin Wright), eludes him.This film is fun, funny and touching, if not a little bit sad. If a school wanted to (and no doubt some have), it would be an interesting way to teach the second half of the 20th century. Elvis, Wallace, the Kennedys and more.This is probably the film that \"made\" Tom Hanks. Although he was already big in the 1980s with \"Big\" (no pun intended), this was probably the turning point where he went from comedy to serious actor (well, somewhat serious). And it probably remains his most-watched movie of all time (well, besides maybe \"Sleepless in Seattle\")."},{"username":"jboothmillard","userUrl":"https://www.imdb.com/user/ur4248714","reviewLink":"https://www.imdb.com/review/rw1037266","warningSpoilers":true,"date":"11 March 2005","rate":"9","helpful":"72 out of 163 found this helpful.","title":"Forrest Gump","content":"From Oscar and Golden Globe winning, and BAFTA nominated director Robert Zemeckis (The Back to the Future Trilogy), this is a remarkable comedy drama based on the novel by Winston Groom. Basically, Forrest Gump (Oscar and Golden Globe winning, and BAFTA nominated Tom Hanks) is the low-intelligence but friendly man on a bus stop bench, and telling his life story to all strangers who sit down. The film is basically chronicles of his life accidentally ending up in big events of America between the 1950's and the 1970's, and finding fame and fortune without wanting or asking for it. These include meeting Elvis Presley, being put on an American football team for his running speed, meeting President John F. Kennedy, joining the army for the Vietnam war, becoming a Ping Pong champion, receiving the congressional medal of honour from President Richard Nixon, becoming a shrimp boat captain with his own company and running across America for two years. Within these adventures in his life, he always thinks of those close to him, the love of his life Jenny Curran (Golden Globe nominated Robin Wright Penn), friend Lt. Dan Taylor (Oscar and Golden Globe nominated Gary Sinise), friend Pvt. Benjamin Buford 'Bubba' Blue (Mykelti Williamson) and his mother Mrs. Gump (BAFTA nominated Sally Field), and with his low-intelligence he does not realise the significance of his actions. Also starring Siobhan Fallon as Dorothy Harris, School Bus Driver, Alexander Zemeckis (Robert's son) as School Bus Boy, Elizabeth Hanks (Tom's daughter) as School Bus Girl and The Sixth Sense's Haley Joel Osment as Forrest Gump Jr. This is one of those films you cannot ignore, even if some people think not to watch it, but like Forrest says \"I don't know if we each have a destiny, or if we're all just floating around accidental-like on a breeze, but I, I think maybe it's both\" (this explains the use of the feather at the beginning and end). Personally, this is a film I would definitely recommend to see, and not just because of Hanks in what has to be one of his best roles. It won the Oscars for Best Visual Effects, Best Film Editing, Best Writing, Screenplay Based on Material from Another Medium and Best Picture, and it was nominated for Best Art Direction-Set Decoration, Best Cinematography, Best Sound Effects Editing, Best Makeup, Best Music for Alan Silvestri (he should have) and Best Sound, it won the BAFTA for Best Special Effects, and it was nominated for Best Cinematography, Best Editing, Best Adapted Screenplay, the David Lean Award for Direction and Best Film, and it won the Golden Globe for Best Motion Picture - Drama, and it was nominated for Best Original Score and Best Screenplay. Tom Hanks was number 3 on The 100 Greatest Movie Stars, and he was number 39 on The World's Greatest Actor, the film was number 40 on 100 Years, 100 Quotes (\"Mama always said life was like a box of chocolates. You never know what you're gonna get.\"), it was number 11 on The 100 Greatest Tearjerkers for Forrest at Jenny's grave, it was number 37 on 100 Years, 100 Cheers, and it was number 71 on 100 Years, 100 Movies. Very, very good!"},{"username":"ccthemovieman-1","userUrl":"https://www.imdb.com/user/ur4445210","reviewLink":"https://www.imdb.com/review/rw1316767","warningSpoilers":false,"date":"16 March 2006","rate":"8","helpful":"16 out of 42 found this helpful.","title":"The Good & The Bad Of Forrest Gump","content":"Wow, I found a number of \"good\" and \"bad\" in this movie, too much to go into detail here without writing what looks like a novel, so I'll condense my thoughts with notes here. I don't expect many to agree with me but overall I found this good very good storytelling and a film that stays with you.The GOOD: 1 - a totally unique story back when it was released and still that way, unlike anything else I've seen; 2 - an involving story. You really care about the lead character \"Forrest Gump,\" who is magnificently played by Tom Hanks; 3 - the story has a good combination of drama, action and humor; 4 - numerous memorable scenes that you'll never forget, especially if you've seen this more than once; 5 - an excellent 1960s soundtrack; 6 - very interesting characters throughout, with solid performances from Gary Sinise, Robin Wright, Myketti Williamson and Sally Field; 7 - a realistic look at some of the unflattering people of the 1960s who were not all \"peace and love;\" 8 - a sweet, tear-jerking ending.The BAD: 1 - The Liberal attitude that having children out of wedlock is just fine is not a good message. (\"You didn't do anything wrong, Forrest,\" says Wright, after he discovered he fathered her child out-of-wedlock); 2 - a blatant anti-gun agenda in which every political shooting is duly noted, along with yet another cheap shot made against Richard Nixon, Hollywood's favorite villain; 3 - The Lord's name in vain used 21 times within a 49-minute period, mostly GDs by Sinise.Overall, the \"good\" far outweighs the \"bad,\" making this a truly memorable movie and one that is fairly unfairly blasted by a lot of \"critics.\" Maybe they didn't like the '60s radicals portrayed in a negative light. That's too bad. I owned this DVD and got rid of it. I'm sorry I did because I'd watch it again and I've seen it three times. Love it or hate it - you don't forget it."},{"username":"TxMike","userUrl":"https://www.imdb.com/user/ur0438066","reviewLink":"https://www.imdb.com/review/rw0339030","warningSpoilers":false,"date":"2 September 2001","rate":"","helpful":"4 out of 9 found this helpful.","title":"A great fantasy story with a lifetime of messages for all of us.","content":"Once again, I watched \"Forrest Gump\" for Christmas. While it isn't a \"Christmas Movie\", to me it contains a message that is better than most Christmas movies. I have seen it a number of times over the years, I own the DVD. Sometimes I hesitate, because it is so long, but once I am watching it the time passes quickly, there is never a dull moment.To me the story here embodies the main messages that any of us should carry through life. Don't dwell on your shortcomings, look towards your opportunities. Play on your strengths. Be diligent, treat others well, be willing to learn from others, always give it your best. And it does all this in an entertaining way, through the fictional escapades of Gump.This is told in a fantasy story, of a young boy with leg braces and an I.Q. of 75, whose mother refused to let that get Forrest down. She always encouraged him. He never sought fame, but by sheer luck found himself in situations where his latent talents could come forward and shine. Tom Hanks of course is super as grown-up Forrest, and I believe this movie is well on its way to becoming a classic the way \"A Wonderful Life\" has become a classic."},{"username":"Quinoa1984","userUrl":"https://www.imdb.com/user/ur0453068","reviewLink":"https://www.imdb.com/review/rw0338909","warningSpoilers":false,"date":"1 April 2000","rate":"10","helpful":"159 out of 244 found this helpful.","title":"One of the best films of the 90's","content":"Winston Groom's Forrest Gump was a novel that was complicated, but (Oscar winning) director Robert Zemeckis brings events together with visual effects that boggle even George Lucas. And leading the film in this odyssey of American life is Tom Hanks playing Gump (he won his second Oscar for his portrayal) in a film that shows one man who goes through many events in history to find the one he loves. Well done, well acted, and well directed to pythagorean procision. A++"},{"username":"tavm","userUrl":"https://www.imdb.com/user/ur11228318","reviewLink":"https://www.imdb.com/review/rw3083813","warningSpoilers":false,"date":"9 September 2014","rate":"10","helpful":"8 out of 11 found this helpful.","title":"After 20 years, I still love Forrest Gump!","content":"When I originally watched this with my mom 20 years ago, we both were pretty touched by the events of Forrest Gump's life and the way he handled things. So now, watching this in IMAX with my movie theatre-working friend, it's the same feelings all over again but now having some additional life experiences, one notices things one hadn't thought of before. Like how the first person who sits with Forrest on the park bench is so uninterested in his story she takes the wrong bus and admits it to him while the last one who sits with him doesn't take her scheduled one because she's so immersed in hearing about his life! Or how Jenny realizes how much she truly loves him despite the way she sometimes treated him. Robert Zemeckis truly made a very compelling picture. And Tom Hanks delivered a wonderful performance worthy of a second Oscar win. Nice humorous stuff involving Hanks mixed in real news footage of the various presidents. And great music soundtrack to mark the times they lived in. Oh, and I loved the supporting cast of Mykelti Williamson, Sally Field, Gary Sinise, and Robin Wright as Jenny. With all that said, I'll now just say that Forrest Gump is worth all the praise and adulation it has gotten over the years."},{"username":"ComedyFan2010","userUrl":"https://www.imdb.com/user/ur23138767","reviewLink":"https://www.imdb.com/review/rw2277133","warningSpoilers":true,"date":"10 July 2010","rate":"8","helpful":"5 out of 9 found this helpful.","title":"It is overrated but far from bad","content":"The movie is a bit over-hyped. And I do think that Pulp Fiction should have gotten the Academy Award that year. But there are many times when I disagreed with the winner and this is the one time where I am not too upset because it is still a great movie.It shows us the history through the eyes of Forrest Hump. He has a low IQ and this makes them look at things with the eyes of an innocent and pure person.I disagree with the people who believe that the message of the movie is that one should never question authority. Forrest doesn't just follow. While he doesn't analyze his actions much, he usually does what he feels like. He does save Lt. Taylor even though he is telling him to leave him. He has a bunch of people following him on his run, which I think is another example where it shows that one should not just follow but try to understand why. And I never saw Jenny as a bad character. She was an abused person trying to find herself. Her death is not some kind of punishment for her actions and the fact that she was fighting for social changes. It is just a \"part of life\", and her life ends well because at the end of it she is finally at peace with herself. She lived a life that she wanted and at the end had a family and realized that Forrest is the one who loved her more than anyone even though she used to think that he doesn't know what love is.The acting is very good. I loved Robyn Wright as Jenny and Gary Sinise as Ltd. Taylor.I don't think it is a political propaganda of any kind. I don't know what the political beliefs of the director are, but I didn't feel it was pushing us in any way.The movie has many messages. One would be to take all of lives opportunities. That even when it seems like nothing good will happen it might. That one should fight for what one believes in. That one can find love in the most unusual places It is a very sweet movie. One shouldn't take it to seriously, analyze it on a political level or wait for it to be believable. It is very unique and interesting. A bit too long and too sweet maybe, it is still very good"},{"username":"edwagreen","userUrl":"https://www.imdb.com/user/ur2542703","reviewLink":"https://www.imdb.com/review/rw1301460","warningSpoilers":false,"date":"26 February 2006","rate":"10","helpful":"3 out of 9 found this helpful.","title":"Delicious Box of Chocolates ****","content":"Oscar-winning film of 1994 with an amazing award winning performance by Tom Hanks. It's the story of a slow young man who just seems to be in the right place while monumental events are taking place in this nation's history.Hanks has never been better. His slowness is beautifully realized and then audiences know that he is far from the slow person that he is attempting to depict.Sally Field, as his mother, is equally superb and should have been rewarded with at least a supporting Oscar nomination. It was amazing that the Academy overlooked her brilliant performance.Gary Sinise's performance as the soldier who ultimately is crippled is also splendid.Life is certainly like a box of chocolates. You know what you're going to get. With \"Forrest Gump,\" you will get the best of the best chocolates."},{"username":"hitchcockthelegend","userUrl":"https://www.imdb.com/user/ur16161013","reviewLink":"https://www.imdb.com/review/rw2031053","warningSpoilers":false,"date":"2 March 2009","rate":"9","helpful":"4 out of 7 found this helpful.","title":"Best Picture Oscar winners are like a box of chocolates.....","content":"Forrest Gump, from a humble afflicted childhood, and with a low IQ, goes on to play a major part in the history of the second part of the 20th century.Forrest Gump is one of those movies that comes along every once in a while to light a fuse under the movie worlds bottom! The sort of film that has evident flaws yet packs in so much charm, wit, intelligence and sentiment to make it really difficult to dislike with any sort of conviction. Even those with an aversion to the talent of Tom Hanks would surely be kidding themselves if they honestly fail to see that Hanks, as Gump, gives anything less than an extraordinary performance.What made Forrest Gump such a well loved picture? Garnering 5 golden baldies at the Academy Awards {three of them the main ones} and earning a staggering $677,387,716 worldwide after being made for the now relatively paltry sum of $55 million? Personally I think it has a little of everything that a film watcher wants in a picture, it sure does have things many dislike {the romantic arc, the overdose of sugary sentiment}, but as Forrest lurches from each apparently none-plussed situation to another, the air of the underdog coming thru triumphant sticks in the craw, but, in a most appetising way. We are in the company of a perfectly honest, simple and innocent man, he may not know it, but Forrest Gump has become a champion of the people, both in the film and to us the movie loving public.If by some miracle you still haven't seen Forrest Gump, then I urge you to do so, it may not resonate with you as much as it did/does the majority {argue with the box office I say}, but for towering performances by Tom Hanks and Gary Sinise, and for being a clever movie with its finger on the pulse of Hollywood, Forrest Gump has few peers. 9/10"},{"username":"Calicodreamin","userUrl":"https://www.imdb.com/user/ur29385135","reviewLink":"https://www.imdb.com/review/rw7793277","warningSpoilers":false,"date":"24 January 2022","rate":"7","helpful":"1 out of 2 found this helpful.","title":"Jennayyy","content":"A decent movie in terms of storyline and production value. The characters are well cast and well acted and the story flows easily through the life of Forrest. Some cinematic shots."},{"username":"Theo Robertson","userUrl":"https://www.imdb.com/user/ur1532177","reviewLink":"https://www.imdb.com/review/rw0339323","warningSpoilers":false,"date":"11 September 2003","rate":"4","helpful":"41 out of 125 found this helpful.","title":"Only In America","content":"I remember the BBC coverage of the Oscars in 1995 . Barry Norman was asking the Brits in Hollywood - Among them Tracey Ullman and Alan Parker - what they thought of the years nominations and the British view was unanimous that FORREST GUMP was nothing more than an overated mediocre movie . After seeing the film for myself I`ve got to agree with the standard British view - This is an overated mediocre movie It`s impossible to believe anyone outside America could love this movie . The overated ( Third time I`ve used that word in this review ! ) Tom Hanks plays Forrest the local town idiot who experiences many of the truimphs and torments of 1950s 60s and 70s America , and it`s all produced , played and written in a sickly sweet way , so sickly sweet you should watch this with a bucket in your hand so you don`t get any vomit on the carpet.Amazing fact . Both American and non American voters on this site give FORREST GUMP an identical voter average - 8.1 . I`m at a loss to explain this"},{"username":"bevo-13678","userUrl":"https://www.imdb.com/user/ur76062573","reviewLink":"https://www.imdb.com/review/rw5589839","warningSpoilers":false,"date":"29 March 2020","rate":"10","helpful":"4 out of 7 found this helpful.","title":"Iconic","content":"I like the bit where he drank all those dr peppers and had to do a wee"},{"username":"LeonLouisRicci","userUrl":"https://www.imdb.com/user/ur33374263","reviewLink":"https://www.imdb.com/review/rw2945809","warningSpoilers":false,"date":"20 January 2014","rate":"8","helpful":"4 out of 5 found this helpful.","title":"Even The Mentally Challenged Can Be A Master of The Universe","content":"Almost Anyone can become Amazingly Successful in America, just Look at those who have run for President and Vice President of the United States and some have Actually Won. Arguably not Our Best and Brightest.This is Excellent Entertainment, but could be Dangerous Entertainment. It's like those Infamous Subliminal Messages you Hear about that Enter the Subconscious without Your Consent or Knowledge. In this Movie nothing is Hidden, it is Unabashedly Up-Front about its Intent.This is a Fun Film but be Advised. It has a Political and Social Agenda. In one of the First Scenes the Audience is shown how Forrest got His Name. From one of the Founders of the Ku Klux Klan. And We're off and Running.Gump's Unanswered Love for His Sweetheart Jenny is Hammered Home throughout and She, along with any other Liberals are Treated here with Contempt and Her Behavior towards Forrest Gump is more than Contemptful, it is Hateful until the Bitter End in this \"Sweet\" Movie. If this Film is Approached with just a Little Cultural Awareness and Realize that it is Manipulating the Audience on All Levels, it can be Enjoyed as a Philosophical Point of View on any Number of Subjects. But the Filmmakers Know that most Folks are not that Discerning and Therein Lies the Danger."}],"errorMessage":""}