{"imDbId":"tt0172495","title":"Gladiator","fullTitle":"Gladiator (2000)","type":"Movie","year":"2000","items":[{"username":"MartinHafer","userUrl":"https://www.imdb.com/user/ur2467618","reviewLink":"https://www.imdb.com/review/rw2564841","warningSpoilers":false,"date":"12 February 2012","rate":"8","helpful":"17 out of 50 found this helpful.","title":"Amazing and a bit disappointing.","content":"Visually, \"Gladiator\" is a masterpiece. I saw a documentary about how they made this film long before I saw the actual movie and it's amazing to see how they used CGI to construct an enormous FULL stadium even though most of it wasn't real! The costumes, props, chariots and trappings were also gorgeous--as good as anything you'll ever see in a film about ancient Rome. And, with some spectacular stunts and TONS of blood, it is brutal--but spectacularly brutal. You really have to see this film and it will knock your socks off.If you look at my summary, however, I say that the film is a bit disappointing as well. As a retired history teacher, I know that much of the history shown in this film is wildly inaccurate. It bears only a very superficial semblance to the facts and it's a shame, as the true story of Emperor Commodus would make for an exciting film. In addition, at times I felt as if the dialog was just awful. Too often, folks talks as if they were making speeches or delivering lines in a high school play. And, it turns out I am not alone. After the film, I read through the IMDb trivia and noticed that the actors ALSO hated the dialog and much of it was changed....though in my opinion, not enough of it was changed. There was often no emotion other than rage or boredom from Maximus, for example. His grief at the crucifixion of his family sounded LESS emotional than it should have--like he was upset that the commissary forgot to but cheese on his burger--not like a man grief-stricken with loss. Simply put, the human side to the film is stilted.So what you are left with is a WILDLY exciting film--a true spectacle. But it lacks the humanity and truth that would have made it even better. Still, it's well worth seeing."},{"username":"TheLittleSongbird","userUrl":"https://www.imdb.com/user/ur20552756","reviewLink":"https://www.imdb.com/review/rw2066737","warningSpoilers":false,"date":"15 May 2009","rate":"9","helpful":"16 out of 19 found this helpful.","title":"Disturbing, but beautifully made and well acted, as well as jaw-dropping scenery!","content":"Ridley Scott rarely disappoints with his films. All of them, including the unjustly-maligned Legend, are visually stunning and just show the director's artistic genius. Gladiator should be up there as one of the best films he's done, if not the best. Almost everything on screen is very graphic, making some scenes upsetting to watch, but the visuals are just outstanding. The music score by Hans Zimmer just adds to the drama that is already there in the script. which is well written and rather Shakespearean. The performances were brilliant, especially Joaquin Pheonix and Oliver Reed. Russell Crowe is wholly convincing in the title role, and Richard Harris and Connie Nielson are also excellent. The costumes are brilliant, as well as the sets. In conclusion, Gladiator is a near masterpiece, only marred by some upsetting scenes. 9/10 Bethany Cox."},{"username":"bkoganbing","userUrl":"https://www.imdb.com/user/ur2483625","reviewLink":"https://www.imdb.com/review/rw6146388","warningSpoilers":true,"date":"4 October 2020","rate":"8","helpful":"11 out of 14 found this helpful.","title":"The Glory that was Rome was of another day","content":"35 years after Samuel Bronston and Anthony Mann gave us The Fall Of The Roman Empire, Ridley Scott told the same tale of the Emperor Commodus and his problems succeeding his legendary father, Emperor/philosopher Marcus Aurelius. Neither film got the story right, both have him killing his father and both have him with a hero/rival. In the Mann film it's Stephen Boyd in this film it is Russell Crowe. Both have a sister working against him Sophia Loren in the Mann film and in the Ridley Scott film Connie Nielsen.Although I loved Christopher Plummer in The Fall Of The Roman Empire, truth be told Joaquin Phoenix is closer to the real Commodus. Commodus was only a teen when he became Emperor in 180 AD and reigned a lot longer than it seemed in Gladiator. In real life he was strangled by a wrestler who was part of a conspiracy. He did in fact love the Coliseum and did like to participate occasionally as is shown in both films.In this film when Joaquin Phoenix learns that Richard Harris as Marcus Aurelius plans to name Russell Crowe one of his best fighting generals as his successor he kills Harris and Crowe's family. Crowe is sold off in bondage, but works his way back to Rome to take Phoenix down.Gladiator marks he farewell film of Oliver Reed who plays the head of the gladiator school who trains Crowe. Derek Jacobi plays a senator and as he did in I Claudius dreams of reestablishing the republic.Gladiator won for Best Picture and Best Actor for Russell Crowe and also won for costume design, special effects, and best sound. Sharp film fans will see bits of both Ben-Hur and Spartacus woven into the story.Gladiator is a well put together drama and Crowe and Phoenix have quite an acting duel. Maybe the real Commodus story will get a film one day. Until then Gladiator and The Fall Of The Roman Empire will do nicely."},{"username":"Leofwine_draca","userUrl":"https://www.imdb.com/user/ur0482513","reviewLink":"https://www.imdb.com/review/rw3509536","warningSpoilers":true,"date":"22 July 2016","rate":"9","helpful":"3 out of 3 found this helpful.","title":"Epic spectacle","content":"An epic, awe-inspiring movie which thankfully shows us that Hollywood hasn't forgotten how to make good movies anymore, this is a film which has it all, from intrigue to suspense to violence to subtle romance. Forget any of the other CGI-laden rubbish filling out the multiplexes, this is a film which simply has to be seen at the cinema - or alternatively on a very big television screen indeed. Due to the fact that this film was hyped up incredibly, it doesn't actually live up to the hype, but nothing could have done. GLADIATOR is pure, old-fashioned escapism, nothing less.For once, the acting is totally flawless. Russell Crowe comes out of nowhere to give us a powerful, sensitive action hero, able to emote without the use of dialogue, delivering his lines when needed with a gruff British accent. Crowe is a revelation here - I hated him in VIRTUOSITY, but his acting is excellent and finely judged, right up there with the brooding intensity of De Niro or Pacino. He is well supported by a varied cast, including Connie Nielsen who makes a very sultry and alluring love interest. Joaquin Phoenix makes his snivelling, whining emperor truly despicable, easily soaking up the entire audience's hatred. Oliver Reed is also very good in what was to be his final role, as the proud but friendly slave owner who becomes Maximus' friend. Richard Harris lends an air of nobility and authenticity in his brief role as the dying emperor Caesar, while noted British actors Derek Jacobi and David Hemmings appear as senators.Okay, so the plot of revenge is a fairly clichéd one and the plot here is reminiscent of a whole number of other films, as well as MACBETH, but it is given added power and resonance by the great acting. The music score is also absolutely excellent and really adds to this film's atmosphere. Physically, it is beautifully made and extremely realistic - you constantly feel that you're in Rome itself. Everything is epic and the whole film is chock-full of grandeur. It looks lovely, it sounds lovely, hell, it is lovely.Director Ridley Scott doesn't skimp on the gore front either, leaving in some gruesome shots of people being cut in half, being decapitated and blood spraying in the air and all over the place. The battle scenes are the highlight of the film and are filmed in a weird way - sometimes sped up, sometimes slowed down - which make them so realistic that you do feel like you're there. They're also very exciting, with Crowe taking on ferocious tigers, masked hulking warriors, and chariots too. The twists and turns in the plot are unexpected and there's a moving, poignant ending giving this film an extra element. Old-fashioned, well-crafted and truly splendid - any movie fan owes it to themselves to see this film."},{"username":"SnoopyStyle","userUrl":"https://www.imdb.com/user/ur2898520","reviewLink":"https://www.imdb.com/review/rw2898208","warningSpoilers":false,"date":"2 November 2013","rate":"8","helpful":"2 out of 4 found this helpful.","title":"Grand","content":"Maximus (Russell Crowe) is a powerful and popular Roman general. Emperor Marcus Aurelius is an aging ruler who prefers Maximus than his own conniving son Commodus (Joaquin Phoenix). After Commodus kills his own father, Maximus refuses to acknowledge the new emperor and his family is slaughtered. He falls into slavery and the gladiator arenas.The scale is a grand. The use of CG is top notch. It really expanded the visual experience to the required spectacle. Russell Crowe takes on the big Hollywood leading man role with ease. Joaquin Phoenix is well conceived as the evil foil to Crowe. The movie has the big battles, and the fun gladiator fights. It is grand in the best traditions of Hollywood."},{"username":"Hitchcoc","userUrl":"https://www.imdb.com/user/ur0278527","reviewLink":"https://www.imdb.com/review/rw0598968","warningSpoilers":false,"date":"23 October 2001","rate":"7","helpful":"8 out of 13 found this helpful.","title":"Predictable Spectacle","content":"I never got around to seeing this in the theater. I'm sure it's a marvelous spectacle on the big screen. I don't know what it was. I found the acting good, the spectacle and special effects outstanding, the hero one we could cheer for. Why, then, do I feel so empty? Was it all the hype, best picture of the year? I just don't know. It was totally predictable. There were absolutely no surprises. After seeing The Patriot and realizing both movies have the same plot, I expected something more. Why are evil Roman Emperors always portrayed as cowardly wimps? I still don't believe that he actually was willing to go into the arena with Maximus. He wouldn't have anything to do with war. There is the obligatory killing of the family. That goes back to Macbeth folks. If a ruler wants to stay a ruler, leave the family alone. I know it's just to show how evil and powerful the Emperor is, but do you want the top general in the army gunning for you?--this will guarantee it. There is masterful cinematography in this film. The scenes of violence are masterful. Although once you've seen one fountain of blood spouting up, you've seen them all--one decapitation is like another. What I wanted was to see the characters really dealing with the evil of the times and confronting it. There is always that army out there ready to be commanded again. There is always the possibility that the greatest empire in the world can be destroyed by one guy (like when Mel Gibson won the Revolutionary War all by himself). I think this is really quite a good film. But I don't see it as deserving to be named the best of any year. We've come to demand a movie that looks good rather than one that grasps our heart."},{"username":"Kirpianuscus","userUrl":"https://www.imdb.com/user/ur61197531","reviewLink":"https://www.imdb.com/review/rw3602604","warningSpoilers":false,"date":"20 December 2016","rate":"","helpful":"1 out of 2 found this helpful.","title":"admirable work","content":"one of rare contemporary films who is, obvious, very, very close to be defined as perfect. because it illustrates a collection of virtues , many long time ignored, few not very familiar first, it is a great eulogy to a favorite genre of classic Hollywood. same recipes, same craft, same vision, same style. a Spartacus of a new millennium. then, it is a film of actors more than one of \"tricks\". and to say Russell Crowe/Oliver Reed/Joaquin Phoenix/Richard Harris does a great job is far to be enough. because the genius of Ridley Scott is to give not parts but an entire fresco. so, it is the film of each actor and fight scene and dramatic moment and touching sequence and fragment of impressive Rome. mix of poetry and history and epic and science of detail, it is a classic. it sounds precious but it is only the truth. because it is , in same measure, a film for heart and mind. and a courageous exercise to resurrect the force and fascinations of the historical blockbusters from the decades VII - VIII."},{"username":"bob the moo","userUrl":"https://www.imdb.com/user/ur1002035","reviewLink":"https://www.imdb.com/review/rw0600133","warningSpoilers":false,"date":"26 October 2003","rate":"","helpful":"6 out of 16 found this helpful.","title":"A great revenge movie that is not as worthy as it thinks it is but is still a great movie","content":"Maximus is the favoured commander of Emperor Aurelius' armies in Germania. He is favoured to the point that the Emperor, sensing his death is near, commands him to succeed him and return Rome to a republic. Caesar's son discovers this, kills his father and orders Maximus dead. However he survives and, finding his wife and son murdered, is captured by slave merchants and sold to gladiator trainer Proximo. As his skills increase his strength he eventually comes to the games at Rome, where he finds himself anonymous and within striking distance of the revenge he seeks.If you strip away all the period settings and political battling in the background, this film is essentially a revenge film and a good one at that. It's best to ignore the liberties it takes with both logic and history and enjoy it for what it is. At times it does threaten to take itself too seriously, but it's worthy sheen is just about supported by the emotive story and strong characters. The film hits a good mix of political goings-on and action, with the action being the main body of the film. It is delivered in bloody spades and the action scenes are a lot more dramatic than I expected.Although the characters fit into traditional revenge movie moulds (wronged man, evil man in position of power etc) they still manage to be strong characters in their own right. Maximus is a strong hero and it is hard not to feel for him and thus get involved in the film. True, the script is very generous in it's painting of him but this is a minor issue. Crowe takes the lead really well and, while I don't personally care for him, he really fitted the role here. Phoenix plays it well despite the fat he could easily have given into mugging the evil role. Harris is good in his small role, although Jacobi just shows up once or twice. Reed has a good part for his swansong but this is really Crowe's film and he commands it as his character does his army.The close of the film always gets me as it treats the characters and audience with respect (although it is not as daring as some would suggest. Overall this is a great film to watch as long as you don't take it too seriously or go looking for flaws. The music and direction gives it a great feel \u0096 the music in particular used to support the required emotions created by the action. Three hours go by very quickly and enjoyably."},{"username":"Sleepin_Dragon","userUrl":"https://www.imdb.com/user/ur15311310","reviewLink":"https://www.imdb.com/review/rw7946887","warningSpoilers":false,"date":"12 March 2022","rate":"10","helpful":"1 out of 2 found this helpful.","title":"Spellbinding.","content":"One of the best films of a generation, it's a bold claim, but Gladiator truly is that good. Every single element is perfect, the story is phenomenal, one to absorb you for the full running time. The visuals are incredible, an epic masterpiece for the eyes as well as the soul. The acting first rate, surely the aim of any film is to move you, this does just that and then some.The best of Russell Crow are far as I'm concerned, he really does command the screen throughout, Joaquin Phoenix is just as good, it makes me so sad that this was the last film of the late great Oliver Rees, and of course he's awesome.I must also comment on the incredible soundtrack, the sublime music of Has Zimmer coupled with the ancient, enchanting voice of Lisa Gerrard, the music is the same glorious standard as the film.One of my top ten films of all time, a masterpiece, 10/10."},{"username":"kosmasp","userUrl":"https://www.imdb.com/user/ur5876717","reviewLink":"https://www.imdb.com/review/rw2099408","warningSpoilers":false,"date":"21 July 2009","rate":"8","helpful":"1 out of 4 found this helpful.","title":"Resurrection","content":"I haven't seen the Director's Cut yet and I have to admit, that the story really didn't capture me as much as it did with others. For once, many things that happened were so foreseeable, I was able to close my eyes, open them a few minutes later and could see what I predicted was gonna happen.While that still works for many movies, it did kind of ruin my enjoyment of the Gladiator. A movie which \"resurrected\" the Sandal movie, as was stated back then. Obviously, ten years later it's safe to say, that didn't really happen. But what made this movie so popular? For one thing, every movie that has a sort of underdog as a main character, can always be sure to get many sympathies. But that's not all! Mr. Ridley Scott shot this movie in a great way. Some symbolisms in the framing and the color scheme, being also responsible for peoples reactions.And while I did like the fight scenes and the scenery in general, the movie left me cold for the main character. I'm not completely alone with my perception of the movie (I still think that a 6/10 is pretty good), but it's more likely that you will like this and won't really think about plot points and the journey of the hero, while you watch this ... Something I couldn't do.Edit: No I watched the longer cut (wrongly called it Director's cut above as Mr. Scott would scold me for saying that earlier - it is just an extended cut) - and unlike Ridley, I actually liked the longer cut better. It added some gravitas and much needed backstory to certain things. And while the movie overall still remains predictable, the scope of it all is plain amazing. Considering the movie started while the script wasn't completely done, might even give this more things to like ... So I reckon I was maybe a bit too harsh on my initial rating (almost everyone I did watch it with fell asleep though), but the rating now is for the rewatch.I still think that other movies (be it the old Spartacus or the newer TV show Spartacus to name a few) did it better ... but considering my love for Sandal movies as a kid, I should have seen the love that was put into this. No matter how easy to decipher and the cliches that were put in. And the fun Russell Crowe had on set .. the behind the scenes pranks, might give you a new view and love for this as well I reckon."},{"username":"classicsoncall","userUrl":"https://www.imdb.com/user/ur2707735","reviewLink":"https://www.imdb.com/review/rw3040978","warningSpoilers":true,"date":"28 June 2014","rate":"9","helpful":"1 out of 2 found this helpful.","title":"\"Brothers, what we do in life echoes in eternity.\"","content":"I saw Russell Crowe not too long ago in 2012's \"The Man With the Iron Fists\" where he looked about a hundred pounds heavier than he did here; his character was a mercenary named Jack Knife. It was quite a contrast then to see him once again in this film made a dozen years earlier. In fact, considering that Crowe was playing a Roman warrior, he actually looked like he might have been too small for the part. Well, so much for that.\"Gladiator\" has an epic sweep not often seen in modern films, the opening battle scene makes you wonder if wars were actually fought that way in ancient times. The political intrigue involved in the plot to murder Maximus (Crowe) and it's failure sets up a dynamic story in which Maximus battles to regain respect and notoriety with the Roman citizenry. Personal relationships are put to the test as Emperor Commodus (Joaquin Phoenix) proves to be a too cunning adversary to be defeated by normal means.You know, I had to replay the Commdodus/Maximus dungeon scene when Commodus stabbed his enemy, and it didn't make sense to me. When the blade struck Maximus, it appeared to go through his tunic which became blood stained, but in the pull away shot, Crowe wasn't wearing a garment of the same dimensions and he didn't appear to be injured or bleeding. I went back and forth with that one until I decided it had to be an error in filming or editing, but it certainly was a head scratcher.Anyway, this is an intriguing movie as long as you don't let historical accuracy guide you. Or get distracted by the use of elevators to raise soldiers up to ground level of the Coliseum to do battle. What's inspirational is the way Maximus earned the loyalty of his fellow warrior prisoners and their dedication to fight in strength and honor under impossible circumstances."},{"username":"lee_eisenberg","userUrl":"https://www.imdb.com/user/ur4888011","reviewLink":"https://www.imdb.com/review/rw1127500","warningSpoilers":false,"date":"15 July 2005","rate":"7","helpful":"3 out of 7 found this helpful.","title":"Ave!","content":"Okay, I'll admit that I didn't consider \"Gladiator\" the best movie of 2000, but it did have it's merits, namely that it focused on plot rather than violence. Russell Crowe certainly did a good job as Maximus, and Joaquin Phoenix made a nasty Commodus. Although that was sort of the problem: the good guy was 100% good and the bad guy was 100% bad. It might have been a little better if there had been some gray area.But other than that, it was a really good movie. Since we had just gone to Italy when the movie came out (we went for the millennium jubilee), it made the movie all the neater. I guess that you could say: the movies that we watch in life echo in our eternities."},{"username":"gavin6942","userUrl":"https://www.imdb.com/user/ur1234929","reviewLink":"https://www.imdb.com/review/rw3126427","warningSpoilers":false,"date":"18 November 2014","rate":"7","helpful":"2 out of 4 found this helpful.","title":"Great Roman Epic, Better On The Second Viewing","content":"When a Roman general (Russell Crowe) is betrayed and his family murdered by an emperor's corrupt son (Joaquin Phoenix), he comes to Rome as a gladiator to seek revenge.The music is very much like that for the \"Pirates of the Caribbean\" series, which should not be surprising given that both come from Hans Zimmer. Did he recycle the music here for \"Pirates\", or is it just a similar style? Hmm.This is the film that really made Russell Crowe an international star, and helped him earn an Oscar (though it probably should have gone to Geoffrey Rush). This is also probably the best film from Ridley Scott since \"Blade Runner\". While on first viewing it may not seem like anything special, it really does present a great telling of Rome and its problems (fictionalized) and could have parallels to empires today."},{"username":"jboothmillard","userUrl":"https://www.imdb.com/user/ur4248714","reviewLink":"https://www.imdb.com/review/rw1166723","warningSpoilers":true,"date":"6 September 2005","rate":"9","helpful":"2 out of 12 found this helpful.","title":"Gladiator","content":"This is a great story about a man kidnapped, but still keeps doing what he was born to do. Oscar winning, and BAFTA and Golden Globe nominated Russell Crowe plays General Maximus, he used to be a soldier who fought a war in Germania. He is thought by King Marcus Aurelius (Richard Harris) as the son he should have had. Commodus (Oscar, BAFTA and Golden Globe nominated Joaquin Phoenix) is the evil man who kills his own father to become king himself. Unfortunately Maximus was taken by a tradesman and he is given to Proximo (BAFTA nominated Oliver Reed) and trained to become a gladiator. He fights against men and animals in front of some audiences. It's when Commodus witnesses one of the shows that he is reminded that he should kill him. Oliver Reed was the most watchable of the actors, besides Crowe, its a shame he died while filming. Also starring Connie Nielsen as Lucilla, Derek Jacobi as Gracchus, Djimon Hounsou as Juba, David Schofield as Falco, David Hemmings as Cassius and Omid Djalili as Slave Trader. An excellent film from Oscar and Golden Globe nominated Alien and Blade Runner director Sir Ridley Scott. It won the Oscars for Best Costume Design, Best Visual Effects, Best Sound, and Best Picture, and it was nominated for Best Art Direction-Set Decoration, Best Cinematography, Best Editing, Best Music, Original Score for Hans Zimmer, and Best Writing, Screenplay Written Directly for the Screen, it won the BAFTAs for Best Cinematography, Best Editing, Best Production Design, and Best Film, and it was nominated for the Anthony Asquith Award for Film Music, Best Special Visual Effects, Best Costume Design, Best Make Up/Hair, Best Original Screenplay, and Best Sound, and it won the Golden Globes for Best Motion Picture - Drama, and Best Original Score. Oliver Reed was number 78, and Russell Crowe number 26 on The 100 Greatest Movie Stars, Reed was also number 26 on The 50 Greatest British Actors, General Maximus Decimus Meridias was number 50 on 100 Years, 100 Heroes & Villains, the film was number 98 on The 100 Greatest Tearjerkers for the ending, it was number 24 on The 100 Greatest War Films, it was number 99 on The Ultimate Film, and it was number 6 on The 100 Greatest Films. Very good!"},{"username":"rmax304823","userUrl":"https://www.imdb.com/user/ur0819382","reviewLink":"https://www.imdb.com/review/rw1666444","warningSpoilers":true,"date":"1 June 2007","rate":"6","helpful":"3 out of 14 found this helpful.","title":"Alpha Males","content":"The emperor Marcus Aurelius (Richard Harris) is murdered by his son Commodus (Joaquin Phoenix). Aurelius's designated successor, General Maximus (Russel Crowe) is betrayed, becomes a slave, a gladiator, finally a the most popular gladiator in Rome, and kills Commodus before he himself drops dead of an unfair wound. Rome is turned over to Senator Grachus and is saved. Commodus's sister (Connie Nielson) has a son who will become the next emperor. Actually, that happy return to a Republic is tacked on, isn't it? Dictatorships continued till the end.I kept trying to figure out just what elements distinguished \"Gladiator\" from the earlier sun and sandal epics of the 1950s, like \"Herculus,\" usually starring some beefed-up parody of a male figure like Steve Reeves, or \"Ben Hur\" for that matter.Obviously \"Gladiator\" is more expensive and the special effects more especially effective. And, thank God, unlike Steve Reeves' epics the movie isn't dubbed, so nobody sounds like Orson Welles gargling.\"Gladiator\" is darker all around than almost all earlier movies of the period. Cinecitta was always so sunny and its weather so balmy. There's a moment near the beginning of \"Ben Hur\" when Judah and Massala meet and Massala removes his decorative metal cuirass and reveals the soft scarlet cloth beneath it. It's a neat splash of color. There's nothing like that in \"Gladiator.\" The Romans all wear dark clothing, usually black. And their armor is spiky-looking and abrasive, as if influenced by some video game or by Dungeons and Dragons. I guess the Senate wears white but even their robes are drained of brightness, so that they resemble the sheets that my laundry dryer produces. And sometimes it's cold too. Snow falls and the Romans wear fur robes. Pretty ugly stuff.The dialog isn't dubbed but the Foley artists have been hard at work generating the expectable clichés. No sword can be drawn without the slick sound of sharp metal against metal. And God forbid that a sword be thrown through the air without going whoo-whoo-whoo. If one of these behemoths swings his weapon it's invariably accompanied by a swoosh or a wheeesh. I don't know why. It doesn't make the motion more compelling in any way. It's a distraction because somewhere in the viewer's mind there must be the realization that if you swing a piece of metal through the air, it simply does not swoosh. The sounds of battle aren't the only clichés. The \"thumbs down/ thumbs up\" business for death and life was, I think, borrowed from an improvisation in a Cecil B. DeMille movie, not from the historical record.Award for best performance: Richard Harris (his last movie) as Marcus Aurelius, the emperor who is at least as well known for his philosophy -- he was a stoic -- as for his martial exploits. Imagine -- a head of state who can have an original thought? \"Death smiles at all of us and all we can do is smile back.\" Award for best-looking and most succulent actress: Connie Nielson. She couldn't be better. I don't know about her performance but she looks absolutely right for the part of the bitter widow, abused by her own brother, hopelessly in love with a man she'll never have. She's beautiful, sensuous, elegant, and as cold as polished steel.Best imitation of Steve Reeves: Russel Crowe, he of the enormous trapezii. I wouldn't want to get in the arena with that guy. His performance? Well -- he tries to laugh at one point.Best bad guy: Joaquin Phoenix isn't bad as the evil, cowardly, deceitful Commodus. It wouldn't surprise me to find that he had an amphora stuffed with ladies' lingerie. I'll give him a pass on insisting on incest, inasmuch as Connie Nielson is the victimized party. But, man, what a creep; no longer the teen age beauty, slightly more plump, and with a thicker voice.Is it worth seeing? Well, of course! Could anything on which so much expense had been lavished NOT be worth seeing? And it's thought provoking too. The thought it provokes is: what is it in human nature that prompts us to watch innocent others suffer and die violently? No? You don't have to look long on the internet to find video clips with titles like \"Iraqi gets blown up,\" or \"Marine has arm shot off!\" We can smugly dismiss \"the mob\" of Romans for their barbaric tastes but we can't pass a highway accident without looking for some mangled limbs. Hell, we revel in it."},{"username":"ccthemovieman-1","userUrl":"https://www.imdb.com/user/ur4445210","reviewLink":"https://www.imdb.com/review/rw1511624","warningSpoilers":false,"date":"1 November 2006","rate":"8","helpful":"75 out of 102 found this helpful.","title":"A Throwback To The Epics Of The '60s","content":"An intense Roman epic, a la \"Ben-Hur\" or \"Spartacus,\" it was nice to see something like this made again. It had been since the 1960s that we had seen a 3-hour extravaganza like this.Like Ben-Hur, this is a story of a successful man who loses everything thanks to an evil man, and then has to fight his way back up to seek revenge on that man and to obtain his freedom back. It's a tried-and-true formula. This movie doesn't go to excess on the violence as some of the other more recent epic films did, such as \"Braveheart\" or \"The Patriot.\"The acting is excellent, beginning with Russell Crowe, who has established himself as one of the best actors of today. Joaquin Phoenix also put himself \"on the map\" as an actor with his portrayal of the evil \"Commodus.\" He's so annoying you want to slap that sucker, which means he's doing a good job acting. Kudos to the rest of the cast, too.Too bad they don't make more of these type of films, as they did in the 1950s and 1960s."},{"username":"ma-cortes","userUrl":"https://www.imdb.com/user/ur3270789","reviewLink":"https://www.imdb.com/review/rw2569983","warningSpoilers":false,"date":"22 February 2012","rate":"8","helpful":"9 out of 14 found this helpful.","title":"Impressive epic movie with strong casting , rousing sets , and overwhelming combats","content":"Breathtaking Sword and Sandals plenty of swordplay , perfect cast ,lively pacing , massed action ,dastardly plots and many other things . The late second century : the Roman army is fighting Germania where takes place a bloody carnage . Troops are commanded by general Maximus (Russell Crowe). Ailing Marcus Aurelius ( Richard Harris) would like his confident and favorite to take over empire , but the events go wrong . Mean heir Comodus's (Joaquin Phoenix) vices arise from poor parental care as he takes power. When the Roman general is betrayed and his family murdered by an emperor's corrupt son , the insecure Commodus feels powerful . Having ensured father dies in his arms , the new emperor exerts his killer fury . Maximus , then comes to Rome as a gladiator to seek revenge .He won't swear loyalty and gets a chance to redeem himself .Father of a murdered son , husband to a murdered wife and I shall have my revenge in this life or the next .This bloody good movie has great action sequences well staged with stylish and vitality , thrills ,fundamental emotions , fortright spectacle ,fierce combats including scud catapults , and is pretty entertaining . The film results to be a special remake to ¨Fall of Roman Empire¨ directed by Antony Mann with Stephen Boyd , Sofia Loren and Christopher Plummer as Commodus , though is a little revisionist about characters , history and time when is developed the action . Before directing ¨Robin Hood , Kingdom of heaven¨ films , director Ridley Scott and Russell Crowe teamed but with much bigger budget . The final product looked as although the actors learn the screenplay and decided the best issue was to take a good time and amuse themselves and both managed to stage some excellent action scenes . Great performances abound , as stalwart Russell Crowe playing an enslaved ex-general who bent on vengeance , he is very fine ; in addition , vacilating empress Connie Nielsen is memorable and attractive , she comes up the film as a valiant and obstinate woman . Special mention to gladiator owner magnetically performed by Oliver Reed and Joaquin Phoenix as evil and crazed emperor in a sensationalistic interpretation . Marvelous relationship between Maximus-Russel Crowe and an African slave-Dijimon Honsou , the deep bond lends a P.C. historicity. Ample support cast formed by notorious British secondaries as David Hemmings David Schofield , John Schrapnel and endearing Derek Jacobi . There are great action sequences including the battle against Barbarians and the final confrontation in arena at the climax of the film. Impeccable but sometimes dark cinematography by John Mathieson . Movie is shot on natural sets and interior scenarios with impressive production design by Arthur Max , but also excessive use of computer generator images . Magnificent and sensible musical score by Hans Zimmer and Lisa Gerrard , including wonderful songs .I found it fun , well-acted , in Peplum tradition and fast-paced.The motion picture packed with pomp and pageantry is lavishly produced by the prestigious Douglas Wick and David Franzoni , also screenwriter ; being glamorously directed by Ridley Scott , at his best and as stylish as ever , similarly his previous film ¨Someone to watch over me¨ and others as ¨Blade runner¨, ¨Black rain¨ , ¨Legend¨ in which his visual style is impressive . The picture belongs to his speciality ,the historical genre , as ¨Robin Hood¨ , ¨Kingdom of heaven¨ , ¨Duelists¨ and ¨Black Hawk down¨ . Rating : Above average . Essential and indispensable watching for Ridley Scott followers"},{"username":"BA_Harrison","userUrl":"https://www.imdb.com/user/ur0945066","reviewLink":"https://www.imdb.com/review/rw4144947","warningSpoilers":false,"date":"27 April 2018","rate":"9","helpful":"3 out of 5 found this helpful.","title":"Maximus Excitus Entertainius.","content":"In the event of his death, ageing Emperor Marcus Aurelius (Richard Harris) intends to leave his trusted Hispano-Roman general Maximus Decimus Meridius (Russell Crowe) in charge of Rome, instead of allowing his son Commodus (Joaquin Phoenix) to become his successor. Commodus has other ideas: he murders his father and orders Maximus to be executed. Maximus, not one to give up quietly, makes a daring escape, and, badly wounded, heads for home, where he discovers that his wife and son have been crucified on Commodus' orders. Passing out from the pain of his injury, Maximus is captured by slavers, nursed back to health and forced to fight as a gladiator. This new life eventually leads him to the Colosseum of Rome, where he finally comes face to face with the man who betrayed him.From director Ridley Scott, Gladiator is a historical epic to rival the classics from the 'golden age' of Hollywood. Opening in 180 A.D., with a brilliantly orchestrated battle between the Roman armies and the tribes of Germania, Scott's film grabs the viewer's full attention from the outset and doesn't let go until the end, having delivered an Oscar-winning central performance from Crowe, a memorable score by Hans Zimmer, excellent supporting roles from the likes of Harris, Phoenix, Connie Nielsen and Oliver Reed, and some of the most impressively bloody scenes of hand to hand combat ever filmed.If I were to choose my favourite scene, it would be the 're-enactment' of the battle of Carthage, a savage piece of action cinema in which Maximus and his fellow gladiators are ushered into the arena like cattle to the slaughter, only to turn the tables on their attackers, winning the hearts of the Roman masses in the process. A rousing, blood drenched spectacle, it's a fine example of Scott's expert direction, a masterclass in camera placement and movement, editing (the violence is extreme, but the film doesn't wallow in the gore), sound design and special effects, which still thrills even after all of these years."},{"username":"moonspinner55","userUrl":"https://www.imdb.com/user/ur0989035","reviewLink":"https://www.imdb.com/review/rw1631050","warningSpoilers":false,"date":"5 April 2007","rate":"6","helpful":"3 out of 11 found this helpful.","title":"Not in the league of \"Spartacus\", though well worth-seeing...","content":"Russell Crowe won a Best Actor Oscar for his taut performance as Maximus, hailed general of battle in 180 A.D. Rome who soon becomes a fugitive and warrior-slave after the Emperor dies and his ambitious, wicked son (Joaquin Phoenix) takes command. Director Ridley Scott's sword-and-sandal, blood-and-guts spectacular isn't anything original, yet it certainly looks good and has many moments of power and emotion. Scott tries for the sweep of a latter-day \"Spartacus\", but the script isn't as intriguing and the film, while entertaining on the whole, isn't as memorable. Dedicated to actor Oliver Reed (Proximo), who makes his final film appearance, this Oscar winner for Best Picture has old-fashioned ideals transposed after the new-fangled violence, with lots of bloody action to snare modern moviegoers; it works successfully enough, and Scott efficiently uses the long running-time to build character and dramatic tension. **1/2 from ****"},{"username":"TxMike","userUrl":"https://www.imdb.com/user/ur0438066","reviewLink":"https://www.imdb.com/review/rw0598491","warningSpoilers":true,"date":"4 December 2000","rate":"","helpful":"0 out of 3 found this helpful.","title":"Excellent story, good acting, lots of gladiator action, beautiful filming, I rate \"8\" of 10.","content":"I have criteria for a film to make it up to my \"9\" or \"10\" rating and this one does not reach that level. Still, it is a very entertaining film that plays shorter than its 2 1/2 hours, and gives a good glimpse of the Roman state of emperors and politics in the second century after Christ. I rate it a solid \"8\" of 10.The straightforward storyline is not new. A loyal soldier, a \"Spaniard\" (Russell Crowe)who aging emperor Marcus Aurelius calls \"Rome's greatest general\", leads the Roman army to a convincing victory in Germania, the last frontier for the 180 A.D. Romans. This general, \"Maximus\", is the son the emperor wishes he had and asks him to come to Rome to help create a democracy. Immediately all fortunes change and Maximus goes from general to slave to gladiator to rebel. Packed around that storyline are some excellent, however gory, battle and arena scenes. The film ends a bit unbelievably.The DVD picture and sound are great. You get 2 discs for your purchase, the second has all the \"extras\" which are quite extensive and provide good perspectives on the Roman Empire, and the making of this film.** CAUTION - SPOILERS - READ AT YOUR OWN RISK -----After the victory at Germania, all Maximus wants to do is go home to his farm and wife and young son. It had been 2 years and 265 days since he had seen them. When the emperor's son, Commodus, finds out about his father's favor towards the Spaniard, he kills his own father to become emperor, has his guards take Maximus out to kill him, but Maximus gets the upper hand and kills them all and, badly wounded on his left shoulder, rides towards home. Roman guards also destroy his home, and kill his wife and son. He sees this, passes out, and is a changed man.He is rescued and sold into slavery to become a gladiator in small venues in a remote Roman province. There, he quickly becomes a killing machine, and soon heads for the big time in Rome, where the new emperor is putting on \"150 straight days\" of gladiator games in the area. The Romans are entertained by seeing gladiators kill each other, or Christian children eaten by lions.Ever since the old emperor was killed, then his family killed, Maximus's sole ambition was to face the emperor and get revenge. At their first face-to-face encounter, the Spaniard's popularity with the crowd kept him alive. Repeated \"traps\" were unsuccessful because Maximus was such a good fighter.Commodus borders on insane. He has a driving lust for his own sister, Lucilla, and tells her he wants a son by her so he can have his own legitimate heir to the throne, instead of her son by a now dead husband. Lucilla ends up helping in a plot to free Maximus who would return in a few days with an army of 5,000 to kill Commodus and restore some semblance of democracy, to fulfill the desires of the dead emperor. But insiders spoil that plot, kill Maximus' friend, and imprison him again.Finally, crazy Commodus wants to settle it in a fight in the arena between him and Maximus, man-to-man. But Commodus cheats - while Maximus is still shackled, Commodus stabs him deeply in the abdomen in what turns out to be a mortal wound. However, he has enough strength to first kill Commodus, and order all prisoners freed, and Rome freed, then Maximus dies and we see him, in dream-like sequences, joining his wife and son in the afterlife.A couple of things did not ring true. Maximus was so much better than everyone else, and it is only barely credible that anyone could have fought out of all those situations. Also, I am not a student of Roman history, but I find it hard to believe that an emperor would get into the arena and fight a gladiator. Still, it is a good watch and I will see it again."},{"username":"dbdumonteil","userUrl":"https://www.imdb.com/user/ur1219578","reviewLink":"https://www.imdb.com/review/rw0598973","warningSpoilers":false,"date":"4 November 2001","rate":"5","helpful":"7 out of 25 found this helpful.","title":"A poor man's Ben Hur","content":"Completely untrue as far as history is concerned:Marcus Aurelius died from the plague,and he did give his power to his son Commodeus (who did not strangle him,why would he?)On the other hand,Commodeus would have been strangled (in his bath?) but NOT by Maximus.The plot is linear,predictable and owes a lot to \"Ben Hur\".Forget the Christ and we have a similar pattern: a hero's downfall,his family is killed (thrown in jail in Ben Hur),he falls into a slaves(gladiators) trader's hands.He takes a spectacular revenge on his enemy (Commodeus,here,Messala in \"Ben Hur\")Outside Wyler's classic,\"Gladiator\" finds some inspiration in Kubrik's \"Spartacus\" and LeRoy's \"Quo Vadis\" too,and even in Delmer Daves'\"Demetrius and the gladiators\" (1954)All these sword and sandals,except Daves'one,are superior to Ridley Scott's work.Of course,the battle scenes are impressive,thanks to technology ,but it does not make up for the paucity of the dialogue and the simplicism of the screenplay.The \"poetic\" slow motion ending has been filmed so many times that one wonders why Scott could bother with such a rehash."},{"username":"Quinoa1984","userUrl":"https://www.imdb.com/user/ur0453068","reviewLink":"https://www.imdb.com/review/rw0598816","warningSpoilers":false,"date":"19 April 2001","rate":"9","helpful":"2 out of 6 found this helpful.","title":"Enjoying the spectacle even more on DVD","content":"In my first review of Gladiator, I said it had good action. I think I was a little too subtle with that, because after watching this movie for the first time in a year on the grand DVD, and I see why this film won best picture (though I still feel this is 2nd best to Traffic and Traffic was snubbed like Saving Pvt. Ryan in 99, only that Gladiator isn't mediocre like Shakespeare in Love is).Russell Crowe, as in all of his films commands the attention of the viewer every minute he's on the screen (though once again, Tom Hanks did it better though and also deserved the Oscar, but I'm not mad about it) as a man who is changed as he goes from respected general, to disgraced slave, and then back to respected Gladiator. Smart, exciting moviemaking all the way, with Scott delivering good direction to the scenes and the rest of the cast being good deliverers to the film (fans of old film stars Reed, Harris and Jacobi will find this a treat). Even better than I thought it was back last May, and with time should become a classic like Bravheart, though that is better (I also was a little subtle with Braveheart's spectacle). A+"},{"username":"michaelRokeefe","userUrl":"https://www.imdb.com/user/ur0449021","reviewLink":"https://www.imdb.com/review/rw0598876","warningSpoilers":false,"date":"8 June 2001","rate":"8","helpful":"1 out of 4 found this helpful.","title":"What is a man's life worth in ancient Rome.","content":"This movie is one of the best movies I have ever seen. Exciting story. Well acted. This movie has every element of being an instant classic. Don't haggle about historical accuracy; just enjoy this epic with wild eyed anticipation. A story of love, vengeance and will power.Russell Crowe plays Maximus Meridius, a Roman general that winds up a gladiator after refusing to pledge loyalty the emperor's power-hungry son Commodus(Joaquin Phoenix). Emperor Marcus Aurelius(Richard Harris)on his deathbed wants to turn the leadership of Rome over to Maximus; but the jealous Commodus smothers his already dying father to death and takes over the throne. Maximus escapes a death sentence and becomes a slave; then a gladiator that avenges his murdered family by constantly defying Commodus. Crowe is excellent as is Phoenix. The two contrasting personae make a great rivalry. Connie Nielsen plays the sister of Commodus and the object of his sexual obsession. Stand outs in supporting roles are:Oliver Reed, David Schofield, Derek Jacobi and David Hemmings.From scene to scene the marvelous story flows and the music of Hans Zimmer orchestrates the many moods of the movie. Your heart will not let you forget this movie.This will be one for the ages."},{"username":"tedg","userUrl":"https://www.imdb.com/user/ur0643062","reviewLink":"https://www.imdb.com/review/rw0598399","warningSpoilers":true,"date":"7 May 2000","rate":"","helpful":"12 out of 25 found this helpful.","title":"The Illusionist and the Ventriloquist","content":"Two things about this film intrigue me: the novel integrated talents of Ridley Scott and Russell Crowe.We are creatures who depend on idea fragments in everything we do. Virtually everything is a rehash, sometimes creative but mostly not. When someone or something comes along and adds to the vocabulary, something essentially new, it is a big deal -- that's my definition of genius. Today, a major force in defining our basic vocabulary is cinema, the visual element of filmaking. But all the easy stuff has been done as we leave the first generations of the art.So when someone comes along who can conceive a world that is new and unfamiliar, and who can actually deliver the illusion of being in that world, it is notable. Scott does that here (and in Blade Runner). Kubrick did it once or maybe twice; Polanski had the skills when he had an edge, but this is exceedingly rare. Note here how little quoting Scott does of prior battle in his battle scene, how Ben Hur (and all the lesser period pieces) are not at all referenced. How new this all is. (The only concession is the annoying British accent of the Romans.)What is remarkable is that it is all visual. It is not in the writing, the effects per se, or the acting, though they are all good enough. I intend to see this film several more times for just the visual experience. I suspect that because of the coherence and advance of the visual vocabulary. this will be seen as a landmark film long after Private Ryan and Titanic become footnotes.But there is also Crowe, and there's something notable here. I don't see great acting in the normal sense, but there is something else, and this seems new to me as well. To check this, I reviewed LA Confidential and The Insider. Crowe has the ability to develop tension, a normal enough skill, but he also has the ability to project this tension into the environment of the film. Watch how the scenes flow as his acting in one scene is tossed into another; it's remarkable.When he did this in The Insider, he seems to use as his resonator the unwitting, ever-bombastic Pacino. Here, He uses the similar exaggerated scope of the story, both the setting and the violence of the context.WARNING! Spoilers follow:Both Scott and Crowe seem to know what they are doing. So they have eliminated many of the elements normally required: there is no backstory, no explanation of what went before, no comic relief, just the barest of scaffolding. But in that, it is made of huge, strong girders. In another film, we'll have revenge driven by the death of the Hero's wife. Here, she and their child are gang-raped, burned until nearly dead, then crucified. In another film, the bad guy is conventionally bad, but here we have patricide and incestual rape. In another period film, we'd have lots of street scenes (which are cheap) to convey a sense of place: not so here. Nothing not essential to the core projection and resonant backdrop are used. So instead of parading the effects (as with Titanic or Jurassic Park), they are handled casually, incidentally as background. Just a huge visual sweep through which tension is passed. It is early to know, but this could be one of the great films."},{"username":"tedg","userUrl":"https://www.imdb.com/user/ur0643062","reviewLink":"https://www.imdb.com/review/rw0599212","warningSpoilers":false,"date":"14 May 2000","rate":"","helpful":"10 out of 19 found this helpful.","title":"Film as Colosseum","content":"Regular readers of my comments note my penchant for pointing out that film is a modern medium, meaning that films -- good ones anyway -- are often largely about themselves. When the nature of this self-comment is interesting, I point it out. But I failed to do so in an earlier comment on Gladiator, so here is the remedy.Summer movies target the lowest of our sensibilities. The plots are highly simplified morality plays where good and evil are radically drawn; the form is of violent spectacle. In other words, our civilized society wants the same things we observe in later Rome, to which we insist on feeling superior.So the master Scott gives us a violent spectacle about a violent spectacle. He makes fun of us by pandering to our baser tastes while slyly getting us to agree with the wise senator who observes how simple, stupid and manipulable is the mob. He did much the same in Blade Runner, but there the comment was on the sharpness, complexity of the audience not its dullness. Is this a maturing cynicism, an adventure into a new challenge (mastering the art of painting with a blunt palette), or a striking out against Hollywood's financial politics? I suppose we've have to wait a decade to find out -- until after the power-hungry Caesars die and the medium is returned to the enlightened leaders of the people."}],"errorMessage":""}