{"imDbId":"tt0167261","title":"The Lord of the Rings: The Two Towers","fullTitle":"The Lord of the Rings: The Two Towers (2002)","type":"Movie","year":"2002","items":[{"username":"TheLittleSongbird","userUrl":"https://www.imdb.com/user/ur20552756","reviewLink":"https://www.imdb.com/review/rw2395768","warningSpoilers":false,"date":"8 March 2011","rate":"10","helpful":"33 out of 39 found this helpful.","title":"My personal favourite of the trilogy","content":"I do love all three films of The Lord of the Rings trilogy, all are visually stunning with wonderful music and strong narratives. The Two Towers is my personal favourite of the three for several reasons. For one thing it is less talky than Fellowship of the Ring, and the pace is a little more secure here. Also the final battle is just breathtaking in the action, direction and in its scope, and very compelling and epic. And some of the characters are developed more here than they were in Fellowship of the Ring primarily Frodo and Aragorn, who were played very well there but a little bland in comparison to here. When it comes to the scope The Two Towers is possibly the biggest in the trilogy. The cinematography is one of the strongest assets, while the scenery, costumes, lighting and make up(the orcs look amazing) are all gorgeous. You can tell a lot of effort went into this and it showed. The music is also darker and perhaps more complex, the story is richer and compelling and the dialogue is thought provoking. People may disagree, but I think The Two Towers is the best directed of the trilogy too.The acting is very good. Elijah Wood is likable enough with a stronger-written character, while Sean Astin's bumbling persona suits Sam really well. Viggo Mortensson is as strong and charismatic as ever. Ian McKellen, Christopher Lee and Bernard Hill are also perfectly cast, but the real revelation in my view with this movie is Gollum. Here Gollum is designed superbly, and Andy Serkis's performance is absolutely phenomenal and Oscar-nod worthy.In conclusion, a fine film and for me my personal favourite of the trilogy. 10/10 Bethany Cox"},{"username":"Leofwine_draca","userUrl":"https://www.imdb.com/user/ur0482513","reviewLink":"https://www.imdb.com/review/rw3528190","warningSpoilers":true,"date":"19 August 2016","rate":"10","helpful":"11 out of 13 found this helpful.","title":"Fantasy greatness with one of the best sieges put on film","content":"Well, I'll be darned if this isn't one of the best epic movies I've ever seen in my life. And am ever likely TO see in my life. Following in the footsteps of THE FELLOWSHIP OF THE RING, Peter Jackson's second instalment of the trilogy ups the ante tenfold, offering one amazing movie packed with heart, action, romance, dazzling effects, and brilliant characters. Thankfully free of the time-consuming introduction needed to begin the first part of Tolkien's trilogy, Jackson now has time to focus on developing characters, perilous quests, and, of course, out-and-out action. I'm an action lover at heart so I was in seventh heaven watching this movie. Everything you could want from the second book is here, up on screen and even more amazing than Tolkien could render. Plus, Jackson has done his magic and inserted a few memorable scenes of his own so there are plenty of surprises even for those who know whats coming.Where to begin with such a film? The characters, I guess. Jackson takes the option of cross-cutting repeatedly between the three different sets of principal characters and his method pays off nicely, offering a well-rounded film that never lets up with the drama (I was astonished that three hours had passed by the time this was over – it felt more like just one hour). Merry and Pippin's encounter with the Ents is awe-inspiring stuff. Of course, a walking tree is a hard thing to portray, but with the aid of some outstanding special effects Jackson does it and does it so superbly. Then we have Frodo and Sam crossing the dead marshes (complete with creepy corpse ghosts – the horror imagery is strong in this movie folks, and Jackson doesn't skimp on the splatter either) and meeting up with totally CGI-created Gollum. Gollum is fantastic, a breath of life straight from the book; Andy Serkis does wonders with his voice and movements and helps to craft the flawed, schizophrenic psychology of the ugly but hugely sympathetic creature.The main action, of course, comes from the whole Aragorn/Legolas/Gimli storyline, mixing in plenty of incident and nasty creatures along the way. The bear-like Whargs are violent and unpleasant; the Oliphants are amusing and breathtaking in equal measure; the Nazgul and their winged demons are fantastic to behold. Visually, the film is always spectacular, splendid and sweeping; it makes even better use of the varied New Zealand countryside than the last film which is no mean feat. Howard Shore's sweeping score is better than before and highlights the evocative nature of the movie, often threatening to overwhelm us with the sheer wonder of it all. This IS Tolkien.Of course, the movie finishes off with the battle of Helm's Deep, a forty-minute non-stop barrage of carnage and destruction, explosions, mayhem and might. It's easily one of the best battles ever put on film and the special effects are entirely convincing (as they are throughout). I'll confess that I was close to tears at a couple of points – the white light streaming onto the battlefield, the breaking of the dam at Isengard – these flawless moments just choked me up and made me glad to be able to appreciate the true wonder of cinema. The cast is flawless – exemplary performances from the recurring cast members, kudos to newcomers Brad Dourif, Miranda Otto, and Karl Urban, and especial mention to Bernard Hill. Nothing more can be said. A modern classic I'm only too privileged to have seen on its opening night."},{"username":"SnoopyStyle","userUrl":"https://www.imdb.com/user/ur2898520","reviewLink":"https://www.imdb.com/review/rw3552324","warningSpoilers":false,"date":"28 September 2016","rate":"8","helpful":"2 out of 8 found this helpful.","title":"impressive sequel","content":"The fellowship has scattered. Frodo Baggins and Samwise Gamgee, on their journey to Mordor, encounter a vile creature named Gollum. Aragorn, Legolas, and Gimli are chasing the kidnappers of Merry and Pippin. Merry and Pippin manage to escape and befriend tree shepherd Ent Treebeard. Aragorn, Legolas, and Gimli encounter Gandalf reborn as Gandalf the White. They go to Rohan to find King Théoden under the control of evil Saruman.The story and the characters get split up into basically three groups. That back and forth can scatter the tension a little bit. It's a small drawback. I would consider doing Frodo and Samwise in the first half leaving the others to the second half. That would keep continuity flowing. The CGI is world class and nothing is more impressive than Gollum. The movie is able to keep the story compelling in all aspects."},{"username":"Hitchcoc","userUrl":"https://www.imdb.com/user/ur0278527","reviewLink":"https://www.imdb.com/review/rw1316651","warningSpoilers":false,"date":"16 March 2006","rate":"9","helpful":"4 out of 8 found this helpful.","title":"It's the middle child of the movie.","content":"This is the war. This is the necessary part of the film to set up the finale. Because it's the middle child, it doesn't get the attention or respect. Once one has all three films in hand, he can begin to view them as a single entity. Still they are considered to be separate. The arising of the Gollum. The series of battles that make up this film are so incredible. Though made at the same time, the tales gain the advantage of advances in production techniques and graphics. There is not much exposition here, though new characters are made available to us. It is rather to get from point A to point B and make way for the final book. The rocky relationship between Frodo and Sam continues, Frodo fixated on the ring and all that it implies. Then there are the magnificent battle scenes with the unlikeliest of creatures forming alliances. I read reviews by people who are so into these books that they nitpick over every aberration from the original works. This is a movie. It's accessible to anyone, including those who will never make their way through the novel. The novels aren't for everyone. They are filled with long introspective meanderings and a good deal of poetry (hardly any of which is in any of the three films). Like with Trekkies, it's hard to talk with these people because of the obsessiveness about a single piece of literature--the betrayal they feel. Just enjoy what Peter Jackson was able to do. It will live forever in film history."},{"username":"Horst_In_Translation","userUrl":"https://www.imdb.com/user/ur3914439","reviewLink":"https://www.imdb.com/review/rw3134112","warningSpoilers":true,"date":"1 December 2014","rate":"6","helpful":"3 out of 37 found this helpful.","title":"Flawed, but still worth a watch for fantasy lovers","content":"\"The Lord of the Rings: The Two Towers\" is the middle piece of Peter Jackson's \"Lord of the Rings\"-trilogy. Awards-wise the least successful, I would also classify this film inferior to 1 and 3. It starts with the plot twist that Gandalf is actually alive and we see Gollum for the first time, the visual description of what the ring does to people. For the most part, we follow Sam and Frodo (group 1) and Aragorn, Legolas and Gimli (group 2) after Boromir's death. Sam's behavior towards Gollum stood a bit in contrast to his warmheartedness with Frodo, but apart from that I liked these two story lines and also the introduction of Gollum (possibly the most interesting character from the trilogy). I really was not impressed at all with the storyline of the king who obeys to his evil snake servant and the whole family business of the king. Aragorn looking at the traces and seeing that the two Hobbits must still be alive was complete nonsense. The tree creatures (on which the Hobbits spend pretty much the whole film) were quite nice though. However, there were some problems with these too. The tree promised Gandalf nothing would happen to the Hobbits. So how come these Hobbits climb right that tree who vowed to protect them? He sure did not follow them. He was even sleeping before they woke him up. And why does he think they are Orcs at first? And when did the other hobbit duo become brave enough to scream at the trees to get them to help? They were just fools before all that and I just cannot see them transforming into credible heroes. Nonsense, I say. Also they don't even ask if Gandalf is still alive.Another thing I wondered was how Aragorn knew that Sam was with Frodo. But that's just a minor criticism. One hour into the movie, Frodo and Sam are at the gates of Mordor. So what would happen the next 2.5 hours. Well.. the kingdom story happened and it did nothing for me. You can say yes it was in the book, but still you can cut the uninteresting parts and maybe make this an hour shorter and avoid the dragging. And that guy's name was Wormtongue? Really? That sounds like it would be the villain from a children's film. Or Harry Potter maybe. Anyway, the character was played by Brad Dourif, roughly three decades after his most significant role in Cuckoo's Nest, an interesting snippet in my opinion. Also the farewell song for the King's son did not move me at all. The whole story of Miranda Otto's character and Aragorn I could have done without. It added nothing really.Saruman stays the main villain here just like in the first film, so it is a bit surprising as everybody keeps talking only about Sauron when it comes to LotR-villains. The creatures in this movie were top-notch, just like in the first, especially the Wolves of Isengard. Gimli provided comic relief again and it helped a lot that he had Bud Spencer's dubbed voice. Great fan here of the spaghetti westerns. That scene in which he asks Aragorn to throw him and not tell \"the Elf\" was very funny. The main characters keep surviving under the most difficult circumstances that you sometimes wonder if they are actually immortal (Aragorn here in particular, and Gandalf early on as well). Liv Tyler looks pretty nice and so does Orlando Bloom, but the latter did not do really much for me. His character is so interesting, but acting-wise and story-wise it was all very underwhelming about Legolas. Back to Frodo and Sam, I liked the issue if Frodo's friendship with Sam could survive Frodo's ring connection with Gollum. Which of the two is stronger? You may need to wait for film 3 for a final decision. And please disregard Frodo's constant visions and deliria. These were not done convincingly at all.The big problem this film has that despite its stunning visuals, it is fairly uninteresting from an emotional standpoint. Neither the kids having to go to war as soldiers nor all the groups of fighters spectacularly coming to help our heroes at Helm's Deep I found particularly captivating (except the trees maybe, that was slightly intimidating). The second half of the film was weaker than the first I felt, mostly thanks to Gollum's introduction and presence early on. At least Gollum gets the final scene, so we can look forward to him in the final film. Random note: Why is Smeagol not naked and why does he wear a slip if he cares about nothing but the ring. We will never know. After that scene, we hear the closing credits. And while I liked Enya's song from the Fellowship, this one is a disappointment. It sounds much more like a Bond song and brings none of the fantastic aspects of the film to the table. I recommend this film to fantasy lovers. If you somehow enjoy the very overrated \"Game of Thrones\" and still have not seen Jackson's LotR trilogy, it is high time. They will enjoy it, but I cannot call this film an epic, let alone the entire trilogy."},{"username":"claudio_carvalho","userUrl":"https://www.imdb.com/user/ur2488512","reviewLink":"https://www.imdb.com/review/rw0586495","warningSpoilers":false,"date":"1 September 2003","rate":"10","helpful":"14 out of 30 found this helpful.","title":"A Sequel in the Same Level as the Original Movie","content":"This sequel of the best movie of fantasy and adventure ever made can not be seen as another movie, but the second part of a splendid film. The journey of Frodo Baggins and his friends in this movie is also outstanding, stunning, a masterpiece. I believe there is nothing else to be said about this fantastic movie. My vote is ten."},{"username":"bob the moo","userUrl":"https://www.imdb.com/user/ur1002035","reviewLink":"https://www.imdb.com/review/rw0585678","warningSpoilers":false,"date":"30 December 2002","rate":"","helpful":"14 out of 30 found this helpful.","title":"Vastly better than the first film - Jackson's Empire Strikes Back!","content":"The quest of the ring continues with the fellowship broken up. Aragon, Gimil and Legolas pursue the orcs who took Merry and Pippin. However they lose the hobbits when the orcs are attacked and killed by Eomer, nephew of King Theoden. Merry and Pippin escape into the forest, meeting the keeper of the forest, Treebeard. Aragon et al follow their trail into the forest to meet Gandalf the White who leads them to defend Rohan where Saruman's forces are preparing to attack and wipe out man. Meanwhile Frodo and Sam are joined by Gollum, addicted to the ring and corrupted by it's power. They reluctantly allow Gollum to lead them to Mordor despite Sam's mistrust. Gandalf frees King Theoden from Saruman's spell and the King takes his people to the fortress at Helm's Deep where the armies of man and orc will collide.The plot sounds plain confusing. And looking in the film magazines at the various maps and family trees that they published I did fear that the film would be even more demanding than the first and would almost require me to start ploughing through the book's appendices to follow it. But no, that's the first thing Jackson has done well. He has stripped down the detail and has made the relationship easy to see and the characters easy to understand. I'm sure much of the text has been lost but it works better. On top of this the film's pace is much more even.In my review of the first film I disliked the stop/start nature of the talking/running plot and found it tiring and hard to enjoy. Here the film manages perfectly with a good level of action and story that is consistent and builds to the battle for Helm's Deep as it's climax. It makes for an enjoyable film rather than the pacing of the first. Even the fragmented story line is dealt with well - it could easily have pulled the plot in 3 different ways and affected how the film hangs together but it really worked out well. All three stories are told but none is lingered on longer than needed (with the possible exception of flashbacks of Aragon's love).This made it much more enjoyable to me - that the film was fun to watch and not hard work. Also the comedy was inserted nicely. Again the first film felt like it would be rude to enjoy this sacred story - but here we have nice laughs that don't cheapen the story or the characters. The action is less chaotic than before and only the odd scene is a blur. The special effects are excellent despite looking computer generated beside real things. The riskiest effect is Gollum - he could easily have been another Jar-Jar Binks in the way he didn't work well as a real character. However the animation is superb. Sure he doesn't always LOOK real beside Frodo and Sam but that's cause he's not!In terms of character Gollum was the best addition to the cast. He is a real character - pathetic yet dangerous, funny yet treacherous. After a few minutes I forgot that he was an effect and was as involved with him as with any of the others. In fact the extent to which Serkis made Gollum watchable was shown by how held I was by his scenes with Frodo. I found Wood to be too serious and worthy and hard to watch - Serkis' Gollum changed that and I was gripped. The other good character is Astin's Sam who appears minor but is really the honest heart of the fellowship thus far, he is well acted and not allowed to be just a clumsy sidekick. Pippin and Merry have minimised time which is good but their scenes are better this time round. Mortensen, Bloom and Rhys-Davis are all great and any scene they are in holds the attention effortlessly. Mortensen is especially good and I can't understand why people prefer Bloom over him!? Generally the acting is very good. In the first film everything felt very tight, like the actors were afraid of upsetting anyone and read every line like it was gospel. Here they fit their characters better and seem to enjoy it which in turn helped me.Overall I pretty much enjoyed the first film but had big reservations about it - having to work to enjoy it and finding the pace tiring and ill-judged. In this outing all my reservations had been dealt with. Sure it's not perfect but it is a very, very good film. Epic in every sense but yet enjoyable and (thank God) fun to watch. Just like Lucas improved Star Wars with Empire, so too has Jackson done much better second time around. Lets just pray that The Return of the King doesn't turn out to be his `Return of the Jedi' - nope! It's unlikely - I can't wait!"},{"username":"classicsoncall","userUrl":"https://www.imdb.com/user/ur2707735","reviewLink":"https://www.imdb.com/review/rw1256649","warningSpoilers":true,"date":"28 December 2005","rate":"10","helpful":"37 out of 43 found this helpful.","title":"\"There's some good in this world Mr. Frodo, and it's worth fighting for.\"","content":"\"The Lord of the Rings\" continues it's epic quest in this second installment of the trilogy, as the original fellowship is disbanded and it's various members must continue the good fight. While Frodo and Sam pursue their mission to Mordor, Pippin and Merry manage to escape the Uruk hai into the Fangorn Forest and their own adventure with the Ents. Aragorn, Legolas and Gimli traverse the Riddermark into the realm of Rohan.The One Ring begins to deepen it's spell over Frodo who questions his worthiness and stomach for the mission. This facet of his character allows Sam (Sean Astin) to portray his devotion and loyalty to his master, particularly when Gollum makes his appearance and becomes their guide. Gollum's looks are rivaled only by his treachery, and the duality of his personality is given emphasis in the tortured conversations he has with himself. I was a bit surprised at the way Gollum was portrayed in \"The Two Towers\"; his cameo appearance in the first film as a slinky black cave denizen more closely resembled Tolkien's description and corresponded to the mental image I took away when reading about it. At the same time though, there was almost a comic element to it, whereas his physical features presented here more accurately allowed for a menacing but tortured creature.Even more fantastic creatures find CGI life in the film; I found the presentation of the Ents to be masterfully done. The \"olyphants\" were a neat touch and I was happy to see them included. Of course the orcs, wargs and Uruk hai all personify the evil that befalls Middle Earth in this dire time, and their presence instills fear and dread for the heroes all along the way.There's a lot going on in the film, and repeated viewings are helpful, along with an understanding created by reading Tolkien's story. Though not entirely necessary to enjoy the movie, I feel it grounds the viewer in the rich background of the characters and locations. Actually, the books and the film complement each other nicely, even though the movie of necessity must leave out some elements.There is no doubt that \"The Lord of the Rings\" has earned it's reputation as one of the greatest epic films of all time and the best fantasy film of them all. At the same time, it does a wonderful job of examining such themes as honor, loyalty, friendship and love as it's characters interact with each other and find common ground against a threat to their very existence."},{"username":"lee_eisenberg","userUrl":"https://www.imdb.com/user/ur4888011","reviewLink":"https://www.imdb.com/review/rw1198297","warningSpoilers":false,"date":"21 October 2005","rate":"10","helpful":"10 out of 18 found this helpful.","title":"One of the few sequels that equals the original's quality.","content":"With the fellowship in splinters, Frodo Baggins (Elijah Wood) and Samwise Gamgee (Sean Astin) continue on their quest to destroy the corrupting ring. Meanwhile, Aragorn (Viggo Mortenson) has his own duties to attend to, as does Gandalf (Ian McKellen). Peter Jackson's midpoint of the trilogy is as great as its predecessor and successor. Every shot is beyond impressive; there isn't any adjective that I can use that would do the movie justice.And Gollum? Now there's an intriguing character, precious. An awe-inspiring, if pitiful, being, he makes you really want to see part 3, just to see what will happen. \"The Lord of the Rings: The Two Towers\" is truly one movie that will continue to inspire people for years. A masterpiece."},{"username":"gavin6942","userUrl":"https://www.imdb.com/user/ur1234929","reviewLink":"https://www.imdb.com/review/rw2309864","warningSpoilers":false,"date":"13 September 2010","rate":"8","helpful":"1 out of 4 found this helpful.","title":"Greatest Fantasy Film of All Time?","content":"Quite simply, Peter Jackson's \"Lord of the Rings\" trilogy is the best fantasy film series ever made. This is surprising for people who are familiar with Jackson's earliest work (\"Bad Taste\", for example). But give the man a decent budget and he can command a film. Of the three films, this is possibly the strongest (though the third is also good). Generally, fight scenes tend to bore me, but here Jackson makes them interesting, fun to watch and \"epic\" in the best sense of the word.Although coming in at three hours, the extended edition adds on another forty minutes. I have not seen this, but from what I hear it is a must-see. And I cannot disagree. The three hours is all killer, no filler... if the remaining scenes are just as good, there is no reason to miss out on them."},{"username":"jboothmillard","userUrl":"https://www.imdb.com/user/ur4248714","reviewLink":"https://www.imdb.com/review/rw1028001","warningSpoilers":true,"date":"25 February 2005","rate":"10","helpful":"10 out of 40 found this helpful.","title":"The Lord of the Rings: The Two Towers","content":"The second part to the J. R. R. Tolkien book based film trilogy is more darker than the first. Basically, the fellowship is broken, Frodo (Elijah Wood) and Sam (Sean Astin) travel to Mordor accompanied by the treacherous Gollum/Sméagol (Andy Serkis). Merry (Dominic Monaghan, now known in TV's Lost) and Pippin (Billy Boyd) have been kidnapped by the Urukhai, but get rescued by Treebeard (John Rhys-Davies), and they plan their battle with other Ents. Aragorn (Viggo Mortensen), Legolas (Orlando Bloom) and Gimli (Rhys-Davies) have joined forces with the King Theoden of Rohan (Bernard Hill). Gandalf (Sir Ian McKellen), now a White wizard has returned, and with Thoedon's bunch they plan the battle of Helm's Deep against Orcs and Uruks sent from Isegard by traitor White wizard Saruman (Christopher Lee). BAFTA and Golden Globe nominated director Peter Jackson has done another fantastic job, and the big battle is spectacular. Also starring Liv Tyler as Arwen, Cate Blanchett as Galadriel, Hugo Weaving as Elrond, Miranda Otto as Eowyn of Rohan, Brad Dourif as Wormtongue, David Wenham as Faramir, Karl Urban as Eomer and Sean Bean as Boromir (flashback). Featuring the song \"Gollum's Song\" by Emilíana Torrini. It won the Oscars for Best Sound Editing, and Best Visual Effects, and it was nominated for Best Art Direction-Set Decoration, Best Editing, Best Sound, and Best Picture, it won the BAFTAs for Best Special Visual Effects, and Best Costume Design, and it was nominated for the BAFTA Children's Award for Best Feature Film, Best Cinematography, Best Editing, Best Make Up/Hair, Best Production Design, Best Sound, the David Lean Award for Direction, and Best Film, and it was nominated the Golden Globe for Best Motion Picture - Drama. Cate Blanchett was number 37, and Sir Christopher Lee number 31 on The 100 Greatest Movie Stars, he was number 13, and Sir Ian McKellen number 4 on The 50 Greatest British Actors, and McKellen was number 5 on Britain's Finest Actors, the film was number 85 on 100 Years, 100 Quotes (\"My precious.\"), it was number 22 on The Ultimate Film, and as part of the trilogy, all three films were number 11 on The 100 Greatest Family Films. Outstanding!"},{"username":"ccthemovieman-1","userUrl":"https://www.imdb.com/user/ur4445210","reviewLink":"https://www.imdb.com/review/rw1436780","warningSpoilers":false,"date":"2 August 2006","rate":"9","helpful":"29 out of 51 found this helpful.","title":"A Second Look, With Subtitles In Parts, Made This Much Better","content":"I didn't really appreciate this second installment of the LOTR trilogy until I watched this for the second time. The key was how I looked at the key character of this film: \"Gollum\" (Andy Serkis.). Once I began to appreciate and marvel at this weasel-like character, my opinion of the film went from bad to good. That doesn't mean I like that slimy creature: I don't, but I am more fascinated by him rather than totally annoyed as I was with the first viewing. A big reason was that I put on the English subtitles, so I was able to understand everything he said. I recommend doing that you has a similar problem deciphering his dialog. Now I more fully understood what a tortured soul that pathetic creature was.Anyway, this second installment, as in the first, offers a lot of fascinating sights and sounds and a nice varied platter of action scenes and wild characters. For younger kids, I am to happy to say there is absolutely nothing, language-wise, that would offend anyone but the violence is heavy and brutal at times.This is a solid, highly-recommended second installment in the trilogy. It's epic film-making. No, it may not be equal to the first - The Fellowship Of The Ring - but what adventure story is?"},{"username":"Tweekums","userUrl":"https://www.imdb.com/user/ur13977076","reviewLink":"https://www.imdb.com/review/rw2096911","warningSpoilers":true,"date":"16 July 2009","rate":"10","helpful":"7 out of 9 found this helpful.","title":"Exciting fantasy sequel","content":"This film starts off where \"The Fellowship of the Ring\" leaves off; Frodo and Sam are on their own and heading to Mordor with the sinister Sméagol who has promised to guide them through the mountains, Merry and Pippin are in the hands of Saruman's Orcs as they return to Isengard and Aragorn, Legolas and Gimli are in pursuit until they are diverted into helping King Theoden of Rohan.The film switches between the three groups so we never get chance to forget what the characters are doing. I think this is the only film that I've seen where the narrative follows different groups who never meet each other. The action is even more spectacular then the previous film, the storming of Helm's Deep is one of the most spectacular scenes that I've ever seen, also amazing are the realism of Sméagol, the CGI creature based on the movements of Andy Serkis and the Ents, huge creatures that look like walking trees.The actors did a great job, especially Elijah Wood as Frodo as he approached Mordor you could almost feel the increasing weight of the ring hanging from his neck. The cast of characters here is quite a lot larger than the previous film giving us some great new characters, the most obvious is Sméagol who was only glimpsed before but there is also the wonderfully vile Grima Wormtongue and Eowyn, King Theoden's niece who is smitten with Aragorn.If you haven't seen any of the Lord of the Rings films I strongly recommend this but only after watching The Fellowship of the Ring, if you don't watch that it will be hard to understand what happens here."},{"username":"paul_haakonsen","userUrl":"https://www.imdb.com/user/ur22654354","reviewLink":"https://www.imdb.com/review/rw5441423","warningSpoilers":false,"date":"27 January 2020","rate":"7","helpful":"1 out of 7 found this helpful.","title":"More action-packed than the previous movie...","content":"First of all, I must say that \"The Lord of the Rings: The Two Towers\" was significantly more easy to sit through than \"The Lord of the Rings: Fellowship of the Ring\", as this movie had more action, and wasn't as slow-paced with as much storytelling and setting the mood as the first movie did.Needless to say that you need to watch the first movie prior to watching this 2002 sequel, unless you want to be missing out on a great deal of information about the characters and the storyline.As a direct continuation of the previous movie \"The Lord of the Rings: The Two Towers\" was a nice upscale in pace, and I must admit that I was enjoying this a lot more than the previous movie.While \"The Lord of the Rings: The Two Towers\" is driven by a solid story and character development, much like the first movie, then \"The Lord of the Rings: The Two Towers\" adds a much needed element of action and fantasy battles.It shouldn't be necessary to say that you are in for a grand adventure when you sit down to watch \"The Lord of the Rings: The Two Towers\", especially if you are a fan of the sword and sorcery fantasy genre, which I happen to be.And it was marvelous to have the original cast return to perform their roles again, making for a wonderful continuation of the storyline, and not having to adjust to a new face on an already established character.Definitely well worth taking the time to sit down and watch the extended version. Just keep about 4 hours free for it. I am rating \"The Lord of the Rings: The Two Towers\" a well-deserving seven out of ten stars."},{"username":"BA_Harrison","userUrl":"https://www.imdb.com/user/ur0945066","reviewLink":"https://www.imdb.com/review/rw2331713","warningSpoilers":false,"date":"30 October 2010","rate":"9","helpful":"2 out of 5 found this helpful.","title":"The middle film from Middle Earth.","content":"The Two Towers is my favourite film from the entire The Lord of the Rings trilogy. It starts with my favourite scene of the trilogy—Gandalf's breath-taking battle against the Balrog in the bowels of Middle Earth; ends with the best action scenes of the trilogy—the epic battles at Helm's Deep and Isengard; and features many of my most memorable moments from the trilogy, including Gollum's schizophrenic conversation with Smeagol, a hilarious discussion between orcs about whether they should eat Merry and Pippin, and Legolas shouting 'They've taken the hobbits to Isengard!' (check out the dance music remix of this on YouTube—it's hilarious!).A few minor niggles prevent me from awarding The Two Towers top marks—the rather slow scenes with Treebeard in Fangorn, Legolas surfing down some steps on a shield (a portent of the excesses of The Return of the King), and the fact that it took me three viewings to completely understand all that happens—but on the whole this is an excellent film. Did I mention it was my favourite of the trilogy?"},{"username":"TxMike","userUrl":"https://www.imdb.com/user/ur0438066","reviewLink":"https://www.imdb.com/review/rw0586740","warningSpoilers":false,"date":"18 May 2004","rate":"","helpful":"8 out of 12 found this helpful.","title":"Second installment, great DVD, story a bit muddled, a movie mainly for \"Ring\" fans.","content":"Almost two years ago, after I saw the first of the trilogy, I wrote in summary...\"As a film of a historic work of fiction, and especially this DVD release, it is almost perfect. However, as a fictional work the story is a bit of a let-down, in my opinion. It is best appreciated by all the \"Ringheads\" out there who have bonded over the years with the ring trilogy and Tolkien. For my own enjoyment there are more interesting fictional works. Maybe I'll have a different opinion in two years, after I've seen all three of the installments. \"I've not seen the last installment yet, but my opinion has not changed any. First off the movie is entirely too long. Not that length itself is bad, but in an apparent attempt to follow the books faithfully, much of the story drags badly. Wise producers and directors realize that movies made from books must exclude much material, to keep the story interesting and the running time reasonable. People who read novels often do so over weeks. Movies are normally watched at one sitting. So, while this long movie may be just what the \"Ringheads\" want, for the rest of us it is simply too much of the same, and too long. Still, it has remarkable production values and is a joy to watch. Just too long and boring in spots."},{"username":"Quinoa1984","userUrl":"https://www.imdb.com/user/ur0453068","reviewLink":"https://www.imdb.com/review/rw0585016","warningSpoilers":false,"date":"20 December 2002","rate":"10","helpful":"4 out of 15 found this helpful.","title":"The Trilogy continues, and it's just as good as the first...","content":"...with even more action pumped in; the final battle sequence is an astonishing feat from Jackson and his team, making an entire fleet of Urk-Hai completely computer animated, seem totally convincing. And while the second part is exactly as long as the first, it's even more eye-grabbing with it's visual wonder, the scope of Middle Earth the most impressive thing about Two Towers (it's deserved of an Oscar). Another impressive feat is the computer animated creature of Gollum, a schitzophrenic, deformed Hobbit who finds Frodo Baggins his new master, alongside Samwise Gamgee, and he may just be the most compelling of the characters, along with the somewhat downsized role of Gandalf the Grey, er White, played still with skill by Sir Ian McKellan.So, for the fans of the Fellowship, and for Tolkien's core audience, they may find a few story strands missing from the original novel, but it is highly reccomended viewing anyway, and if those are concerned about not seeing a scene they visioned from the book, keep in mind that probably a year from now will see the release of the Two Towers extended edition on DVD. Grade: A"},{"username":"wes-connors","userUrl":"https://www.imdb.com/user/ur15896852","reviewLink":"https://www.imdb.com/review/rw2155020","warningSpoilers":false,"date":"9 November 2009","rate":"10","helpful":"3 out of 9 found this helpful.","title":"The Middle of The Ring","content":"\"The Fellowship has broken, but the quest to destroy the 'One Ring' continues. Frodo and Sam must entrust their lives to Gollum if they are to find their way to Mordor. As Saruman's army approaches, the surviving members of The Fellowship, along with people and creatures from Middle-earth, prepare for battle. 'The War of the Ring' has begun,\" according to the DVD sleeve description, the film was \"Nominated for six 'Academy Awards' including 'Best Picture'.\" \"The Two Towers\" begins with a reprise of one of the first film's worthiest recreations of Tolkien text, beloved Gandalf falling to his apparent death; then, the film outdoes its predecessor again, and again, and again. The scene-stealing creature \"Gollum\" (superbly voiced by Andy Serkis) is an especially well-realized highlight. It was this chapter being so successfully received that insured \"The Lord of the Rings\" trilogy could be considered a classic.This installment is as well-produced as \"The Fellowship of the Ring\" (the three films were shot together); but, with story, pacing, and characterizations much more suited to epic cinema. Peter Jackson's direction is most outstanding, the use of Howard Shore's music is much improved, and Michael Horton is a welcome addition to the editing team. Even the alterations of J.R.R. Tolkien's original work are satisfactory; sometimes, we all must meddle in the affairs of wizards.********** The Two Towers (12/5/02) Peter Jackson ~ Viggo Mortensen, Elijah Wood, Sean Astin, Andy Serkis"},{"username":"tedg","userUrl":"https://www.imdb.com/user/ur0643062","reviewLink":"https://www.imdb.com/review/rw0585189","warningSpoilers":true,"date":"21 December 2002","rate":"","helpful":"16 out of 29 found this helpful.","title":"Is It Magical?","content":"Spoilers herein.One hallmark of science fiction and fantasy is the creation of a world that includes to some extent the creator. That way, instead of inhabitants bumping around in a world, we get a complex set of interactions: some as a result of the world affecting the players, and some the other way around. Tolkien's work fits well within this tradition, in fact why it was so successful I think is the thoroughness with which he developed the magical laws. The reader not only understood that the magic had power, but had some notion of how it worked. That allowed the reader to exist both at the level of Frodo and the magical level of the wizards and demigods.That's the soul of the books; not any episode, not any `theme' about brotherhood or hope or any such sodapop.The first film of this saga impressed purely with the sheer ambition of the project, and we now have the second one. It is fun watching, just like `Speed' was in its day, but I'm unhappy with some of the choices that were made.With film, there are specific ways to span the two worlds, ways which a few filmmakers have been exploiting for a long time -- long enough for some of them to appear in mainstream films. Almost none of those techniques were used here. Nearly all the choices were ones that plant us firmly in the world of the inhabitants who are buffeted by the world's forces just like we as people are. This literally boils all the magic out of the books, and we are left with `Braveheart' meets `The Black Cauldron' except slightly more expensively done and with some monsters.The travesty is not that these choices were made to protect the investment in the films, but that so many Tolkien enthusiasts miss the point and argue about whether elves appear in the wrong scenes.Further to the philosophy of the film: the manner in which the characters deal with the camera is roughly equivalent to the relationship the readers' imaginative `eye' has with the text. In addition to being cast at the level of the adventures and not the magic, there are other problems. That stance is inconsistent -- the greatest offense comes in the middle of the great battle. Until then, the players have been dead serious. They've been in their lives, not characters in a movie that wink at us. But all of a sudden, we have a barrage of winking: the `surfing' move, the dwarf-tossing joke, the 007-like standoff on the bridge. All of these depend on us knowing it is a movie and the characters leaving their lives and knowingly entering the movie.Other problems with that stance. The various technologies used each have their own way the camera must be used. The two perspectives that impressed me were the handling of the fight between Gandolf and the balrog and the relationship we have with Gollum. In the first, our eye IS magical as it swoops around sometimes watching the fight, sometimes IN the fight. This use of the camera is new -- I noticed it also last week in `Treasure Planet' when encountering the black hole. But it entirely different than the soliloquies Gollum (and several others) have. Under the guise of talking to themselves, they are really talking to us, nearly looking at the camera. All of the camera engagement is from Bergman, and is his well-studied solution to the Shakespearean stage technique.I liked both of these, but they are inconsistent with each other, inconsistent with Tolkien's magic as noted and inconsistent with the movieland jokes. But there are even more diverse perspectives. We have the helicopter shots (again from `Braveheart'), and a few similar shots of virtual sets. We could have had some new movement (like the balrog fight), but we are supposed to recall similar shots.And then there are the Ents, animation straight out of `Poltergeist.' It is another set of views determined by the technology rather the story. Shifting among the bluescreen of hobbits in Ents, to the humanistic CGI Gollum, to the video game animation of the battle was jarring. We never were in Tolkien's world, just browsing through the aisles of your video store, shifting about.LOTR was written with specific notions of reading in mind and is bound to them. But `Dune' was not. Imagine a film of Dune with this budget and Lynch's originality instead of Jackson's `me-too-isms.' Now that would be cool.Ted's Evaluation -- 3 of 4: Worth watching."},{"username":"Theo Robertson","userUrl":"https://www.imdb.com/user/ur1532177","reviewLink":"https://www.imdb.com/review/rw0586146","warningSpoilers":true,"date":"27 January 2003","rate":"9","helpful":"33 out of 43 found this helpful.","title":"My Visit To The Cinema","content":"Don`t you just hate cinemas ? No matter where you sit you always end up surrounded by people who spend their time chatting amongst themselves as to the events on screen 30 seconds before they happen . If we`re after a running commentary we`ll buy the DVD thank you very much . Add to this unattended mad mental kids running around wild . In fact many years ago our local newspaper saw a no holds barred letter of complaint about a screening of 3 MEN AND A LITTLE LADY which referred to foul mouthed juvenile delinquents in the audience . And on top of all this I`m a chainsmoker and cinema chains don`t allow patrons to poison themselves or others with nicotine so as a rule I don`t visit cinemas . But it`s a rule I broke in order to see THE TWO TOWERS because I was literally dying to see it . So I booked my ticket well in advance for the premier screening in Rothesay on the 26th of January , popped into the cinema that night and demanded to be entertained****** SPOILERS ******I was entertained and more , but I later had some reservations . On a technical level TTT not only does not disappoint but it outdoes FELLOWSHIP in terms of both scope and scale but this doesn`t automatically make it as some people have claimed a better film . The battles of Helms Deep and Isengard are truly breath taking and out do anything Hollywood has done , but ironically by concentrating on spectacle TTT feels more like a Hollywood film than FELLOWSHIP . And all this spectacle causes a problem for Peter Jackson - How does he finish all these impossibly epic set pieces ? The simple answer is he can`t ! As several reviewers have mentioned the fractured storyline comes to the rescue of the director in much the same way as Gandalf rides to the rescue of Helms Deep : Cut to the most breath taking calvary charge in the history of cinema , cut to the Ents attacking Isengard and then cut back to Helms Deep where our heroes have snatched victory from the jaws of defeat , except they did so mainly off screen . It`s as if the director has used the fractured storyline in order to get himself out of a corner . Likewise reviewers on this site have noticed the story telling technique hides several plot holes involving characters appearing and disappearing to and from the story .Of course you don`t notice these flaws at the time due to the awesome onscreen visuals but there is one major criticism you can level at TTT as soon as the credits roll and that`s a lack of an emotional impact . Yes you`ll gasp and cheer and feel your heart race but you won`t burst into tears . Remember the scenes in the first film where the fellowship escape into the mountains after Gandalf has confronted the Balrog or the departure of Boromir ? Remember how your throat tightened and you nearly had a tear run down your face ? Of course you do because these two scenes are amongst the most moving and heart wrenching in cinema history . Unfortunately there is no similar equivalent in TTT . And the film also cries out for a flawed but noble ambigous anti hero like Boromir in a story where everyone is either good or evil and no in between , though this is almost certainly the fault of Tolkien rather than Jackson who does manage to get the best out of his cast in film lacking in character development . Special mention goes to Andy Serkis who alas seems to have missed out on nominations for best supporting actor , Brad Dourif who plays a very slimy villain , and Bernard Hill who made me forget that this is the same actor who played Yosser Hughes in BOYS FROM THE BLACKSTUFF 20 years ago . But I couldn`t help but miss Sean Bean and I suppose casting him as Faramir twin brother of Boromir would have been just too obviousBut despite my criticisms I enjoyed TTT immensely and for three magical hours I forgot all about my nicotine addiction and the world outside . No doubt the audience at the Rothesay cinema felt the same way as me as we watched this film in a hushed silence . We laughed at the right bits , gasped at the technical achievements , but no one cried which means I can only award THE TWO TOWERS 9 out of 10"},{"username":"bevo-13678","userUrl":"https://www.imdb.com/user/ur76062573","reviewLink":"https://www.imdb.com/review/rw5594796","warningSpoilers":false,"date":"31 March 2020","rate":"10","helpful":"2 out of 7 found this helpful.","title":"Awesome","content":"Wait a minute, is this the first one or the second one??? What ever"},{"username":"preppy-3","userUrl":"https://www.imdb.com/user/ur0463200","reviewLink":"https://www.imdb.com/review/rw0586042","warningSpoilers":false,"date":"21 January 2003","rate":"10","helpful":"4 out of 8 found this helpful.","title":"As good as the first","content":"Actually, it's better than the first!First off, see \"Fellowship of the Ring\" or you won't be able to make heads or tails out of this. It follows the fellowship being divided and facing evil on all sides. There's battles galore, tons of action, incredible sets and special effects, breathtaking scenery and the usual great direction from Peter Jackson. The acting is just so-so except for (surprisingly) Viggo Mortensen. I wasn't impressed with him in the first movie but he improved vastly in this one--a very subtle but physical performance. His scenes with Liv Tyler were especially moving. It runs for 3 hours but it flew by and I was never bored. The battle at Helms Deep is easily among one of the most incredible action sequences ever caught on film. A definite must-see. I can't wait for \"Return of the King\"!"},{"username":"Boba_Fett1138","userUrl":"https://www.imdb.com/user/ur1416505","reviewLink":"https://www.imdb.com/review/rw1042496","warningSpoilers":true,"date":"19 March 2005","rate":"10","helpful":"32 out of 37 found this helpful.","title":"Absolutely, totally fantastic!","content":"Watching this movie is like watching a 179 or 223 minutes long action sequence. The pace is incredibly high. Alright I have to admit that the Extended Edition of the \"The Lord of the Rings: The Two Towers\" takes an awful lot of this pace away and make some of the scene's unnecessary long and the scene's with Treebeard are also a bit dull and long but still...Especially compared to the first that was just too slow at times this is an huge improvement!Luckily there also are some welcome additions in the Extended Edition. Best addition are the scene's with Boromir, Faramir and Denethor in Osgiliath.There also are some newly great characters and actors. David Wenham is a surprisingly talented young actor and I think it's great that they actually have cast someone that really looks like Sean Bean. Bernard Hill also impressed me, he probably is best know for his role as the captain in \"Titanic\" in which he also already impressed me. Viggo Mortensen probably still is the best actor of \"The Lord of the Rings\" movies. Yes sure Ian McKellen and Christopher Lee are also more than great but Mortensen really puts some passion and effort in his character. I know Sean Astin is always being praised a lot but I seriously don't think that he is such a good actor in any of \"The Lord of the Rings\" movies. Andy Serkis also was really good as Gollum/Sméagol and I wouldn't had mind seeing him get an Oscar nod.Strange thing is that the Gimli and Legolas suddenly changed into some comical sidekick characters. It was odd to see but it works! They provide some good comical relief at times.Most fantastic thing about the movie is that it's really action filled. The Battle of Helm's Deep truly is fantastic to see. Still favorite and most powerful moment of the movie is when the Ent's march to war. Also the scene's with the riders of Rohan are a true spectacle.I've never been really a big fan of the editing of \"The Lord of the Rings\" movies and this one is no exception. Problem is that Peter Jackson shot way too many hours of footage with as a result that the editors have difficulties picking the right scene's and the length of them.But \"The Lord of the Rings: The Two Towers\" is one of those movies were the pluses make more than up for the minuses.A spectacular adventure action experience.10/10http://bobafett1138.blogspot.com/"},{"username":"bombersflyup","userUrl":"https://www.imdb.com/user/ur25775215","reviewLink":"https://www.imdb.com/review/rw6291984","warningSpoilers":true,"date":"21 November 2020","rate":"7","helpful":"0 out of 6 found this helpful.","title":"Smeagol: But the fat Hobbit, he knows. Eyes always watching. Gollum: Then we stabs them out. Put out his eyeses, make him crawl. Smeagol: Yes. Yes. Yes.","content":"The Two Towers continues the journey, but too often ventures away from that which brought joy.First off it's hard to find 4 hours within a day to dedicate to watching the film, as you want to continue the story not too long after the first. This film introduces many new and not so great characters, with drawn out and somewhat dull sequences. A cursed and weary Theoden and Merry and Pippin with treants, some of the weaker parts. Gollum makes his presence felt here, with Frodo and Sam, but they're in it not nearly enough. Aragorn's a strong character, but a lot of time's spent with undeveloped character's Legolas and Gimli and new not so likable characters. It still has magical moments, like Frodo falling to his death to catch the all important salt, but much less."},{"username":"TBJCSKCNRRQTreviews","userUrl":"https://www.imdb.com/user/ur2093818","reviewLink":"https://www.imdb.com/review/rw2180779","warningSpoilers":false,"date":"26 December 2009","rate":"10","helpful":"4 out of 6 found this helpful.","title":"Raises the bar","content":"This might actually be a little better than The Fellowship of the Ring. There is less annoying comic relief, and, as you probably already know, we get to really *see* Gollum, in all his fully rendered, entirely CGI glory. This was probably one of the first times such a large role was so successfully entirely digital, and definitely that it had such an impact. You feel for him, and you frankly forget that he's not \"really\" there. He can also be kind of funny. The humor in general is good. This picks up where the first one left off, and with several nifty surprises(for those not familiar with the novels, or who haven't had it spoiled) along the way, the plot progresses nicely. The pace is smooth, and this doesn't seem as if it actually is the three hours long that it is. This creates moods well, being creepy, light, gloomy, etc. at different points. The action and battle sequences are exciting and awesome, not to mention well-choreographed. Every acting performance is spot-on. Even baby-face Wood and dull Bloom are impeccable. The effects are astonishing. This has an epic scope, and has a magnificent, grand score. The characters are interesting and credible. This leaves you wondering what will happen next, and I'm very much looking forward to catching the last one. There are scary scenes in this, and it might be beyond what some children can handle. I recommend this to anyone that can imagine liking it, and who have watched the first one. 10/10"}],"errorMessage":""}