{"imDbId":"tt0103064","title":"Terminator 2: Judgment Day","fullTitle":"Terminator 2: Judgment Day (1991)","type":"Movie","year":"1991","items":[{"username":"TheLittleSongbird","userUrl":"https://www.imdb.com/user/ur20552756","reviewLink":"https://www.imdb.com/review/rw3308439","warningSpoilers":false,"date":"31 August 2015","rate":"10","helpful":"9 out of 12 found this helpful.","title":"A bigger, richer sequel that is every bit as fantastic as its predecessor and even surpasses it in some areas","content":""},{"username":"Michael_Elliott","userUrl":"https://www.imdb.com/user/ur13134536","reviewLink":"https://www.imdb.com/review/rw2073415","warningSpoilers":false,"date":"29 May 2009","rate":"","helpful":"6 out of 9 found this helpful.","title":"Masterpiece Sci-Fi","content":""},{"username":"Leofwine_draca","userUrl":"https://www.imdb.com/user/ur0482513","reviewLink":"https://www.imdb.com/review/rw3578430","warningSpoilers":true,"date":"11 November 2016","rate":"10","helpful":"4 out of 6 found this helpful.","title":"The purest form of action cinema there is","content":"At the time of release, this was one of the biggest, most expensive, box office hits ever made. Obviously that reputation has long since been diminished by films which have come since, but I still remember the hype and excitement that surrounded this film when I was but a ten year old boy. Containing Arnold Schwarzenegger's most accessible, likable performance, it's difficult to find fault with this near-masterpiece of adrenaline-pumping action.Essentially it's just a string of set pieces linked together by a few scenes of dialogue. There's little drama or acting involved - all the characters are clear-cut - basically, the film goes from one outstanding action sequence to another. And these action scenes are truly wonderful. There are five in all; each more exciting and meaningful than the last. The first comes when the T-800 and T-100 finally meet up and have a huge battle in a hallway, smashing walls down and throwing each other through windows. The battle of the titans continues outside in a riveting truck chase, stopped only by a huge explosion. The third suspenseful set-piece shows just how unstoppable the T-1000 is, as the goodies and baddies battle over rescuing Sarah Connor from her mental asylum. Then there's lot of gunfire and explosions in the Cyberdyne building siege, until the final climatic battle between good and evil at a steel mill.If THE ABYSS was the first film to really introduce CGI, TERMINATOR 2 is the first film to really make use of its facilities and to place them in a context - unlike later entries which tried to make non-computerised things look real, and failed. The T-1000's morphing shots are stunning, show-stopping, and exceptional, and they work because they are meant to look as such. Aside from these excellent morphing sequences (the scene involving the T-1000 coming out of a floor is probably the greatest), there's tons of ammunition and explosions flying across the screen at every opportunity. Arnie dons some realistic \"wound\" makeup in the final scenes of the film, and once again the makeup is flawless. The special effects are the best things in this film; the makeup, CGI work and stunts all come together in absolute perfection.The performance are spot on too; characters are introduced and are made charismatic, but thankfully are not dwelled upon. Edward Furlong makes an impressive debut as the streetwise, foul-mouthed kid who has a heart of gold, while Linda Hamilton has undergone a complete transformation from her victimised waitress in the first film to a muscular, lean killing machine herself. Robert Patrick helped to carve himself a niche for playing evil psychopaths, and his slim figure goes well with the morphing capabilities he possesses - he looks like a match for Arnie. But it's our friend Schwarzenegger who steals the film, starting out as a cold, calculating machine and in the end sacrificing himself for mankind. That this finale had me bursting into tears on more than one occasion shows just how good Arnie is in it. He's funny, heroic, likable and consistently impressive - what more could you want? Other familiar faces fill out the supporting cast, with the likes of Xander Berkeley and Earl Boen (returning from the first film) in minor roles.The violence isn't skirted, either...lots of people get impaled by the T-1000's knife-arms, plenty of men get shot in the knees (ouch), Arnie even cuts the skin off his own arm at one point. But this is primarily an action film, and should be treated as such. Every scene is flawlessly composed, with some little neat ideas thrown in almost everywhere - everything is portrayed coolly and stylishly, especially where Arnie is concerned. He really is the king of cool here - from the flick as he puts on his sunglasses to the shotgunning open of locked gates in split seconds to his final catchphrases - \"Hasta la Vista baby\" and \"I'll be back\" to name but two. And still there's more to praise: a moral behind the story, a suspenseful score, excellent opening titles, no lulls in the film whatsoever, nice photography, crisp editing...the list is, indeed, endless. In my youth, this was my most-watched film, and I can still watch it over without ever becoming bored. A masterpiece, plain and simple, and one of my very favourite films."},{"username":"SnoopyStyle","userUrl":"https://www.imdb.com/user/ur2898520","reviewLink":"https://www.imdb.com/review/rw2901081","warningSpoilers":false,"date":"7 November 2013","rate":"10","helpful":"1 out of 1 found this helpful.","title":"Great action and much more","content":"The future John Connor has sent a T-101 (Arnold Schwarzenegger) to protect the teenage John Connor (Edward Furlong) from the most advanced Terminator ever, the T-1000 (Robert Patrick). It's mimetic poly-alloy material allow it to mimic anything it touches. John must retrieve his mother Sarah Connor (Linda Hamilton) from the psychiatric hospital.The CG T-1000 is the most advanced FX of its times. For the rest, it is all real action. It still looks exciting and hasn't aged too badly. James Cameron has pushed the envelop to the limits. This is not simply Terminator on steroids. Cameron has added a lot of humor, and also heart. The T-101 is more a father figure to John Connor. And Sarah Connor's tough love really adds to the heartbreak. And the central idea that the future is still their's to create. All of it makes this more than a simple shoot 'em up movie. This is one of the best sequel ever."},{"username":"classicsoncall","userUrl":"https://www.imdb.com/user/ur2707735","reviewLink":"https://www.imdb.com/review/rw2544953","warningSpoilers":true,"date":"6 January 2012","rate":"8","helpful":"1 out of 3 found this helpful.","title":"\"You can't just go around killing people!\"","content":"I recall seeing this film when it first came out and remember my reaction thinking how cool it was to have Arnold turn the tables on his Terminator character by coming back as a good guy and the protector of Sarah Connor and her son. I haven't seen the picture since then until tonight, and even though it's twenty years later I'm still blown away by the special effects of the picture. The liquid metal alloy concept of Robert Patrick's T-1000 makes for a lot of clever mutations, with each one outdoing the one that went before. The one that really got me was when he rose out of the black and white tile floor of the hospital corridor. Very cool.Story wise, I always have a little trouble with these time travel gimmicks. It seems to me that Miles Dyson (Joe Morton) understood the unintended consequences of his work with Cyberdyne, and the science that came out of the remnants of the 1984 Terminator were handily disposed of at the finale. So Arnold and Company effectively saved the present day AND the future, except that the future happened anyway. I may be missing something here, but I'm not going to dwell on it.What I probably like most about the story is the relentless nature of the T-1000 to complete his mission, and the equal resolve that the Cyberdyne Systems Model 101 (that would be Arnie) has to stop him. Schwarzenegger once again parlayed his ability to deliver just a single line that has since become iconic - \"Hasta la vista, Baby\", getting by the rest of the way with his huge physique and a singular scowl. To her credit, Linda Hamilton literally got in shape for this picture by getting totally buffed, making her action sequences that much more believable. I'd probably be remiss if I didn't mention Edward Furlong for his portrayal as the young John Connor. I didn't really care for him at the start of the picture, but he grew into the role as the story progressed, becoming a sympathetic character by the time it was over."},{"username":"lee_eisenberg","userUrl":"https://www.imdb.com/user/ur4888011","reviewLink":"https://www.imdb.com/review/rw1195620","warningSpoilers":false,"date":"17 October 2005","rate":"7","helpful":"2 out of 9 found this helpful.","title":"Here's why it outdoes the original:","content":"You see, the first \"Terminator\" had someone protecting Sarah Connor (Linda Hamilton), and she depended on him. In \"Terminator 2: Judgment Day\", Sarah goes all bad-ass to protect her son John (Edward Furlong, in an impressive debut). Oh, and of course there's the Terminator (Arnold Schwarzenegger) battling the villainous T-1000 (Robert Patrick), sent back in time to kill John.Okay, so \"T2\" goes a little overboard on special effects, but it does manage to have a plot. The threat of a nuclear holocaust is always unnerving. Obviously, sending someone back in time to change history violates the paradox of time travel (meaning that if you change the past, then the future will be completely different, so there would be no incentive to change the past to begin with), but this is a pretty good movie, as action flicks go. Among other things, it shows that when Ah-nuld tries, he can act."},{"username":"gavin6942","userUrl":"https://www.imdb.com/user/ur1234929","reviewLink":"https://www.imdb.com/review/rw1700863","warningSpoilers":false,"date":"26 July 2007","rate":"8","helpful":"7 out of 11 found this helpful.","title":"Best. Terminator. Movie. Ever.","content":""},{"username":"jboothmillard","userUrl":"https://www.imdb.com/user/ur4248714","reviewLink":"https://www.imdb.com/review/rw1041820","warningSpoilers":true,"date":"18 March 2005","rate":"10","helpful":"9 out of 22 found this helpful.","title":"Terminator 2: Judgement Day","content":"He said \"I'll be back\", and he was, 11 years since the first film, James Cameron (Aliens, Titanic) directs the bigger sequel about the human looking machine, cyborg, returning from 2029. Another Terminator (Arnold Schwarzenegger) has come to the past, 1991, and this time his mission is to protect the leader of the human resistance, age 13 John Connor (introducing Edward Furlong). The villain of the film this time is another machine, but the T-1000 (Robert Patrick) is not a cyborg, it is a shape-shifting liquid metal machine. When the Terminator finds John, and it follows John's order to get his mother, Sarah (Linda Hamilton) who is in a mental hospital, they start their run. Sarah doesn't trust the Terminator for a while, looking the same as the last, but she will. But the film does not involve just them on the run from the T-1000, but after Sarah attempts to kill the man mostly responsible for Skynet being created, Miles Dyson (Joe Morton), they plan to destroy the Cyberdyne building, to avoid the war, Judgement Day. Also starring Earl Boen as Dr. Silberman. The special effects, particularly for the T-1000 are extraordinary, the chase and action, i.e. guns and fights sequences are gripping, Hamilton is much more aggressive, Schwarzenegger is hard and lovable, and his goodbye is quite teary, and Cameron's direction is still fantastic. Another not great sequel followed in 2003. It won the Oscars for Best Sound Effects Editing, Best Visual Effects, Best Makeup and Best Sound, and it was nominated for Best Cinematography and Best Film Editing, and it won the BAFTAs for Best Sound and Best Special, and it was nominated for Best Production Design. Arnold Schwarzenegger was number 54 on The 100 Greatest Movie Stars, and he was number 20 on The 100 Greatest Pop Culture Icons, Terminator (Hero) was number 48 on 100 Years, 100 Heroes & Villains, the film was number 76 on 100 Years, 100 Quotes (\"Hasta la vista, baby.\"), it was number 77 on 100 Years, 100 Thrills, and it was number 32 on Film 4's 50 Films To See Before You Die. Outstanding!"},{"username":"ccthemovieman-1","userUrl":"https://www.imdb.com/user/ur4445210","reviewLink":"https://www.imdb.com/review/rw1573255","warningSpoilers":false,"date":"15 January 2007","rate":"8","helpful":"16 out of 29 found this helpful.","title":"Many Annoyances, But An Incredible Action Flick","content":""},{"username":"Tweekums","userUrl":"https://www.imdb.com/user/ur13977076","reviewLink":"https://www.imdb.com/review/rw3522540","warningSpoilers":true,"date":"10 August 2016","rate":"8","helpful":"1 out of 2 found this helpful.","title":"The Terminator is back this time to save John Connor","content":"Set almost fifteen years after the original film we learn that Skynet sent a second, more advanced, T-1000 Terminator back in time; this time to kill the teenaged John Connor. The T-1000 is nothing like the original; it is a liquid metal machine, able to change its form to look like anyone or anything of the same volume. To protect John the resistance and reprogrammed a captured T-800 Terminator and sent it back to defend him.When the film starts John is living with foster parents and his mother is in a secure mental institution still convinced that Skynet will destroy civilisation in 1997. The T-800 manages to save John from the T-1000 then, on John's orders helps Sarah escape. Once out she knows what must be done; they must find the man responsible for the creation of the technology behind Skynet and prevent him from finishing his work all the time staying ahead of the T-1000.Even though this film was made a quarter of a century ago the special effects still look very impressive and there is a lot of exciting and spectacular action there are shootouts, a truck vs bike chase along on of Los Angeles's concrete rivers, explosions and final chase involving trucks and a helicopter. Those who want action should certainly be pleased on the other hand it does feel a bit safe at times; John orders the T-800 never to kill making it like a defanged cobra; scary looking but no longer deadly. Arnold Schwarzenegger continues to impress in the role, managing to inject some humour into the character. Linda Hamilton is also pretty solid as Sarah Connor; it is interesting to see how much her character has developed since the original. Edward Furlong is okay as the young John Connor although his character can be a bit irritating at times in a way that didn't seem real. Robert Patrick did a fine job as the shapeshifting T-1000. The level of violence is considerably lower than the original; the T-1000 kills a few people but even when blasting away with a minigun the T-800 only destroys property and causes non-life-threatening injuries this of course means the film is suitable for a slightly younger audience. Overall I'd definitely recommend this to fans of the original; personally I prefer the first film but I can understand why others would rate this one higher."},{"username":"ma-cortes","userUrl":"https://www.imdb.com/user/ur3270789","reviewLink":"https://www.imdb.com/review/rw5323040","warningSpoilers":false,"date":"15 December 2019","rate":"8","helpful":"2 out of 4 found this helpful.","title":"Nail-biting and exhilarating outing with state-of-art special effects","content":""},{"username":"BA_Harrison","userUrl":"https://www.imdb.com/user/ur0945066","reviewLink":"https://www.imdb.com/review/rw2515508","warningSpoilers":false,"date":"8 November 2011","rate":"10","helpful":"4 out of 5 found this helpful.","title":"You want incredible action and excitement? No problemo....","content":""},{"username":"paul_haakonsen","userUrl":"https://www.imdb.com/user/ur22654354","reviewLink":"https://www.imdb.com/review/rw3399492","warningSpoilers":false,"date":"21 January 2016","rate":"7","helpful":"1 out of 3 found this helpful.","title":"Come with me if you want to live!...","content":""},{"username":"Quinoa1984","userUrl":"https://www.imdb.com/user/ur0453068","reviewLink":"https://www.imdb.com/review/rw0300305","warningSpoilers":false,"date":"30 April 2000","rate":"10","helpful":"270 out of 343 found this helpful.","title":"surpasses the original","content":""},{"username":"sunwarrior13","userUrl":"https://www.imdb.com/user/ur5291991","reviewLink":"https://www.imdb.com/review/rw2572900","warningSpoilers":true,"date":"27 February 2012","rate":"10","helpful":"4 out of 5 found this helpful.","title":"A State-Of-The-Art Action Movie","content":"Terminator 2: Judgment Day is a science fiction action film, the second installment of the Terminator franchise and the sequel to The Terminator. Directed by James Cameron and written by Cameron and William Wisher, Jr., it stars Arnold Schwarzenegger, Linda Hamilton, Robert Patrick, and Edward Furlong. Terminator 2 follows Sarah Connor and her son John as they are pursued by a new, more advanced Terminator, the liquid metal, shape-shifting T- 1000, sent back in time to kill John to stop him from becoming leader of the human Resistance. An older, less advanced Terminator is also sent back in time to protect John.Having been informed by a time-traveling soldier in the first film that John will one day grow up to become humanity's savior from a computer- controlled Armageddon, Sarah has responded by becoming a muscle-bound she-warrior bent on educating John in survival tactics and battle strategies. Her ranting about humankind's future has landed Sarah in an insane asylum and John in the foster care system. The rebellious John has responded to his situation by getting into scrapes with the law. When a new and improved Terminator android called the T-1000 arrives from the future to eliminate John, an older model T-800 is sent to protect the boy. The T-1000, however, has the ability to morph itself into any shape it desires, allowing it chameleon-like powers and near indestructibility. The T-800 saves John's life and helps break Sarah out of the institution. Staying only one step ahead of the dogged T-1000, Sarah leads her son and the T-800 to the headquarters of Cyberdyne Systems, the company that will invent a robotic intelligence that will eventually take over the world. There, they attempt to convince inventor Miles Dyson to help them stop the future from ever occurring by destroying his work. Dyson sacrifices himself in an explosion to save the world, leading to a final showdown between the two Terminators at a steel foundry.A sequel to the sci-fi action thriller that made him and star Arnold Schwarzenegger A-list Hollywood names, writer/director James Cameron upped the ante with this follow-up by employing a more sweeping storyline and cutting-edge special effects.The film excelled in many technical categories for its groundbreaking effects for which it won four Oscars.It is the ultimate is a state-of-the-art action movie, all right: It gets you thinking that the most reasonable thing might just have been to blow everyone away."},{"username":"Theo Robertson","userUrl":"https://www.imdb.com/user/ur1532177","reviewLink":"https://www.imdb.com/review/rw0300590","warningSpoilers":false,"date":"17 June 2002","rate":"6","helpful":"10 out of 41 found this helpful.","title":"Over Produced and Over Rated Sequel","content":""},{"username":"bevo-13678","userUrl":"https://www.imdb.com/user/ur76062573","reviewLink":"https://www.imdb.com/review/rw5587935","warningSpoilers":false,"date":"29 March 2020","rate":"10","helpful":"4 out of 5 found this helpful.","title":"I'll be back","content":"I like the bit where he shoots the locks off of the gates whilst riding a motorcycle"},{"username":"Calicodreamin","userUrl":"https://www.imdb.com/user/ur29385135","reviewLink":"https://www.imdb.com/review/rw7110596","warningSpoilers":false,"date":"10 July 2021","rate":"10","helpful":"2 out of 2 found this helpful.","title":"Hasta la vista baby","content":"The best terminator movie by far and one of the all time greatest movies ever made. The effects are amazing for the early 90s and hold up even by todays standards. The storyline is easy to follow and the action scenes are amazing. The characters are well cast and the actors sell this movie. An absolute classic."},{"username":"zardoz-13","userUrl":"https://www.imdb.com/user/ur2079400","reviewLink":"https://www.imdb.com/review/rw3274942","warningSpoilers":true,"date":"11 July 2015","rate":"10","helpful":"2 out of 2 found this helpful.","title":"The Best Terminator Movie!!!","content":"Sequels rarely surpass originals, but \"Terminator 2: Judgment Day\" provides the exception to the rule. Writer & director James Cameron has outdone himself with this follow-up film to his seminal sci-fi, time travel, yarn about men and machines. In the original, a Cybernetic organism classified a Terminator appeared from the future to execute Sarah Connor, while the mankind resistance army of the future dispatched a warrior back to 1984 to save Sarah from certain death. Kyle Reese showed up and helped Sarah kill the Terminator. Nevertheless, although our heroine managed to survive the nightmarish ordeal and have a baby before she hightailed it to Mexico, Cyberdyne Systems acquired the forearm of the Terminator that she killed in the machine press and Sarah eventually wound up locked away in custody at the Pescadero Mental Hospital. Miraculously, Sarah's ten-year son John Connor (Edward Furlong in his first role) has been farmed out to foster parents, Janelle (Jenette Goldstein) and Tod Voight (Xander Berkeley), but is living the life of a low-grade hoodlum ripping off automated teller devices at banks when another Terminator designated a T-1000 (Robert Patrick) shows up to kill him. Unlike the enemy Terminator in \"The Terminator,\" the T-1000 is a highly advanced model that consists of liquid metal and can alter its shape. Essentially, the T-1000 is far more formidable than the earlier Terminators, and it gives our heroes a run for their money. As it turns out, the Resistance has rewired a T-800 (Model 101) Terminator (Arnold Schwarzenegger of \"Red Sonja\") and sent him back to 1995 to protect John. The outcome is a thoroughly exciting action thriller that raises the stakes where the villainous Terminators are concerned. Cameron and co-writer William Wisher have supplemented the plot with some humor as young John Connor helps the Terminator fit into society by saying familiar phrases. The T-1000 is a truly menacing adversary for our heroes and they have to keep on blasting away at it because it can repair itself in no time. As Sarah Connor, Linda Hamilton has undergone a transformation from being a vulnerable waitress to being a lean, mean doll who fights the Terminator. Initially, when John and the T-101 show up at the mental asylum, they have to battle the T-1000 and escape by the hair of their chin. You won't find a better sci-fi actioneer than \"Terminator 2: Judgment Day,\" and some of the dialogue is funny."},{"username":"view_and_review","userUrl":"https://www.imdb.com/user/ur3670492","reviewLink":"https://www.imdb.com/review/rw1579051","warningSpoilers":false,"date":"21 January 2007","rate":"9","helpful":"2 out of 2 found this helpful.","title":"An innovative trend-setter","content":""},{"username":"TBJCSKCNRRQTreviews","userUrl":"https://www.imdb.com/user/ur2093818","reviewLink":"https://www.imdb.com/review/rw1984340","warningSpoilers":false,"date":"2 December 2008","rate":"10","helpful":"5 out of 5 found this helpful.","title":"There's a reason this is so appreciated","content":""},{"username":"george.schmidt","userUrl":"https://www.imdb.com/user/ur0937743","reviewLink":"https://www.imdb.com/review/rw0300663","warningSpoilers":false,"date":"23 April 2003","rate":"","helpful":"13 out of 24 found this helpful.","title":"\"Back\" and better than ever! One of the best sequels in cinematic history.","content":"TERMINATOR 2: JUDGMENT DAY (1991) **** Arnold Schwarzenegger, Linda Hamilton, Joe Morton, Edward Furlong, Robert Patrick, Michael Biehn (cameo). Rousing superior sequel to \"The Terminator\", this time with Sarah Connor (a bufffed babe Hamilton) as a mercenary institutionalized from her adolescent son Furlong (in an impressive debut) facing two terminators: one evil (Patrick in a chilling perf) and one good (Ah-nold) to protect the young Connor. Eye-popping visuals and introducing long format morph process computer effects that won a much deserved Oscar(the prototype was first seen in Cameron's \"The Abyss\").Oscars also went to Stan Winston's make-up, sound and sound effects editing. One of the most popular and profitable films ever made. Non-stop action to the nth degree, a blunt anti-nuclear treatise by director James Cameron, and some nice humor courtesy of Arnold as the kinder, gentler robot: \"Hasta la vista, Baby!\""},{"username":"evanston_dad","userUrl":"https://www.imdb.com/user/ur4532636","reviewLink":"https://www.imdb.com/review/rw1977844","warningSpoilers":false,"date":"19 November 2008","rate":"9","helpful":"3 out of 3 found this helpful.","title":"He's Baa-aack","content":""},{"username":"neil-476","userUrl":"https://www.imdb.com/user/ur7813355","reviewLink":"https://www.imdb.com/review/rw1740793","warningSpoilers":false,"date":"4 October 2007","rate":"10","helpful":"5 out of 6 found this helpful.","title":"An observation","content":""},{"username":"bombersflyup","userUrl":"https://www.imdb.com/user/ur25775215","reviewLink":"https://www.imdb.com/review/rw7228895","warningSpoilers":true,"date":"14 August 2021","rate":"10","helpful":"0 out of 0 found this helpful.","title":"Come with me if you want to live.","content":"Terminator 2 Judgment Day is action-packed entertainment, clearly surpassing the original.It's epic and brilliant, with superb sound, cinematography and effects. Not without its moments of humour too, T-1000: \"Get out.\" Schwarzenegger and Patrick excellent. It's almost perfect minus a few Sarah and John individual and collective moments, where it tries to connect and evoke but fails. Though Furlong's better than I remembered. Dada da-dada."}],"errorMessage":""}