{"imDbId":"tt0120737","title":"The Lord of the Rings: The Fellowship of the Ring","fullTitle":"The Lord of the Rings: The Fellowship of the Ring (2001)","type":"Movie","year":"2001","items":[{"username":"TheLittleSongbird","userUrl":"https://www.imdb.com/user/ur20552756","reviewLink":"https://www.imdb.com/review/rw2326534","warningSpoilers":false,"date":"19 October 2010","rate":"9","helpful":"17 out of 22 found this helpful.","title":"A very solid start to a great trilogy","content":"J.R.R Tolkein's books are wonderful, with memorable characters, an enchanting atmosphere, strong narrative and dialogue and an epic story. Peter Jackson's trilogy mayn't be necessarily true to them, but it does have the memorable characters, the epic story and enchanting atmosphere that the books do. The Fellowship of the Ring is probably the weakest of the three, but it is a very solid start. It is I agree slower in pace to the other two, and there are some talky scenes that drag it down a tad.However, I cannot deny that this is a great film. One of the many strong assets of this picture are the visuals. The cinematography is marvellous, the costumes are splendid, the effects are great, the makeup is immaculate and the scenery is fantastic especially with Rivendell which was like a Utopia. There is also the score, what an amazing score. As much as I do like Howard Shore, his scoring for the Lord of The Rings trilogy is his most memorable for me and probably his most complex as well. There are so many beautiful and haunting parts here, sometimes even at the same time, as well as the charming Hobbits theme, the ethereal theme played while at Rivendell and the sinister bombastic sounds while at Mordor.Now I am not going to say that Peter Jackson is a bad director or an outstanding director, but he has directed some wonderful films especially Heavenly Creatures, and this is no exception, where he does a very capable job directing. The story still has its epic scope, with standouts being the confrontation between Gandalf and Sarouman, the scene in the mines with Balrok and Boromir's death scene. I also liked the pursuit of Frodo and Arwyn and Frodo with the Black Riders which was beautifully shot. Then there is the dialogue, which on the whole is excellent, Gandalf in my personal opinion gets the best of it.And the acting is very good. I do think Frodo is developed more in the sequels than here, but Elijah Wood does do a likable enough job here, while Sean Astin's bumbling yet well meaning persona suits Sam well. Cate Blanchett is a lovely Galadriel, and Liv Tyler is stunning as Arwyn. And then there is Christopher Lee, whose presence always ensures that the performance is going to be good, and indeed it was, and Ian Holm is very good as Bilbo. Sean Bean also does well with Boromir, and John Rhys Davies is a welcome presence. Aragorn like Frodo is developed more in the sequels than here, here he is more brooding and charismatic above all else. Not a bad thing really, as Viggo Mortenssen does do that very well. The standout though is Ian McKellen, who is an absolute revelation as Gandalf, the delivery to the camera, the delivery of the lines, perfectly judged. In fact the only real weak link in the cast is Orlando Bloom, yes he is dashing and handsome, but in the process he does come across as a little uncharismatic and bland.In conclusion, a great start. 9/10 Bethany Cox"},{"username":"Leofwine_draca","userUrl":"https://www.imdb.com/user/ur0482513","reviewLink":"https://www.imdb.com/review/rw3528189","warningSpoilers":true,"date":"19 August 2016","rate":"10","helpful":"26 out of 26 found this helpful.","title":"Near perfect adaptation of a fantasy benchmark","content":"Director Peter Jackson and wife Fran Walsh have successfully created an epic movie in both look and feel to equal J. R. R. Tolkien's novel (itself awarded the title of \"book of the century\"), bringing to the big screen a film nearly flawless in its execution. My biggest disappointment is that two chapters are missing from the novel - Tom Bombadil and the following encounter with the barrow-wrights - but everything else is present and correct.Visually the film is stunning, and Jackson's decision to shoot it entirely in New Zealand is one that pays off. From the incredibly lush green opening scenes of the Shire, to the enchanting elvish woods, to the imposing mountains and plains, it really is a great film to look at and enjoy the backdrop. Even the computer-generated images, like that of Mount Doom, are pretty realistic. Jackson's fluid camera leads to some great sweeping shots through orc-infested mines, huge towers, cameras in places you've never dreamed of. The soundtrack is also perfect, with Howard Shore's suspenseful, exciting, and emotional score a real plus, especially with the cool chanting that fills the Mines of Moria sequence. On top of this, great stuff is done with sound effects - in particular one scene involving a horn suddenly blowing had me jumping in my seat with its realism.I don't really need to examine the story, because it sticks closely to the book with so few minor changes that it's impeccable. The script is intelligent and well-written, the characters charismatic and believable in the situations they encounter. Despite a three hour running time, the film never drags, even in some of the slower sequences - I just didn't want it to be over while I was watching it. The costumes, sets and appearances - down to the hobbits' hairy feet - are all exactly as you would picture them in the book. Jackson's bizarre, arty depiction of life in the \"netherworld\" when Frodo puts on the ring and becomes invisible is as good as it could ever have been - spooky, supernatural and utterly weird. Lighting, pacing, suspense, tension, and the rest - it's all here and done 100% correctly for an overall brilliant effect.Elijah Wood seemed an odd choice to me for the lead role, but I immediately fell in love with his character. Through his acting he creates an emotional, weak in body but strong in spirit hero, a real centre piece for the film to evolve around, and the film makes great use of the actor's slightly odd eyes (especially in the sequence in which he nearly becomes a wraith). Ian McKellen is also excellent as Gandalf and seems to have been perfectly cast in the role, making it his own. Then there's the fellowship itself - Viggo Mortensen excels as the proud and just Strider (later Aragorn), especially in the action stakes where he fights with such fierce determination that he's a presence to behold. Orlando Bloom is fine as the elf warrior Legolas, and moves as fast with his bow as he does in the book. Screen stalwart John Rhys-Davies IS Gimli the dwarf, and couldn't be better. Then there's Sean Astin - lovable as the dopey but loyal Sam Gamgee, and Billy Boyd and Dominic Monaghan in slight comic relief roles as hobbit buddies Pip and Merry. Finally, kudos to Sean Bean, for creating in Boromir a flawed but deeply likable and understandable character, with a sympathetic performance that eclipses all of the actor's previous work - bravo.The action sequences are magnificent and really get the heart going - they put you into the middle of the action with all the blood, sweat and clanging steel, and are edge-of-the-seat stuff. Highlights include Strider fighting the ring-wraiths with his burning brand on Weathertop and the final assault by orcs on the fellowship, which leads to one of the most noble deaths ever in a film. And what of the special effects? In a film dominated by CGI work, I'm happy to say that most are unnoticeable. The digital manipulation to create four-foot hobbits is sometimes dodgy but most of the time you don't notice. The backdrops and effects are great, expensive looking but solid and real at the same time - whoever said they look \"cartoony\" just got it wrong.My favourite scene in the movie is the Mines of Moria sequence - a fantasy fan's dream come true, and the best on screen depiction of a Dungeons & Dragons game so far. The lurker in the lake is a Lovecraftian monster par excellence and the spooky and atmospheric trip through the corpse-strewn deserted mines exceptionally eerie stuff. Then follows a fantastic battle with a cave troll, thankfully on screen for a fair amount of time so we get to admire the fluid and superb effects, and then a truly gob-smacking encounter with the fiery Balrog, just as you imagine it from the book. This half an hour is probably the best film sequence I've ever seen, flawless and perfect in its depiction - amazing. A highlight of what is an impressive and epic film throughout, and a must see for any film fan worth their salt - I can't recommend this film highly enough, and plan to watch it again before the cinema run expires. In my opinion this is better than any STAR WARS movie or HARRY POTTER - and easily one of the best fantasy movies ever made, although it has to be said the competition isn't exactly stiff. Bring on the sequel!"},{"username":"SnoopyStyle","userUrl":"https://www.imdb.com/user/ur2898520","reviewLink":"https://www.imdb.com/review/rw3548197","warningSpoilers":false,"date":"21 September 2016","rate":"9","helpful":"5 out of 6 found this helpful.","title":"immersive new world","content":"Dark Lord Sauron forges the One Ring to rule them all. He loses the battle and the ring is lost. It passes through the hands of Isildur, Gollum, and finally lands with Bilbo Baggins. Gandalf (Ian McKellen) arrives in the Shire to visit Bilbo. Bilbo goes on a personal journey leaving the burden of the ring to Frodo (Elijah Wood). Frodo sets off on a quest to save the world with his best friend Samwise (Sean Astin). Along the way, others join this Fellowship of the Ring.Peter Jackson delivers a near-perfect execution of this fantasy classic. The CGI is state-of-the-art but the movie does not get bogged down with battles of massive armies. The action is visceral and thrilling. The characters are compelling and the performances are near perfect. The internal conflicts over the ring actually drive the narrative and ultimately generates great paranoia and isolation for Frodo. This is a great start."},{"username":"Hitchcoc","userUrl":"https://www.imdb.com/user/ur0278527","reviewLink":"https://www.imdb.com/review/rw1304439","warningSpoilers":false,"date":"2 March 2006","rate":"10","helpful":"16 out of 17 found this helpful.","title":"I Don't Know if They Could Do It Much Better","content":"I am not fanatic, though I have read the books a couple of times. My interest in J. R. R. Tolkien goes to his knowledge of the history of language as well as his work in fantasy. I've seen some of the bad animation that was done using his work. I always assumed that this would be the only vehicle that could be used to bring these works to the screen. Now with a new generation of special effects masters, we have a work of art like the world has never seen. Granted, there can never be a definitive work that matches the depth and poetry of the books, but this captures the charm, the wonder, the amazing epic. To see the Shire presented in the first scenes and the party in the home of Bilbo as the creatures of this amazing fantasy are exposed is one of those incredible moments. The story is set up for the ultimate adventure as Frodo paddles out onto that lake, not knowing what has been set in motion. I will leave the real reviews to others. My first thought upon seeing this was, I just hope I survive to see it to its conclusion."},{"username":"Horst_In_Translation","userUrl":"https://www.imdb.com/user/ur3914439","reviewLink":"https://www.imdb.com/review/rw3134034","warningSpoilers":true,"date":"1 December 2014","rate":"6","helpful":"3 out of 43 found this helpful.","title":"Good beginning to a memorable trilogy","content":"\"The Lord of the Rings: The Fellowship of the Ring\" is the first of Peter Jackson's \"Lord of the Rings\"-trilogy and possibly my favorite from the three movies. After a sole writing nomination for one of his earlier works, Jackson started his big run with the Academy Awards here back in 2002. The first hour was pretty great here. I thought the female narrator was a good introduction to the films and I also really enjoyed looking at all the juicy green from the Shire. And we should be glad the headless horseman did not manage to get little Frodo after 60 minutes as then the whole tale would have been over already. That Frodo seemed quite a survivalist anyway looking at the quantity of situations where he came out alive, almost like the Chosen One from \"The Matrix\". However, the actor who plays Agent Smith is one of the good ones here. They all seem to have a talent to stay away from death, even if they are getting in the most dangerous situations, like Gandalf falling deep down and becoming the White Gandalf. This applies also to many other characters who keep getting missed by Orc arrows by centimeters. Lucky bunch.Anyway, back to the story. This is obviously a fantasy drama, but it has its fair share of comedic moments as well. Most of these involve the two other Hobbits or pretty much every scene with Gimli the Dwarf, for example when he asks to not be pulled on his beard. While we're at it, that nasty creature down there in the dwarfs' graveyard is truly disgusting. Most of the film is about the journey though, the whole adventure when the group is still together. At the end, they split up. Frodo and Sam keep going to destroy the ring. Aragorn, Legolas and Gimli try to free the other two hobbits. I can't say the film did not drag a single second during its 3.5 hours runtime (for me it mostly did during the fight sequences), but at least we get to watch beautiful landscapes and cinematography from start to finish. Also all the creatures included here are fairly special and memorable.One of my favorite scenes is when we see Frodo's grief and regret when Gandalf allegedly dies as Frodo was the one who wanted to take the Moria route and Gandalf did not. Another one I liked was the Elf marching scene early on when Sam says it makes him sad for some reason. It's almost like a special march of animals (penguins for example, or birds flying south). Two scenes I did not like that much were when we saw what the ring does to people. Bilbo and Galadriel look almost like horror movie creatures during their respective scenes and that is not a course the film takes at any other point. This film is all about Sauron's invisible danger and these two transformation scenes did not work in its favor. Nonetheless, Saruman felt more like the main antagonist in this film here, first of all of course because of his fight against Gandalf and then also because he pretty much commands the Orc army. During one scene he gives the order to kill all those who accompany the Hobbits. Then there is the usual components to this kind of movies, such as the enemy within the group, who (luckily to Frodo?) gets killed by the Orc army.Elijah Wood was one of the most promising young actors back then, so it was no surprise he got cast. The bigger surprise is possibly Sean Astin, who was not that well-known, but worked wonders during the whole trilogy and is possibly my favorite actor from the whole cast taking all three films together. Today he is possibly the epitome of the loyal friend in movie history. The movie ends with an Enya song (also Academy Award nominated). She did the super successful song connected with the 9/11-tragedy some months earlier and her song here works very well too. Taking all components together, this is a pretty good movie and a must-see for everybody with an interest in the fantasy genre."},{"username":"claudio_carvalho","userUrl":"https://www.imdb.com/user/ur2488512","reviewLink":"https://www.imdb.com/review/rw0461823","warningSpoilers":false,"date":"1 September 2003","rate":"10","helpful":"36 out of 52 found this helpful.","title":"The Best Movie of Fantasy and Adventure Ever Made","content":"In my opinion this is the best movie of fantasy and adventure ever made. The journey of Frodo Baggins and the Fellowship of the Ring is outstanding, stunning, a masterpiece. I believe there is nothing else to be said about this fantastic movie. My vote is ten."},{"username":"bob the moo","userUrl":"https://www.imdb.com/user/ur1002035","reviewLink":"https://www.imdb.com/review/rw0458255","warningSpoilers":false,"date":"4 January 2002","rate":"","helpful":"14 out of 44 found this helpful.","title":"Very worthy but why didn't I find it fun too watch?","content":"Wizard Gandalf retrieves an evil ring from Bilbo Baggins he finds it's true nature and must destroy. Frodo, a hobbit with a pure enough heart to resist the ring, is selected to make the journey to destroy the ring.The story here is very heavy and a good job has been made of trimming down the story to make it accessible to those not familiar with the story. The characters are quite well developed - the beauty of the film is that it knows it will be a trilogy of films so it doesn't have to rush past characterisation where other films would need to get down to action quickly to ensure that it can get a sequel greenlighted.The visuals are fantastic, the special effects are brilliant and are mixed well with New Zealand's natural scenery to great effect, there's no doubting that Jackson can cope with such a grand canvas to work on. The action scenes are also very well handled and the monster special effects are mostly good (only occasionally it is obvious that some are computer generated).The main problem with the film is that it isn't a lot of fun. I know it wants to be serious but it also needs to be fun for the audience to watch, three hours is a long time to sit listening to lots of talk about family trees and ancient quests etc. I didn't want comedy but it all took itself too seriously to be totally enjoyable. Another problem with it is that the pacing is all off - the film has a set pattern that goes all the way through, first a talky scene with slow camera movements, then the music changes, the camera starts zooming around and we enter an action scene, then back to a talky scene, then an action/chase scene and so on. It all gets a bit tiresome with it's continual cut between action/talking/action/talking with a relentless monotony. There's nothing wrong with the content but it all gets a bit tiresome after a while.The cast are roundly great - almost totally well cast with the exception of Hugo Weaving who looks, sounds and acts just like his character in the Matrix - it makes it too distracting. Wood as Frodo is a little too serious at times, gazing off into the distance and delivering straight dialogue. Bean and Mortensen are both great, Bean especially with his flawed character struggling against the ring. The best character in the film is the ring! The film suffers from not having a bad guy to focus on (Christopher Lee is built up but he isn't the main source of evil). Giving the ring itself the ability to tempt and manipulate and speak, this makes it the main evil character and makes the quest even more tense.Overall it's a big grown up blockbuster with amazing effects but it isn't very much fun to watch (not just laughs but basic enjoyment). A good film but far from perfect - 4 out of 5."},{"username":"classicsoncall","userUrl":"https://www.imdb.com/user/ur2707735","reviewLink":"https://www.imdb.com/review/rw1245074","warningSpoilers":true,"date":"22 December 2005","rate":"10","helpful":"21 out of 23 found this helpful.","title":"\"Remember what Bilbo used to say, it's dangerous business Frodo, going out the door.\"","content":"When I first read \"The Hobbit\" and \"The Lord of the Rings\" Trilogy back in the early 1970's, I recall saying to myself that the story would make a wonderful movie. \"Star Wars\" still hadn't come out yet, and realizing that the available technology could not do justice to the fantastic world presented by J.R.R. Tolkien, it was simply best left to the imagination.Well, imagination has found life in \"The Fellowship of the Ring\", a truly profound epic that sets the standard for film fantasy, just as the books did for the written word. Upon first seeing it during it's initial release, I couldn't have been happier with the amount of detail it offered while remaining true to the original adventure. Everyone imagines what a story and characters look like in their own mind; it was as if Peter Jackson tapped a great cosmic consciousness to deliver a tale that captured the tone and pacing of the novel dead on.I feel that readers of the trilogy have a leg up on the characters and locations of Middle Earth, as they are revealed in the film quickly and with nominal explanation. For example, when the Black Riders appear for the first time, it's difficult to grasp what they're all about, other than the fact that they're after the ring. Strider's explanation of the Nazgul is perfect - ring wraiths who were once men, neither alive nor dead, who always feel the power of the ring. Coming to the movie with that understanding ahead of time helps the viewer have a greater appreciation of the action taking place.The real magic of the movie for me is the seamless manner in which the various races coexist and interact with each other. Though levels of unfamiliarity and distrust appear, can anyone coming out of the movie doubt that elves, dwarfs, hobbits and wizards actually exist. Even orcs and evil Uruk hai have a place in this world, for without the danger they pose there is no triumph.If the movie captures your imagination and you haven't read the trilogy or it's prequel \"The Hobbit\", you'll be doing yourself a favor to do so. There in even more exquisite detail are nuances such as Elvish poetry and additional characters that provide more depth and color to the world of Middle Earth. It's a world easy to get lost in, and makes one appreciate a writer of legendary proportion who invented a land, people, and language all of his own that can now be shared with everyone."},{"username":"lee_eisenberg","userUrl":"https://www.imdb.com/user/ur4888011","reviewLink":"https://www.imdb.com/review/rw1198289","warningSpoilers":false,"date":"21 October 2005","rate":"10","helpful":"10 out of 14 found this helpful.","title":"One ring - and three great movies - to rule them all.","content":"A pop culture phenomenon, \"The Lord of the Rings: The Fellowship of the Ring\" is unlike anything that you've ever seen. The plot of course has several hobbits and humans joining up in Middle Earth to destroy a ring that corrupts whomever possesses it; in the process, they have to fight off evil beings. The movie is beyond impressive. In fact, there isn't any adjective that can do it justice. You have to see it to believe it. Peter Jackson adapted J.R.R. Tolkien's novel to the screen as a work of art that would otherwise be unfathomable. I've never read the novel, but I can say that Elijah Wood, Ian McKellen, Viggo Mortensen, Sean Astin, John Rhys-Davies, Liv Tyler, Cate Blanchett, Christopher Lee, and Ian Holm, interpret the characters with a style and quality that we usually associate only with history's most distinguished actors and actresses. This is THE movie to see, and parts 2 and 3 were equally good. A masterpiece in the true sense of the word."},{"username":"jboothmillard","userUrl":"https://www.imdb.com/user/ur4248714","reviewLink":"https://www.imdb.com/review/rw1027516","warningSpoilers":true,"date":"24 February 2005","rate":"10","helpful":"8 out of 36 found this helpful.","title":"The Lord of the Rings: The Fellowship of the Ring","content":"This is the first part of the famous trilogy based on the well-loved books by writer J. R. R. Tolkien. Basically, long ago in Middle-Earth, an evil lord Sauron in the land of Mordor forged a ring of evil powers in the fires of Mount Doom. Years later Bilbo Baggins (Sir Ian Holm) of The Shire finds this ring and leaves it to Frodo (Elijah Wood). Accompied by a fellowship of friends/heroes he must return this ring to Mount Doom to destroy it. This fellowship includes Sam (The Goonie's Sean Astin), Pippin (introduction by Billy Boyd), Merry (introduction by Dominic Monaghan, now known in TV's Lost), Gandalf the Grey wizard (Oscar and BAFTA nominated Sir Ian McKellen), Aragorn/Strider (Viggo Mortensen), Boromir (Sean Bean) and Legolas (introduction by Orlando Bloom). Meanwhile, betraying White wizard Saruman (Christopher Lee) in Isengard has an army hideous of Orcs and Urukhai to find the ring, along with the terrifying Nazgûl (Ring-wraiths). Also starring Liv Tyler as Arwen, Cate Blanchett as Galadriel, The Matrix's Hugo Weaving as Elrond and Andy Serkis as Gollum/Sméagol. BAFTA winning, and Oscar and Golden Globe nominated director Peter Jackson has created an excellent start to the trilogy filled with marvellous landscapes and great action. It won the Oscars for Best Cinematography, Best Visual Effects, Best Makeup, and Best Music, Original Score for Howard Shore, and it was nominated for Best Art Direction-Set Decoration, Best Costume Design, Best Editing, Best Sound, Best Writing, Screenplay Based on Material Previously Produced or Published, Best Original Song for Enya's fantastic \"May It Be\" (also nominated the Golden Globe), and Best Picture, and it won the BAFTAs for the Audience Award, Best Special Visual Effects, Best Make Up/Hair, the David Lean Award for Direction, and Best Film, and it was nominated for the Anthony Asquith Award for Film Music, the BAFTA Children's Award for Best Feature Film, Best Cinematography, Best Costume Design, Best Editing, Best Production Design, Best Adapted Screenplay, and Best Sound, and it was nominated the Golden Globes for Best Motion Picture - Drama, and Best Original Score. Christopher Lee was number 31 on The 100 Greatest Movie Stars, he was number 13, and Sir Ian McKellen number 4 on The 50 Greatest British Actors, and McKellen was number 5 on Britain's Finest Actors, the film was number 16 on The Ultimate Film, and as part of the trilogy, all three films were number 11 on The 100 Greatest Family Films. Outstanding!"},{"username":"ccthemovieman-1","userUrl":"https://www.imdb.com/user/ur4445210","reviewLink":"https://www.imdb.com/review/rw1308663","warningSpoilers":false,"date":"7 March 2006","rate":"10","helpful":"142 out of 164 found this helpful.","title":"First, And Still The Best Of LOTR","content":"Here is one film that lived up to its hype, and by the time I saw it after it had arrived at the video stores, I had heard and read a ton of things about it, and seen all the awards it had received, and expected a lot. To my surprise, it did not disappoint.Now, several years later after having watched all three of these \"Rings\" films twice each, I still think this first movie of the trilogy is the best. It is a truly spectacular adventure story all the way through, probably the best ever put to film...and the first three hours of it is extra special. The following two films were very good, to be sure, but this first had a better mixture of the story. The second and third movies were almost entirely Frodo and his allies' long journey, but the first half of this movie also gives a good bit of interesting introductory material including a number of scenes at the Shire, before the long adventure starts. If you watch all three of these films consecutively the action wears you down by midway through the final episode and it almost becomes just too much That never gets a chance to happen with the \"Fellowship\" film.Anyway, \"Fellowship,\" stunned me for the visuals alone. I can't recall any film that has so many jaw-dropping scenes, one after the other, for three straight hours. Some are beyond description, and I don't care if they are computer- generated. So what? The fact is they are awesome to view, both in beauty and in staggering action scenes that feature incredible-looking monsters and other mythical characters.The story covers all kinds of terrain, too, from the lush Shire of the Hobbits, to the harsh neighboring landscapes. Each couple of minutes, as in the two movies that followed, scenes radically change from calmness to action, adventure to romance, sweet lovable characters to hideous monsters, on and on and on. It's an incredible movie experience."},{"username":"Tweekums","userUrl":"https://www.imdb.com/user/ur13977076","reviewLink":"https://www.imdb.com/review/rw2096743","warningSpoilers":true,"date":"16 July 2009","rate":"9","helpful":"5 out of 7 found this helpful.","title":"A great adaptation of a classic story","content":"This is a great film, unlike most films that are the first part of a trilogy you really do have to watch the remaining films to get the most out of the story as there is no sense of closure at the end of the film, it is merely the end of one part of their quest and the beginning of the next. This is not a bad thing; just make sure you'll have enough time to watch all three films fairly close together. The film is very long but I don't think there were any scenes that could have been removed or trimmed so the length is justified.I think the film followed the book fairly well, although I confess it has been a while since I read it. After a short prologue where we are given a history of The Ring. We then find ourself in the Shire, the home of the Hobbits; the wizard Gandalf has come to attend a birthday party for his old friend Bilbo Baggins. During the party Bilbo announces that he is going to be leaving the Shire, he then slips a ring onto his finger and vanishes into thin air. When he takes the ring off again he is confronted by Gandalf who tells him he must leave the ring behind when he goes as it is dangerous.Unfortunately his use of the ring has been noticed by the evil Sauron who has dispatched nine wraiths; horsemen who's sole purpose is to retrieve the ring for their master. Gandalf instructs Bilbo's nephew Frodo to take the ring to Elves at Rivendell. On the way he and three Hobbit friends meet up with a mysterious man who helps them flee from the riders although Frodo is wounded and needs the Elves to recover. At Rivendell the group learn that their quest is not over, they must continue on to Sauron's land of Mordor where they can finally destroy the ring. The group are joined by Gandalf, an Elf called Legolas, Gimli the Dwarf and a man called Boromir.This film doesn't go as far as Mordor, in fact it only shows the first part of the journey which will see our heroes battling Orcs, other strange creatures and their own desire for the power the ring may bring; not all of the group will survive.As this is a fantasy film they are a lot of special effects, thankfully they are so well done that they don't look like effects even though we know they must be, I especially liked how they made the hobbits look so small, had I not seen the actors in other films it would have been almost possible to believe that the actors really were that short. Peter Jackson did a great job on this film getting a good performance from all his actors; a combination of well known veteran actors and young actors who will probably go onto be stars although I suspect this is the film they will be remembered for."},{"username":"paul_haakonsen","userUrl":"https://www.imdb.com/user/ur22654354","reviewLink":"https://www.imdb.com/review/rw5428781","warningSpoilers":false,"date":"22 January 2020","rate":"7","helpful":"1 out of 9 found this helpful.","title":"A solid story-driven movie...","content":"When \"The Lord of the Rings: The Fellowship of the Ring\" was originally released back in 2001, it took me three or four attempts to get through the movie, as I found it to be massively boring and unappealing. Which is odd, because I have been playing Dungeons & Dragons since around the mid-1980s.Then I got my hands on the extended version in 2020, and decided to sit down and watch it again. Perhaps I have matured since 2001, because I found the movie to be much more enjoyable this time around, despite it running for close to four hours. Sure, it was a long ordeal, but enjoyable none the less.The characters are well-rounded and they have a great ensemble of actors and actresses to perform the various roles in the movie. And I am still amazed with how the visual effects team managed to make the hobbits and dwarves small in size in comparison to the elves and humans. But it worked so nicely in favor of the movie and the fantasy atmosphere of Tolkien.This is definitely a story-driven movie, so it might not have appeal to everybody, especially those hungering for more action.The visual effects in the movie were great, and the Nazgul were impressive.If you haven't already seen \"The Lord of the Rings: Fellowship of the Ring\", it is definitely a movie you should take the time to sit down and watch.My rating for this movie is a seven out of ten stars - or rings, if you will."},{"username":"BA_Harrison","userUrl":"https://www.imdb.com/user/ur0945066","reviewLink":"https://www.imdb.com/review/rw2325494","warningSpoilers":false,"date":"17 October 2010","rate":"8","helpful":"4 out of 6 found this helpful.","title":"A short review for a very long film.","content":"Although it may not be entirely faithful to the book, Peter Jackson's Lord of the Rings trilogy perfectly captures the essence of J.R.R. Tolkein's fantasy classic: it's magical, imaginative and completely unforgettable, but also extremely long and a little hard going at times. Those who stay the distance, however, seem to agree that a bit of perseverance is well worth it in the end.The Fellowship of the Ring is perhaps the most laborious of the three films, what with the setting up of the plot, the introduction of a multitude of characters, and several talky scenes eating into the 171 minutes running time, but thankfully the film's impressive fantasy fighting action, breath-taking scenery, and amazing performances more than make up for the duller moments.All in all, I found The Fellowship of the Ring to be an admirable start for this ambitious attempt at bringing Tolkein's complex fantasy epic to the screen."},{"username":"moonspinner55","userUrl":"https://www.imdb.com/user/ur0989035","reviewLink":"https://www.imdb.com/review/rw1276854","warningSpoilers":false,"date":"28 January 2006","rate":"5","helpful":"12 out of 49 found this helpful.","title":"Overkill","content":"The preamble of \"The Lord Of the Rings\" thankfully isn't so pedantic that we are forced to wade through every cranny of J.R.R. Tolkien's fanciful-but-incredibly-detailed set-up for the story, but neither is it anything more than just a jumble of scenes (an expansive but darkly-lit battle, close-ups of faces, wind blowing the hair of warriors), and once the actual plot got underway I had hope that this fractured fairy tale-style was just an aberration. The first hour is actually rather leisurely, with an introduction to the Hobbit village that is sweet if a little slow (and hampered by show-off fireworks effects). But once the first journey is undertaken by the Fellowship, frenetic action scenes, too many battles, and countless close-ups of THE RING in someone's palm take over. The direction is deadening, relying far too heavily on special effects and sound effects to juice the narrative. The acting is good except from the women (Cate Blanchett and Liv Tyler are poorly-used) and we get elaborate glimpses of magical worlds without ever gaining a sense of their histories. Blanchett rules the Forest of Women, and indeed it is eye-popping, but the scene is a bummer, only included so Blanchett could help forecast Elijah Wood's future (scenes from the next installment!). The movie is not a cheat: it packs in a lot of astounding action, but that's all it is, action for it's own sake. The art directors go for overkill in dazzling this thing up, but lovers of intriguing and substantial content will feel undernourished. The film gives you your money's worth, sure, but only in style. **1/2 from ****"},{"username":"TxMike","userUrl":"https://www.imdb.com/user/ur0438066","reviewLink":"https://www.imdb.com/review/rw0461035","warningSpoilers":false,"date":"10 August 2002","rate":"","helpful":"8 out of 14 found this helpful.","title":"Very high production values, very long, perfect for \"Ring\" fans.","content":"I went to school in the 1950s and 1960s. I never read \"The Hobbit\" nor any of the \"Ring\" trilogies. So I only had a vague idea what Tolkien and his writings were all about, although I already knew there were \"Ring\" fanatics of all ages out there. I got a \"free\" DVD as a result of the Blockbuster campaign where you buy a 10-week rental card for $25 and get a DVD in return at no extra cost. A deal I couldn't refuse!Well, last night I watched the film, along with good friends Frank and Judy who happen to be \"Ringheads.\" The filming was absolutely gorgeous. The DVD transfer is about the best I have seen so far, and the Dolby 5.1 sound is very dynamic and beautiful. In short about all one could ask for in a DVD. Plus, there is a second disk which has over two hours of \"extras\", several \"making of\" plus a 10-minute preview of the second installment due out later this year. While the movie itself is very interesting, especially the first one-third which sets the stage for the journey that \"the fellowship of the ring\" will undertake, to ultimately return the \"one ring\" to the volcano, NEVER did I feel that this was a \"great\" film. As the story unfolds there are increasingly brutal battles to be fought, one after another, with little story between each battle. While that may make for really good reading, where you can create exactly the images you want in your own mind, as a film it gets to be a bit much. I actually became bored, with yet another battle and narrow escape. Like adding too much spice to a good meal.As a film of a historic work of fiction, and especially this DVD release, it is almost perfect. However, as a fictional work the story is a bit of a let-down, in my opinion. It is best appreciated by all the \"Ringheads\" out there who have bonded over the years with the ring trilogy and Tolkien. For my own enjoyment there are more interesting fictional works. Maybe I'll have a different opinion in two years, after I've seen all three of the installments."},{"username":"Quinoa1984","userUrl":"https://www.imdb.com/user/ur0453068","reviewLink":"https://www.imdb.com/review/rw0459569","warningSpoilers":false,"date":"20 December 2001","rate":"9","helpful":"7 out of 12 found this helpful.","title":"One of the best fantasy films of the new millenium","content":"Co-writer and producer/director Peter Jackson has masterfully transferred J.R.R. Tolkien's first chronical in his infamous trilogy into an absorbing, interesting and above all awesome picture. It is quite long, which is the film's only downside, but then in order to tell Tolkien's tale properly as many details would be necessary, thus it is never boring. This first epic starts off Frodo Biggins (Elijah Wood) on his dangerous yet crucial quest along with others like Gandolf (Ian McKellan) and Strider (Viggo Mortensen) to bring the rings back to which the fire it came from. The plot is important, but that isn't the key thing about the film that will intrigue most non-fans on Tolkien (fans of Tolkien make this a must see by the way). The picture has so much visual splendor matched with constant (yet not too constant) suspense, action and battles that it is hard to complain about the few lulls. Not the best epic fantasy I've, but it could be up there. Big props go to McKellan by the way for giving one of his best performances to date with Gandolf, though the other performances are also noteworthy. A"},{"username":"wes-connors","userUrl":"https://www.imdb.com/user/ur15896852","reviewLink":"https://www.imdb.com/review/rw2155021","warningSpoilers":false,"date":"9 November 2009","rate":"8","helpful":"5 out of 7 found this helpful.","title":"Frodo Row Your Boat Ashore","content":"\"With the help of a courageous fellowship of friends and allies, Frodo embarks on a perilous mission to destroy the legendary 'One Ring'. Hunting Frodo are servants of the Dark Lord Sauron, the Ring's evil creator. If Sauron reclaims the Ring, Middle-earth is doomed,\" according to the DVD sleeve description, \"Winner of four 'Academy Awards', this epic tale of good versus evil, friendship and sacrifice will transport you to a world beyond imagination.\" Reading the original J.R.R. Tolkien novels was an intellectual rite of passage; whilst young, you read and enjoyed \"The Lord of the Rings\" trilogy willingly - prepping with \"The Hobbit\", of course. \"It's a job that's never started that takes the longest to finish,\" someone said. Writer/director Peter Jackson's \"The Fellowship of the Ring\" is the first of an extremely well-produced trilogy. Understandably, it's made into a special effects extravaganza, without taking many breaths for thoughtfulness.\"The Bridge of Khazad-Dûm\" (#30 on your DVD menu) sequence is a highlight; it climaxes with the wizard Gandalf (Ian McKellen) and the demonic Balrog (CGI) falling into an abyss, from which return seemed impossible This was one of my most memorable \"Lord of the Rings\" reading experiences - a future without Gandalf was unimaginable. Mr. Jackson and company recreate some emotional scenes extraordinarily well. At one time, it seemed impossible to think that such literature could be brought to cinematic form.******** The Fellowship of the Ring (12/10/01) Peter Jackson ~ Elijah Wood, Ian McKellen, Viggo Mortensen, Orlando Bloom"},{"username":"studioAT","userUrl":"https://www.imdb.com/user/ur23359813","reviewLink":"https://www.imdb.com/review/rw3720875","warningSpoilers":false,"date":"1 June 2017","rate":"4","helpful":"0 out of 18 found this helpful.","title":"We begin our journey","content":"This was an epic undertaking from director Peter Jackson, and it was well worth the effort, and he is able to bring the original text to life in vivid detail.From great performances from the cast, to the great use of CGI to bring some of the books key moments to life, this film deserved the plaudits it received upon release.Yes, it's overlong, and quite dark in places, but it's a good retelling of a classic novel, and even then some details are left out to keep the running time down. Which seeing as it's nearly three hours long to start with is saying something.Well done Mr Jackson."},{"username":"tedg","userUrl":"https://www.imdb.com/user/ur0643062","reviewLink":"https://www.imdb.com/review/rw0461267","warningSpoilers":true,"date":"29 September 2002","rate":"","helpful":"8 out of 26 found this helpful.","title":"The Quirks of Cate's Mind","content":"Spoilers herein.For some reason, IMDB dropped my original comment. Only Gandolf knows why. This is a slim replacement, but done after some time has passed. That distance is valuable.The game here is one that you can only lose. Books can tap the imagination in ways that film ruins because what you see constrains what you can imagine. The books were successful because they created a whole world in such a way that found niches in our ability to envision. The best that can be done is to amaze visually, not trample the actual story, and hope that distracts from the fact that something unbounded is now visually bounded forever.My original comment spoke to small compromises made in the film that make the pagan notions fit more clearly in a Christian context. That's likely what prompted the removing complaint, so I avoid repeating the mistake. But I will note how the women, Ms Blanchett and Tyler are photographed. They are so idealized (even for film!) that I sat impressed. The camera can construct beauty and imply so much more. They do so here, and many girls will struggle with these ideals in the future.I think the idealization of Cate adds one dimension to the story that wasn't quite in the book: Cate's magical pledge could be seen as creating a vision that is the entire rest of the story. I prefer this, seeing all the monsters and motivations as coming from this lovely magical queen's mind. Cate as Elizabeth, the magical queen that Spencer has as the Fairie Queen whose dreams define the world. This way, the imagination part of the project is made explicit.Ted's Evaluation -- 2 of 4: Has some interesting elements."},{"username":"Calicodreamin","userUrl":"https://www.imdb.com/user/ur29385135","reviewLink":"https://www.imdb.com/review/rw6625464","warningSpoilers":false,"date":"22 February 2021","rate":"8","helpful":"0 out of 0 found this helpful.","title":"Visually stunning","content":"A visually immersive movie, beautiful scenery and ethereal cinematography. The storyline is captivating and unique. Characters are well cast and well acted, and costuming is amazing. \"if you want him, come and claim him\" is one of my all time favorite movie quotes."},{"username":"Theo Robertson","userUrl":"https://www.imdb.com/user/ur1532177","reviewLink":"https://www.imdb.com/review/rw0461127","warningSpoilers":false,"date":"16 August 2002","rate":"10","helpful":"67 out of 88 found this helpful.","title":"A Masterpiece","content":"I've never been a fan of the sword and sorcery genre . I'm surprised film companies decide to make rubbish like THE BEASTMASTER, HAWK THE SLAYER and RED SONJA but I am aware of the popularity of JRR Tolkien's massive novel LORD OF THE RINGS and of it's popularity , I remember in a survey carried out by a very well known British fantasy/SF magazine in 1987 Tolkien's book was voted the greatest fantasy novel of all time ( THE STAND by Stephen King was a long way second ) , but it's a novel that has always struck me as being read by anoraks who - like fans of STAR TREK and STAR WARS - insist on reading subtexts that are just not there . When the THE FELLOWSHIP OF THE RINGS shot to number one in the IMDb top 250 films I put the popularity down to obsessed anorakish fans who were going to vote the film a classic no matter what . Stranger still I found groups as diverse as neo Nazis to gays to enviromentalists proclaiming \" This is our film \" so when I finally sat down to watch TFOTR I was expecting only some average entertainment for a non sad person with no political axe to grind . After seeing the film I had to admit THE FELLOWSHIP OF THE RING is a masterpiece .Much of the credit must go to the producers . I 've no idea of the politics about bringing the story to the silver screen but I can imagine the Hollywood bigwigs sitting around the commitee table saying \" Give us Tom , give us Nicole , get Harrison , get Leonardo . No limeys . Limeys are slimy . No limey accents . We're Americans , this is our baby \" to which the producers gave a firm and resounding \" No \" . Good for them because the Hollywood treatment would have ruined this film. The cast comprised of well known - but not megastar - actors and unknowns are uniformally excellent even the normally hammy Lee and Rhys Davis and the bland Tyler are good . Also great to see so many Brits playing good guys and having the American actors adopting non specific British accents .The cast do a good jobThe other production values are outstanding . Pride of place goes to Andrew Lesnie's cinematography where the camera sweeps down from the sky into the Orcs underground lair and the camera also shows off the stunning New Zealand landscapes . I'd always believed Scotland had the greatest scenery on Earth but I'm willing to change my mind . The FX are good throughout though perhaps the matte backgrounds and CGI are less impressive in places but they're still a lot better than we've been used to recently . The Orc make up is wonderful and helps them become classic cinema monsters . The only bad point about the Orcs is - Like the stormtroopers in STAR WARS - they're too easy to kill .There are some minor flaws to THE FELLOWSHIP OF THE RINGS but this is probably down to Tolkien's source novel rather than the film makers . A couple of times the heroes seem set to suffer a resounding defeat when something not obvious at first like flammable villains or a giant eagle saves the day . I guess this is cancelled out by the dangers and adversaries also appearing from nowhere and there's little female perspective in the story for the women in the audience to relate to but come on girls you've got Viggo Mortensen and Sean Bean acting all hunky and macho so you can't complain.I see the IMDb reviewers have started a backlash against FOTR like they did with TITANIC and GLADIATOR . They're right about the gawd awful rubbish that is TITANIC but they're wrong about GLADIATOR which is a very good film and even further wrong about THE FELLOWSHIP OF THE RING which is a cinematic masterpiece. Ignore their criticisms . Any film that is praised by people as diverse as fans of the book , people who have never read the book , enviromentalists and cynics like myself is worth your time watching . I'm really looking forward to THE TWO TOWERS"},{"username":"bevo-13678","userUrl":"https://www.imdb.com/user/ur76062573","reviewLink":"https://www.imdb.com/review/rw5594788","warningSpoilers":false,"date":"31 March 2020","rate":"10","helpful":"2 out of 3 found this helpful.","title":"Good","content":"I like the bit where they walk and walk and walk and walk."},{"username":"Doylenf","userUrl":"https://www.imdb.com/user/ur1048771","reviewLink":"https://www.imdb.com/review/rw0461252","warningSpoilers":false,"date":"21 September 2002","rate":"","helpful":"9 out of 19 found this helpful.","title":"Set pieces...battles...set pieces...battles...","content":"THE LORD OF THE RINGS has its admirers who are familiar with the plot and the strange characters inhabiting it--and who genuinely love the book and were eager to see their favorite story on the big screen.In this case, it helps if you are familiar with the plot and the characters because the screenplay is a murky one with none of the characters given enough time for us to understand what they are all about. Instead, we move from set piece to set piece (grand, beautiful sets abetted by dazzling visual effects) and in between each new grand view locale there's another battle of good vs. evil with weapons clashing in every direction and limbs lopped off as fierce battles ensue.It's a sort of dungeons and dragons world and if this is your thing then this is your dark movie adventure. I saw this on video rather than the big screen so I can assure you it probably all looks a lot grander on the theater screen with the deafening stereo sound effects adding to the vigor of the story. But none of the characters really stand out amid all this swordplay and skullduggery.Only Ian McKellen and Elijah Wood have substantial enough parts to connect a viewer to the movie. The others are all backgrounders without becoming characters we care about--with the exception, perhaps, of Christopher Lee as Saruman the White, who always makes a convincing villain. Another problem is the sound--voices are dropped so often that much of the stilted dialogue is muted. This is a special drawback because several of the actors have some sort of accent. The worst offender happens to be Ian McKellen who nevertheless gives a very compelling performance behind his grizzly make-up--however, someone should have dubbed some of his lines for greater clarity. The likeable Elijah Wood relies on his specialty--wide-eyed wonder or tense concern for close-ups, but it's rather a one-note performance.All in all, I was disappointed. With all of the hype (and due to some of the comments expressed here) I expected a much more substantial story than this, especially for a movie with a running time of almost three hours. The drawback on video is that many of the special effects are pretty obvious and the big screen grandeur is lost even when viewed on a large TV screen. A bit of a letdown in every department. Even the score only occasionally has the right mystical quality between battles. The battles are not quite as brutal as those in GLADIATOR but their intensity is just as great and they turn up with alarming frequency!"},{"username":"preppy-3","userUrl":"https://www.imdb.com/user/ur0463200","reviewLink":"https://www.imdb.com/review/rw0458108","warningSpoilers":false,"date":"3 January 2002","rate":"10","helpful":"25 out of 32 found this helpful.","title":"Excellent","content":"Incredible adaptation of the first book of J.R.R. Tolkien's \"Lord of the Rings\" trilogy. I'm not going to summarize the story--there's way to much going on. All I'll say is they took a verry difficult book with a intricate plot and made it an exciting, totally accesible movie. The film moves quickly (with a few slow spots--but that's to get in the plot) and there's a lot to take in, but I was never confused. I should mention that I tried twice to read the books but found them too hard.The film looks magical--Middle Earth looks beautifully real. All the special effects are great (the Ring Wraiths are downright terrifying--as they should be) and the action sequences are among the best I've ever seen--fast, long and breathtaking. The film is long (2 hrs, 40 min) but the time flies by. The only problem is that there's so much plot and action going on that you're exhausted by the end--but in a good way.With the exception of Viggo Mortensen (very wooden) all the actors are good--top honors go to Elijah Wood, Dominic Monaghan, Cate Blanchett, Liv Tyler and (especially) Ian McKellan.But the film is VERY violent (despite the PG-13 rating). It deserves an R--this is NOT one for the kids. Still, it's the best film of 2001. SEE IT!!!!"}],"errorMessage":""}