{"imDbId":"tt0110413","title":"Léon: The Professional","fullTitle":"Léon: The Professional (1994)","type":"Movie","year":"1994","items":[{"username":"MartinHafer","userUrl":"https://www.imdb.com/user/ur2467618","reviewLink":"https://www.imdb.com/review/rw3287184","warningSpoilers":false,"date":"29 July 2015","rate":"7","helpful":"73 out of 176 found this helpful.","title":"Good but #27?! I just don't get it.","content":"I wish I'd never seen that \"Leon: The Professional\" was rated #27 on IMDb. With an outrageously high score like this, I get my expectations too high--way too high. Now I am not saying it's a bad film but it's certainly not THAT good. In fact, it's not among writer/director Luc Besson's best (\"The Fifth Element\" and \"La Femme Nikita\" are definitely better). Why is it rated so highly? The film stars Jean Reno as a top ninja-like assassin. However, in an odd twist, this lone wolf killer falls in with a girl (Natalie Portman) and he becomes her foster dad. This is hard to believe but even harder to believe is his training her to be a killer as well as he going after the baddie lone wolf style! And, speaking of the baddie, Gary Oldman pretty much plays the same guy he played in \"The Fifth Element\". Saying the film has some ridiculously difficult to believe aspects is certainly an understatement. Now I am not saying it's bad...but it cannot be a great film, in my opinion, if so much of it is difficult to believe. Interesting, yes....top 100...no way.By the way, I think it's safe to assume that Portman was named Mathilda in the film because of her and her family's strong similarity to the characters in the Raold Dahl book \"Matilda\"."},{"username":"TheLittleSongbird","userUrl":"https://www.imdb.com/user/ur20552756","reviewLink":"https://www.imdb.com/review/rw2438415","warningSpoilers":false,"date":"4 June 2011","rate":"10","helpful":"32 out of 47 found this helpful.","title":"Intense, gripping, stylish and poignant with one of the best feature debuts ever","content":"Luc Besson's film Leon:The Professional is a superb one. Visually, it is very stylish, with striking location work, atmospheric lighting and really authentic and bold cinematography. The soundtrack also does very well in enhancing the mood of each scene, and Besson's direction is faultless.There is also a gripping story with well crafted characters particularly Mathilda and Jean Reno's character Leon, a cracking script and crisp pacing and while there are some over-the-top and intense moments particularly with Stansfield and the beginning, particularly as the chemistry between Mathilda and Leon expands there are some poignant ones too.The acting is excellent. Jean Reno is charismatic and commanding in the title role while Gary Oldman is wildly bombastic as Stansfield. But I was especially impressed by Natalie Portman, who delivers one of the best and most captivating feature debuts ever. In conclusion, a fantastic film. 10/10 Bethany Cox"},{"username":"Leofwine_draca","userUrl":"https://www.imdb.com/user/ur0482513","reviewLink":"https://www.imdb.com/review/rw3526494","warningSpoilers":true,"date":"16 August 2016","rate":"10","helpful":"18 out of 22 found this helpful.","title":"Besson's masterpiece - action cinema with real heart","content":"Despite having a mainly American cast and being set on the rough streets of New York, this is very much a French film, evident from the crew list at the end of the film. I'm always one to give foreign film-makers a try, as they usually offer up something a little bit more stylish and different than the usual formula. Take Lucio Fulci with his trademark 'hard' and nightmarish horror films, Dario Argento with his gory yet stylistic giallo films, or John Woo's violent, ballet-like action films.Luc Besson doesn't disappoint with this film, offering us his typical lashings of wit, and drawing charisma and charm from his cast. While THE FIFTH ELEMENT bordered on being silly in places, it was still a fun science fiction film, and kudos to the man for experimenting with different genres. LEON is probably the first film that brought him to the typical American's attention, and I would say deservedly so. While masquerading as a typical action-filled gun fest, it is in fact a film of three parts. The beginning is packed with horrible, unflinching violence from killers who don't have the slightest feeling of remorse - Jean Reno expertly massacres a squad of bodyguards, while Gary Oldman shotguns children and people in the bath. The middle of the film is more like a conventional drama, and it tells the story of Leon, the hit-man, and Mathilda, the young orphaned victim, and their growing love for one another which draws the human side of Leon out of his impassive shell. The ending is indeed all out action.All parts of the film are great, and Besson frequently shows his American contemporaries how it should be done. As the box says, it is extremely hard-hitting at the beginning, with deaths shown in all their bloody impact. The ending is also brilliant, with a SWAT team laying siege to Leon's apartment; this is non-stop, violent action and easily rivals any blockbuster like FACE/OFF. However, the film's main triumph is that it really makes us care about the two central characters, thanks to the script, Besson, and of course the actors involved.This is the film that really made Jean Reno something of a star. He's great as the Bruce Willis-like ageing hero, even if he does mercilessly kill people. Natalie Portman is also likable as the child who is old beyond her years, and almost unrecognisable from the bland role she played in STAR WARS. The villain is a drug-taking maniac, brilliantly played with startling intensity by Gary Oldman, who frequently shows his competitors how it should be done. LEON may be sentimental, but this sentiment slowly grows from the start and is realistic and believable, it is not shoved down our throats. Also, check out the ending, which manages to be very good and fitting, and yet sad at the same time. It will make you yell and cry in equal measure."},{"username":"SnoopyStyle","userUrl":"https://www.imdb.com/user/ur2898520","reviewLink":"https://www.imdb.com/review/rw3064081","warningSpoilers":false,"date":"7 August 2014","rate":"8","helpful":"8 out of 10 found this helpful.","title":"Luc Besson style of violent action","content":"Léon (Jean Reno) is a milk-drinking illiterate hit-man for Italian mob boss Uncle Tony (Danny Aiello) in NYC with his favorite plant. His next door neighbor 12 year old Mathilda (Natalie Portman) has an abusive father (Michael Badalucco) who skimmed drugs off of Stansfield (Gary Oldman). Stansfield massacres the family. She comes home to find Stansfield's men still there. She fakes and walks over to Léon's. It turns out that they are corrupt DEA agents. Léon the cleaner reluctantly lets her in and she badgers him to teach her. She seeks revenge on his little brother's murderers.Director Luc Besson brings his often collaborator Jean Reno to America and makes a nice discovery with a young Natalie Portman. Before Hit-Girl, there was Mathilda. Gary Oldman is a superb strange bad guy. Luc Besson has a certain French flair with his action. He really has a unique take on the action thriller genre. It definitely has an edgy violent style that sometimes sexualized the young Portman. She takes on a lot of adult tendencies. That probably held it back a little back in the day."},{"username":"Horst_In_Translation","userUrl":"https://www.imdb.com/user/ur3914439","reviewLink":"https://www.imdb.com/review/rw3141479","warningSpoilers":true,"date":"14 December 2014","rate":"8","helpful":"8 out of 11 found this helpful.","title":"Great film with one of the most memorable duos in film history","content":"\"Lèon\" is a 1994 movie written and directed by Luc Besson and named after its central character played by Jean Reno. The film went almost completely under the radar in terms of awards recognition outside of France, but its reputation steadily rose over the years and it is now pretty much considered a classic. Besson was in his mid-30s when he made this movie, but already had a respectable résumé including a French and English version of \"Nikita\". For Reno and Oldman this is probably still the most famous work (not counting Oldman's efforts in the Batman movies) and for Portman it goes right along with other blockbusters like \"V for Vendetta\" and \"Black Swan\", which gave her the Oscar. I am still a bit disappointed Reno was not present at the ceremony. For Portman, Mathilda was the first role in a movie. Also in the film is Danny Aiello as a friend to Léon. His role wasn't clear early on to me as it seemed unsure what he was doing with the money, but as the film went on it showed that he was pretty close to Léon.The film begins with an introduction of what Léon does. He is a contract killer, who, in fact only wants a little talk as we find out in the first sequence. The way he disappears into the dark is pretty cool. What is a more sad than cool is the one scene where Léon's loneliness is displayed. However, when we see him in the theater he does not seem to mind at all. His face expression while watching the movie is so much fun. He is also a milk junkie (just like myself). Sadly, I got no little girl that brings all this milk to me. There are many cult references closely connected with this film: the shades, the long coat, the piggy, the plant (rootless like Léon, nice quote), the chewing gum trick... After the intro, Portman and Oldman (character name Stansfield, a pill-popping Beethoven-listening psychopath cop) pretty much enter the film at the same time. Oldman's character is really scary, even his colleagues fear him. If you listen closely, Matilda's dad only dares to shout at Stansfield's partner Malky, not at him. The fact that Oldman is not physically intimidating at all makes him even scarier as he must be a complete nutcase if people three times his size fear him. Another little snippet: One of the actors who play Stansfield's helpers died during the terrorist attacks on 9/11 during his work as a firefighter seven years after the movie. When Mathilda's family is killed, the writers already gave it their best to make them look as unlikeable as possible being very violent to their daughter/sister, except the very small one of course. It's pretty sad when Mathilda describes him as a kid who only wanted to cuddle. However, we also find out that her dad paid a tuition fee for one year in advance, so he can't be all bad. I wondered about Oldman's character why the internal commission isn't getting worried if so many people that cross his way keep dying.One of my favorite scenes from the film is when Mathilda returns with the milk, hears her family is dead and knocks on Léon's door. Very intense moment with her begging going against his principles. Finally he lets her in, physically and mentally into his life. He becomes her mentor, she becomes his housewife and quickly develops some sexual tension (quiz game for example or talk about virginity as well being at an age where girls start dating their classmates. She doesn't go to school, so there is no such possibility.) At the same time, Léon also turns into some kind of father figure to her. She looks up to him and also starts dressing more and more like him. Even if she seems very tough, there's a handful scenes where we see how immature and naive she really is, like when she tells the hotel worker that Léon is her lover or also her cartoon addiction or how she pours in the alcohol.The movie is at its most entertaining when the two go to work together. The scene with LaSardo (great actor) is pure gold and when they shoot the jogging politician from far away, it is also slightly special. Another funny comment by Léon is the \"hurry or he will never shut up\" after they run into gunshots. An emotional highlight is Mathilda's attempted suicide. She asks him what she is to him. He says nothing, yet contradicts himself by pulling the gun away in time. Almost a bit of a spoiler scene is when Léon tells Aiello's character to give Mathilda the money if something happens to him. One of the most intense scenes is when Stansfield and Mathilda meet in the bathroom. Edge-of-seat stuff and it shows that Stansfield is really scared of nothing, not even killing a girl in police headquarters. The possibly most beautiful camera shot of the film is when we see Léon and Mathilda reunited at one point and the camera shows us their feet. The last half hour is almost exclusively action sequences. I enjoyed these despite generally not being a great action movie fan. Maybe the reason is that you have made such a strong connection with the two protagonists at this point already. Oldman's way of handling the final act says a lot about him as well. He stays outside of the action to not put his own life in danger, but is a coward who prefers to shoot his victims in the back. When Léon hits the ground, it is a pretty sad moment (just like the farewell scene a couple minutes earlier) as we see it from his perspective. The film ends with Mathilda deciding to go back to school and a beautiful Sting song before the credits roll in.Wonderful movie, over two hours very much worth watching."},{"username":"claudio_carvalho","userUrl":"https://www.imdb.com/user/ur2488512","reviewLink":"https://www.imdb.com/review/rw0973688","warningSpoilers":true,"date":"7 December 2004","rate":"10","helpful":"97 out of 134 found this helpful.","title":"A Perfect Chemistry","content":"In New York, León (Jean Reno) is an Italian professional hit-man, who loves drinking milk and has a plant as his best friend. His godfather and mentor is the mobster Tony (Danny Aiello), who loves León as if he were his own son, and his cold blood makes him a perfect killer. When Stansfield (Gary Oldman) and his gang executes the family of his twelve years old neighbor Mathilda (Natalie Portman), León lodges the girl in his place, beginning a weird friendship between a killer and a confused girl wishing revenge. When Mathilda finds who Stansfield is, she presses León to kill him. 'León' is a wonderful movie, having one of the most perfect chemistry in the cinema between Jean Reno and Natalie Portman. The storyline recalls some parts of John Cassavetes' 'Gloria', but the performances of the debutant Natalie Portman and the always-excellent Jean Reno upgrade this film. There are at least three scenes that I really love: the light on the corridor, when León opens the door for Mathilda; when they are walking together in a New York street, coming towards the camera; and when Stansfield hits León. My vote is ten.Title (Brazil): 'O Profissional' ('The Professional')"},{"username":"bob the moo","userUrl":"https://www.imdb.com/user/ur1002035","reviewLink":"https://www.imdb.com/review/rw0342859","warningSpoilers":false,"date":"17 October 2001","rate":"","helpful":"13 out of 47 found this helpful.","title":"Beautiful love story","content":"Generally a love story about a 40 year old man who lives by himself and a 12 year old girl would go down about as well as a porkpie at a Jewish wedding with cries of paedophilia from far and wide. However Leon is just that - a love story, everything else is incidental or situation, and has become a modern classic.What makes this work is that Leon is the 40 year old but appears more naive and childlike, while Mathilda is the grown up in a 12 year old's body - a modern version of Lolita. The love between them is a pure love, like the relationship between two children, where Leon protects Mathilda and cares for her and Mathilda provides a life that fills the cold existence of Leon's hitman-focused lifestyle.Portman is excellent in this role - she has yet to do anything better, Reno is well cast and handles the opening up of his character in a very believable fashion - he is totally convincing as a killer and a nervous child making friends for the first time. Oldman overacts like a madman! If you look closely at his shirt sleeves you'll see his cuff links are actually pineapple rings because he's such a big ham! His performance doesn't sit well beside the others and he seems to be in a different movie at times. However he does bring a cold killer element with it that works well and offsets his eccentricities.A classic love story, look beyond the guns at the two central performances and you'll see one of the most beautiful relationships in modern films. The ending will fill you with happiness and break your heart in equal measure."},{"username":"classicsoncall","userUrl":"https://www.imdb.com/user/ur2707735","reviewLink":"https://www.imdb.com/review/rw1997922","warningSpoilers":true,"date":"29 December 2008","rate":"7","helpful":"13 out of 25 found this helpful.","title":"\"I like these calm little moments before the storm\".","content":"This film held my interest for exactly one hour. It was about at that point that Gary Oldman's character was revealed to be a cop, and then the head scratching began. I mean, really, did he and his goons have to take out Mathilda's whole family over a drug deal gone bad? And when Stansfield (Oldman) is questioned about the massacre, he storms out yelling that he doesn't have time for this spit? What police force allows it's own to go renegade like that without stepping in? Then you have Mathilda (Natalie Portman). OK, I know we're pushing our kids like never before into a maturity they can't handle, but come on. Was anything about Mathilda believable? I can understand her wanting to get revenge on the scum that killed her family, but she was more than ready to go out and target practice using live rounds on joggers in the park. Who comes up with this stuff? There was nothing remotely believable about anything that occurred in the second half of the story, especially after Leon (Jean Reno) wasted the two cops right inside police headquarters. After that, it all became too absurd for comprehension.So then I call up this flick's stats on the IMDb, and it sits at #35 in the Top 250 of all time! What's that all about? That's just a total perversion of any kind of integrity in the rating system. This film is an escapist action adventure flick where one's sense and rationality is best left checked at the door on the way in. To give it the kind of adulation that most of the reviewers here seem to bestow upon it just makes me wonder what we all have become. It's not pretty."},{"username":"lee_eisenberg","userUrl":"https://www.imdb.com/user/ur4888011","reviewLink":"https://www.imdb.com/review/rw1318419","warningSpoilers":false,"date":"18 March 2006","rate":"7","helpful":"2 out of 15 found this helpful.","title":"My introduction to Luc Besson, Jean Reno, and Natalie Portman.","content":"I had never heard of Jean Reno when \"Leon\" (called \"The Professional\" in the United States) came out, but I was sure impressed with it. Featuring Reno as a hit-man who has to take teenager Mathilda (Natalie Portman) under his wing after a corrupt DEA agent (Gary Oldman) murders her family, the movie is gritty - and sometimes a little gag-inducing - but an interesting look at the underworld.As for the people involved in it, Luc Besson later directed the super-cool \"Fifth Element\" and the misconceived \"Messenger: The Story of Joan of Arc\"; Jean Reno will probably make an interesting Bezu Fache in \"The Da Vinci Code\"; Natalie Portman may be best known as Queen/Senator Amidala, but I prefer to remember her for \"Mars Attacks!\" (although it remains to be seen how she performs in \"V for Vendetta\"). All in all, a really good movie."},{"username":"gavin6942","userUrl":"https://www.imdb.com/user/ur1234929","reviewLink":"https://www.imdb.com/review/rw3128250","warningSpoilers":false,"date":"21 November 2014","rate":"9","helpful":"8 out of 10 found this helpful.","title":"One of the Greats of the 1990s","content":"Mathilda Lando (Natalie Portman), a 12-year-old girl, who is reluctantly taken in by Léon Montana (Jean Reno), a professional assassin, after her family is murdered. Léon and Mathilda form an unusual relationship, as she becomes his protégée and learns the assassin's trade.This is what you get if you take \"Lolita\" (sort of) and put it in the middle of a world with mobsters and hit men. And then casting for perfect actors? Priceless. Luc Besson probably had no idea that Portman would go on to be the international sensation she has become.Of course, we also have a solid performance from the always-impeccable Gary Oldman. Very few actors are working on his level. Maybe Daniel Day-Lewis, possibly Christian Bale. But Gary Oldman can be anyone and delivers 100% every time.Roger Ebert gave the film only two-and-a-half stars out of four, writing, \"Always at the back of my mind was the troubled thought that there was something wrong about placing a 12-year-old character in the middle of this action... In what is essentially an exercise—a slick urban thriller—it seems to exploit the youth of the girl without really dealing with it.\" Not to disregard his concern, but time seems to be against Ebert here. The film has steadily gone up in praise over the years, possibly due to Portman's rising star."},{"username":"jboothmillard","userUrl":"https://www.imdb.com/user/ur4248714","reviewLink":"https://www.imdb.com/review/rw1573223","warningSpoilers":true,"date":"15 January 2007","rate":"8","helpful":"2 out of 9 found this helpful.","title":"Léon","content":"From director Luc Besson (The Fifth Element), I remember seeing this film, also titled The Professional, once before, but I couldn't remember much about it, so I had to have a second viewing. Basically Leone 'Léon' Montana (Jean Reno) is the professional hit-man, or \"cleaner\", who only drinks milk, cares for a houseplant and loves Gene Kelly musicals, and he lives next to Mathilda Lando (Natalie Portman) is the twelve year old New York girl living with her little Brother (Carl J. Matusovich) and her dysfunctional family. Mathilda's Father (Michael Badalucco) is being paid by corrupt DEA cops to store cocaine in his house, and when they find out he has been stealing some of it for himself, sharp-suited and drug-addicted Norman 'Stan' Stansfield (Gary Oldman) leads his team of agents to kill him and his family. Mathilda managed to escape death going shopping, and Léon lets him into his apartment knowing she is all alone, and she eventually finds out his deadly profession, but she doesn't see this as a threat, but an opportunity. She is willing to pay him a fee he has mentioned to kill the people responsible for killing her family, well, specifically her brother, or teach her to use the weapons of his trade, so he does this. So Léon teaches her how to use many firearms, particularly a scoped rifle, and in return she does chores in the apartment and teaches him some skills he lacks, such as literacy, and in doing so she claims she is falling in love with him. One day, after learning what she thinks is enough to do the job herself, Mathilda takes a number of weapons in a bag to go and hunt Stansfield down, posing as an innocent delivery girl, but he ambushes her, until Léon arrives to take her away. After gaining the information of Léon's whereabouts from friend Tony (Danny Aiello), Stansfield gets a team of SWAT-like masked men to take Mathilda hostage and infiltrate the apartment, but Léon's skills get the better of them and he gets her back safely. She manages to escape going down an air shaft, and Léon looks like he is going to make his way out posing as one of the masked men with bad injuries, but Stansfield recognises him. The end sees Léon nearly getting away, but being shot by Stansfield, and blowing himself and the villain up with active grenades, and after being refused a hit-man existence, Mathilda tries to return to school, and she plants Léon's beloved plant in a field. Also starring Peter Appel as Malky, Ellen Greene as Mathilda's Mother and Elizabeth Regen as Mathilda's Sister. Reno gives a wonderful performance as the loner with all the skills, Oldman is great as a dark drug taking villain on the wrong side of the law, and young Portman almost steals the show as the girl wanting revenge, and obviously Reno and Portman together create sparks. It is an action filled film, with some funny moments, some dark, atmospheric and suspenseful moments, as well as touching moments with the title character and his female friend bonding, a must see thriller. Gary Oldman was number 40 on The 100 Greatest Movie Stars, he was number 11 on The 50 Greatest British Actors, and he was number 36 on The World's Greatest Actor. Very good!"},{"username":"rmax304823","userUrl":"https://www.imdb.com/user/ur0819382","reviewLink":"https://www.imdb.com/review/rw2504633","warningSpoilers":true,"date":"17 October 2011","rate":"6","helpful":"8 out of 20 found this helpful.","title":"Smart Kid.","content":"Natalie Portman, at twelve, is a smart, street-wise kid living in an shabby walk-up apartment with a dysfunctional family. Returning from an innocent trip to the grocery she finds that Gary Oldman and his goons have killed her entire family and are rummaging around, looking for some lost dope.Being a smart kid, Portman slowly carries her grocery bags past the open door to the blood-spattered room, past Oldman's lookout man who eyes her suspiciously, and when she reaches the end of the hallway, unable to walk farther, she presses the last doorbell. It doesn't open. The lookout is watching, his pistol in hand. She rings the bell again, whispering, \"Please open it.\" Behind Door Number N is Jean Reno, a professional hit man, also with a drawn pistol, watching the goings on through a hole in the door. He works alone, \"no women, no kids\", doesn't want to be involved in somebody else's violence, and he knows the girl's situation.He opens the door and for him it's like opening Pandora's box. All sorts of irrelevant demands are placed on him and he's subject to threats that have nothing to do with his profession.Oldman discovers that Portman was missed in the slaughter and the gang begins its search for her and, ultimately, for him too. Portman smokes cigarettes, is cheeky, wants to learn how to kill people, and whispers to the manager of their new hotel that Reno is not really her father. He's her lover.The manager's expression is a little hard to read. Natalie Portman may be an underdeveloped twelve but she is angelic with her Louise Brooks hair cut and her black choker and her feline eyes and her plump lips. She's not the most convincing little actress in the business but what does it matter? Any normal man would be abnormal if he didn't want to squeeze and bite her.There is a shoot-out at the end or, maybe, a grenade-out would be better. It's not a very sophisticated movie and it doesn't demand much of the viewer. Lone gunman comes to love a little kid and sacrifices himself. And there are a couple of spots meant to be humorous that only sometimes hit the mark. Reno's imitation of John Wayne is superb.In fact, though, Reno is pretty good throughout. What an \"everyman\" kind of face. It's in no way glamorized. He's balding and his chin is stubbled. He dresses like a hobo and looks as if he might smell like a goat.Gary Oldman is a good heavy too, but the movie makes a clear distinction between bad killer Oldman and good killer Reno, who has a soft spot in his heart for beautiful children, rather like Allan Ladd had his kitten in \"This Gun For Hire.\" But Portman is cute and Reno is appealing. A divertimento."},{"username":"ccthemovieman-1","userUrl":"https://www.imdb.com/user/ur4445210","reviewLink":"https://www.imdb.com/review/rw1198544","warningSpoilers":false,"date":"21 October 2005","rate":"9","helpful":"16 out of 35 found this helpful.","title":"A Movie Of Extremes & Fascinating","content":"This is one of the truly sick movies I own and am embarrassed to say how much I have always liked it....but I have, big-time. This film, with some very sick messages, is uniquely appealing at the same time. To use a popular word of today: it is \"extreme.\"The extreme GOOD: 1 - A very different story and a fascinating profile of a strange, likable loner hit-man and a tough little girl and how they help each other soften the other's personality; 2 - A very intense drama at times with tremendous action scenes in the beginning and end, particularly the latter. 3 - The little girl \"Mathilda\" (Natalie Portman's first role) does of the best acting jobs I've ever seen for pre-teen child, and I've seen a number of good ones over the years. It is no surprise she has turned out to be a big star. 4 - Despite his profession, \"Leon\" (Jean Reno) is a very likable character and extremely contradictory, extolling admirable virtues to the little girl (no cursing, no smoking, choosing good friends, etc.) while at the same time teaching her how to shoot people and then using her as an accomplice to murders! Reno's voice is fun to listen to, really different from any other actor I've ever heard. 5 - Gary Oldman, as usual, is great at playing a whacked-out character. The more you watch this film, the more you appreciate his performance. 6 - A very satisfying ending; 7 - Great camera shots by director Luc Besson, who is known for some stylish movie-making.The extreme BAD: 1 - Not only does nice-guy Leon teach Mathilda how to shoot people but.... 2 - the latter (on the extended version) gets drunk and later wants Leon to make love to her ; 3 - Portman uses strong profanity throughout the film. I'm sorry, but a little girl doing and saying all of this is pretty sick! (What kind of parents, by the way, would allow their 11-year-old to play a role like this?) 4 - Another film that makes a killer into the good guy and the police into the bad guys. In the end, though, it's only a movie, just a fictional story and it's job is to entertain....and in that it succeeds amazingly well. Great entertainment in a perverse way."},{"username":"Tweekums","userUrl":"https://www.imdb.com/user/ur13977076","reviewLink":"https://www.imdb.com/review/rw1882051","warningSpoilers":true,"date":"28 May 2008","rate":"9","helpful":"2 out of 6 found this helpful.","title":"A Tale of a hit-man and a young girl","content":"Matilda was a young girl living with an uncaring family until one day that family was killed by corrupt DEA officials and she seeks sanctuary with her neighbour Leon. While she didn't care about most of her family she loved her younger brother and asks Leon to help her get revenge on those responsible for his death.Natalie Portman puts in a fine performance as Matilda in what is one of her best roles to date and Jean Reno is good as the quiet killer Leon, however the film is stolen by Gary Oldman playing Stansfield, the corrupt DEA officer in brilliantly over the top fashion.The story is fairly exciting throughout, especially during a siege where Leon and Matilda are surrounded by a large number of heavily armed police. The only week scene in my mind was when Leon was teaching her how to shoot a sniper's rifle and when she fires we learn she wasn't using live ammunition but some sort of paint-ball, it just seemed a bit of a cop out.. perhaps it was thought having a young girl killing a random person would have led to problems with the censors."},{"username":"BA_Harrison","userUrl":"https://www.imdb.com/user/ur0945066","reviewLink":"https://www.imdb.com/review/rw3692354","warningSpoilers":false,"date":"24 April 2017","rate":"7","helpful":"7 out of 8 found this helpful.","title":"The hit-man and her.","content":"An unlikely relationship forms between 12-year-old Mathilda (Natalie Portman), who seeks revenge on the gangsters who slaughtered her family, and an assassin, Léon (Jean Reno), who lives in the same apartment building and teaches her how to 'clean'.A love story between a grown man and a twelve year old girl: sounds a bit dodgy, doesn't it? Director Luc Besson tries his hardest to pull it off by making Reno's character almost childlike, and having Portman's Mathilda act well beyond her years, swearing, smoking, and more than capable of looking after herself. In the end, though, it still feels very awkward Sporting a Louise Brooks bobbed haircut and wearing shorts and a vest, Mathilda is definitely sexualised, kinda like a cross between Lolita, Mindy from Kick Ass and that girl from Lazy Town, which makes her relationship with Léon rather uncomfortable viewing at times, especially when the characters declare their feelings for each other, or when Mathilda tells a hotel manager that she is Léon's lover.Thankfully, the film's love angle is never developed beyond the platonic, and Besson breaks up the emotional drama with numerous shootouts and explosions as Mathilda tries to find and kill villain Stansfield (Gary Oldman) with help from Léon. It's mindlessly entertaining, I suppose, but not nearly good enough to warrant the film's current IMDb ranking (#27 in the Top 250).6.5 out of 10, rounded up to 7 for IMDb."},{"username":"moonspinner55","userUrl":"https://www.imdb.com/user/ur0989035","reviewLink":"https://www.imdb.com/review/rw2198420","warningSpoilers":false,"date":"27 January 2010","rate":"7","helpful":"4 out of 10 found this helpful.","title":"Moody and exciting, coolly defiant...but ultimately dispiriting","content":"French filmmaker Luc Besson's darkly intriguing, absorbing modern noir about a precocious, orphaned preteen girl in New York City (Natalie Portman) who attaches herself to a thorough, yet curiously mild-mannered hit man (Jean Reno). Begins as a rich character study studded with small bursts of violent action, with very little theatrics or inane hyperbole. Unfortunately, in the third act, Besson allows the violence to take over, leading to an over-baked finale with an eye on the commercial market. Still, a sleek and handsome piece of work, entertaining, mature and straightforward, with terrific performances by Reno and the shockingly unself-conscious Portman. *** from ****"},{"username":"TxMike","userUrl":"https://www.imdb.com/user/ur0438066","reviewLink":"https://www.imdb.com/review/rw0342999","warningSpoilers":false,"date":"28 June 2002","rate":"","helpful":"3 out of 7 found this helpful.","title":"Unconventional love story. A professional hitman and his protege', a 12-year-old orphan.","content":"Updated February 2020: A very intriguing, action-packed 2 hours and 11 minutes. I was bothered a bit by the same thing that bothered Ebert's accurate review, namely the idea of a young girl aspiring to be a \"cleaner\" like the man she adopts after her parents and siblings are killed by a rogue cop when a drug deal goes bad. Also the implied relationship the young girl sought, telling the hotel clerk \"he's not really my father, he's my lover.\" Or the circuitous discussion of whether first-time sex is enjoyable, or the scene where she tells him to sleep next to her in the bed. This character is not a little teddy-bear hugging child, but a mature 12-year-old who wants to have a relationship with the older man, no matter how absurd it seems. Probably the French influence.However, all that aside, \"Leon\" is an entertaining and action-packed film. This was Natalie Portman's (Mathilda) first film role, two years before her smart performance in \"Beautiful Girls\", and she is quite remarkable. Gary Oldman is his usual crazy self. Jean Reno is cool as the hit man, a role that fits his image perfectly.The opening scenes, where Leon is hired to \"advise\" a man to stay out of NYC, is one of the best I have seen in any movie and establishes Leon's profession and skill set. And of course the closing OTT action. But the vast middle of the story is a non-sexual love story between Mathilda and Leon, something that neither had experienced before.I initially saw it on DVD, then more recently purchased the BluRay version which has an enhanced soundtrack, especially with inclusion of some really deep bass at appropriate places to heighten the tension. This is one of my favorite re-watches, I've probably watched it more than a dozen times. The BluRay disc also has a set of interesting extras, including actors reflecting on the experience of making Leon."},{"username":"dbdumonteil","userUrl":"https://www.imdb.com/user/ur1219578","reviewLink":"https://www.imdb.com/review/rw0342860","warningSpoilers":false,"date":"11 November 2001","rate":"1","helpful":"28 out of 156 found this helpful.","title":"An utter travesty.","content":"Has anybody seen Cassavetes's \"Gloria\"?It's the same story,particularly the beginning.A rip-off,a shameless plagiarism,Luc Besson's only stroke of inspiration,so to speak, being the sex reversion.Jean Reno is listless and totally inexpressive and Natalie Portman is totally bland:the nineties Judy Gardland,she definitely is not;her dramatic ambitions are limited,as \"star wars \" and co will demonstrate later.Nothing to do with Gena Rowlands in Cassavetes ' movie.It's a crying shame that the first movie-the second now,cause of \"Amelie\"- made by a French director on the top 250 should be this appalling piece of garbage.\"Leon\" epitomizes what's the most despicable: a French director trying to ape the American to earn a lot of dough.Besson should direct Christophe Lambert,whose ambitions are similar.It makes you sick.Yuck!"},{"username":"Quinoa1984","userUrl":"https://www.imdb.com/user/ur0453068","reviewLink":"https://www.imdb.com/review/rw1043282","warningSpoilers":false,"date":"20 March 2005","rate":"9","helpful":"39 out of 53 found this helpful.","title":"A thrilling crime film, in deep touch and care with the characters- Besson and Portman's best work to date","content":"I sensed that Luc Besson (director of The Fifth Element and La Femme Nikita) was, like Tarantino and many, many others before him, borrowed elements from various films and genres to create their own voice in the film. With Leon, I sensed him alluding to the crime films of France (i.e. Melville), Hong-Kong (i.e. Woo), and America (i.e. Scorsese), and making it into his own special brand for the story and characters. That his style visually is as compelling helps a great deal. The international version (which is the one I saw) is a little grittier, and more suggestive, than the version most American audiences saw in 1994 and on cable. But it is also a must-see if you are planning to see the film. It's not a long movie, though it gives a good many details in its story.Jean Reno has his star-making turn (at least for what he's worth) in Leon- he's ruthless contract killer who will kill just about anyone for the right price. He lives out of an apartment by himself, trying his best to ignore his noisy neighbors. One of the daughters is Mathilda (Natalie Portman, also a major breakthrough performance), abused by her whole family to no end. When a corrupt cop (Gary Oldman, one of the key villain performances of his career along with Dracula and Drexl in True Romance) goes and kills off her family while she's away, she has no one else to turn to besides the reclusive killer. She knows what he does, and she wants in. The rest of the film is about their relationship, as it unfolds professionally and emotionally, leading to a tremendous, bloody climax.One thing that struck me most about Leon is the fact that the film was more disturbing than I expected. The idea of a killer getting a pupil in a young teenage girl is unusual enough, but the way it unfolds I felt so much for her plight got to me at times. this doesn't make Leon a tear-jerker (maybe for some, I'm not sure), but because of Portman's dead-on portrayal, it makes the story work somehow, and is in a way as fantastical as it is naturalistic. There are also a few scenes that stuck out as being little masterpieces of all the elements coming together. The first is a brief scene, and crucial to showing the character of Leon early on- he takes a break after his contract, and sees a movie, a musical with Gene Kelly. He's the only one in the theater, and he is completely in the grasp of what he sees on the screen. It's the perfect touch of humanity and shows his only escape is into complete fantasy.The second is when Leon and Mathilda are in a restaurant, after she has just gone through a day of training (there's a hilarious montage that follows this scene). Mathilda is getting drunk off of champagne, rambling with words she may or may not mean. Suddenly, she starts laughing, and she laughs more, and harder. People in the restaurant look at her like she's nuts. Leon is, of course, embarrassed. However, I thought this was just the right touch to this scene, where the kind of father-daughter relationship going on between Leon and Mathilda is revealed. It's not exactly funny, not even really cringe worthy. It just is. The third scene is when Mathilda decides to pay a visit to the man who murdered her family. She follows the man into the bathroom, and waits. Suddenly, he (Oldman) appears out from behind a door. The language used, the tenseness of the two off of one another, it's simply the most terrifying scene in the picture (aside from the first violent turning point).So, basically, when Leon finished, I think I realized that my reaction was this: if I had seen this film when I was younger, be it in high school or even middle school, I would've responded to it even more strongly than I do now. There's something very visceral about the nature of violence and killing, as well as the mentor/pupil relationship, that Besson really gets down pat. While some of the situations have the chance of slipping into clichés, it doesn't happen very often. Leon: The Professional, is hard-hitting when it has to be, soft and funny when it can, and does stay with the viewer a few days after it's over."},{"username":"Calicodreamin","userUrl":"https://www.imdb.com/user/ur29385135","reviewLink":"https://www.imdb.com/review/rw7465183","warningSpoilers":false,"date":"21 October 2021","rate":"10","helpful":"1 out of 1 found this helpful.","title":"I'm a cleaner","content":"Loved this movie. The characters were well cast and well acted. The chemistry been Portman and Reno fells authentic and Oldman is perfectly manic. The storyline is unique, there is a tense aura surrounding most of the scenes that heightens the senses."},{"username":"bevo-13678","userUrl":"https://www.imdb.com/user/ur76062573","reviewLink":"https://www.imdb.com/review/rw6352339","warningSpoilers":false,"date":"10 December 2020","rate":"10","helpful":"3 out of 6 found this helpful.","title":"Great","content":"Wonderful romantic comedy about a person who is paid to kill people"},{"username":"LeonLouisRicci","userUrl":"https://www.imdb.com/user/ur33374263","reviewLink":"https://www.imdb.com/review/rw2800113","warningSpoilers":false,"date":"20 May 2013","rate":"9","helpful":"2 out of 3 found this helpful.","title":"UnHollywood and Uneasy","content":"There are two distinctly different versions of this Film. The theatrical American release called The Professional and the International and Home Video cut titled Leon: The Professional or just Leon. The longer by almost a half hour contains footage edited initially because other than Euro Audiences found the almost sexual but ultimately Platonic relationship between a 12 year old Girl and a 30 something Hit Man just too uncomfortable.It is the complete uncut version that is the more consummate and rich. It is realistic to assume the behavior of either Character and Director Luc Besson manages to approach the line of good taste but never crosses.This is a different kind of Crime/Action Movie to be sure. It definitely has a Non-Hollywood tone and has a gritty feel of the street. This isn't slick, except maybe in the Action scenes that are violent and impressively Artistic, but it is more of a heady affair of some very off the wall Characters. It delivers on many levels and is complex and exciting.This is a powerful Film with some powerhouse Performances. Requires involvement and a bit of tough analysis from the Viewer. It is an uncompromising and unconventional uncovering of some uncomfortable realities that are challenging as well as engaging. It is a Movie that can isolate many but also endear those willing to take on a bit more than usual."},{"username":"writers_reign","userUrl":"https://www.imdb.com/user/ur2567136","reviewLink":"https://www.imdb.com/review/rw2333414","warningSpoilers":true,"date":"3 November 2010","rate":"8","helpful":"1 out of 8 found this helpful.","title":"My Oldman's A Bust, Man","content":"This is a fine twist on My Father, The Hero, and could just as well be titled My Surrogate Father, The Hit-man. Jean Reno and Natalie Portman are beyond outstanding in the two leads and even Gary Oldman, a graduate of the Robert de Niro Academy where pupils are taught that SHOUTING equals Acting especially when VIOLENCE is added to the mix, can't really spoil what it is effect a bildungsroman. Somehow Luc Besson, far from a favourite of mine, has got it right against all the odds giving us yet Another movie in which a bachelor set in his ways is lumbered with a young child, almost always a girl, and emerges wiser even if, as in this case, stiffer as well. There was another fine French film exploring this theme - albeit without the violence - a few years back, Le Papillon and together the pair make a fine ad for French cinema."},{"username":"lastliberal","userUrl":"https://www.imdb.com/user/ur2171244","reviewLink":"https://www.imdb.com/review/rw1648909","warningSpoilers":false,"date":"4 May 2007","rate":"9","helpful":"2 out of 6 found this helpful.","title":"Cleaners need love, too","content":"It is easy to praise the father-daughter relationship that Leon (Jean Reno) and Mathilda (Natalie Portman) display in this dark and compelling film, but I feel that would be superficial.The relationship appeared to be much deeper - almost sexual - as the two tried to find some meaning in their lives.Leon was just slouching through life doing his job and not caring about much else. A wired cop (Gary Oldman) thrust Mathilda into his arms, and he became her protector and trainer. This relationship unfolded slowly and beautifully and was truly a joy to watch.Sure, there was action, but it framed the story, which was really about Leon and Mathilda. Reno and Portman were brilliant and aptly supported by Oldman and Danny Aiello."},{"username":"view_and_review","userUrl":"https://www.imdb.com/user/ur3670492","reviewLink":"https://www.imdb.com/review/rw1617599","warningSpoilers":true,"date":"14 March 2007","rate":"9","helpful":"0 out of 2 found this helpful.","title":"Leon: the blue collar hit-man","content":"\"The Professional\" was probably the first hit-man film I ever watched. I'm not sure how many, if any, hit-man films came out before \"The Professional\", but being that I haven't heard of any, they could not have been as good. Since \"The Professional\", other hit-man movies have been released, such as \"Assassins\", \"The Specialist\", \"Last Kiss Goodnight\", \"Bourne Identity\", \"Mr. & Mrs. Smith\", and \"Collateral\". In these movies, and other similar movies, the hit-man (or hit-woman) was nicely dressed, clean cut, well spoken, and had seemingly unlimited resources. In contrast, Leon lived in an old apartment, he dressed shabbily, and had a heavy accent that he could not hide. Your affinity for Leon wasn't because he had and was everything you wanted, but because he was a regular guy just like you and me. You got a good feeling of the type of person Leon was even with the few words he spoke.You got an even better insight of Leon when he developed a relationship with Mathilda, who was played by a young yet bold and somewhat enticing Natalie Portman. The movie centered a lot around their relationship. Leon took in Mathilda after her family was killed by some crooked cops. She actually wanted Leon to teach her how to kill so that she could exact revenge. Mathilda was a multi-layered character as well, even though she was a child. As the bond between Leon and Mathilda developed and grew, and the movie funneled towards its apparent end, all that happened before with Leon and Mathilda steered Leon towards his ultimate act of self sacrifice.Leon's end game move did not diminish the movie one bit, on the contrary, it immortalized the movie. Everyone loves a hero, and more often than not the hero lives in the end after having saved the day, leaving everyone jubilant and happy. Very seldom is the hero killed, or more precisely, takes his own life just for the one he loves. Leon and Mathilda may not have been romantically involved, but they definitely forged a strong bond. Leon had some amazing moves in store for the team of police that came after him, but you can't help but feel that he could not and would not have been so determined if it weren't for his love for Mathilda"}],"errorMessage":""}