{"imDbId":"tt0120586","title":"American History X","fullTitle":"American History X (1998)","type":"Movie","year":"1998","items":[{"username":"MartinHafer","userUrl":"https://www.imdb.com/user/ur2467618","reviewLink":"https://www.imdb.com/review/rw1292418","warningSpoilers":false,"date":"15 February 2006","rate":"9","helpful":"13 out of 20 found this helpful.","title":"exceptionally powerful drama--but not for the kids","content":"I really appreciated how those associated with this excellent film refused to pull any punches in showing the life of a young skin-head so ably portrayed by Edward Norton. Instead of creating a caricature of a racist, all the vile language and violence is shown. This DEFINITELY makes this a movie NOT for KIDS, but for adults it makes a strong impact--like a right cross into the jaw! Now I know some adults will also be completely turned off by this as well, but considering how slimy and awful racism is, how can you talk about it other than by exposing it as it really is?! I applaud the efforts, though I must also admit it can VERY hard to watch--particularly the shooting scene and the intensely graphic language."},{"username":"Leofwine_draca","userUrl":"https://www.imdb.com/user/ur0482513","reviewLink":"https://www.imdb.com/review/rw2746106","warningSpoilers":true,"date":"31 January 2013","rate":"8","helpful":"8 out of 9 found this helpful.","title":"Gutsy and compelling","content":"American History X is a real surprise, a searing look at racism in America today, told from the point of view of members of a skinhead gang. It's a lengthy film that's punctuated with moments of unflinching brutality, and yet it keeps you hooked to the screen throughout. And the reason for that? Edward Norton. Norton burns up the screen in this film; he's even better than he was in FIGHT CLUB, his big break-out picture. He somehow makes his Neo-Nazi character frightening, compelling and sympathetic in equal measure, a fully realised human being rather than a caricature. Furlong isn't bad, and supporting players like Gould and Keach are great, but let's not kid ourselves here. This is Norton's movie, and he owns it.This film works well because it isn't judgemental in the slightest. It presents all the sides of a situation without ever TAKING sides. It refuses to preach to the viewer, too, which is something to be commended. It gradually draws you into the plot, and for once the many and lengthy flashbacks are more interesting than the present-time story; the prison flashbacks are among the most powerful I've seen presented. It's not quite a perfect film - I'm not too sure about that ending, when it comes down to it, it feels forced and disconnected from the rest of the movie - but it's certainly up there with the best that Hollywood had to offer during the 1990s."},{"username":"SnoopyStyle","userUrl":"https://www.imdb.com/user/ur2898520","reviewLink":"https://www.imdb.com/review/rw3309833","warningSpoilers":false,"date":"2 September 2015","rate":"9","helpful":"6 out of 6 found this helpful.","title":"great American cinema","content":"Derek Vinyard (Edward Norton) grew angry after his firefighter father was shot and killed while putting out a fire in a drug den. He becomes a white supremacist under the tutelage of Cameron Alexander (Stacy Keach). Along with girlfriend Stacey (Fairuza Balk) and idiot Seth Ryan (Ethan Suplee), he aims to take back the neighborhood from the minorities. He kills 3 black guys who are breaking into his truck and gets sent to prison for 3 years. His brother Danny (Edward Furlong) idolizes him. However, Derek leaves prison a changed man as he tries to get his family away from his past.This is a shocking revealing portrayal of personal racism. Norton is insanely powerful. Furlong does some solid work as the teen with a chip on his shoulder. This is a movie worthy of recognition."},{"username":"Hitchcoc","userUrl":"https://www.imdb.com/user/ur0278527","reviewLink":"https://www.imdb.com/review/rw4672532","warningSpoilers":false,"date":"18 February 2019","rate":"10","helpful":"5 out of 6 found this helpful.","title":"So Mind Bending","content":"Sometimes it's hard, as a viewer, to even watch something like this. It is inundated with scenes of horror and violence. If one simply passes off the idea of doing a movie about the ugliest side of humanity and then put it in our laps. The performances are outstanding and a moral commitment is made. Some would say to the worst of the worst, there is a glorification of the events through flashback that may be seen as sort of cool. This is a small price for me to pay, but I have to admit, I would not do well with a continuous diet of such darkness."},{"username":"Kirpianuscus","userUrl":"https://www.imdb.com/user/ur61197531","reviewLink":"https://www.imdb.com/review/rw3513484","warningSpoilers":false,"date":"28 July 2016","rate":"","helpful":"1 out of 1 found this helpful.","title":"useful","content":"splendid performances. powerful message. violent. realistic. obvious, a masterpiece. the force of this film becomes, decade by decade, more important. because it is not exactly a great film presenting a delicate theme in wise manner but a kind of guide for understand every day reality. it is not only a problem of racism or an American story but an impressive fresco of the challenges to meet the other. this is the key of its importance. the splendid performance of Edward Norton represents start point for self definition of each of film viewer. the tragic end is the most precise warning about the social expectation and the importance of the past in the social status perception. it is a special film for the virtue to represent a slice of reality. and this does it one of the films who could change its public."},{"username":"mark.waltz","userUrl":"https://www.imdb.com/user/ur0968789","reviewLink":"https://www.imdb.com/review/rw6528443","warningSpoilers":true,"date":"26 January 2021","rate":"10","helpful":"8 out of 11 found this helpful.","title":"I don't feel angry. I just feel disgust.","content":"Is this what has happened to society? I can watch something like this, even being a 20+ year old film, and feel nothing? No fear, no hatred, no sympathy, no caring, just nothing, as if novocaine has been shot into my heart. That's the power of cinema that I don't really want to see but when I do, I am amazed how well done it is. It's not the film I despise. It's that feeling I get of emotions I list above that I just don't feel when I read this in the papers, see on the evening news or on the street, or in this case, see on my TV as a movie.The young Edward Furlong has made a hero (fortunately not a martyr) out of older brother Edward Norton, a skinhead white supremesist who in the opening scene kills two black kids who are attempting to steal his car. It's not the shooting that is shocking. It's the hatred in his eyes as he does it, as if they were his release of anger for the day and he could pump them with lead then go back to bed. After three years in prison, he's on the streets and finds out that Furlong is heading down the same path even though he's not even out of high school, his voice sounding like it's still changing.There's no pointing of finger of right or wrong, of moral judgment from the point of view of the writer as far as I can see. This is what's on the news, documented from what's been on the pages of the L.A. Times for decades. The point of view is that society has become entirely rotten from all sides, that the hatred of all but a certain type of white is acceptable from the point of view of Norton's crowd.Through history teacher Elliot Gould, a conversation erupts with Norton and his family (which includes ailing mother Beverly D'Angelo whom Gould is dating) over the Rodney King trial and riots that shows the differing feelings on the subject, a very intense argument that makes you ask if anything on these issues can ever be resolved. Avery Brooks plays Furlong's principal, a black man unwilling to give up on trying to save Furlong from his fate, and while he attempts to be the voice of reason, is there really any reason left in the world? When Norton rants at Gould in the most anti-Semitic manner, you may feel your gut wrenching up in horror, and it's one of the most depressing moments in screen history.So is \"American History X\" the conversation we're supposed to have? The film is structured in a way where the current situations are filmed in color while the flashbacks are in black and white, and that gives it the feeling of one of Leni Riefenstahl's German pro-Nazi documentaries. It's obvious that sounds like this are meant to be seen when you reach a certain maturity because otherwise, they are often too deeply depressing to watch, and indeed, I can't imagine watching it ever again.But the violence sticks with you, the image of Norton on the street in his boxers with his smug smile being arrested as if he saw himself as a savior of some sort. Once you see this film, even if you never see it again, you'll never forget those images, although as for myself, one viewing was plenty even if I never want to see it again, I have to call it one that I couldn't imagine not seeing. My 10/10 star rating is simply for the way it made me feel, the numbness of the emotions and the way it has made me think about every moment about it afterwards."},{"username":"bob the moo","userUrl":"https://www.imdb.com/user/ur1002035","reviewLink":"https://www.imdb.com/review/rw0442593","warningSpoilers":false,"date":"8 November 2003","rate":"","helpful":"39 out of 55 found this helpful.","title":"Not perfect but still very strong","content":"Years have past since Danny saw his neo-nazi brother, kill several black males who were robbing his car. Since he has been in prison, Derek's legacy has grown among the white gangs of the area and Danny has followed in his brother's footsteps. When he writes a racist paper for school, his teacher makes his write a new paper, focusing on recent history \u0096 that of his brother and how he influenced him. Meanwhile Derek leaves prison a reformed man with only the desire to repair the damage he once did to his family with his beliefs and his hate.I was looking forward to see this film as I missed it at the cinema and am a firm believer that Edward Norton is one of the most talented actors of his generation and is always worth seeing (even if some of his films have given less than he deserves). It was maybe better that I only saw it recently as I was able to enjoy it without all the hype and fighting over who did what to who, or all the comments from director Kaye as to his opinions of the film. Having seen the pompous fool interviewed several times, I find it quite self assuring that I don't agree with his opinions of it!The plot is a mix of flashback into Derek's hate filled past (told in b&w) and the present (colour) where he is desperate to save his brother and family from suffering anymore from his `sins'. As a basic narrative the film struggles at times to make a solid story and seems to be trying too hard to create confrontations to up the drama within the film. It still works mind you but this is not it's best asset.The main thing the film does well is to be a very true representation of white male disillusionment. The film avoids painting these people as monsters straightaway (although makes no bones that they are confused, misled and wrong). The arguments and discussions they have in the film are not so far from reality that the characters seem fiction \u0096 the characters and the film's world seem very real. The film's message that hate is no way to live no matter who it is directed at may be a little simplistic but it is a valid point. One particular weakness which I felt was a little hamfisted was Derek's `road to Damascus' experience in prison \u0096 it was OK but was far too easy given the character we had just seen brutally kill several black men.The other main selling point the film has is a performance by Norton that simply ensures he steals nearly every scene he is in. In b&w flashback he is at his best \u0096 a larger than life character who is never allowed to just be seen as a thug. Norton acts out the various stages of his life well and makeup ensures that he looks younger when required. In the present he is less dominant but still is very good giving a different performance. Furlong is also very strong, although he only has a few scenes where he is able to be outside of Norton's shadow. Support from Balk, Gould, D'Angelo and Brooks is mixed \u0096 Gould's Jewish character is only in the film to allow for one scene to occur, while Brooks' righteous teacher is simply a `morally upright teacher' with no meat on his character.Overall this is a good film, which occasionally struggles when it forces the issue in the `present' scenes. However for the most part it is a powerful film which owes a lot to well captured themes and an excellent performance from Norton."},{"username":"classicsoncall","userUrl":"https://www.imdb.com/user/ur2707735","reviewLink":"https://www.imdb.com/review/rw2545128","warningSpoilers":true,"date":"7 January 2012","rate":"9","helpful":"5 out of 5 found this helpful.","title":"\"Has anything you've done made your life better?\"","content":"I've seen a lot of movies and have seen a lot of violence in them - war films, Westerns, horror and even some of those slasher/gore flicks that go so way over the top. For the most part, the violence depicted is far removed from any sense of reality, because after all, it's a movie and the director can be as unrealistic as he wants to get with flying bodies, severed limbs and the like. However the curb stomp by Edward Norton's character on the black hood in the street was probably as visceral an experience that one can get from simply watching the event on screen. I think that comes from internalizing the impact such a trauma can have if it was personally done to you. It's a little hard to put into words, but I hope you can catch my meaning.What I think the film does effectively is show how a hardened racist like Derek Vinyard (Norton) can slowly come to terms with his prejudices when forced to confront them in a restricted environment. Not only is Derek influenced by his co-worker Lamont (Guy Torry) in the laundry, but also the hypocrisy of the segregated racial groups in the prison yard who break those boundaries for self expediency and personal profit. It's also noteworthy to remark on the character of Cameron Alexander (Stacy Keach), who foments racism and violence from a safe distance, never forcing a confrontation for himself, but only through surrogates like Derek and Seth (Ethan Suple).If the film does anything, it should help instruct the viewer to rely on one's own life and experiences to see the humanity and good in all people, regardless of race or ethnic background. I'll never understand why racists and haters focus on what's 'different' about others instead of seeing what makes all people the 'same' - a desire to amount to something, be part of a family and have a sense of belonging to a larger community of mankind."},{"username":"lee_eisenberg","userUrl":"https://www.imdb.com/user/ur4888011","reviewLink":"https://www.imdb.com/review/rw1339699","warningSpoilers":false,"date":"12 April 2006","rate":"9","helpful":"11 out of 18 found this helpful.","title":"Why didn't anyone challenge Derek when he became a racist?","content":"My 9/10 rating is because \"American History X\" is very well done in every way, except that it seems that when Derek Vinyard (Edward Norton) started spouting out the anti-Semitic diatribe, they should have asked him what became of his humanity. Then again, maybe they wouldn't know what to say in such a situation.But other than that, the movie is quite good. Portraying a reformed Derek trying to prevent his younger brother Danny (Edward Furlong) from becoming a white supremacist, we get to see various issues. For example, when Derek is in jail and gets to know a black man for the first time, his anger starts to ebb. Good support from Beverly D'Angelo, Elliott Gould, Stacy Keach and Fairuza Balk make this a very good movie, even if they didn't develop it as far as they could."},{"username":"gavin6942","userUrl":"https://www.imdb.com/user/ur1234929","reviewLink":"https://www.imdb.com/review/rw1488837","warningSpoilers":true,"date":"2 October 2006","rate":"9","helpful":"3 out of 5 found this helpful.","title":"What Happens When People Stop Being Polite And Be Real?","content":"American History X is the tale of a skinhead (Edward Norton) who \"curb stomps\" a black man and goes to prison. Whiel in prison, he reflects on his younger days and learns that racism is stupid. But when he gets back out, can he save his brother (Edward Furlong), who has followed in his footsteps? Also stars Fairuza Balk, Avery Brooks and the dad from \"Boy Meets World\".This is a very powerful movie because of one thing: its rawness. Raw is the only word I know that describes the intensity of the violence and the prison situations. You won't find this on \"The Birdman of Alcatraz\" (though maybe on \"Oz\").Also, the movie tackles a real world issue: racism. Unfortunately, it does so in a very exaggerated way (not all racists are skinheads), drags in things like affirmative action (which is racial but not necessarily racist or anti-racist) and seems to focus on blacks. In the world of 1998 maybe blacks were heavily discriminated against, but by 2006 it seems that being black is not nearly as bad as being Hispanic or Arab. (Not that blacks are equal yet, but much more so than other groups.) We all know Edward Norton is a great actor (\"Fight Club\") and many will rave over Edward Furlong (\"Brainscan\"). Avery Brooks tries hard to break away from the Star Trek stereotype (but fails). Fairuza Balk is great (at least as good as \"The Craft\", much better than \"The Waterboy\" but not as good as \"Return to Oz\"). The dad from \"Boy Meets World\"? Don't know his name... he's the dad from \"Boy Meets World\".A great film, but don't watch it with your kids unless they're old enough to understand adult situations. This is \"Schindler's List\" for Americans. Could be a great way to start a discussion on a difficult issue."},{"username":"jboothmillard","userUrl":"https://www.imdb.com/user/ur4248714","reviewLink":"https://www.imdb.com/review/rw1652563","warningSpoilers":true,"date":"9 May 2007","rate":"7","helpful":"2 out of 18 found this helpful.","title":"American History X","content":"To be honest I do not remember all of what happens as I got confused with most of it, I just like it for the stars and stand-out moments, i.e. racism, violence, etc. The story is built up with the present day (in colour) and the past (in black and white) with the two brothers of the film, Derek (Fight Club's Oscar nominated Edward Norton) and Danny Vinyard (Terminator 2's Edward Furlong). Basically Derek went to prison for racism and hatred, and Danny is soon following. When Derek's father is killed on duty, Derek's view on mankind is changed, and he finds out in prison there is good and bad in every person, whatever race. Danny now has to be convinced of this newfound enlightened. Also starring Beverly D'Angelo as Doris Vinyard, Avery Brooks as Dr. Bob Sweeney, Jennifer Lien as Davina Vinyard, My Name Is Earl's Ethan Suplee as Seth Ryan, Stacy Keach as Cameron Alexander, Fairuza Balk as Stacey, Elliott Gould as Murray and Guy Torry as Lamont. I think this is a really controversial film not for those sensitive to race issues, oh, and the fact that Derek is pretty much has the persona of a Nazi German, and the tattooed Swastika. Very good!"},{"username":"rmax304823","userUrl":"https://www.imdb.com/user/ur0819382","reviewLink":"https://www.imdb.com/review/rw2667859","warningSpoilers":true,"date":"2 September 2012","rate":"6","helpful":"2 out of 6 found this helpful.","title":"Chronicle of the Times.","content":"I don't think this is ONLY about Edward Norton's shifting attitudes towards white supremacy or American Naziism or whatever the organization is called here. Maybe that was the producers' intent when this was made in 1997, when some of the public were still hearing for the first time about the Aryan Brotherhood and all that.If the object was not just to entertain us but to teach us that racist-inspired violence is utterly wrong, the message seems not to have gotten through. We don't have race riots very often but the country is now polarized and angrier than I can remember, at least since Vietnam. The engine propelling that hatred now is not so much race, although that plays a part, but political ideology. One end of the political spectrum is so consumed by anger that the fantasies on which that outrage is based has come to look as anomalous as Norton's original notions of Aryan supremacy. In some cases, it's downright loco.Norton is a skinhead in an ordinary American family, though he himself is anything but ordinary. He belongs to a group led by Stacey Keach that meets in some kind of garage draped with Nazi flags. Norton's body is covered with tattoos of barbed wire and, featured prominently, a Swastika on his chest. This part of the movie -- the introduction and many flashbacks -- is in black and white.When a black gang burglarizes a house in his neighborhood, one of the gang is wounded and helpless. The shirtless and bemuscled Norton strides over to him and stomps his head against the curb, removing with one stomp all of the guy's front teeth. He's arrested and sent to prison. Norton's actions sound pretty bad to most of us, but evidently not to all of us. Ten years after this movie's release, a Texan named Joe Horn saw his neighbor's house being burglarized by two Mexicans and called the police, who said cars were on the way. Against the instructions of the police, Horn announced, \"This ain't right,\" took his shotgun, went out on his lawn and said, \"Freeze -- or you're dead.\" Two men tried to run away and Horn shot and killed them, later to be cleared of any charges.Norton's spell in prison rearranges his attitudes. Initially hostile to the black and Mexicans he is forced to live with, he finally begins to chuckle over a black colleague's absurd jokes in the laundry room. And, with the cooperation of the corrections officers, Norton is beaten and raped in the shower room by whites, in a particularly brutal scene. He emerges reformed and tries to save his younger brother from treading the same path. The scenes after his release from the slams are shot in color.The writing is sometimes rather clever. Elliot Gould plays a polite, vaguely \"live-and-let-live\" kind of Jew who is courting Norton's mother. Over the dinner table, the unregenerate Norton tweaks him about his attitude towards the Rodney King incident and is allowed to make some points. (What if King were white and the cops were all blacks?) The mother tries to put an end to the growing argument -- \"What about some ICE CREAM?\" -- and there follow about 30 seconds of a well-scripted and sublimely awkward silence. But the fight has acquired its own momentum, as combat has a tendency to do. Norton is hijacked by his amygdala and shouts poor Gould down so that Gould must leave the house and the widow he's courting. Norton's extreme attitudes have corrupted his manners at the table and perhaps wrecked his mother's chances for remarriage.I don't want to go on about this. Norton is actually pretty good. The character's attitudes are ironbound but Norton isn't stupid at all. Stacey Keach is a stereotype and is shown as such. When he laughs heartily at some racist remark, the camera practically dives down his throat. I haven't seen so many teeth since \"Jaws.\" The writers have been careful to indicate that Norton's pre-prison personality has nothing to do with the Ku Klux Klan -- \"a bunch of illiterate rednecks.\" Why not, asks the curious viewer, since the ideologies are almost the same? Well, answer the producers, we don't want to align the KKK with this despicable racist because we don't know how many KKK members are out there but we do know that they buy movie tickets.I really doubt that anyone learned much from watching Norton's rehabilitation or reformation or whatever it was. We can't identify with him. He's too extreme and obnoxious in all respects. We might learn more from a movie about Joe Horn, his killing of two unarmed burglars at somebody else's house, and his subsequent vindication by the courts. I'm sure Joe Horn had good table manners and loved his dog. We can see us in him."},{"username":"ma-cortes","userUrl":"https://www.imdb.com/user/ur3270789","reviewLink":"https://www.imdb.com/review/rw2493605","warningSpoilers":false,"date":"25 September 2011","rate":"7","helpful":"5 out of 7 found this helpful.","title":"Outstanding film with a sensational performance by Edward Norton as fanatic Nazi","content":"This is an intelligent story of racial violence and xenophobia with countless violence and broody message . It happens in Venice , California and deals with a young man , a skinhead and leader of a violent white supremacist gang named Derek Vinyard (Edward Norton) previously seduced into the fascist bunch by Alexander (Stacy Keach) . The Nazi group follows a racist doctrine about white supremacy , showing the feeling for the male reality of reactionary working class environments . Meanwhile his problematic family torn apart , specially his mother Doris (Beverly D'Angelo). He goes to jail after committing a heinous crime , but while in prison Derek's view of mankind is altered, he discovers that there is good and bad in every race . When he is released , the former neo-Nazi skinhead attempts to prevent his younger brother named Danny (Edward Furlong) who idolizes him is on the brink of becoming a Neo Nazi himself as Derek must save him from a similar destination from going down the same wrong path that he did . As his only thought is to steer his brother away from that same violent past and being helped by a reformist headmaster (Avery Brooks).Intense and thought-provoking drama with powerful performances and slick direction , being developed by means of flashbacks filmed in black and white and color . It's an important production about racism and Nazism but with lots of violence and unpleasant images as a frightening rape in the prison and the shocking murder at the beginning . Extraordinary acting by Edward Norton who steals the show as fanatic Nazi that committed acts of racial crime throughout and subsequently become good guy . Very good cinematography -specially the black and white fragments- by the same director Tony Kaye . Emotive and moving musical score by Anne Dudley , including some wonderful song . However , disowned by his director and reportedly reedited by its star . The motion picture is stunningly realized Tony Kaye , an unsuccessful director of a few films and documentaries who here achieved his big and only hit . Rating : Above average , essential and indispensable seeing . Well worth watching ."},{"username":"BA_Harrison","userUrl":"https://www.imdb.com/user/ur0945066","reviewLink":"https://www.imdb.com/review/rw2713664","warningSpoilers":false,"date":"2 December 2012","rate":"10","helpful":"1 out of 3 found this helpful.","title":"X-cellent.","content":"As a wise person once said (a long time ago): 'Fear leads to anger. Anger leads to hate. Hate leads to suffering.' This proves all too true for Derek Vinyard (Edward Norton), whose fear, frustration and rage at the murder of his father by a black gang member twists his soul, taking him not to the dark side, but to the white side—a neo-nazi gang called The Disciples of Christ—where his extremist beliefs and violent ways earn the respect of his peers, but only bring him and his family further pain and torment.Redemption for Derek comes during a stint in prison, his three year sentence for killing two black men giving him plenty of opportunity to realise the flaws in his philosophy and the error of his ways; with help from his African-American high school teacher Mr. Sweeney (Avery Brooks), Derek achieves parole and endeavours to make amends for previous actions, rejecting his right-wing lifestyle and those who endorsed it. But will it be enough to save his younger brother Danny (Edward Furlobg) from making the same mistakes as he did?It's kind of fitting that, for such a film—one so focused on turmoil, struggle and radical beliefs—American History X is the result of an extremely troubled background itself, director Tony Kaye attempting to disown the final film after star Ed Norton saw fit to re-cut the film against his wishes. Amazingly, somehow, the finished film bears no signs of its tumultuous past, being a nigh on perfect study of the cyclical nature of bigotry, one that powerfully drives home the futility of blind hatred.Boasting many a brilliant performance, wonderful cinematography, smart editing throughout (Norton must've known what he was doing), and some almost poetic acts of violence, plus a powerful message at its heart, this is must-see cinema that makes the viewer think long and hard about what they have witnessed long after the shocking climax has faded from the screen."},{"username":"moonspinner55","userUrl":"https://www.imdb.com/user/ur0989035","reviewLink":"https://www.imdb.com/review/rw1799702","warningSpoilers":false,"date":"13 January 2008","rate":"5","helpful":"15 out of 31 found this helpful.","title":"\"Now we can ignore each other in peace...\"","content":"Past and present collage of a youthful neo-Nazi skinhead in Venice Beach, California, his life going into a tailspin after the gang-related murder of his father. After killing some neighborhood thugs, the skinhead serves jail time and is eventually paroled (and reformed), yet he can't seem to straighten out his erratic family, particularly his younger brother who seems intent on following down the same ugly path. Director Tony Kaye puts the squeeze on us right from the start, staging a blacks vs. whites basketball game as if it were Epic Human Drama (photographed in black-and-white, with slow-motion effects and a heavenly choir). The superlative performances nearly carry the picture, yet screenwriter David McKenna lays on the be-true-to-yourself rhetoric with a trowel (and yet lets the opposite side get their licks in too, whittling the film down to a battle of speeches ladled with words like 'empowerment'). The jailhouse scenes are the strongest, but the family drama and the sidebars with the police (who also get to make speeches) are uncomfortably contrived. ** from ****"},{"username":"TxMike","userUrl":"https://www.imdb.com/user/ur0438066","reviewLink":"https://www.imdb.com/review/rw1853041","warningSpoilers":true,"date":"6 April 2008","rate":"","helpful":"1 out of 5 found this helpful.","title":"All too real, addresses hate across ethnic groups.","content":"Edward Norton is skinhead Derek Vinyard, with a very large Swatsticka tattoo on his left pecs. Somehow he has become very jaded, unhappy, and against any ethnic group but his own. Part of it resulted from his firefighter dad's death at the hands of a black man, while dad was fighting a fire. Now Derek worships everything Hitler stood for, white supremacy. Not just against blacks, but also against Jews, Hispanics, and Asians.One night late, while Derek and his girlfriend Stacey (Fairuza Balk) are consummating their affair one more time, Edward Furlong as younger brother Danny Vinyard alerts Derek that some black dudes are breaking into his vehicle. He goes out and chases them away, killing two of them. He has only underwear and a big grin on his face as the cops arrive to arrest him.While Derek is serving his prison time, younger brother Danny is beginning to follow in his footsteps. Stacy Keach as Cameron Alexander is the older man who fills all of them with propaganda.While in prison Derek learns and mainly by association with a black inmate in the laundry job begins to question many of his supremacy beliefs. As he gets out, he has resolved that all of his former beliefs are bullspit, and resolves to make sure that he protects his family, and guide Danny away from Cameron.Avery Brooks is teacher Dr. Bob Sweeney, a black man who helps to set a good example. But we see in a family flashback that dad had much earlier instilled the prejudice that Derek and Danny now fought to overcome.Hard to watch movie, but very good.SPOILERS: Derek returned to announce to Cameron and everyone else that he wanted no part of his former association with them. But shortly in an incident at school, his brother was shot, assassination style, in the boy's bathroom."},{"username":"Quinoa1984","userUrl":"https://www.imdb.com/user/ur0453068","reviewLink":"https://www.imdb.com/review/rw0442089","warningSpoilers":false,"date":"19 March 2000","rate":"9","helpful":"4 out of 12 found this helpful.","title":"The Best masterpiece of it's time","content":"Tony Kaye's American History X is the most shocking film of the year (especially considering most of it is happening now). It is violent, electrifying and sad. But it also is terrific in it's acting, directing and photography. Edward Norton is the highlight of this film (along with an Oscar Nom.) as the troubled Derek Vinyard, who after his father is killed by a group of blacks is drawn into the Neo-Nazi movement in Venice Beach. The scenes depicting his time in the Nazi movement is startling, violent, and frustrating. It really puts the zap on your head. Anyway, after Derek is put in jail for double murder, he leaves only wanting to save his brother (played well by Edward Furlong) from the same movement that put him into jail. All through the film, we never feel anything in this movie is less than perfect. I certaintly didn't, and hopefully you won't either. Best film of 1998. A++"},{"username":"michaelRokeefe","userUrl":"https://www.imdb.com/user/ur0449021","reviewLink":"https://www.imdb.com/review/rw0442153","warningSpoilers":false,"date":"11 August 2000","rate":"6","helpful":"5 out of 15 found this helpful.","title":"You will grimace and flinch; but you have to watch.","content":"This movie for me was hard to watch. It to me was disturbing as FIGHT CLUB. The graphic brutality and violence is probably too much for small children to endure. This is not for the faint of heart. This movie is bold and frank in its dealing with issues such as neo-nazism, bigots, 'skinheads', racism and classism. A wake up call for civility toward all mankind.Edward Norton has never been better. He turns in a flawless piece of work. Also appearing are Edward Furlong, Beverly D'Angelo, Stacy Keach and Elliot Gould."},{"username":"tedg","userUrl":"https://www.imdb.com/user/ur0643062","reviewLink":"https://www.imdb.com/review/rw0442430","warningSpoilers":true,"date":"3 July 2002","rate":"","helpful":"24 out of 47 found this helpful.","title":"Clumsy Term Paper","content":"Spoilers herein.I found Ed Norton to be a plausible foil in `Fight Club,' but a simple mugger in `The Score.' I sought this out to discover whether he should be on a list to watch or not -- this being a picture he influenced heavily.It is a mess. It is a mess because the director was too callow to have and impose a vision. So we get lots of different visions depending on the composition of the moment and the elements involved. One of those elements is Norton himself. I continue to maintain that the actor should never be in charge of the vision: he just has an entirely different set of concerns. One can see the scenes that Norton rips away from the director and sets up as billboards for himself.There are times when this can work. Scorsese seems to have explored more than all of them. It doesn't work here. This material demands that it be centered in large numbers of `ordinary' people. The impact is that this could be widespread, not just isolated to one movieland character. But Norton sucks all the attention out of the story.The material demands ambiguity. But the center is an unwaveringly decent black schoolteacher, as artificial a character as Norton's.The material attempts some sort of reflection through the term paper/diary reflections of the brother. But this is clumsily written and ends up as simple narration, usually the sign of poor visual storytelling.There is self-reference of sorts between Norton and his character. The character is playing a role that allows for one-dimensional excess. This role is widely respected because of the matter he preaches. So too with Norton himself."},{"username":"Theo Robertson","userUrl":"https://www.imdb.com/user/ur1532177","reviewLink":"https://www.imdb.com/review/rw0442584","warningSpoilers":true,"date":"14 October 2003","rate":"7","helpful":"48 out of 96 found this helpful.","title":"A Confused Film","content":"A Finnish commentator compared this film to American prison drama OZ . I love OZ , it`s my all time favourite American show , it`s compelling and brilliantly acted , adjectives you could use to describe AMERICAN HISTORY X. However while the HBO show suffers from lapses in logic there`s enough going on in different sub plots for you not to notice these flaws but seeing similar flaws in this film you can`t help but notice them First let me point out the good aspects . As said this movie contains great performances . In real life Ed Norton reminds me of the Kevin character from HARRY ENFIELD AND CHUMS with his floppy hairstyle and his back to front baseball cap but he always gives a good performance . In this movie he gives a GREAT performance as Derek the skin head from hell . Edward Furlong also gives a GREAT performance as Derek`s younger brother Danny . Norton earned an Oscar nod but strangely Furlong seemed to miss out , a pity . Tony Kaye also shows us he had great potential as a director , and it`s one helluva shame it`s unlikely we`ll be seeing either Furlong or Kaye as big Hollywood names***** SPOILERS *****But it`s the script that brings the film down , and in some places it`s quite woeful . Derek kills a couple of armed home boys who turn up at his house and he`s convicted of manslaughter . I know this is a plot device but couldn`t it have been better done ? Is it possible any jury would have convicted Derek for protecting his property from armed burglers . I guess all the jurors were called Goldberg and Rubinstein ? And I`ve got to agree with everyone who don`t buy the idea of Derek making friends with a black guy inside prison even after Derek gets raped by the skin head gang , oh and how many prisons in America have a mix of one third black , one third hispanic and one third Nazi/peckerwood ? It`s unrealistic the reasons why Derek stopped being a Nazi but it`s even more unrealistic why he became one in the first place - His Father used the \" N \" word a few times ! Of course the real reason might have been that his Father was murdered by a black gang but if that`s the case then why include the dinner scene ? It`s just confusing . There`s also another confused dinner scene where Derek`s mother invites a Jewish teacher around the family table . Would a Jew want to share a table with a couple of Nazi teenagers ?But the major flaw is with the ending . AMERICAN HISTORY X is a very obvious redemption plot but Danny being murdered at the end doesn`t tie in with Derek`s redemption . If Derek remained a Nazi Danny would have died , if Derek had become a flower arranger with Greenpeace Danny would have died . No matter what Derek would have done Danny would still have been murdered . When writing a redemption plot it`s essential the ending of the movie ties in with the protagonist`s road to Damascus .AMERICAN HISTORY X possibly does deserve to be in the IMDB top 250 movies but not at number 58 . It contains great performances but also some very poor scripting especially poor character motivation . If you want to see a better , more thought provoking film concerning race hate watch ROMPER STOMPER"},{"username":"bevo-13678","userUrl":"https://www.imdb.com/user/ur76062573","reviewLink":"https://www.imdb.com/review/rw5829313","warningSpoilers":false,"date":"16 June 2020","rate":"10","helpful":"6 out of 9 found this helpful.","title":"X","content":"Hard hitting gritty drama/rom com. Better than malcom x"},{"username":"LeonLouisRicci","userUrl":"https://www.imdb.com/user/ur33374263","reviewLink":"https://www.imdb.com/review/rw2768616","warningSpoilers":false,"date":"17 March 2013","rate":"7","helpful":"2 out of 4 found this helpful.","title":"Dramatic But Disappointing","content":"This is really a frustrating Movie. It has a lot worth watching but there are some things that keep this from being a great Movie. There is Edward Norton's versatile performance and some good looking Cinematography and it is all in support of a sociological/psychological problem that is forever haunting the American Dream.It is a confusing and only slightly believable, if powerful, story of racism and hatred. People searching for solutions to complex problems and lashing out with unintelligent behavior. Both the White Supremacist and the Black Gangs are equally ignorant and their actions are stupefying.The Film makes a powerful effort for it all to be meaningful, but it comes across as somewhat stereotypical. It is far less insightful than it pretends to be. It is all carried along by the extreme portrayals and the darkly poetic visuals.The prison middle and heroic transformation has the weakest of explanations and is rather shallow. Add to that the overacting of a fat Neo-Nazi and a stilted educator swallowing his lines as if he really doesn't believe anything he is saying, and the Film is rendered interesting but overrated. Worth a look see for some of the strong suits but ultimately superficial and somewhat a disappointment."},{"username":"preppy-3","userUrl":"https://www.imdb.com/user/ur0463200","reviewLink":"https://www.imdb.com/review/rw0442527","warningSpoilers":false,"date":"17 May 2003","rate":"8","helpful":"6 out of 10 found this helpful.","title":"Excellent but curiously unmoving","content":"A white supremacist Derek (Edward Norton) is sent to jail for brutally killing two black men who try to steal his car. Through some harrowing experiences in jail he realizes his way of thinking and living was wrong. He gets out and tries to prevent his young brother Danny (Edward Furlong) from becoming the same as him...but is it too late?First off I'm giving the film an 8. I thought is was excellent but it does have problems--it's overlong (I was bored more than once); there's way too many slow-motion sequences; there's disjointed editing; a finale I saw coming from a mile away and an annoying tendency to cut from b&w to color constantly. Those issues aside the film is great.The script and imagery is strong and graphic (as it should be) and there's some great acting here. Norton is just superb (he was Oscar-nominated); Furlong is subdued but good as Danny--a lot of his emotions come through in his eyes; Beverly D'Angelo was just great as their mother and Fairuza Balk is frightening as Norton's girlfriend. The only bad acting was by Avery Brooks--but he's not really a main character so it doesn't really hurt the film.Some of the sequences in here were very difficult to watch (the attack on the store, the prison sequences and the finale) but they're meant to be that way. This movie hits you over the head with its message but it does work. It just didn't affect me that strongly. As I said, I saw the ending coming from a mile away so it didn't shock me at all. Still, it is a powerful film. Well worth catching.Also there was a huge amount of controversy when this was released. It seems the director (Tony Kaye) accused New Line Studios of letting Edward Norton into the editing room and cut the film himself (this is no shock--Norton is known as a control freak). He requested his name be removed from the credits and replaced with Mickey Mouse or Donald Duck. He didn't win his request. If Norton did indeed edit this film--he shouldn't quit his acting job. The editing here is herky-jerky and the film could easily lose those slomo sequences."},{"username":"view_and_review","userUrl":"https://www.imdb.com/user/ur3670492","reviewLink":"https://www.imdb.com/review/rw1575589","warningSpoilers":false,"date":"17 January 2007","rate":"7","helpful":"4 out of 7 found this helpful.","title":"American (Heavy) History X","content":"\"American History X\" is not a weak, fluffy, cutely wrapped after school special on racism, life in the 'hood, life in prison, and breaking the cycle. \"American History X\" is powerful and hits like an anvil. Edward Norton does an excellent job as Derek Vinyard, a venomous, hateful leader of a local gang of skinheads.The movie takes a singular look at a young man who is entrenched in the White Supremist movement, then how he emerged from that life, and even how he started down that path to begin with. Of course most people don't like racist bigots and the movie shows the very ugly nature of the skinheads/Arian Brotherhood. But the movie also shows the interaction between the Whites and Blacks in the 'hoods of L.A. There was by no means an angelic depiction of the African-Americans in this film. A few of the blacks shown were thugs who in part helped shape the views that Derek and his brother Danny (Edward Furlong) held as White Supremists, but there were also a couple of key African-American characters that helped to reshape the views of Derek and Danny.\"American History X\" made sure to do it right and make it true to life. The life Derek had before prison, the life inside of prison with the segregation and the gangs, and his life after prison as a changed man. This was no \"Mississippi Burning\" or \"Rosewood\" detailing events of the past, rather this was a movie showing the present, the good and bad in both parties, and the different ways people can be reformed."},{"username":"grantss","userUrl":"https://www.imdb.com/user/ur2860723","reviewLink":"https://www.imdb.com/review/rw4107625","warningSpoilers":false,"date":"28 March 2018","rate":"9","helpful":"0 out of 1 found this helpful.","title":"Superb","content":"Derek Vinyard is a skinhead and the leader of a white supremacist gang. After killing two black men who tried to steal his truck he is sent to prison for three years. Prison gives him a time to think about his life and when he comes out he decides to avoid the hate and prejudice of his past. He leaves the gang and attempts to live a normal life. However, his previous actions and prejudices may have influenced his younger brother.Superb drama. A great examination of prejudice and racial hatred, the causes and effects of it, and how it shapes, and destroys, lives. Also looks at the generational impact of it.Well written and directed with a powerful, profound ending.Great performance by Edward Norton in the lead role. Well deserved his Best Actor Oscar nomination."}],"errorMessage":""}