{"imDbId":"tt0108052","title":"Schindler's List","fullTitle":"Schindler's List (1993)","type":"Movie","year":"1993","items":[{"username":"TheLittleSongbird","userUrl":"https://www.imdb.com/user/ur20552756","reviewLink":"https://www.imdb.com/review/rw2076036","warningSpoilers":false,"date":"4 June 2009","rate":"10","helpful":"73 out of 107 found this helpful.","title":"Incredibly moving and visually disturbing, Spielburg's best by far!","content":"Some of Schindler's List is very disturbing indeed, with very graphic images on the screen. I thought this film is outstanding. True, it is very long, but the Holocaust was a very long and epic event, and the movie needed a long length to convey the harsh realities of the Nazi's treatment of the Jews. The cinematography was truly excellent, and some of the close ups of people being tortured or dying was enough to make you look away. The direction was taut and focused, most Spielburg's movies are good, but don't quite always have an impact on the whole audience. Schindler's List is visually disturbing and incredibly moving, and because of this, this is definitely Spielburg's best. The acting was phenomenal. Both Liam Neeson and Ben Kingsley give superb performances, and Ralph Fiennes is also very chilling in his role. The music by John Williams is not only haunting, but also unbearably sad, believe me I was in tears for a lot of this movie. All in all, a truly moving film, that deserves a 10/10. Bethany Cox."},{"username":"bkoganbing","userUrl":"https://www.imdb.com/user/ur2483625","reviewLink":"https://www.imdb.com/review/rw1976534","warningSpoilers":true,"date":"16 November 2008","rate":"10","helpful":"46 out of 75 found this helpful.","title":"When The State Dehumanizes A People","content":"It would not have been possible to have made Schindler's List immediately after World War II. The public was just taking in the magnitude of the Holocaust, they might not have believed it. Fortunately for the prosecutors at Nuremberg and for history the Nazis being the anal retentives that they were, made these incredibly meticulous records which scholars and historians have sifted through and we have the whole thing incredibly documented by the perpetrator's own hand. With a fifty year perspective now and the very existence of the state of Israel questioned by those who ought to know better, Steven Spielberg has given us a work for the ages.If you can sit through two incredibly long and sorrowful films one ought to see Schindler's List back to back with The Diary Of Anne Frank. In the latter film, we see a very ordinary group of people fighting for survival to escape the fate of what we see happened to so many. The fact they were days from possible liberation makes the sorrow of that film all the more poignant.Schindler's List is a story of escape from the ultimate fate of six million. Oskar Schindler played by Liam Neeson is a German businessman who sees a chance at some nice war profits using some incredibly cheap labor from the concentration camps. He's willing to start a factory in occupied Poland with slave labor Jews. Towards that end he hears of a man who ran a factory among the Jews in the newly formed Cracow ghetto, Itzak Stern played by Ben Kingsley. Kingsley agrees to work for him and with him recruiting the labor force, Neeson gets his factory going. With that comes responsibility for these people. He fights for them, the original ones and some added to his growing work force. Over the over 3 hour film, Neeson gradually changes and his concern for his charges becomes humanitarian. He plays a dangerous game, especially with concentration camp commandant Ralph Fiennes. A man who delights in the total power he's been handed and the liberation from all civilized restraints to exercise barbarism, arbitrary and capricious. Fiennes will chill you with his penultimate portrayal of a perfect Nazi.Let us not forget that Schindler himself was a Nazi. He did in fact in the end go broke in paying out bribes for special consideration for his charges that meant their very lives. It's also possible that he saw the way the war would end and that those responsible for the Holocaust would be held accountable. Some have speculated that he did this for no other reason than to bank credit with possible witnesses. If that was the case it certainly worked because he was investigated and not charged with any war crimes.Still I'd prefer to believe the testimony of those on the scene including the real life Itzak Stern. Those are the folks that ought to know.Schindler's List was nominated for 12 Academy Awards and won seven including Best Picture and Best Director for Steven Spielberg. Liam Neeson and Ralph Fiennes were nominated for Best Actor and Best Supporting Actor. It deserved every honor it got and I only wish Neeson and Fiennes were winners as well.It's a film about the Holocaust, but it's also a film about the results of dehumanization of a people and when the state completes the process of dehumanization what can be the result. I'm not sure what future work Steven Spielberg has planned, but he can't top this no way, no how."},{"username":"Leofwine_draca","userUrl":"https://www.imdb.com/user/ur0482513","reviewLink":"https://www.imdb.com/review/rw3708949","warningSpoilers":true,"date":"16 May 2017","rate":"8","helpful":"23 out of 37 found this helpful.","title":"One of the ultimate anti-war movies","content":"SCHINDLER'S LIST is perhaps one of the ultimate anti-war movies in existence. Directed by Steven Spielberg in a naturalistic, unfussy style, it's a harsh, black and white epic that looks at the extermination of the Jews at the hands of the Nazis. Some humanity is brought to the fold by an excellent Liam Neeson who plays Oskar Schindler, a businessman who somehow found himself involved in the situation and who did the right thing. Like many Spielberg films, this is shamelessly sentimental, but then it can hope to be nothing else given the subject matter. The stirring music combines with the expert direction to make this an effortless watch, complemented by Ralph Fiennes whose role is the personification of evil."},{"username":"SnoopyStyle","userUrl":"https://www.imdb.com/user/ur2898520","reviewLink":"https://www.imdb.com/review/rw2984638","warningSpoilers":false,"date":"23 March 2014","rate":"10","helpful":"22 out of 29 found this helpful.","title":"Spielberg's most important work","content":"Oskar Schindler (Liam Neeson) is a social climbing opportunistic womanizing German businessman. He charms important Nazis, and gets access to limitless Jewish labor. He gets Itzhak Stern (Ben Kingsley) as his right hand man, and Jewish money to pay for his business. He provides the front. Using black market deals and advantageous connections, he becomes rich and powerful. Stern works tirelessly to save people. Even as the Jews are rounded up to Plaszow labor camp under the command of unstable Amon Goeth (Ralph Fiennes), Schindler is able to befriend the mad commander.This is probably the most important movie of director Steven Spielberg's career. At least it's the most important for him. Based on the true story, Spielberg uses all his movie making skills to create this iconic movie. The black and white provides starkness and thankfully a little bit of distance from the horrible events. Liam Neeson and Ben Kingsley are the perfect duo. Ralph Fiennes gives a complex performance as the mad commander. The shock of the horrors of the Holocaust is expertly done. When I first saw it in the theater, I couldn't help sob a little when Schindler breaks down at the end."},{"username":"Hitchcoc","userUrl":"https://www.imdb.com/user/ur0278527","reviewLink":"https://www.imdb.com/review/rw1327585","warningSpoilers":false,"date":"28 March 2006","rate":"10","helpful":"20 out of 28 found this helpful.","title":"It's About Our Humanity","content":"We need to look at a work of art like this to see ourselves in this movie. This is the result of a regime that no longer saw the worth of the human being. It politicize life. This leads to monstrous treatment of people (because they are not people in their eyes). I saw this film the first week it came out. We were on vacation on Hilton Head Island in South Carolina. I remember my wife and I not being able to talk for almost 15 minutes after it was over and then we needed to talk about something else. There are few experiences that can do that to someone. Since that time, I've had many others tell me the same thing. Why is this movie so much more effective than other Holocaust films. First of all, there's something personal about it. We get to know the people, even the bad guys. Secondly, the recreation of the death camps is so accurate. Then there is a spot of genius, the little girl in the red coat. If anyone wants to complain about black and white, watch this film. We get to see what can be done with shades and shadows. The work of Schindler is the work of the heart against great odds. The scene at the end when the holocaust survivors visit the graveyard, is what moves the film. I think that everyone should see this film at some time. Then sit down and think about what is being done to people here in our own country."},{"username":"Kirpianuscus","userUrl":"https://www.imdb.com/user/ur61197531","reviewLink":"https://www.imdb.com/review/rw3377265","warningSpoilers":false,"date":"21 December 2015","rate":"","helpful":"32 out of 56 found this helpful.","title":"portrait of evil","content":"maybe, not the best movie about Shoah. but the most useful. because it reminds the small details who are bricks of normality. and it does that in a wise manner. far to be one of fans of film, it seems be a real high good job. but it presents , in beautiful manner, a side of tragedy. a not large part of a phenomenon who shows its fruits but not its deep roots. a duty of Spielberg to his people, a remarkable photography and a touching story, it is a must see not for the story, artistic virtues, memorable scenes, splendid performances but for not ignore the evil. because it is not a film about Jews or a courageous man who saves innocent people , not about war but about the science to be yourself in dark periods. a film who must see. for reflection. for not ignore. the past. the vulnerability of society face to evil."},{"username":"Horst_In_Translation","userUrl":"https://www.imdb.com/user/ur3914439","reviewLink":"https://www.imdb.com/review/rw4610854","warningSpoilers":true,"date":"27 January 2019","rate":"8","helpful":"6 out of 10 found this helpful.","title":"The mother of all Holocaust movies","content":"\"Schindler's List\" is an American mostly English-language movie from 1993 that won Best Picture that year and took home another six Oscars including one for director Steven Spielberg, for whom it is probably still his career-defining work and with everything that he has under his belt like Jaws, Indiana Jones and much more, this means quite something. This film we have here runs for over 3 hours and I was lucky enough today to catch it on the big theater screen on the occasion of a very special day here in Germany. And what can I say. It was a feast. If that is an appropriate term given the heavy subject. I already wrote in the title of my review that this is of course a movie about the Holocaust. And it does not even try to hide the horrible deeds done by the perpetrators back then. Which means you have several occasions where you see people being shot in the head from the nearest distance and killed in cold blood for what their religion is. But it is also an uplifting movie as the man in the middle of it is Oskar Schindler, a manufacturer who saved more than a thousand Jewish lives during these perhaps darkest days in German (global) history. He is played by Liam Neeson and this is also his career-defining performance today without a doubt. Ralph Fiennes was around the age of 30 when he played the main antagonist here, Amon Göth, and Ben Kingsley, already an Oscar winner back then, is also on board and he looks so different compared to how he looks today, almost older you could say.By the way I did not know this film was based on a book in fact. It's really been a long long time since first time I saw it. But it is as good 25 years after its release as it was back then when I watched it for the first time. I must say I was not too touched throughout the movie as I hoped I could be and as I know many others were, but the last 20 minutes or so are heart-breaking stuff. I am talking about the moment when Schindler starts talking to his \"employees\", the guards I mean with that, as well as the Jews when he says he will be the hunted from now on. And then there is this powerful march with the haunting music at the very end before the film switches into the now, well into the early 1990s you must say, and we see the survivors, the Schindler Jews, and their offspring too and this idea of how Schindler did not only save these men, but saved entire generations and future children is so incredibly touching that there is no way your eyes won't get wet. I think my entire cinema could have finished drought in Africa when the closing credits rolled in. And lets not forget John Williams' beautiful beautiful soundtrack / main theme that is among the saddest tunes you will ever hear during a film and I know now already it is one that will never leave my head and ears. It was probably before watching this film the one thing that I have come across many times over the last years/decade and which I remembered better than anything else from this film.I was also glad to see parents with their children in the audience today, kids that were not even close to being born in 1993, so the film's message is carried on to the next generation. Well, what can I say. The Holocaust subject here in Germany is one that is very dominant today also in modern culture and there are constantly new exhibitions about this topic and also many new films still being made. And not just in Germany obviously. But I am pretty sure that none of these will ever reach the icon status of Schindler's List. Other really touching moments for me included the moment Kingsley calls the list something like \"ultimate goodness\", when we see earlier on the shoes and jewellery taken from Jews before their journey into destruction, the dead girl in the red dress etc. The latter is one you could talk about for ages and write an entire review about in my opinion. What is her significance? Well.. I would say this only use of color before the jump forward in time near the end is intended to emphasize that there is an individual human being behind every face and even if they don't stand out thanks to shining garments, we still should not forget that. Be it the one-armed men, the woman who knew so much about construction or everybody resting down there below Göth's balcony. They all have their stories and their loved ones and they all should not have died. It is very difficult in the presence of these sheer numbers of Jews being killed back then, but we shall not forget every one of them deserved to live. And every one of them has their own story. If we lose our empathy and become numb to what happened, then all is lost. And it is merely numbers that mean nothing to us.Okay, I mentioned Göth already. Fiennes was nominated for an Oscar for that portrayal and many today say he should have won instead of Tommy Lee Jones, but not having seen the latter's movie, I will not discuss that in detail. But I think it is a surprising loss, even with TLJ having the momentum given how much they loved Schindler's List. Like with the scene I mentioned some lines above, I also think that Göth could have deserved his own review. It is so difficult to say what this character is and what he is not. There is no 100% description, it is all about the shades. Very fitting the house keeper's description that you never knew what would happen next with him and how you could calm him down. Is he an opportunist? A sadist? A psychopath? A racist? Probably yes to all that, but then there are these moments when deep down inside him he has affections for the Jewish housekeeper before reality bites and he starts attacking her violently. The scene when he tells Schindler that he wants to take her with him is telling enough, only to say he should shoot her in the head in the nearest forest. Maybe this is the closest he can get to love? Tough to say. The relationship between Göth and Schindler is also interesting. I do think he looks up to Schindler for his success with women, his whole aura, his talent to entertain and he wants to be like him instead of being an alcoholic and gambling addict. Not many would have gotten away with the hose scene really, but Schindler does with the high-profile Nazis trying desperately to convince themselves that he is just torturing the Jews in the wagons. Of course he is not and they know. But they do not have the will and charisma to oppose him. The very first scene at the table when Schindler invites the Nazis over is already very telling, who is the man in charge. But he needs them too. Without being an NSDAP member, there is no chance for him to thrive and save a single life.And finally, lets look at the character transformations. Some brief words on Göth first who believes he is some high-appointed ruler about who lives and who dies thanks to Schindler's influence. There is no real goodness in the former. It is all make-believe and when he realizes he shoots the boy in cold blood. But about Schindler, there is a lot more to say, also when it comes to his wife and of course his heartfelt final speech about how he could have saved more. At some point, it was never about prestige, about reputation or about business anymore. Let alone about money. He gives it all away for his fake factory. This is when he turns into the good human being, which also has a lot to do with Stern's influence for sure. So yeah, this is a really long movie, but oh so rewarding and also for me a definite contender for best film of 1993. Don't give up on it if greatness is not achieved on all occasions early on. What is waiting for you is absolutely worth it.Of course, due to the cruel imagery, this is not a film for the very young ones, but even if it is extremely serious and will break your heart on more than one occasion, there are also really many moments, surprisingly more than I expected where this film will make you smile. These include basically all Schindler's exchanges and interactions with women, be it the ones sitting on his desk typing or the ones who want to see him or all the other ones attracted to him and the other way around. Or one other scene that stays in the mind very much for me is when he is looking for Stern at the train station and how these resilient Nazi guards help him quickly after being worried about their own future and having fear of being sent to Russia. So yeah, there is probably at least a dozen scenes more that stay in the mind and that I could write a whole chapter about and you will recognize these scenes when you watch them or maybe you will think of completely different scenes than the ones I mean, but that is perfectly fine though. I will spare you all that. But I will not spare you the words that this is an absolute must-see from the historic and emotional perspective and unless you really really hate Holocaust movies for whatever reason, you should watch this one. Actually, even if you do, you should watch it because this is the one film that can change your mind. Go for it if you really haven't seen it so far and with that I am of course speaking in particular to the younger readers. There's a reason this is so high on the imdb top250. And rightfully so. If you are lucky enough like myself to get into a big screen showing, then do not miss out under any circumstances. A gigantic thumbs-up from me for Schindler's List."},{"username":"mark.waltz","userUrl":"https://www.imdb.com/user/ur0968789","reviewLink":"https://www.imdb.com/review/rw3077441","warningSpoilers":true,"date":"29 August 2014","rate":"10","helpful":"25 out of 34 found this helpful.","title":"You don't have to be Jewish to be touched by this response to inhumanity.","content":"History has proved that the old saying, \"God makes mad first whom he intends to destroy\", and in the case of Nazi Ralph Fiennes in this Steven Spielberg masterpiece, that is oh, so true. Unfortunately, a lot of innocent people have to pay for that madness in the meanwhile, and that truly adds to the intensity of his madness as it increases and his vileness just gets more and more out of control.On the other end of the spectrum is Liam Neeson's Oscar Schindler, a businessman who knows by allowing the Nazis to take his Jewish workers away, his productivity will suffer. Selfish motives keep these innocent people from being sent to the death camps, and as Schindler learns the truth about the atrocities going on and becomes closer to the people who work very hard for him, he goes out of his way to keep the Nazis from going through with their evil plans.The atrocities you see here are things we can't fathom here in America. Innocent children are forced to hide in human waste to avoid discovery. An innocent woman prisoner with a background in architecture is brutally murdered after insisting that a building being constructed is doomed to collapse, after which the evil Fiennes simply orders his men to do what she suggested. Fiennes picks targets and guns them down, and also has Schindler's aged workers killed simply because he considers them too old to contribute. An innocent young girl in a red coat (the only color in this black and white movie) wanders around Warsaw as the ghetto is destroyed. Neeson almost looses his right-hand man (a magnificent Ben Kingsley) because of a paperwork mix-up. This culminates in the most daring of escapes from Nazi persecution, and that is where Neeson realizes the full effect of what's going on, breaking down in a scene that will have you shivering in your seat.I can't watch these movies without the temptation to scream at the Nazis on screen. Even in the most outlandish propaganda films of the war era, I tended to either applaud loudly or scream in delight \"Die, Nazi, Die!\" as the villain gets their come-uppance, either through brutal murder or the firing squad after a lengthy trial revealed their shame. Many of those times, my body was shaking so violently as sobs emerged from me that I was unaware I was capable of. You can't call these feelings manipulation by the direction; Spielberg obviously felt a passion for the story he was telling, as if he knows that this can cross over into any race, any culture, any religion.Rarely in recent movie history has it been so obvious when a film was released that it would sweep the Academy Awards, and \"Schindler's List\" truly deserved every honor which it received. Some stories are so painful that you can't go back and watch them easily; I find that every so often, I need a movie like \"Schindler's List\" to remind me of how vile humanity can be, and how one compassionate human being can change the course of history for so many. The finale with real-life \"Schindler Jews\" honoring their hero is truly awe inspiring and is certainly what you can call triumph over tragedy."},{"username":"bob the moo","userUrl":"https://www.imdb.com/user/ur1002035","reviewLink":"https://www.imdb.com/review/rw0328506","warningSpoilers":false,"date":"23 March 2003","rate":"","helpful":"30 out of 50 found this helpful.","title":"Powerful and moving if not exactly a fun night in!","content":"As Nazi Germany invades Poland, opportunist Oscar Schindler sees a chance to open a factory serving the military and using Jews for labour. However, as the full horror of the war on the Jewish people becomes ever more clear, Schindler's selfishness turns more into compassion for his fellowman.Having spent 10 weeks watching `Taken' and remembering just how awful Spielberg can be when he is being mushily sentimental, I revisited this film as it was showing in the build up to the TV coverage of the 2003 Oscar ceremony. It is a powerful film simply because Spielberg manages to keep the mush out of it and just let the events speak for themselves. When people are shot on the street there is no John Williams music or slow-motion, they simply fall in a bloody heap and the film moves on. This makes it shockingly cold and that is the aim.The story is difficult to summarise because a surprising amount of it is spent away from the story of Schindler and on the plight of the Jews generally. Again this theme within the narrative stops to wandering and allows it to be impacting. True there is an element of `look what happened, isn't this terrible?' about it, but not too much. In the final hour in particular it gets a little sentimental but not to the point of spoiling things.Neeson's Schindler makes you wonder why he wasn't able to get any character into his recent role in Star Wars I. Here he keeps Schindler a complex man, driven by a mix of selfishness and compassion but Spielberg simplifies him a bit towards the end (but I may be being a bit picky). Fiennes' Goeth is also wonderfully drawn. A cold blooded killer no doubt but also not painted without his own complexities and Fiennes holds the focus whenever he is onscreen. The support cast are all excellent right down to extras \u0096 if you think it is easy to scream and wail convincingly then you should compare this to Kate Capshaw in Indiana Jones! I never doubted that any of the actors were anything but the characters they played.Spielberg rightly won his Oscars for this and his direction is excellent. Although I do dislike him immensely when he goes all `apple pie' on us, he is great at what he does and this is one of his best films since Jaws. A powerful, moving film that is moving for all the right reasons and not just because John Williams cranks in. Difficult to watch but worth the effort."},{"username":"classicsoncall","userUrl":"https://www.imdb.com/user/ur2707735","reviewLink":"https://www.imdb.com/review/rw1500459","warningSpoilers":true,"date":"18 October 2006","rate":"10","helpful":"14 out of 20 found this helpful.","title":"\"The list is an absolute good, the list is life...\"","content":"Probably the most powerful and important film one can watch in this or any lifetime. The Nazi atrocity is presented in stark images of horror beyond comprehension and even the power of one's own imagination. The scene that brought that all home to me was the one in which the young Jewish boy made his way down into the latrine to escape the nightmare of separation from his family, only to find others had beaten him to it. Such desperation, such will to survival.Liam Neeson, Ben Kingsley and Ralph Fiennes are superb in their respective roles. The filming in black and white is only appropriate for an era of history devoid of color. Amon Goeth (Fiennes) crystallizes the Nazi sentiment toward an entire race with one line to Helen Hirsch (Embeth Davidtz) - \"I realize that you're not a person in the strictest sense of the word\".\"Schindler's List\" is hardly the type of film one can consider a favorite, it's reach goes far beyond entertainment. It deserves it's recognition as one of the best films of all time, it's power resides in giving literal interpretation to the message 'never again'."},{"username":"lee_eisenberg","userUrl":"https://www.imdb.com/user/ur4888011","reviewLink":"https://www.imdb.com/review/rw1144741","warningSpoilers":false,"date":"7 August 2005","rate":"10","helpful":"37 out of 60 found this helpful.","title":"Possibly THE BEST example of a Best Picture winner","content":"I can't possibly describe with words how great \"Schindler's List\" is. You can't realize it unless you watch it. Spielberg not only makes you feel like you're in the middle of it, but you continue feeling that way for hours after watching the movie. Liam Neeson does a top-notch job as Oskar Schindler, a man caught between loyalty to his government and the desire to save over 1,000 people. Equally good is Ben Kingsley as Itzhak Stern, whom Schindler saves from getting exterminated, and then helps Schindler save more people. And Ralph Fiennes as Amon Goeth, a Nazi Kommandant with plans to rape a Jewish woman. Like I said, I can't possibly describe how great this movie is. YOU HAVE TO SEE IT TO UNDERSTAND IT. 11/10."},{"username":"gavin6942","userUrl":"https://www.imdb.com/user/ur1234929","reviewLink":"https://www.imdb.com/review/rw3117415","warningSpoilers":false,"date":"4 November 2014","rate":"8","helpful":"10 out of 16 found this helpful.","title":"A Now-Classic Tale of Salvation In Poland","content":"In Poland during World War II, Oskar Schindler (Liam Neeson) gradually becomes concerned for his Jewish workforce after witnessing their persecution by the Nazis.Spielberg, unsure if he was ready to make a film about the Holocaust, tried to pass the project to several other directors before finally deciding to direct the film himself. Indeed, the biggest criticism the film gets is that it came from Spielberg, well known for his sentimentality. Had another director made the same film, it would probably be considered flawless.One can wonder about the casting of Liam Neeson as a Moravian German, when he clearly is not. But with such a strong acting ability, this can be overlooked. The casting of Ben Kingsley was brilliant, even if he is not Jewish, and it is a shame this role is not the one he is best known for. Somehow Ralph Fiennes got a supporting actor nomination, but not Kingsley? The choice to film in black and white makes sense, as Spielberg wanted a \"documentary\" feel. Does the infusion of red take away from this? Some might say so.This film racked up a slew of awards, including several Oscars, and this is well-deserved. Despite its critics, this will no doubt go on to be considered one of the greatest films of all time, and easily the best to address the Holocaust."},{"username":"jboothmillard","userUrl":"https://www.imdb.com/user/ur4248714","reviewLink":"https://www.imdb.com/review/rw1041095","warningSpoilers":true,"date":"17 March 2005","rate":"10","helpful":"32 out of 61 found this helpful.","title":"Schindler's List","content":"The first film from Oscar, BAFTA and Golden Globe winning director Steven Spielberg (Jaws, Raiders of the Lost Ark, E.T. the Extra-Terrestrial, Jurassic Park) expressing the passion of his Jewish religion (the second - Oscar winner - being Saving Private Ryan) is a brilliant look into the horrific incidents in the Holocaust, based on the novel Schindler's Ark by Thomas Keneally. Set in the Nazi German concentration camps of World War II, filled with thousands of innocent Jewish people, where greedy, unsuccessful businessman Oskar Schindler (Oscar, BAFTA and Golden Globe nominated Liam Neeson) hoping to make profit from the Jewish slave labour manufacturing. Later we are introduced to one of the lead villains, overseeing the progress of the camp, the evil Amon Goeth (BAFTA winning, and Oscar and Golden Globe nominated Ralph Fiennes). As time goes by, more and more Jews are trying to escape capture, torture and death by the Nazis, Oskar sees how much pain and suffering these innocent souls are going through, and starts having changes in heart. So with the help of friend and almost colleague Itzhak Stern (BAFTA nominated Sir Ben Kingsley) they begin to type a list (hence the title) for all the Jews he can afford to buy and take away to another camp for a new manufacturing business. He manages to \"evacuate\" approximately 1,100 victims, and he becomes the unlikely hero (after not doing much earlier) by releasing all of them. Also starring Caroline Goodall as Emilie Schindler, Jonathan Sagall as Poldek Pfefferberg, Embeth Davidtz as Helen Hirsch and Malgoscha Gebel as Victoria Klonowska. There are horrific and memorable moments of realistic suffering, torture and death, a hideous real villain and a great unlikely real hero, moments of colour (i.e. the beginning, the girl with the red coat, and the ending) and a teary ending with many survivors paying their respects at Schindler's grave. It won the Oscars for Best Art Direction-Set Decoration, Best Cinematography, Best Film Editing, Best Music for John Williams, Best Writing, Screenplay Based on Material from Another Medium and Best Picture, and it was nominated for Best Costume Design, Best Makeup and Best Sound, it won the BAFTAs for Best Cinematography, Best Editing, Best Score, Best Adapted Screenplay, the David Lean Award for Direction and Best Film, and it was nominated for Best Costume Design, Best Make Up Artist, Best Production Design and Best Sound, and it won the Golden Globes for Best Motion Picture - Drama and Best Screenplay - Motion Picture, and it was nominated for Best Original Score. Steven Spielberg was number 56 on The 100 Greatest Pop Culture Icons, Ralph Fiennes was number 83 on The 100 Greatest Movie Stars, Fiennes was number 28, and Liam Neeson number 15 on The 50 Greatest British Actors, Oskar Schindler was number 13 (Hero) and Amon Geoth number 15 (Villain) on 100 Years, 100 Heroes & Villains, the film was number 4 on The 100 Greatest War Films, it was number 3 on 100 Years, 100 Cheers, it was number 9 on 100 Years, 100 Movies, and it was number 9 on The 100 Greatest Films. Outstanding!"},{"username":"rmax304823","userUrl":"https://www.imdb.com/user/ur0819382","reviewLink":"https://www.imdb.com/review/rw1751421","warningSpoilers":true,"date":"23 October 2007","rate":"8","helpful":"32 out of 55 found this helpful.","title":"A moving story.","content":"Steven Spielberg, until the appearance of this film, was rightly noted mainly for his child's view of movies, fast action, easy sentiment, and a generally accurate sense of appeal to fantasy and wish fulfillment. He pretty much discarded that sort of innocence here, without leaving behind his appreciation of the commercial value of a story.It's impossible not to be deeply moved. The extermination program of the Nazis was the most horrific offense to human morality of the 20th century, and one of the worst in history. It wasn't the worst of the slaughters. The two world wars qualified for those honors. It wasn't even the worst example of ethnic cleansing, as it's come to be called. But more than six million Jews and more than seven million other undesirables -- homosexuals, the mentally ill, gypsies, political dissidents -- perished in the camps and not a single Jewish family in Europe went untouched. And it wasn't a war in which the victims were fighting back. It was a deliberate and very thorough act of genocide on the part of a people that Madame de Stael once described as \"a nation of poets and dreamers.\"It's a kind of \"cross-over\" movie in which the protagonist is not Jewish but rather a Christian who comes to their rescue. A basically decent man comes to his senses. This is the formula, whether the despised and abused minority are Jews or African-Americans. If it were otherwise, there would be a danger of this being seen somehow as a \"Jewish\" movie by the unenlightened masses and, as a consequence, might suffer at the box office. Better \"In the Heat of the Night\" than \"Superfly.\" But Spielberg has avoided most of the clichés associated with films of the final solution. No voice overs telling us of the suffering. No stock footage of bull dozers plowing corpses into mass graves. For the most part, the story stays at the personal level. (We hear hardly anything of the progress of the war.) And it's at this level that the film excels, due to the mature script and the performances of Liam Neeson, Ben Kingsley and Ralph Feinnes. There are many other characters, including Embeth Davidtz.The film is good because Neason's character begins not as a racist or a humanitarian but as a moral nihilist. He cares about nothing but money and the sensory pleasures it affords. He couldn't care less about the Jews, or about the Nazis either for that matter. The war to him is just a way of making a profit using cheap labor. And the script rises above the formulaic in not giving him a moment of epiphany. At no point does his brow furrow, his eyes light up, and he thinks to himself, \"My God, what am I doing?\" Nope. Instead, his development is informed by minor but important insights distributed here and there. After the surrender, he leaves the camp as a fugitive, dressed in prison clothes, mourning his carelessness in not saving more lives.Spielberg tells the story in a straightforward way but of course some incidents and dialog from events of fifty years ago must be fabricated. And the fabrications are well done. Especially enjoyable is the touchy, sometimes abrasive, and often humorous relationship between Neason, the salesman and con man who simply has no head for business, and Ben Kingsley as the matter-of-fact accountant who does. I'd give examples of some exchanges but there isn't space.Spielberg hasn't quite gotten over his taste for easy sentimentality. There are only two touches of color in this black-and-white movie. A little girl in a rose-colored coat appears two or three times, so that we can know who it is when her body is wheeled past in a barrow, just another victim. And when the workers hold a ceremony on Shabat, the candle flames are touched with a warm orange that signifies life. Effective, yes, but unnecessary in an adult film like this. Most people watching the film may be trusted to know what's going on without being nudged. But that's small stuff. Somewhat more embarrassing is a scene in which a German officer screams like a maniac and makes gargoyle faces at the camera after emptying his pistol into a mountain of burning bodies. Are we supposed to learn from this that the people running the camps were evil? The Nazi's extermination program prompted many studies in social science, none of which has contributed much to our understanding of why this, and similar programs, seem to be so common around the world. It's easy enough to blame Germany and the SS, but what happened in Kosovo, Maylasia, Cambodia, and Rwanda? Perhaps one of the reasons we've never really understood it is that we don't want to. Perhaps the answer lies not in \"F\" (for \"facism\") scales or ideographic studies of power but in the darkest aspects of human nature itself. Is there a group of people who have nothing in common but their ethnic identity that we ourselves would enjoy seeing wiped off the map? We all have massive cerebral cortices, much of the functions of which seem devoted to damping down impulses from structures lower down on the brain that generate desires to mate, to flee from danger, and to kill things and people that get in our way. Some day science might give us an answer but until then we have to rely on poets like Robert Burns.'Many and sharp the num'rous ills Inwoven with our frame! More pointed still we make ourselves Regret, remorse, and shame! And Man, whose heav'n-erected face The smiles of love adorn, - Man's inhumanity to man Makes countless thousands mourn!"},{"username":"ccthemovieman-1","userUrl":"https://www.imdb.com/user/ur4445210","reviewLink":"https://www.imdb.com/review/rw1553550","warningSpoilers":true,"date":"25 December 2006","rate":"9","helpful":"76 out of 138 found this helpful.","title":"Harrowing, Disturbing & Beautifully Filmed","content":"This isn't much I can add to what hasn't been said or written some dozen years after this was released. It's still one of the most powerful stories ever put on film, mainly because it's based on fact. Since it's Hollywood, you don't know how much of this is true but the Holocaust certainly is and that's enough. The little details don't matter.This movie features extremely good acting by the three leads: Liam Neson, Ralph Fiennes and Ben Kingsley. Fiennes is particularly good as the Nazi villain. He's downright scary and one of the most rotten, despicable human beings ever put on film....but that was the intent. I don't know if his character (or lack of it) was exaggerated since this was made by a famous Jewish filmmaker (Steven Spielberg) who has made the Nazis look as bad as possible in a number of his movie (not that they don't deserve it!). Nonetheless, Fiennes' portrayal of \"Amon Goeth\" is one you'll remember. You'll want to punch this idiot right in the nose.Neeson, in the title role as \"Oskar Schlinder,\" is intriguing as the industrialist who slowly sees immoral things happening that the become too repulsive for him to support. For much of the film, he still isn't a \"good guy\" but he certainly comes around and becomes a hero in the end. Neeson's scene near the conclusion when \"Schindler\" parts with \"his\" Jews at the end of the war is extremely moving. It brings tears to my eyes every time. When he agonizes that \"I could have done more,\" it is something all of us could say and probably will some day. That sentence by him haunted me after each viewing.In addition to the moving story, the black-and-white cinematography in here is magnificent. Not many movies today are made in black-and-white and that's too bad because with today's cameras and knowledge, it can look tremendous. (i.e. \"The Man Who Wasn't There,\" \"Ed Wood,\" etc.) The camera-work helped draw me back to several viewings.A lot of people would not watch this movie a second time and I can't blame them. It's tough to watch. There are some brutal, harrowing, scenes in here with executions, naked people being led to the gas chambers....just some very disturbing scenes. It should be seen at least once, though, by everyone."},{"username":"moonspinner55","userUrl":"https://www.imdb.com/user/ur0989035","reviewLink":"https://www.imdb.com/review/rw1684687","warningSpoilers":false,"date":"1 July 2007","rate":"7","helpful":"12 out of 23 found this helpful.","title":"Courageous film from Spielberg","content":"Holocaust drama from director Steven Spielberg, with an intense, sweeping scope, a brave focus, and also some iconic movie-star gloss, with Liam Neeson lit up and photographed à la Humphrey Bogart in \"Casablanca\". Despite this formulaic style, Neeson is very good playing Oskar Schindler, a decadent member of the Nazi party who nevertheless was a reluctant savior to some 1,100 Jews during WWII when he employed them in his factory, saving them from certain death in Hitler's concentration camps. Spielberg won a Best Director Oscar for the film, and he gets terrific supporting performances from Ben Kingsley, Embeth Davidtz, and most especially Ralph Fiennes as a despicable Nazi commandant. Some of the human terror depicted is frighteningly real, and even though the last act smacks of Hollywood grand-standing, the movie has unlimited power. Winner of seven Oscars in all, including Best Picture. *** from ****"},{"username":"TxMike","userUrl":"https://www.imdb.com/user/ur0438066","reviewLink":"https://www.imdb.com/review/rw0976762","warningSpoilers":false,"date":"12 December 2004","rate":"","helpful":"31 out of 55 found this helpful.","title":"One of the great films of the 20th century.","content":"I'll start with an \"aside.\" What is a \"film\" and what is a \"movie.\" I take the logical stance most of the time, the crew \"films\" so that the director and editor can create a \"movie\". But I have a difficult time thinking of \"Schindler's List\" as a \"movie.\" I didn't watch it to be entertained, no person with a clear vision of the history behind it would. So for me, \"Schindler's List\" is certainly a \"film\", one about a real stain on our human history, a stain placed there solely from religious beliefs. The persecution and attempted extermination of the Jews by the German Nazis.But this \"film\", while its overall subject is the holocaust, is not really about the holocaust. While it revolves around the mistreatment of Jews by the Nazis, it is about the man, Oskar Schindler, played by Liam Neeson. A German, a \"connected\" man in society, he went to Poland and bought a factory, employing cheap Jewish labor, hoping to get rich. He was no humanitarian. But perhaps his biggest weakness, his not being an astute businessman, was responsible for the conversion we see during the course of the three hours running time of the film. He has to rely on a Jew, Itzhak Stern (Ben Kingsley), to run his factory. And the rest, as they say, is history. He changes to the point that he risks his own life to save many, perhaps over 1000, Jews from extermination, no longer for profit but for true humanitarian motives.Unique in this time of modern movie-making, this film is mostly in Black and white. For me this works very well, because first it is such a stark subject and second, there is not so much to distract the viewer from the story. Many consider this Spielberg's best directorial effort, probably because as a Jew it was very personal to him. As a viewer, many times I found it difficult to watch, because the scenes are so realistic. I will never forget the scenes of nude prisoners being marched across the prison grounds to their deaths. I give great credit for this film's place in history, but it is not one that I enjoy watching, it is such a reminder how some can be so cruel to those who should be treated as our brothers and sisters."},{"username":"Quinoa1984","userUrl":"https://www.imdb.com/user/ur0453068","reviewLink":"https://www.imdb.com/review/rw0328118","warningSpoilers":false,"date":"13 February 2000","rate":"10","helpful":"79 out of 144 found this helpful.","title":"One of the Best Films Ever Made. Spielberg's Best","content":"Steven Spielberg has his best masterpiece here with Schindler's list. It is also his most personal work to say the least. And what he brings to the screen is like nothing the world has ever seen before- a true to life depiction of the horror known as the holocaust.The story brings us Oskar Schindler, a German munitions chief who brings thousands of Polish Jews from the death camps to his factory and saves them. The acting is spectacular with Liam Neeson as Schindler, the man who changes throughout the film, Ben Kigsley as Schindler's Jewish accountant (and conscience), and Ralph Fiennes in his best performance yet as the frightening German commander. Along with a frighteningly haunting score by John Williams and great Photography by Janusz Kaminski, Spielberg has created a film that will remain with us forever. Haunting, dramatic and true in the art form, this is one of the best masterpieces of cinema ever made."},{"username":"edwagreen","userUrl":"https://www.imdb.com/user/ur2542703","reviewLink":"https://www.imdb.com/review/rw1325514","warningSpoilers":false,"date":"26 March 2006","rate":"10","helpful":"10 out of 18 found this helpful.","title":"****Superlative Holocaust Film A Treasure.","content":"There are no words adequate enough in the English language to describe this fabulous film.John Williams's musical score is just awesome and with Yitzchak Perlman on the fiddle, what could be better? You are just drawn to the theme of this highly emotionally unforgettable masterpiece.Liam Neeson has never been better as Oskar Schindler, whose \"factory\" saved a thousand Jewish lives during the Holocaust.We see Neeson go through the film as a callous businessman to one of great feeling when he sees what is happening to the Jews of Poland.This was the first black and white film to capture the best picture Oscar since 1960's \"The Apartment.\"Neeson gets tremendous support from Ben Kingsley as his bookkeeper and an amazingly brilliant performance by Ralph Fiennes as Amon Goeth, the Nazi mad-dog official. Fiennes portrayal is absolutely frightening as he steals each scene he is in in this remarkable film.The ending will tear at your heart as those saved place stones on Jewish graves.A positively memorable Holocaust film with memorable detail depicted. The liquidation of the ghetto scenes are a haunting memory to what happened in Nazi occupied Europe.Who can forget the little girl's colored coat as she too becomes a victim of the Nazi genocide? What effect this scene had!"},{"username":"Gordon-11","userUrl":"https://www.imdb.com/user/ur0035842","reviewLink":"https://www.imdb.com/review/rw2143371","warningSpoilers":false,"date":"19 October 2009","rate":"","helpful":"188 out of 204 found this helpful.","title":"A three hour film that feels too short","content":"This film tells the story of Nazi officer Oskar Schindler, who secretly saved hundreds of Jewish people from concentration camps.I have wanted to watch \"Schindler's List\" for years, but could not bring myself to do so because I don't want to be disappointed. \"Schindler's List\" is phenomenally powerful and effective in portraying the historical atrocities. I believe no one can keep their eyes dry from Schindler's List\". The scene involving mothers running after trucks of children is particularly memorable. The final farewell scene is very emotional for me. It is rare achievement, but \"Schindler's List\" is a three hour film that feels too short."},{"username":"Calicodreamin","userUrl":"https://www.imdb.com/user/ur29385135","reviewLink":"https://www.imdb.com/review/rw6030008","warningSpoilers":false,"date":"27 August 2020","rate":"10","helpful":"2 out of 5 found this helpful.","title":"Tragically beautiful","content":"I know no other way to describe this movie than tragically beautiful. The horrors of the holocaust must never be forgotten lest they be repeated. A well made movie in all ways, beautiful cinematography, haunting scoring, and great acting."},{"username":"Theo Robertson","userUrl":"https://www.imdb.com/user/ur1532177","reviewLink":"https://www.imdb.com/review/rw0328517","warningSpoilers":false,"date":"21 May 2003","rate":"7","helpful":"25 out of 101 found this helpful.","title":"The More I See It The Less I Like It","content":"I thought SCHINDLER`S LIST was a masterpiece when I first saw it a few years ago and having seen it again a couple of times over the years I find myself admiring it less and less after each subsequent viewing . This is down to my gut feeling that the film sugarcoats many events , especially the eponymous character . Remember the scene at the end where Oskar Schindler gives away his goldnes parteiabzeichen in order to finance the saving of some more lives ? It`s a very touching scene but in reality this badge would have no value , so how is this explained ? Very easily - The holocaust happened but that scene didn`t. And I find the character interaction somewhat cheesy between Schindler and Stern . It`s like Stern`s manipulating Schindler while Schindler is making it clear that he doesn`t need manipulating because he`s going to save as many human lives as possible . It`s like the film is trying to say only someone who is good by nature can benefit humanity , an almost insulting simplification and rose tinted view of human nature . This is why I enjoyed Ralph Fiennes performance as Amon Goeth so much . He`s a Nazi murderer who shoots woman and kids , but Fiennes plays him not as an inhuman goose stepping monster but as an all too flawed human one ."},{"username":"Doylenf","userUrl":"https://www.imdb.com/user/ur1048771","reviewLink":"https://www.imdb.com/review/rw0328237","warningSpoilers":false,"date":"25 April 2001","rate":"","helpful":"10 out of 17 found this helpful.","title":"Shattering impact...one of the great films of all time!","content":"Words are not enough to describe the overall impact of this powerful film about a profiteer (Liam Neeson as Oskar Schindler) during World War II who uses the Jews as cheap labor in his factory until he decides to save over 1,000 of them from death in the gas chamber. Nor are there enough adjectives to describe the performances--especially Liam Neeson as the enigmatic Schindler, a complex man who ironically becomes a saviour of Jewish souls. Although lengthy, it never once loses tension or interest and the decision to use black and white photography was a wise one, considering that all the war footage in the '40s was seen only in monochrome. Ralph Fiennes gives a masterful performance as the chief Nazi villain and should have won a Best Actor Oscar for his work. The John Williams score has a haunting quality--his main theme is a fascinating example of his uncanny ability to connect with the material he was scoring. As powerful a film as ever emerged about World War II, this film will undoubtedly increase in reputation as the years pass, fully deserving of all the praise it reaps. So real that some of it is difficult to sit through--but no serious minded filmgoer should miss it."},{"username":"dbborroughs","userUrl":"https://www.imdb.com/user/ur3079504","reviewLink":"https://www.imdb.com/review/rw0328578","warningSpoilers":false,"date":"6 March 2004","rate":"6","helpful":"10 out of 27 found this helpful.","title":"Split Personality","content":"To me this story of Schindler is a split personality of a film. On one hand its stark black and white photography and realistic view of life in the ghetto and the camp is a kick in the heart. The problem is what should have been a stark gripping in your face take on the Nazi destruction of those it hated is undercut by a classic MGM 1940's style photography in every other scene. I kept thinking one of the great directors of the period was making this and not Spielberg. To me it has always felt that Spielberg waffled on the subject because he feared what the reaction would be. Its not a bad film, its just not the great one it wants to be."},{"username":"lastliberal","userUrl":"https://www.imdb.com/user/ur2171244","reviewLink":"https://www.imdb.com/review/rw2060753","warningSpoilers":false,"date":"2 May 2009","rate":"10","helpful":"9 out of 15 found this helpful.","title":"I could have got more out. I could have got more. I don't know. If I'd just... I could have got more.","content":"Winner of seven Oscars. it should have won all of the ones it was nominated for. It won a total of 63 awards. has any film won more? The film stands far above the rest and will do so for all time.It was the detritus that was being picked over after the trains left for the camps that really struck me. The pile of photos were especially hard to take. The memories recorded for lifetimes to be consumed by fire.It was after Amon Goeth (Ralph Fiennes) arrived, that Oskar Schindler (Liam Neeson) slowly realized he had something more to do than make money. At least the British film critics and the BAFTA recognized Fiennes performance. It is too bad that Neeson didn't fare as well.Ben Kingsley was also fantastic as Schindler's accountant.A stain on history that will never be forgotten. Impossible to watch with bringing a tear to your eye."}],"errorMessage":""}