{"imDbId":"tt0118799","title":"Life Is Beautiful","fullTitle":"Life Is Beautiful (1997)","type":"Movie","year":"1997","items":[{"username":"MartinHafer","userUrl":"https://www.imdb.com/user/ur2467618","reviewLink":"https://www.imdb.com/review/rw1130490","warningSpoilers":true,"date":"19 July 2005","rate":"10","helpful":"16 out of 24 found this helpful.","title":"funny and disturbing","content":"Before I watched this film, I was a bit hesitant because the basic premise sounds so ridiculous--a man who uses humor and imagination to shield his son from the horrors of the holocaust while in a concentration camp! I mean, how can this movie be funny? Is this another \"Hogan's Heroes\" or what, I thought.Well, first, most of the humor in the film occurs BEFORE the internment. This makes sense and allows the movie to be in good taste. I found myself laughing out loud on many occasions with the silly buffoonery of Benigni as he tries to capture the heart of a woman he keeps \"bumping into\". These moments also abound with charm and seem rather reminiscent of the work of Chaplin--lots of physical humor and charm.The second half of the movie does indeed take place in a prison camp. Occasionally, there were some mildly humorous moments but the goal was not a cheap laugh but were desperate attempts to convince the child that he should not give up hope. Despite the ludicrousness of the plot at this point (hiding a little boy in a men's dormitory in a prison camp), the way they explain it works out perfectly and should not offend or diminish from the horrors that were the holocaust.This film, though VERY cleverly written, was carried by Benigni's marvelous acting. He rightly deserved the Oscar for Best Actor for all his charm, enthusiasm and magnetism."},{"username":"TheLittleSongbird","userUrl":"https://www.imdb.com/user/ur20552756","reviewLink":"https://www.imdb.com/review/rw2176614","warningSpoilers":false,"date":"19 December 2009","rate":"8","helpful":"17 out of 26 found this helpful.","title":"Visually stunning, but uneven. For me the second half was better than the first","content":"Before I eventually saw this film, I was not sure whether I was going to like it or not. While in general it is very highly regarded, there have been those who have said it is overrated or whatever. Just for the record, I did like the movie very much. It is uneven, and there were parts that didn't work as well as intended, but this is a brave and affectionate realisation of life during the Holocaust. I asked myself after watching Life is Beautiful, is it really overrated. Well, maybe a tad, but I can really see why people like this movie.So what didn't make this film perfect? Well, as I have stated at least twice already, it is uneven. And in my humble opinion, the second half was better than the first. I just want to clarify that I didn't hate the first half. Some of it is very funny, but some of the slapstick humour didn't work as well as it should, namely eggs breaking on people's heads. It also works very hard, to provide charm. That is perfectly acceptable, but because there was a lot of charm in the performances and the production values it felt slightly overdone. Though I will say that Benigni's tribute to comedy greats like Charlie Chaplin and Groucho Marx was inspired.The film changes tone to a more poignant, compelling and harrowing second half, that I think was much needed. While the character of Guido \"amusingly\" tries to convince his son Giosue that life in the concentration isn't so bad, the second half's tone has a lot of poignancy. Most notably Guido and Giosue trying to communicate to Dora over the loudspeaker, and the ending did have me in tears.That said, there are a lot of truly good things about Life is Beautiful. For one thing, it is sumptuously filmed. The costumes look amazing and the Italian landscapes look breathtaking. (If there is one place that I would love, love, LOVE to go to it is Italy, not only for the food but for the opera as well.) The story is an effective and affectionate one, about a Jewish man who falls in love with the help of his humour, but has to do the same to protect his son in the Nazi concentration camp. The quality of the script, I saw the Italian version with English subtitles, is thoroughly decent, and hits more than it misses.The performances are excellent in general. Roberto Benigni, one of Italy's favourite funny men, gives a admirable performance. He does overact at times in the first half but he appears a lot more subdued in the second. And I also thought he did a better job acting than he did directing. His direction once or twice in this film was a tad stodgy. Nicoletta Braschi is just stunning as Dora, she looked amazing in this movie and was solid in terms of acting. Giorgio Cantarini didn't always convince as Giosue though, there were times when he comes across as whiny and maybe I am being unfair but I have seen better child performances.All in all, beautiful to watch, and a nice story. It is very pleasant to watch with a compelling and poignant second half, but there are flaws that bring it down from what could have been outstanding to just a film worth watching. 8/10 Bethany Cox"},{"username":"Michael_Elliott","userUrl":"https://www.imdb.com/user/ur13134536","reviewLink":"https://www.imdb.com/review/rw2760273","warningSpoilers":false,"date":"27 February 2013","rate":"","helpful":"2 out of 8 found this helpful.","title":"Clever and Brave","content":"Life is Beautiful (1997) *** 1/2 (out of 4) Oscar-winning mix of comedy and drama centers on Guido (Roberto Benigni), an Italian man who uses his style of humor to win a woman (INicoletta Braschi) he has fallen in love with at the start of WWII. They eventually have a son named Joshua (Giorgio Cantarini) and the three are eventually thrown in a concentration camp where the father uses that same humor to try and protect is son from the horrors of the Holocaust. LIFE IS BEAUTIFUL is a rather unique film because it should have been a complete disaster. I mean, how do you really add laughs to the horror of the Holocaust? Writer-director and Academy Award winner for Best Actor Benigni manages to do just that and it's pretty remarkable what he was able to pull off. The film really does play as two movies with the first half being a romantic comedy and then we're thrown into the drama aspect once we enter the camp and the father must try and protect his son. This is a very far-fetched premise and there's no question that a lot of it is unbelievable but at the same time the film is just so charming and unique that you can't help but fall for it. The majority of the credit has to go to Benigni who manages to pull off a Chaplin by mixing laughs with politics, romance and drama. I was really impressed with his performance and you can see why he won the Oscar. He's so incredibly good no matter what he's doing. This includes the slapstick early in the film, the romance in the middle and of course the toughest job of trying to protect his son. The way the film uses the \"game\" to try and protect the kid was quite clever and you can just feel the urgency in Benigni's performance. Both Braschi and Cantarini are also extremely good in their parts. The movie also gives us a very touching music score that perfectly captures everything we're being offered. I'm not going to ruin the ending but it's incredibly touching in the way it plays out. LIFE IS BEAUTIFUL isn't your typical romance and it's not your typical Holocaust picture, which pretty much means it's very original and quite daring but in the end it works."},{"username":"SnoopyStyle","userUrl":"https://www.imdb.com/user/ur2898520","reviewLink":"https://www.imdb.com/review/rw3159808","warningSpoilers":false,"date":"10 January 2015","rate":"7","helpful":"3 out of 8 found this helpful.","title":"broad slapstick and heartfelt drama","content":"It's 1939 Italy. Jewish Guido (Roberto Benigni) tries to open a bookstore but he continues to face hurdles with a smile. He falls for the lovely Dora (Nicoletta Braschi). She is engaged to an ambitious government official but she runs off with Guido. They get married and have a son named Joshua. The fascists would catch up to them but Guido would pretend the camp to be a giant game so that he can hide the truth from his son.Roberto Benigni is going for extremely broad comedy here which turns eventually. The movie is always a bit odd to have slapstick comedy while the audience knows perfectly well what is happening. It makes the movie unfunny. The movie is much more compelling as a heartfelt drama."},{"username":"Kirpianuscus","userUrl":"https://www.imdb.com/user/ur61197531","reviewLink":"https://www.imdb.com/review/rw3327959","warningSpoilers":false,"date":"3 October 2015","rate":"","helpful":"1 out of 5 found this helpful.","title":"different","content":"about Shoah. in different manner. about human basic emotions, feelings and expectations. in a manner who reminds small things in a simple- seductive manner. the result - a film about a tragedy who reminds the essence of family, the delicacy of a parent for protect his child, the frame of life as survive, the joy who is axis of hope in the hard times. a film about the beauty of humor, about war as fog. sure, it is a Benigni. nothing different by other his films. same old fashion tricks, same jokes, same melancholy who preserves drops from Chaplin. but in this case, something is different - the courage and the science and the fine balance between a dark subject and art to give to it a surprising nuance. the story is the same. but the precise dose of humor gives new senses. ."},{"username":"classicsoncall","userUrl":"https://www.imdb.com/user/ur2707735","reviewLink":"https://www.imdb.com/review/rw3155471","warningSpoilers":true,"date":"4 January 2015","rate":"9","helpful":"4 out of 7 found this helpful.","title":"\"Nothing is more necessary than the unnecessary\".","content":"Remember when Roberto Benigni's name was announced as winner of the Best Actor Oscar? He was literally jumping out of his skin to be declared the winner. It perfectly resonated with the character he portrayed in \"Life is Beautiful\". Now I understand why he was so excited, as I hadn't seen the film until now.Not knowing anything about the story, I thought the first half of the movie was wonderfully whimsical and creative, especially with the way Guido managed to manipulate outcomes in his quest to win Dora (Nicoletta Braschi). The writing for these sequences was genuinely inspired with priceless comic touches that warm the heart. The Prince wins his Princess and all is well in the world.I wasn't quite sure how to process events in the second half of the movie, knowing that such antics as displayed by Guido could certainly never have occurred in a Nazi concentration camp. But I kept coming back to an early statement Uncle Elisio (Giustino Dorano) made to Guido quoted in my summary line above. Perhaps the second half of the film is totally unrealistic, but it was necessary for the film makers to get away with this technique to make their case for finding and keeping hope in an impossible situation. Not only did Guido insure that his young son Joshua (Giorgio Canterini) would survive the ordeal, but actually flourish in a hostile environment until the war ended.If I had my preference, Guido would have survived the concentration camp as well since this is a fictional story. But perhaps it's better that some heartbreak was mingled with the joy of Joshua reuniting with his mother. The ending reinforces the idea that joy and sorrow both exist in the world for everyone in different degrees and at different times and that life is not a hopeless condition. Rather a journey to be lived to the fullest with freedom secure in one's own heart."},{"username":"lee_eisenberg","userUrl":"https://www.imdb.com/user/ur4888011","reviewLink":"https://www.imdb.com/review/rw1125021","warningSpoilers":true,"date":"12 July 2005","rate":"10","helpful":"12 out of 19 found this helpful.","title":"Roberto Benigni is a GENIUS","content":"\"Life is Beautiful\" is more than a masterpiece. It is possibly THE most incredibly wonderful movie that exists. Guido Orefice (Roberto Benigni) is a Jewish waiter in 1930s Italy. He has managed to hide his ethnic background, although he is fully aware of the anti-Semitism around him (one man has sons named Adolf and Benito). To counter Mussolini's nationalism, he goes to a school to \"prove\" that the Italians are a superior race: he shows off his bellybutton. After some flings with \"principesa\" Dora (Nicoletta Braschi), the two of them get married and have a son named Giosue (called Joshua in the subtitles).A few years later, the Nazis are rounding up all the Jews in town, including Guido and Giosue (Dora demands to be taken also). But Guido has the most imaginative plan: he tells Giosue that they are playing a game. In what may be the movie's most surprising scene, they enter a barracks where everyone is wearing those suits that we've seen in footage of concentration camps, and Guido \"translates\" for the Nazi guard: he announces how they are participating in this game to see who can get the most points, and you lose points for being a crybaby, asking to see your mommy, or asking for food. You are quite literally assuming that he can't pull it off, but he does masterfully.Throughout the whole movie, you keep expecting that he's eventually going to go over the edge, but he never does. \"Life is Beautiful\" is more than beautiful. Benigni's Oscars for Best Actor and Best Foreign Language Film were probably the most well-deserved Oscars in recent years. If you ask me, the movie should have won Best Picture, and every other possible Oscar. It is a work of pure genius."},{"username":"gavin6942","userUrl":"https://www.imdb.com/user/ur1234929","reviewLink":"https://www.imdb.com/review/rw3122533","warningSpoilers":false,"date":"12 November 2014","rate":"7","helpful":"0 out of 4 found this helpful.","title":"Oddly Irreverent","content":"A Jewish man (Roberto Benigni) has a wonderful romance with the help of his humor, but must use that same quality to protect his son (Giorgio Cantarini) in a Nazi death camp.Roger Ebert wrote, \"At Cannes, it offended some left-wing critics with its use of humor in connection with the Holocaust. What may be most offensive to both wings is its sidestepping of politics in favor of simple human ingenuity. The film finds the right notes to negotiate its delicate subject matter.\" Indeed, this is he most striking thing about this film (from its opening mocking the arm-outstretched salute), just how much it refuses to take anything seriously.In that respect, it is a response to \"Schindler's List\", even if not intended to be. Sometimes in the face of evil, you just have to laugh, and Benigni takes that approach."},{"username":"jboothmillard","userUrl":"https://www.imdb.com/user/ur4248714","reviewLink":"https://www.imdb.com/review/rw1854523","warningSpoilers":true,"date":"9 April 2008","rate":"7","helpful":"1 out of 9 found this helpful.","title":"Life Is Beautiful","content":"I mainly heard of this film from a trailer, and the fact that the leading actor won the Academy Award instead of Tom Hanks in Saving Private Ryan, and he certainly deserved it! He also directs the film, but lost the Oscar to Steven Spielberg, I think he's much more compelling as the actor. Set in the 1930's Italy, the first hour of the story sees friendly Jewish book keeper Guido Orefice (Oscar and BAFTA winning (for acting) actor, writer and director Roberto Benigni) having a fairytale romance. Using his cunning wit he wins over Italian school teacher Dora (Nicoletta Braschi) who was set to marry another guy. He basically makes it out like he is a prince who has found his \"Princess\", and getting the timing right he always shows up, making her smile, until she gives in. Years later Guido and Dora are living together with Guido's Uncle Eliseo (Giustino Durano), and they have a 5-year-old son, Giosué (Giorgio Cantarini), and they all seem happy. I thought the whole film was going to be a happy and charming comedy throughout, but I was wrong. It becomes a gripping drama when Guido and his son are arrested by the Germans and taken away to a concentration camp, with Dora demanding she go too. They are split, but Guido with Giosué wants to protect him from the horrible truth, so Guido tells his son that this is a holiday, and a big game where he has to get 1000 points to win a tank and leave. This lie seems to be very convincing as some of the prisoners and the Germans go the way that Guido expects, and his son does not suspect anything, even with the near catches. When Guido tells Giosué he has 1000 points, he makes him hide while he tries to escape and find Dora, but he is caught, and sadly killed. Thankfully though, Giosué comes out of hiding, a tank really does come with an American (the only English spoken in the film) soldier driving to take him, and he finds his mother Dora, both a tragic and happy ending together. Also starring Sergio Bini Bustric as Ferruccio Papini, Marisa Paredes as Dora's mother, Madre Di Dora; Horst Buchholz as Doctor Lessing, Lidia Alfonsi as Guicciardini and Giuliana Lojodice as School Principal/Headmistress. Real life comedian Benigni is fantastic being funny in the first hour, but also very compelling as a serious actor in the realistic concentration camp environment. Both a great funny film, and a great dramatic film, just a great Italian film. It won the Oscar for Best Foreign Language Film and Best Music for Nicola Piovani, and it was nominated for Best Picture, Best Film Editing and Best Writing, Screenplay Written Directly for the Screen, and it was nominated the BAFTAs for Best Film not in the English Language and Best Original Screenplay. It was number 56 on The 100 Greatest War Films. Very good!"},{"username":"ccthemovieman-1","userUrl":"https://www.imdb.com/user/ur4445210","reviewLink":"https://www.imdb.com/review/rw1302060","warningSpoilers":false,"date":"27 February 2006","rate":"8","helpful":"14 out of 28 found this helpful.","title":"Dramatic Turnaround Makes It Unforgettable","content":"I first saw this in a movie theater when it came out, and I discovered later it didn't remotely compare to watching it on DVD. The latter is a far better experience.It's spectacularly filmed, one of the better looking movies you will see on DVD: sharp as a tack and gorgeous, something a big screen kind of makes fuzzy. I found that more attractive than the story, even if it is a good one and one that you never forget.Few films have changed gears as dramatically as this one. The first half is a slapstick comedy-romance featuring the goofy Roberto Benigni, a hyperactive Italian who successfully woos a woman he accidentally meets one day. About 35 percent of this part in the film is clever and funny and the rest, kind of stupid....but not annoying. The only aspect that grows tiresome is Benigni's motormouth, which is always going and is just too much to bear after awhile. The guy wears you out, listening to him!The second half of the story jumps ahead to about 5-7 years later when Benigni and his girlfriend are now wed and have a little boy. Being Jewish, the man and his boy are then taken away from his little town to a concentration camp by the Nazis. The wife voluntarily goes, just to be with the other two. The rest of the movie shows how the father protects his son by pretending it's all a game. The second half, of course, is what most of us remember best and is very inspiring, a haunting tale with a few scenes that stay in your memory.On DVD you have the option of Italian with English subtitles or a dubbed version. Since the visuals are so good and the dubbing is expertly done, I would recommend that. It's a cliché but, this is an \"unforgettable story.\""},{"username":"ma-cortes","userUrl":"https://www.imdb.com/user/ur3270789","reviewLink":"https://www.imdb.com/review/rw2714606","warningSpoilers":false,"date":"4 December 2012","rate":"8","helpful":"17 out of 28 found this helpful.","title":"Marvelous tale about a likable Jewish protecting his son and wife from horrifying concentration camp","content":"Wonderful fable plenty of amazing fantasy, lively comedy and sad tragedy . This is a poignant and moving fable about a sacrifice to save a son and a wife . It's an unforgettable story formed by two halves that proves imagination, family and love conquer all ; as Benigni's focus is on the love between daddy , mummy and son . The first part results to be an Italian comedy style , the second is horror along with humor . It concerns upon Guido (Roberto Benigni, a magnificent rubber-faced funny man), a Jewish man who has a wonderful romance with the help of his humour, but must use that same quality to protect his son in a Nazi death camp . He's a madcap romantic man and women wish him . But he falls in love with Dora (Benigni's real-life sweetie Nicoletta Braschi). Every day Guido dreams of marrying her , under Nicola Piovani score . When the Second World War spontaneously breaks out , he and his family is imprisoned at concentration camp . Guido is determined to save his lover and son (Cantarini) from dangers around them . His effort sometimes is pure fantasy , though with ruse he pull off more impetus to keep his son and accomplishes feats no man could realistically execute . Guido fabricates an elaborated game to convince his child that the whole ordeal is an endurance proof to be won with prizes forthcoming , as it turns out to be a special contest to win a tank.This is a story about love , war and sacrifice , well starred and directed by Roberto Benigni who develops a fire-line between comedy and tragedy . Inventive gags and wacky humor are splendidly proceeded . At first consideration , the theme of a feel-good holocaust comedy war was a non-sense . However , Benigni doesn't describe a holocaust film but rather a tale of endurance of family love . Benigni tirelessly maintains the humorous ingenuity, even as the horror war escalates. Actor and director Benigni shapes simultaneously haunting and hilarious comedy out of the tragedy of Nazi concentration camp . In a especially humorous scene , Guido translates a guard's barking at the inmates as furthers clarification of the rules of game . The picture is divided into two parts , the first half deals with an entertaining boy-meets-girl tale , a light-weight comedy in which Guido relentlessly pursues Dora ; the second half shifts and depicts the horrors of the concentration camps . Good support cast formed by notorious secondaries as the Spanish Marisa Paredes , Lidia Alfonsi and Horst Buchhold as a Nazi doctor . The film displays an emotive musical score by Nicola Piovani, who deservedly had Oscar winner . Furthermore , it won Academy Award to Foreign film and of course to Benigni ; Roberto Benigni's Oscar for best actor marked only the second time that an actor had directed himself in an Academy Award winning performance , the other was Laurence Olivier for Hamlet . Colorful and glamorous cinematography by Tonino Delli Colli . Effective and appropriate production design by the veteran Danilo Donati . The motion picture was marvelously directed by Benigni. He's a good comedy director (Monster, Johnny Toothpick, Little devil) with some flop (Pinoccio) and usual actor for Jim Jarmusch (Coffee and cigarettes, Night of Earth, Down by law). Rating : Better than average . Well worth seeing ."},{"username":"Quinoa1984","userUrl":"https://www.imdb.com/user/ur0453068","reviewLink":"https://www.imdb.com/review/rw0409196","warningSpoilers":true,"date":"11 May 2000","rate":"7","helpful":"1 out of 9 found this helpful.","title":"One of the best film ever on the holocaust","content":"(Spoilers Ahead)Though Schindler's List is the best film on the horror that was the holocaust, Life Is Beautiful (La Vita e Bella in Italian) is way up there. And I enjoyed it. Especially because the film doesn't completely circle around the concentration camp, just half of it. Half of the film surrounds Guido Orefice (Roberto Benigni won a well deserved best actor Oscar as Guido, along with a second Oscar for best Foreign film as director and writer) as a Italian-Jewish waiter who is in love with a \"princess\". This half has more of the comedy than drama, but the second half is melodramatic as Guido has a son now with his princess and they are taken to a concentration camp. But so to shield his son from the horrors, he makes a game the two can play as their ordeal unfolds. Very original, and very well done, with Benigni acting now aa a Italian version of Charlie Chaplin. Excellent all around. A+"},{"username":"edwagreen","userUrl":"https://www.imdb.com/user/ur2542703","reviewLink":"https://www.imdb.com/review/rw1265767","warningSpoilers":false,"date":"15 January 2006","rate":"10","helpful":"7 out of 15 found this helpful.","title":"Life Can Certainly Be Beautiful ****","content":"A positive outlook on life during such adversity, this is the central theme of the excellent holocaust film \"Life is Beautiful.\"Roberto Benigni was voted best actor by the Motion Picture Academy for his portrayal of a Jewish man, who when imprisoned by the Germans during World War 11, tried desperately to rid his young child of fears by making a game out of the holocaust.The film begins with the very funny courtship of Benigni and his wife, who is not Jewish.Horst Buccholz, so young and charming in \"Fanny\" appears as an Italian army official. They years have matured Buccholz. It was sad reading of his passing a few years after this marvelous film came out.The scenery is breath taking and Benigni alternates his feelings in a terrific comedy-drama performance.Just as liberation appears to be imminent, Benigni is shot by the Germans. Unaware of his father's death, the son will carry on in his tradition. His ride on the tank will bring a tear to your eyes.A moving and endearing film, not to be missed."},{"username":"Theo Robertson","userUrl":"https://www.imdb.com/user/ur1532177","reviewLink":"https://www.imdb.com/review/rw0409483","warningSpoilers":false,"date":"18 May 2004","rate":"6","helpful":"31 out of 78 found this helpful.","title":"Hidously Overrated","content":"I know little about the acting career of Roberto Benigni but I was told by a famous film tutor ( Who`s Jewish by the way ) that Benigni plays more or less the same character in every single film he appears in and I have no doubt this is true And after seeing his performance as Guido in LIFE IS BEAUTIFUL and seeing Benigni clamber over several rows of seats to accept the Oscar as best actor I can`t help thinking Benigni is unable to play ANY character that ISN`T Roberto Benigni This film is about the holocaust - The greatest example of mans inhumanity to man - and that`s why it`s undeservedly well regarded . The scenes in the concentration camp are touching sad and funny as Guido explains to his son Giosue that they`re actually taking part in a contest to win a tank , but it also means sitting through a whole lot of irritating dross featuring Guido wooing his Princess . In fact the whole first half of LIFE IS BEAUTIFUL ( Written , directed , produced by and starring Roberto Benigni ) is an ordeal to sit through unless you`re a fan of Benigni . To be blunt if anyone deserved an Oscar it was Giorgio Cantarini as Best Supporting Actor as Giosue who gives perhaps the most memorable performance by a child actor I have ever seen To be even more blunt I`m getting fed up with both holocaust films and the way they`re over rewarded at film award ceremonies . If you want to know about the horrors and dangers facing Jews and wider human civilisation go and watch one of Pierre Rehov`s documentaries which are often held at Jewish cinema festivals where after the screenings security guards have to check under the seats to make sure no one has left a bomb for the next audience sitting , or access a website featuring a young self employed Jewish man called Nick Berg who went to Iraq to help with the reconstruction and where he was captured by Islamic terrorists who then brutally murder him by holding him on the ground and slowly hack his head off with a knife . Not praising LIFE IS BEAUTIFUL or indeed any holocaust movie is not anti semetism"},{"username":"Doylenf","userUrl":"https://www.imdb.com/user/ur1048771","reviewLink":"https://www.imdb.com/review/rw1534798","warningSpoilers":false,"date":"1 December 2006","rate":"8","helpful":"4 out of 9 found this helpful.","title":"Artful blend of tragedy and comedy is a testimony to the human spirit...","content":"If someone had told me that a genuinely moving story of a Jewish father and son who end up in a German concentration camp could manage to sustain such an artful blend of humor and tragedy, I wouldn't believe them. Then again, think of the popular success Americans have seen on TV in the shape of the enormously successful comedy HOGAN'S HEROES which takes place in a prison camp. Or the bittersweet irony of Billy Wilder's STALAG 17 with its blend of comedy and drama.But what ROBERTO BENIGNI has accomplished here surpasses all expectations on just how extraordinary this sort of material can be when executed with such wit, wisdom and humor and--even more importantly--without offending anyone with such controversial subject matter.The first part of the film is full of abundant humor as it chronicles the romance of the Jewish man and his sweetheart. Midway the tone of the film shifts to a darker element as the man, his wife and the young son are placed in a concentration camp. The husband is so determined that his son will be shielded from the stark realities around them that he pretends it's all a game. Benigni is a man of such irrepressible spirit that it makes the film's ending even more poignant.He deservedly won the Best Actor Oscar in '97 and the film itself was voted Best Foreign Film. The delightful score by Nicola Piovani won still another Oscar.Summing up: A fable, delightfully written and produced with an unforgettable performance by Roberto Benigni. Who can forget his joy on Oscar night when he bounded over the tops of seats to reach the stage and accept his Oscar?"},{"username":"writers_reign","userUrl":"https://www.imdb.com/user/ur2567136","reviewLink":"https://www.imdb.com/review/rw2621412","warningSpoilers":true,"date":"3 June 2012","rate":"9","helpful":"1 out of 4 found this helpful.","title":"Wilder Untamed","content":"In 1960 Billy Wilder wrote and directed The Apartment, a film that started off as satiric comedy, switched halfway through to drama yet finished happily. Imagine if Shirley MacLaine's suicide attempt had succeeded what kind of film The Apartment would have been; answer, something akin to Roberto Begnini's Life Is Beautiful, a film that starts off as a romantic comedy, segues to drama roughly half way, does have one tragic consequence yet ends happily when a mother and child are reunited. Even whilst watching some of the situations are improbable in the extreme - to take just one, the scene where the son wants to go home and the father says okay, let's go, we'll lose the tank but what the hey. He actually opens the door of the barracks and motions the boy to come forward whereas in reality the door would have been locked and guarded. This is the sort of thing you need to accept if you are to embrace this fine movie and you should embrace it, you really should."},{"username":"Boba_Fett1138","userUrl":"https://www.imdb.com/user/ur1416505","reviewLink":"https://www.imdb.com/review/rw1650244","warningSpoilers":true,"date":"6 May 2007","rate":"7","helpful":"8 out of 15 found this helpful.","title":"Not an entirely effective movie, that still is a good watch.","content":"Having heard nothing but positive about this movie, I must admit that I was slightly disappointed by the movie. The movie is not the effective and emotional involving concentration camp movie it promised to be, which is due to some poor choices of storytelling and its approach. But of course nevertheless this movie is way better than the just average movie regarding the subject and the movie still manages to be effective on most of its fronts, just not on the most important ones.The main problem with the movie is that it can be divided into two separate parts. In the first part of the movie 'life is wonderful' and everything is perfect and the story is told almost fairytale like, with a dreamy like love-story and lots of slapstick-comedy in it. It's just too perfect and happy all, which really doesn't make the movie believable. Yes, I of course realize that this was done on purpose to make the contrast of the second halve of the movie that is set in a concentration camp all the more bigger. It's almost like; no matter what we are going to show in the second halve, it's always going to look worse and more horrible compared to the 'happy' perfect-life first part of the movie. It felt like a really cheap way to steer the viewer's emotions. And let's face it, nothing really bad actually ever happens in the second halve For example; correct me if I'm wrong but we never get to see anyone get killed on screen. And all of the prisoners could walk around freely it seemed and the way the story was told made it seems as if they were in the camp for only two days or so. We never get to see any of the WW II cruelty which occurred in these sort of concentrations camp at the time of the war, with the exception of two or three sequences, which just isn't quite good and effective enough for such a sort of movie that tries to get the viewers emotional involved with the characters and events that occur in this movie. Also the fact that the mother was on the other side of the concentration camp gets highly underused and underdeveloped. They could had really made the movie more effective and emotional with this plot element.Also the comedy of the movie was far too slapstick like for a movie with such an heavy subject. It for me was the reason why I enjoyed watching the movie but yet just never got emotionally involved with it. Roberto Benigni is a clown, not an actor! But yet he won an Oscar for his role in this movie. Sorry, can't say I'm really a fan of him. Too much jumping around and shouting and not enough structured acted out humor, though he shows he's a competent director with this movie. Despite taking some not so effective approaches, the movie is still well structured and directed.It's rather cute that Bengini and his wife Nicoletta Braschi always appear together in movies but I'm sorry to say that Nicoletta Braschi just isn't the greatest actress around,, to put it mildly. It's also always dangerous to have a young kid play one of the other main characters of the movie. Giorgio Cantarini does an effective job with looking cute and Innocent at all but he also looked a bit too much to the things going on behind the camera's during sequences, as if he wasn't focused enough on the actual filming process. This was getting a bit disturbing after a while, especially in some of the sequences toward the end of the movie, which are the most heavy moments of the movie. I admire the approach the story picks when the movie gets set in a concentration camp, when the father is coming up with all kinds of things to make his young son believe they are in some sort of holiday camp, instead of a concentration camp. Truth gets mixed up with fiction in the movie, which provides the movie with some good moments. It's perhaps the best and most interesting idea of the movie, which certainly helps to make this movie an unique one. The movie is really good looking, which is of course mostly due to the Italian settings of the movie but the movie also does a good job at re-capturing the '40's period, in terms of costumes, sets and props. The movie is most definitely not a cheap-looking one, which perhaps is the case with most other European productions, especially the ones regarding the same subject and time period.The movie was one of the big surprises of 1997 and was also nominated for 7 Oscar's, also including the ones for best movie, best directing and best screenplay. The movie eventually took home 3 statues for actor in a leading role, best foreign language movie and best music.I was overall slightly disappointed by the movie but my expectations for it were perhaps a bit too high.7/10http://bobafett1138.blogspot.com/"},{"username":"bombersflyup","userUrl":"https://www.imdb.com/user/ur25775215","reviewLink":"https://www.imdb.com/review/rw5000492","warningSpoilers":true,"date":"17 July 2019","rate":"8","helpful":"1 out of 4 found this helpful.","title":"Worthwhile foreign film.","content":"Life is beautiful is a one of kind film, with funny moments and beautiful moments.It's enthralling and rich in feeling, but also hasn't much depth. I agree that it doesn't capture the torment on any level, but it's a film so it doesn't have to and it's labelled a comedy after all. Benigni plays part goof, part heroic sort of genius, but the film doesn't work without Dora's magnetic presence. All the moving moments involve Braschi as well."},{"username":"TBJCSKCNRRQTreviews","userUrl":"https://www.imdb.com/user/ur2093818","reviewLink":"https://www.imdb.com/review/rw1015107","warningSpoilers":false,"date":"6 February 2005","rate":"9","helpful":"39 out of 68 found this helpful.","title":"A beautiful film... but not an entirely perfect one","content":"When I first saw this film, I was told up front that the first full hour of the film, the first half, was all slapstick comedy and character development, and that the second half was more serious and important. I prepared myself mentally for the first half, but I was still surprised by how annoying the gags and jokes were. We're talking cake-in-face, fall-over, slip-on-banana humor. For one full hour. At the end of the first half of this film, I was thinking \"this had better get better very soon...\" And it did. Right then and there. From the very beginning of the second half, the serious mood enters. And it doesn't take long for even the most average minded viewer to realize that the first half of humor and character development was important. It was important for us to ease into a less tense mood, to make the important subject strike even harder, and for us to get to know the characters, to make us care more about what happens to them. I've just finished seeing it for the second time, and I've come to realize that this film is not entirely perfect, as I felt just after seeing it through first time. It does have its flaws, though there aren't many of them. The first half, and some parts of the second half, are heavy on humor, which some will mistake for making fun of the subject(which is almost a crime), or trying to make it seem less important. I don't believe this to be true, it's just a retelling with a more positive message; yes, people do horrible, inhumane things sometimes... but after all, there is beauty, too. The first half will also deter some viewers who will enjoy the second half much more. The plot is very good, though slightly unrealistic. The acting is pretty much all flawless, even in the child actors. The characters are well-written and interesting. The humor is more acceptable in the second part, because it's more toned down and not trying way too hard to get a quick laugh out of the audience. All in all, a great film which anyone and everyone should see at least once during their life... you'll laugh, you'll cry, you'll realize that, in the end, Life Is Beautiful. I recommend this to just about anyone, but I know that not everyone will enjoy it equally. A near-perfect film. Keep watching past the first half... you won't regret it. 9/10"},{"username":"evanston_dad","userUrl":"https://www.imdb.com/user/ur4532636","reviewLink":"https://www.imdb.com/review/rw2267537","warningSpoilers":false,"date":"21 June 2010","rate":"2","helpful":"10 out of 25 found this helpful.","title":"Paging Mel Brooks....","content":"Ugh! Roberto Benigni's attempts to use Chaplin-style humor as a balm to soothe nightmares about the Holocaust make a mockery of both him and the historical events his film depicts.I'm not offended by the humor itself -- Mel Brooks proved that you can make Nazis funny. My problem with this movie is that the humor is done badly; Benigni is irritating and painfully unfunny. And when the film isn't trying to be a comedy, it's unbearably maudlin and sentimental.\"Life Is Beautiful,\" like \"Cinema Paradiso,\" is a foreign film for people who otherwise never watch foreign films.It's got a nice score, I'll give it that.Grade: D"},{"username":"Sylviastel","userUrl":"https://www.imdb.com/user/ur0033913","reviewLink":"https://www.imdb.com/review/rw0409336","warningSpoilers":false,"date":"19 February 2002","rate":"10","helpful":"2 out of 6 found this helpful.","title":"life is beautiful","content":"This is a a great film and a beautiful love story between man and woman forgotten over recent film-making. Bellini shows a difficult story with humor and grace that even most people can relate too. When Guido finally gets his princess, their happiness is disturbed by the concentration camps and the Holocaust. Even Bellini brings necessary humor to comfort his only son from the evil of war. It's a heart-breaking film with Roberto playing the main character, his real-life wife plays his wife on screen in this film and often in others as his love interest. The little boy who plays his son is also wonderful. The film itself is a visual beauty to watch at first. It makes you want to pack up and head to Rome."},{"username":"Vincentiu","userUrl":"https://www.imdb.com/user/ur13017201","reviewLink":"https://www.imdb.com/review/rw2767334","warningSpoilers":false,"date":"14 March 2013","rate":"","helpful":"0 out of 4 found this helpful.","title":"parable","content":"a touching parable. honest, sad, delicate, full of a kind of humor who remains the circus show. because its heart is ordinary life. as seed of joy. as support of miracle. the Nazi menace is only one room. but each existence - puzzle of situations - is scene for this story. sure, Italian spirit is unique. and the art of a special director makes difference. but this is secret. it is not version but another side of Train de vie. another lesson about force of survive as flower of profound hope. as metamorphose of war as silly demon. as definition of courage. as circle of courage to be more than a character of your life. a film like a sparkle. light, fire, magic. and the dark as fiction."},{"username":"=G=","userUrl":"https://www.imdb.com/user/ur0783721","reviewLink":"https://www.imdb.com/review/rw0409259","warningSpoilers":false,"date":"22 December 2000","rate":"8","helpful":"0 out of 5 found this helpful.","title":"A elephant of a film.","content":"Much has been written about \"Life Is Beautiful\" and there can be no doubt it has touched many viewers is a very positive way. However, everything about this film from sets to acting to costuming, etc. is good but certainly not worthy of most of the tribute paid it. What is unique about this film is the story and the tender way it touches the heart. Not satire, not drama, not comedy, \"La Vita e Bella\" is farce. Grand and extraordinary farce which could well make the Bard himself take notice. Just as the blind men feeling the elephant each had a different interpretation of the beast, so will viewers each have a different interpretation of this film. However, one cannot escape the fact that this is a elephant of a film."},{"username":"ElMaruecan82","userUrl":"https://www.imdb.com/user/ur4234119","reviewLink":"https://www.imdb.com/review/rw2519644","warningSpoilers":true,"date":"17 November 2011","rate":"10","helpful":"3 out of 7 found this helpful.","title":"When sometimes, it's worth risking losing life not to lose the very faith in life ...","content":"\"Life is Beautiful\" divide opinions in the most extreme ways, either you love or hate it. It's famous or infamous for having depicted the 'Holocaust' from the perspective of a father who wants to get the Nazi atrocities off the sight of his five-year old son, Josue. Guido would pretend that everything is a game, and Nazis only rhyme with baddies which Josue must hide from and follow his Dad's instructions to win the 1000-point prize: a real tank.We live the horror of the concentration camp from both Guido and Josue's point of view in a bittersweet duality of death and life, sorrow and smile, survival and fun. It's certainly the gutsiest screenplay ever written for the parallel it traced between one of the most horrifying historical events and its translation as a game. And I can't understand why many people fail to ignore the point of Guido's actions. I love what Ebert said about the film: if Guido had weapons, he would have shot the enemy, if he had an Army, he would have wipe the Nazis out but all he had is what his Ancestors called in Latin, 'Vis Comica' (comical force). The film divides and is divided in two parts. The first is set during Italy's fascist days where we meet in a sunny and joyful ambiance a modern clown named Guido Orefice (Roberto Benigni), a character that immediately touches your heart, a man with a communicative appetite for life and laughs: the epitomes of his personal philosophy wonderfully conveyed by Nicola Piovani's score. The delightful lightness of life resonates like Nino Rota's music from Fellini's neo-realistic period. The whole film carries many references to Italian cinema's heritage, the sight of Guido and Dora (Nicoletta Braschi) romantically riding the bike reminds of Rizzi and his wife in the \"Bicycle Thief\" -when the bicycle meant new hopes for the Family- and like De Sica's masterpiece, the film's second part focuses on a poignant father-and-son relationship.\"La Vita e Bella\": even the title is a sort of emphasis on \"La Dolce Vita\", as if sweet was too feeble a word to describe the inner value of life. Indeed, it takes some real genius to embrace life with such a never-ending optimism, Guido is the perfect antidote against the venomous effect of desperation and he's so convincing that he manages to seduce the beautiful Dora (Nicoletta Braschi), promised to marry a Fascist civil servant... until Guido comes and takes her away like a Charming Prince. The whole first act has the feeling of a fairy tale where we discover Guido, his uncle Eliseo and his German Doctor friend with whom he likes to play riddles. The film begins with a comedic triumph that consecrates Benigni as a modern Chaplin, with the foreshadowing of coming tears when we learn that Guido is Jewish.The change of mood from the second act is so abrupt that it accentuates the feeling of discomfort. Cinematically speaking, \"Schindler's List\"' is a superior film but we expect a movie with dark and unbearable scenes, we're like mentally prepared. In \"Life is Beautiful\", it catches us off-guard: after so many laughs, there is a long dramatic transition that even Guido's admirable nerves can't hide. We all know what would happen to Uncle Eliseo when he goes to the 'shower', and the moment when he prevents the Nazi woman officer from falling creates a tragically ironic situation. In the Camp's women section, a little gray cat goes around a pile of women's clothes lying on the floor while he was held earlier by a little girl on the trunk that send the Jews to the train station ...That part is difficult to watch and we're almost glad when laughs are back, when Guido translates the instructions barked by a fat Nazi officer: pure comedic genius! We prefer to see the horror from Josue's view not as a denial, but as a ferocious attachment to the idea of no matter the adversity we face and hardship we endure, while there's life, there's hope; and Josue is the incarnation of this hope for Guido. And when Guido meets the German doctor and tries to seek his help in the Camp, the Doctor's answer leaves Guido shocked and appalled. His face of disbelief is the proof, that Guido is not acting as a clown, all his smiles, games and plays are for Josue.It's all about Josue indeed, and it's certainly with him in mind that Dora, though a gentile, sacrificed her freedom for the camp. In of these ironical twists, Guido would lose his life by trying to find Dora, and knowing his son is watching him, he walks in a comical way before being shot off-screen, off Josue's sight, the gunshots were one of the most disturbing sounds I've ever heard in a film. The day after, Josue would finally win the tank and find his mother; his scream of joy in his Dora's arm is not just the triumph of Guido's sacrifice, but the triumph of hope. And God how I cried in that scene Why do some clever users seem eager to shortcut their emotional reactions in the name of cold rationalism? I'm less questioning their intelligence than their ability to think beyond their intelligence. After all, when the same side says \"Not another movie about the Holocaust!' and \"The movie trivializes (or sugarcoats) the Holocaust\", maybe we should consider that the greatness of Roberto Benigni's Oscar-winning film relies somewhere between these two interpretations. To challenge Guido's legendary optimism and faith in life, \"Life is Beautiful\" needed one hell of a tragedy.\"A picture with a smile-and perhaps, a tear.\" said a too modest Chaplin about his masterpiece \"The Kid\". And after watching \"Life is Beautiful\", no matter how many smiles, how many laughs and how many tears Roberto Benigni expected me to experience I know I lost track."},{"username":"paul2001sw-1","userUrl":"https://www.imdb.com/user/ur2082018","reviewLink":"https://www.imdb.com/review/rw0409486","warningSpoilers":false,"date":"23 May 2004","rate":"8","helpful":"4 out of 8 found this helpful.","title":"Almost beautiful","content":"Roberto Benigni, the Italian Chaplin, has made, in 'Life is Beautiful', a comedy about the holocaust. Which first begs the question: is it acceptable to do such a thing? To which the answer must be \"yes\". Often the best (and most unsettling) comedy is the blackest, in which the intertwining of the funny and the tragic makes us consider afresh the absurdity of life and death. And the holocaust, sadly, was horrific precisely because by the fact that it happened it proved that such events do fall within the range of human behaviour. If, in remembering the holocaust, we can only do so with solemnity, we put it in a mausoleum outside of the rest of human experience; and are thereby less, not more, likely to understand and remember.But this leads onto a second question: is it possible to make a comedy about the holocaust (or at any rate a good one)? Here the sheer scale of the awfulness makes a positive answer harder to give: for such a film to work, the comedy must be commensurate with the tragedy; and this perhaps cannot be done. An earlier (and brilliant) film of Benigni's, 'Johnny Stecchino', poked fun at gangsters: but even then, it was working with stereotyped gangsters as depicted in movies, not at real murderers extinguishing human life. With the holocaust, there is no such get outs: few have even dared make straight movies about this subject.The first half of 'Life is Beautiful' is a classic Benigni romp, poking some gentle fun at the less extreme excesses of Italian fascism as it proceeds. It's silly but good, a story of inescapable charm. But in the second half, the scene moves to somewhere like Auschwicz, and the film becomes more problematic. The idea (of a man who uses humour to save his son, and himself, from confronting the true horror of his situation) has some merit but is ultimately not sustainable in the face of reality. So the film has to tone down reality. Benigni is treated rather better than the average Auschwicz inmate (the film nowhere implies just how low the survival rate was); his fellow prisoners are shown as faceless zombies (distancing us when they do get killed); while when the subject of mass murder is directly addressed, the film inevitably slumps into mawkishness. There are still some good gags, and occasionally some telling moments (particularly those involving a \"humane\" doctor who Beningi befriends); but overall the setting rings false. The film might have achieved more poignancy and realism had it been set in a pre-deportation Jewish ghetto: by going all the way to the death camps, it overplays its hand.'Life is Beautiful' is still a funny and original film; but actually less brave than you might at first think."}],"errorMessage":""}