{"imDbId":"tt0120689","title":"The Green Mile","fullTitle":"The Green Mile (1999)","type":"Movie","year":"1999","items":[{"username":"TheLittleSongbird","userUrl":"https://www.imdb.com/user/ur20552756","reviewLink":"https://www.imdb.com/review/rw2391746","warningSpoilers":false,"date":"27 February 2011","rate":"9","helpful":"17 out of 26 found this helpful.","title":"Overlong, but haunting, thought-provoking, moving and engrossing","content":"I am starting to like Stephen King's work more now, and I read the book. A wonderful book, that is faithfully(mostly) adapted into an equally wonderful film. My only complaint of The Green Mile is the length, I do think it is too long. However, The Green Mile is a film that is haunting, thought-provoking, moving and engrossing.The film is beautifully directed by Frank Darabont(director of the slightly superior The Shawshank Redemption), is beautifully shot with a foreboding setting and atmospheric cinematography and lighting and has an engrossing and haunting story that is well-paced too. Thomas Newman's score is positively hypnotic and very beautiful, with some great authentic song choices, my favourite being Wrap Your Troubles in Dreams(And Dream Your Troubles Away).The script is thoughtful too, and the movie also has a big emotional impact without feeling manipulative, I honestly couldn't help crying at the end of the movie. I have to say as well, the execution scenes were really quite harrowing. The performances are strong, Tom Hanks is excellent as the warden, as is Doug Hutchison who gives a credibility and complexity to a character that could have easily been clichéd and David Morse as Brutus. But Michael Clarke Duncan is the actor I want to give the real kudos to, he has a wonderful character and he absolutely nails it.Overall, a very, very good movie. Had it been shorter, it would have been perfect. 9/10 Bethany Cox"},{"username":"bkoganbing","userUrl":"https://www.imdb.com/user/ur2483625","reviewLink":"https://www.imdb.com/review/rw2170039","warningSpoilers":true,"date":"7 December 2009","rate":"10","helpful":"35 out of 43 found this helpful.","title":"The Least Of us","content":"I'm glad that a number of reviewers have informed me that this highly unusual tale was a faithful adaption from the novel by Stephen King. I'm not much of a fiction reader so it is gratifying to hear that his vision got to the screen intact. I would not have guessed this film would have come from a horror story writer. No monsters from the id or any place else are present in this story set in the American South of the Thirties. But demons do exist in The Green Mile and there is a man named John Coffey who takes them unto himself.The Green Mile refers to the cell block housing the inmates scheduled for Death Row. In that cell block comes Michael Clarke Duncan who is close to seven feet tall and maybe weighing 400 pounds. He's also as docile as a baby lamb and whose only request is that they leave a night light burning because he gets a little afraid of a strange place in the dark.Of course the guards who have the typical white Alabama attitudes of the day don't quite know what to make of them, but Tom Hanks who captains the cell block and most of the rest find out just how special he is. And Hanks cannot believe that someone like Duncan could possibly be guilty of a double rape/murder of a child.This modern day parable of the Jesus story has King telling us that it is very possible that many of his kind have walked the earth with talents for healing. One of them got a religion worked around him, but they can come in all walks of life and certainly no one would expect one to come in the guise of an illiterate black Alabama sharecropper. But one of my favorite Bible verses has Jesus himself saying that what you do unto the least of my brethren you do unto me.Somebody of Michael Clarke Duncan's size and build is not going to get too many really good roles and he certainly hasn't played anything remotely like John Coffey again. Parts like that don't come along and the film seems almost to have been built around him. It's one of the most moving performance that has ever been put on film in history. And it's an incredibly difficult role, he's meek for his size and Uncle Tom like, but as we learn far from it. In fact Coffey is beyond what the ordinary human mind can comprehend. Duncan received one of four Academy Award nominations that The Green Mile got, in his case for Best Supporting Actor. Since the film is built around him, my only question is why was it the Supporting Actor category?The Green Mile was also nominated for Best Picture, Best Sound and Best Adapted Screenplay, but did not come home a winner in any of these. A pity that one of the best films of the Nineties could not get at least one Oscar.Where there's a Christ-like figure you also have some devil spawn villains and we have a pair of them in Sam Rockwell as another death row prisoner and David Hutchison as a rat of a prison guard with both connections and issues. What happens to them is both poetic and diabolical in true Stephen King tradition. Others in the cast of note are Bonnie Hunt as Mrs. Hanks, James Cromwell and Patricia Clarkson as the warden and his wife, David Morse and Barry Pepper as two other guards on the block and Michael Jeter as another prisoner with a remarkably trained 'circus' mouse.The Green Mile is a remarkable allegorical picture and might be considered for Easter time viewing if it has a season. It certainly will make folks think."},{"username":"Leofwine_draca","userUrl":"https://www.imdb.com/user/ur0482513","reviewLink":"https://www.imdb.com/review/rw3510749","warningSpoilers":true,"date":"24 July 2016","rate":"9","helpful":"6 out of 7 found this helpful.","title":"Supernatural prison drama is a feather in the cap for all involved","content":"An excellent prison epic which proves to be another splendid adaptation of a Stephen King novel – the bar has certainly been raised in the '90s for such adaptations after all the trash we got in the 1980s (MAXIMUM OVERDRIVE anybody? Thought not). THE GREEN MILE is a splendid exploration of man's psychology, interactions with other men, and attitudes towards life and death emphasised by the uncomfortable Death Row setting. The characters in this film are vividly portrayed by many accomplished actors and actresses and the film works best as a slow-burning character drama packed with incident and occasionally fireworks. Of course being a King story there is a supernatural aspect to the tale (a prisoner is able to perform miracles) but this does not detract from the realism that the film offers in its story.The narrative is excellent, the film a visual triumph, the special effects work limited and therefore effective. Tom Hanks is great as Paul Edgecomb, the sweaty guard who comes to believe that one of his captives is an angel sent from heaven, but best of all is big Michael Clarke Duncan in an emotional performance that will have any decent viewer reaching for the handkerchiefs during the course of the movie. Also welcome are excellent supporting turns from David Morse, Michael Jeter, and Barry Pepper as fellow prison guards, James Cromwell as the sympathetic Warden and Harry Dean Stanton being weird as always. But the characters who really stick in the mind are the villains: Sam Rockwell as the sleazy, psychopathic inmate who causes no end of grief, and particularly Doug Hutchison as perverted guard Percy. Hutchison, most familiar from his encore performance as mutant killer Tooms in two X-FILES performances back when the show was good, is fantastic in his part and really loathsome – evil, mean and treacherous, but also cowardly, childish and unthinking - a wondrous turn.The film runs the gamut of emotions from A to Z. Love, fear, wonder, anger, everything in the human condition is explored here at one point or another. There are also a number of shockingly violent moments more powerful than any horror film – this is truly a prison movie for modern times. The worst scene has a prisoner frying on the electric chair but not dying. Ten minutes later he finally dies having emptied the building. A truly gruesome and disturbing moment. THE GREEN MILE is suspenseful, exciting, moving, and often profound – not to mention tear-jerking at key points. Thus it gets two thumbs up from this viewer. Watch out for Mr Jingles, the cutest and cleverest mouse ever seen in a movie (forget MOUSE HUNT for sure)."},{"username":"SnoopyStyle","userUrl":"https://www.imdb.com/user/ur2898520","reviewLink":"https://www.imdb.com/review/rw2861826","warningSpoilers":false,"date":"1 September 2013","rate":"9","helpful":"3 out of 6 found this helpful.","title":"American fable","content":"Paul Edgecomb (Tom Hanks) is the lead guard on Death Row which they call the Green Mile. One day, John Coffey (Michael Clarke Duncan) is brought in for brutal rape and killing of two little girls. There is something different about the giant Coffey. There seems to be magic in him.Frank Darabont has created an American fable out of Stephen King's story. This is definitely a slow tear jerker. There isn't any car chase or elaborate fights. What it gives is emotional action. The only minor problem is its running time. It's 3 hours which may be 30 minutes too long. As far as I'm concern, it reached it's climax at the warden's home. But the movie had to keep going for a while still. If Frank Darabont could trim that back, I think it would keep more of the emotional impact."},{"username":"Hitchcoc","userUrl":"https://www.imdb.com/user/ur0278527","reviewLink":"https://www.imdb.com/review/rw1346650","warningSpoilers":false,"date":"20 April 2006","rate":"9","helpful":"5 out of 7 found this helpful.","title":"A Little Editing Please","content":"I had no experience with the book. I should have suspected that the supernatural would begin to play into this. It took me a while to get away from it being a grandchild of \"To Kill a Mockingbird\" to a movie about healing and the power to heal. The whole issue of the electric chair is what I remember the most. The dramatic way we have performed capital punishment. I remember Susan Hayward in \" I Want to Live.\" I was 10 years old and the movie still haunts me. Had this man not been a healer, a supernatural creature, the story would have been just fine. His character is so multi-dimensional in the way it lights up a screen. He has that strong presence that says, \"All will be right.\" He goes about his business despite the hatred that hovers around him, the redneck culture that has done this to him. He holds his head high because he is right. Tom Hanks is second in the portrayal of pain, both physical and emotional. He is such a heroic figure himself. This is quite a film.I am going to have to agree, however, with the people who complain about the length. I believe with proper film editing, this could have been a compact two and a half hours and it would have had much more impact on the audience. There are times when one says, enough, and I hate to be thinking that. I found my mind wandering at times. That mentioned, see this, but be prepared for a movie of human ugliness but hopefulness."},{"username":"Kirpianuscus","userUrl":"https://www.imdb.com/user/ur61197531","reviewLink":"https://www.imdb.com/review/rw3292222","warningSpoilers":false,"date":"6 August 2015","rate":"","helpful":"4 out of 6 found this helpful.","title":"impressive","content":"more than a film, it is a fascinating embroidery. more than a good adaptation, it is a special meeting. because it is a graceful portrait of miracle and the image of Michael Clarke Duncan remains in memory a long time after the end of the film.because it has the simple charm of the old fashion stories and the desire to respect the book has a magnificent result. because it is a Stephen King but it has not only the virtue to be a good adaptation. it represents a beautiful exploration of the nuances. and a special portrait of emotions. the perfect cast in an inspired movie about the force of intentions. a film who becomes magic. for this cause must see it. and than, sure, discover the book."},{"username":"Horst_In_Translation","userUrl":"https://www.imdb.com/user/ur3914439","reviewLink":"https://www.imdb.com/review/rw3763982","warningSpoilers":true,"date":"25 July 2017","rate":"8","helpful":"4 out of 8 found this helpful.","title":"Easily one of the best 1990s movies","content":"\"The Green Mile\" is an American movie from 1999, so this one will have its 20th anniversary 2 years from now when I write this review (2017). Let me start by saying that this film runs for over 3 hours, so if very long films aren't your preferred choice, then you can skip it. It's okay, but you are really missing out in that case. The film is based on a novel by Stephen King and the writer is Frank Darabont who launched his career with Stephen King's works and kept going with adaptations for quite a while. Another would obviously be \"The Shawshank Redemption\", the film he made before this one here. Today, Darabont is probably mostly known for his work on \"The Walking Dead\", which is truly ironic looking at how wonderful his works in the 1990s were. As for this one here, I am definitely a bit biased as the cast includes many actors I quite like. This applies not just to lead actor Tom Hanks, but also to Rockwell, Morse, Cromwell and Sinise, even if the latter only has a very brief appearance. And how can you not like Michael Jeter and Michael Clarke Duncan after their performances in here. May they rest in peace. MCD is the only one who scored an Oscar nomination from the cast and this is also his career/life-defining performance for sure. The movie itself was nominated for four Oscars, but did not win any sadly.I think that it may be difficult at times to appreciate the fantasy aspects in this film and with that i am referring mostly to the healing scenes. The film otherwise relies on very dark, very gritty and realistic plot developments because after all the entire thing takes place at a Death Row prison. But maybe it is this contrast between evil and goodness that lets it work so well. There were honestly more than just a few scenes and moments when I felt that they will really struggle to make this work, but they did succeed every time. Another example would be the frame between start and ending that plays many decades after the events at the prison, but when the closing credits rolled in I was very touched. I would also like to say that the film despite its massive runtime never drags a bit. It is truly easy to care for the characters and wonder what is going to happen next to them and this includes the good ones as well as the bad ones and there are good and bad ones at both sides of the law in here. The prime example is of course Doug Hutchinson's character, who is a bit of a main antagonist next to Rockwell certainly. It's a bit of a shame that the former did not really manage a great career and that people instead talked about nothing but his personal relationships. He was so good in here.I also do believe that another huge strength of the film is the location, namely the prison. There is always an aura of imprisonment and narrowness surrounding this film, also when it comes to the guards. And I personally felt that the film always got a bit weaker for a moment when the action moved outside the prison, like the scene with Clarkson's character or the big jump forward in time. But maybe that's just me. The location is truly special in terms of the overall plot in here. The most heartbreaking moments are the execution scenes, the one with MCD's character, but also the one with Jeter's character. That one was painfully good and you could not watch anywhere else, even if your heart was breaking during it. It was basically a longer more intense version of the rodent-killing scene from right before that. Or maybe I should say \"killing\". So yeah, for me this was an outstanding movie and I believe everybody needs to see it. Then again, looking at the number of ratings this film has here on IMDb, almost everybody has seen it and the few who have not really need to change that as soon as possible. This film is a masterpiece and a definite contender for best film from the year 2009 (the decade sure went out on a strong note) and also for Top10 of the 1990s. What are you waiting for? Don't be scared of the duration. Be grateful it is so long because it is good from start to finish. Also a contender for best film of Tom Hanks' career and that means quite something. (Re-)Watch it!"},{"username":"bob the moo","userUrl":"https://www.imdb.com/user/ur1002035","reviewLink":"https://www.imdb.com/review/rw0455238","warningSpoilers":false,"date":"8 March 2003","rate":"","helpful":"14 out of 46 found this helpful.","title":"Overlong and too worthy but still a good story \u0096 just don't expect it to be anything like Shawshank 2!","content":"Now a resident in a rest home, one time head warden on death row, Paul Edgecomb, is struggling with his untold memories. When a film brings it all back to him he recounts the story of the time when a huge black prisoner called John Coffey was put into wing. It is not too long before the peaceful, loving prisoner, found guilty of the rape and murder of two children, has mysterious gifts that transcend the decay of the lives around the prison.After Shawskank Redemption I was attracted to this as many of the makers were the same not to mention the author, the prison setting and the running time. However that same running time and some negative reviews put me off and I didn't get round to seeing it till recently. The film is very slow and this is occasionally to it's detriment but not too often. It's main failing is that it's supernatural spin makes it difficult to get involved and lose yourself in completely. `Redemption's ` strength was that it was a human story. Green Mile tries to have the strength of human spirit at it's core but it doesn't quite come off.That's not to say that the story still isn't moving and involving because it is. However it doesn't come as easily as it should and when the story slows a little bit it does feel slow. It could easily have lost 30 minutes as at it's current length it feels like a long movie which is a bad thing \u0096 Two Towers is long but didn't FEEL long! Also something I always find annoying is when a score really works the emotion where the actual film can't manage it by itself \u0096 here the score is working overtime to wring every drop of emotion from the scenes.The film is very well directed and there are powerful moments of cruelty. When the chair is used I couldn't help but feel that it was real. However the main attraction (other than the mouse!) is a wonderful performance by Duncan. True there is an element of slave cliché about it but he rises above that a gives a performance of such emotion and such gentleness that came as a surprise from someone of his build. Hanks is also good and wisely plays it quite low-key and the support cast is solid, comprised of many many well known faces including Morse and Cromwell.Overall this is good but overlong. It is a very different film from Shawshank and many will compare it to that much better film. However the film is worth the work despite some simplistic errors and flaws."},{"username":"kosmasp","userUrl":"https://www.imdb.com/user/ur5876717","reviewLink":"https://www.imdb.com/review/rw6835128","warningSpoilers":false,"date":"21 April 2021","rate":"9","helpful":"0 out of 5 found this helpful.","title":"Inside (out)","content":"Stephen King has written quite a few (modern) classics... and I reckon this is one of them. I say I reckon, because while I have read quite a few, I have not read this one. So right off the start, do not expect me to tell you how this fairs when it comes to the novel. What is missing, what was changed (if anything) and what was added (if anything) ... I do not know that.What I do know is, that this movie is quite long, but does not feel like it. While this is quite restrained/contained location wise, it is not when it comes to emotions! This really will get to you ... and the ... let's call it out of this world element is quite crazy. The CGI for that has not aged well, but it is what it is. And it should not take anything away from the emotional impact the movie will have on you ... even for Mr. Jingles ... actually what a character! I can only imagine how much more of him there is in the book.Very fine actors and very well played ... a true classic drama and thriller wise from the 90s."},{"username":"classicsoncall","userUrl":"https://www.imdb.com/user/ur2707735","reviewLink":"https://www.imdb.com/review/rw1594058","warningSpoilers":true,"date":"8 February 2007","rate":"10","helpful":"5 out of 8 found this helpful.","title":"\"I couldn't help it boss, I tried to take it back but it was too late.\"","content":"I had forgotten this was a Stephen King story, probably because it's basis in the supernatural doesn't delve into the realm of horror. The terror here is provided not by a demonic clown or a shop keeper from hell, instead it has a human face. In fact a couple of human faces, in the form of sadistic killer 'Wild Bill' Wharton (Sam Rockwell) and corrupt prison guard Percy Wetmore (Doug Hutchison). Their characterizations are just a few of the excellent portrayals in a film that leave one with mixed emotions and perhaps a misty eye or two.Michael Clarke Duncan casts a large shadow as accused killer John Coffey; his introductory walk on the 'green mile' has a numbing influence on prisoners and guards alike. For an actor who virtually came from nowhere, his performance is extraordinary, shaded with subtle nuance and deep emotion. His characterization is deftly complemented by the core guard group headed by Tom Hanks' Paul Edgecombe, and includes David Morse, Barry Pepper and Jeffrey DeMunn.Speaking for myself, the film's run time of just over three hours is hardly noticed, it's that gripping and absorbing. It puts the viewer through an entire range of emotions; the scenes that develop the duplicitous nature of guard Percy are particularly unnerving. Wouldn't it have been interesting to throw Percy and Wild Bill in a cell together for a mid film half time show?Once one realizes that Coffey will ultimately walk his last mile on death row, the mind races with thoughts of how he'll be found innocent and exonerated of the murder of the two young farm girls. Coffey's own thoughts on the matter only partly put the viewer at ease, there still remains the sense that justice demands an entirely different outcome. Coffey's execution is powerfully emotional, and calls to mind the finale of \"Angels With Dirty Faces\", when the execution of Cagney's character elicits the same misty eyed response. I include both films on my list of all time favorites, each a classic in it's own way."},{"username":"lee_eisenberg","userUrl":"https://www.imdb.com/user/ur4888011","reviewLink":"https://www.imdb.com/review/rw1233479","warningSpoilers":false,"date":"8 December 2005","rate":"10","helpful":"6 out of 10 found this helpful.","title":"This was the last movie that I saw in 1999...","content":"...and I'd say that it was a perfect way to end the 20th century (unless you say that the 20th century ended in 2000). For years, movie adaptations of Stephen King novels bungled everything, but with \"The Green Mile\" in the hands of the man behind \"The Shawshank Redemption\" (also about a prison), it clearly had to be good.In case you've never read the novel - which I highly recommend - the plot has prison guard Paul Edgecombe (Tom Hanks) overseeing death row in a Louisiana penitentiary in 1935. When a very large African-American named John Coffey (Michael Clarke Duncan) arrives, Paul witnesses some events that no one could ever imagine.This is the only which comes to my mind that I would classify as both haunting and heartwarming at the same time. Haunting because the prison's bleak environs drain all hope; heartwarming because of what happens in this particular prison. Both Hanks and Duncan turn in pitch-perfect performances, as do the other cast members. Bonnie Hunt as Paul's wife Jan, trying to cope with the effects that her husband's job has on their personal life; James Cromwell as Warden Hal Moores, doing everything to carry out his job but depressed by numerous factors; Doug Hutchison as despicable guard Percy Wetmore, who likes nothing more than to be as cruel as possible; David Morse, Barry Pepper, and Jeffrey DeMunn as fellow guards Brutus \"Brutal\" Howell, Dean Stanton, and Harry Terwilliger, respectively; Sam Rockwell as vicious inmate \"Wild Bill\" Wharton; Michael Jeter and Graham Greene as fellow inmates Eduard Delacroix and Arlen Bitterbuck, respectively; Patricia Clarkson as the warden's wife Melinda, afflicted by an awful disease; Harry Dean Stanton as loopy janitor Toot-Toot; and Dabbs Greer as the elderly Paul Edgecombe. Gary Sinise all appears as Coffey's lawyer. An 11/10."},{"username":"gavin6942","userUrl":"https://www.imdb.com/user/ur1234929","reviewLink":"https://www.imdb.com/review/rw3125994","warningSpoilers":false,"date":"17 November 2014","rate":"8","helpful":"1 out of 2 found this helpful.","title":"Darabont Scores Again","content":"The lives of guards on Death Row are affected by one of their charges: a black man (Michael Clarke Duncan) accused of child murder and rape, yet who has a mysterious gift.Starting off early with \"Top Hat\", not unlike its use in \"Purple Rose of Cairo\", one wonders if this old film has grown in popularity since its earlier days... but this is neither here nor there.The writing of Stephen King is largely dismissed by critics, and the movies made of his books are very hit and miss. The same with Frank Darabont, whose work is overall nothing terribly special. Yet, somehow when they come together, they do amazing things, at least with prison films. Both this and \"Shawshank Redemption\" have sat firmly on IMDb's Top 250, usually very high on the list.And this one should be. Maybe not high art like the French new wave films or the works of Chaplin, Kubrick and others, but this is a movie that will be timeless. One hundred years from now, it will still be remembered and enjoyed by fans. And that means something."},{"username":"jboothmillard","userUrl":"https://www.imdb.com/user/ur4248714","reviewLink":"https://www.imdb.com/review/rw1167373","warningSpoilers":true,"date":"7 September 2005","rate":"7","helpful":"3 out of 17 found this helpful.","title":"The Green Mile","content":"Based on the book by Stephen King, and from director Frank Darabont (The Shawshank Redemption, also a King novel), this is another good prison drama with a good cast. The film begins with Old Paul Edgecomb (Dabbs Greer) being reminded of his past by Fred Astaire's Top Hat on TV, and then he starts telling his story. In the 1930's, Paul (Tom Hanks) was a slightly cynical prison guard on Death Row, leading men down \"The Green Mile\", along with guards Brutus \"Brutal\" Howell (David Morse), Dean Stanton (Saving Private Ryan's Barry Pepper), Harry Terwilliger (Jeffrey DeMunn) and the evil Percy Wetmore (Doug Hutchison). One day the guards meet new prisoner sentenced to death, large, simple-minded John Coffey (Oscar and Golden Globe nominated Michael Clarke Duncan). As time goes by the guards start to see that John might not be harmless as people make him out to be, especially after performing the miracles of curing Paul's urinal infection, which was great for his wife Jan (Jumanji's Bonnie Hunt), bringing the pet mouse, Mr. Jingles, of prisoner Eduard Delacroix (Michael Jeter) back to life (after Percy squashed it), and more prominently curing the wife of Warden Hal Moores (Babe's James Cromwell) of her illness. Also, they realise that he is innocent and that (after his death, and Percy made dumb, and a flashback) it was in fact 'Wild Bill' Wharton (Sam Rockwell) that raped and murdered two little girls. So when they ask John what he wants done, let go to escape or face his sentence. He decided that he has had enough of living and seeing the bad sides of life, and he requests a final meal and film (Top Hat obviously). John's emotional death (the electric chair) was number 2 on The 100 Greatest Tearjerkers. Also starring Dances with Wolves' Graham Greene as Arlen Bitterbuck, Patricia Clarkson as Melinda Moores and Harry Dean Stanton as Toot-Toot. A fantastic cast, a vicious and utterly hateful villain (bastard, prick, arsehole are the best words to describe Percy), some good fantasy moments, and just an unmissable film, even for three hours. It was nominated the Oscars for Best Picture, Best Sound and Best Writing, Screenplay Based on Material Previously Produced or Published. Very good!"},{"username":"ccthemovieman-1","userUrl":"https://www.imdb.com/user/ur4445210","reviewLink":"https://www.imdb.com/review/rw1485186","warningSpoilers":false,"date":"28 September 2006","rate":"7","helpful":"17 out of 43 found this helpful.","title":"In 3 Words: Long, Intense, Involving","content":"This was such an intense movie that, at three hours in length, I didn't really wind up watching this as many times as I thought I would. This was another of those films I rated very high on the first viewing but lower and lower on the second and third looks, finally eliminating it from my collection. However, that first look was a memorable one because this film had some dramatic moments!The acting in here is outstanding and runs the gamut from well-known actors like Tom Hanks to several unknowns, all having major roles. It's also nicely filmed. However, the story and the acting are the main attractions. The unique story gets you involved to the point where, even having to watch several very, very unpleasant scenes, you don't want to put the movie down.Big Michael Clarke Duncan elevated his career a lot with this role, playing \"John Coffey,\" a prisoner with strange powers. You could root for all the characters save two, a sadistic guard aptly named \"Brutus 'Brutal' Howell\" (David Morse) and Warden Hal Moores (James Cromwell). I was sorry to hear Cromwell blaspheme regularly but not surprised since he seems to have played so many \"bad guy\" roles in the past dozen years and done this in other films. With those two exceptions, however, it was nice to finally see prison guards as good guys, something rarely seen since the classic-movie era. Michael Jeter, one of those unknown actors, was a lot of fun to watch as \"Eduard Delacroix.\"Overall, however, as much as I praise this movie, the unpleasant scenes, the high use of the Lord's name in vain and the length of it all make this a tough movie to watch over and over, but it's a movie to definitely see at least once. Let's put it this way: it gets your attention!"},{"username":"moonspinner55","userUrl":"https://www.imdb.com/user/ur0989035","reviewLink":"https://www.imdb.com/review/rw1408007","warningSpoilers":false,"date":"1 July 2006","rate":"7","helpful":"4 out of 8 found this helpful.","title":"A sterling drama; complex and emotional...","content":"Prison guards in the 1930s are profoundly touched by one Death Row inmate. Surprisingly complex, absorbing and emotional film--surprising because \"The Green Mile\" is a big commercial release, it is (ostensibly) another Tom Hanks vehicle, and it's yet another adaptation of a Stephen King story--and yet, the talented filmmakers are able to pull some lovely magic from this trifecta. The subject matter, featuring several vile supporting characters, is unpleasant, though this doesn't detract from the emotional value of the piece, which is professionally-handled despite one or two small missteps (an execution scene, for instance, which runs too long). Terrific acting by Hanks (who blends right in with the large cast) and Michael Clarke Duncan, exceptional production design and cinematography. Some may quibble over the epilogue, but it's a sweet touch in a movie with a big heart. *** from ****"},{"username":"TxMike","userUrl":"https://www.imdb.com/user/ur0438066","reviewLink":"https://www.imdb.com/review/rw0454812","warningSpoilers":false,"date":"2 July 2000","rate":"","helpful":"3 out of 5 found this helpful.","title":"Marvelous movie, 3+ hours, deserves all the praise it has received.","content":"I saw \"The Green Mile\" on DVD and the extras, although brief, are interesting. I hadn't realized this was an adaptation of a Stephen King book. King himself said the screenplay was as \"perfectly written\" as he had ever seen.Made by the same ones who gave us the \"Shawshank Redemption\", this movie also set in a prison is very realistic. In fact, the several execution by electric chair scenes had me tense up each time. The several stories are carefully interwoven, characters are developed wonderfully, and it is all brought together in the final 30 minutes. Tom Hanks is perfect as the death row \"supervisor\"."},{"username":"blanche-2","userUrl":"https://www.imdb.com/user/ur0342623","reviewLink":"https://www.imdb.com/review/rw0454777","warningSpoilers":false,"date":"19 June 2000","rate":"10","helpful":"2 out of 5 found this helpful.","title":"overwhelming","content":"This knockout of a movie is the best of the Stephen King \"morality\" films such as the wonderful \"Shawshank Redemption\" and the TV versions of \"The Stand\" and \"Storm of the Century\". \"Green Mile\" manages to inspire and devastate at the same time. The casting is interesting, utilizing such actors as Bonnie Hunt and Dabbs Greer brilliantly and everyone performs with warmth and deep feeling. Hanks, of course, is the glue. Michael Clarke Duncan is powerful in his simplicity. This is a film that will never leave me."},{"username":"Quinoa1984","userUrl":"https://www.imdb.com/user/ur0453068","reviewLink":"https://www.imdb.com/review/rw0454641","warningSpoilers":false,"date":"19 February 2000","rate":"8","helpful":"4 out of 7 found this helpful.","title":"A Great Film Experience","content":"The Green Mile is one of those films that makes you feel proud you went to the movies to see the picture. Why? Because The Green Mile has it all: Drama, Romance, Comedy, and everything else in a movie that makes it a masterpiece. Especially the acting by Tom Hanks as the pleasent prison guard and more especially Michael Clarke Duncan as the miracle prisoner John Coffey (like the drink, only not spelled the same)and he not only gives his best performance yet, he gives probably the best performance of the decade. Add that plus a great score, great story (three hours gives it time to expand) and great direction (by Frank Darabont) and you got a great film."},{"username":"edwagreen","userUrl":"https://www.imdb.com/user/ur2542703","reviewLink":"https://www.imdb.com/review/rw2607474","warningSpoilers":true,"date":"5 May 2012","rate":"8","helpful":"2 out of 2 found this helpful.","title":"...And Miles to Go Before I Sleep-The Green Mile ***","content":"M.C. Duncan steals the picture with a tremendous supporting performance as a black gentleman, accused of murdering two children, who has a gift to heal people. No, he is not Elmer Gantry, but you know that he couldn't be guilty of such a crime by his very demeanor.An elderly man tells the story to a woman in a nursing home of when he was a guard some 60+ years before.We meet a whole assortment of condemned prisoners as well as one of the guards who is as sadistic as they come.Tom Hanks is grand as the young guard who shows compassion for the inmates.The film is also definitely one exposing the horrors of the death penalty.There is a fine supporting cast as well with Patricia Clarkson, a grossly under-rated actress, doing a stunning turn as a woman dying of a brain tumor.The film gets even better when a chain of events allows practically everyone to get what they deserved with the exception of the Duncan character."},{"username":"michaelRokeefe","userUrl":"https://www.imdb.com/user/ur0449021","reviewLink":"https://www.imdb.com/review/rw0454454","warningSpoilers":false,"date":"24 December 1999","rate":"8","helpful":"2 out of 4 found this helpful.","title":"A brilliant prison drama inspired by Stephen King.","content":"Frank Darabont brings Stephen King's novel to life. It stays true to the book and will hold your interest the whole three hours running time. Tom Hanks is a prison guard that befriends one giant of a prisoner played by Michael Duncan. Amazing things begin to happen on the \"Green Mile\" leading to execution on death row. Also turning in stunning performances are Michael Jeter, Harry Dean Stanton and Sam Rockwell. This drama has it's humorous moments. This is a dark and moody tale that is Oscar worthy."},{"username":"Calicodreamin","userUrl":"https://www.imdb.com/user/ur29385135","reviewLink":"https://www.imdb.com/review/rw7923193","warningSpoilers":false,"date":"6 March 2022","rate":"10","helpful":"1 out of 4 found this helpful.","title":"Walking the green mile","content":"A hauntingly good film that never ceases to emotionally connect. The characters have depth and are well cast. The storyline is unique and has the perfect mix of supernatural and drama."},{"username":"Theo Robertson","userUrl":"https://www.imdb.com/user/ur1532177","reviewLink":"https://www.imdb.com/review/rw0455199","warningSpoilers":true,"date":"20 November 2002","rate":"6","helpful":"35 out of 122 found this helpful.","title":"Tom Hanks In Another Overrated Overblown Film","content":"***** POSSIBLE SPOILERS ****** Aw come on guys how can anyone vote this film into the IMDB top 250 ? First of all it features the most unconvincing prison officers in the history of cinema who are wetter than drowned fish , there`s no way these guys would get jobs as bleeding heart social workers never mind become guards on death row . Secondly this film is just so predictable ( Which is why I warned of possible spoilers ) there`s no way the audience can be taken in that John Coffey is guilty of murdering a child , and likewise you just know that Percy ain`t gonna enjoy his pension . Thirdly am I alone in thinking Percy didn`t deserve his fate ? He`s surrounded by murdering scum so what do I care if he breaks inmates fingers and lets them suffer in the chair . At least Percy acts in a believable way and consistent manner unlike his colleagues Fourthly this film lasts more than 3 hours and there`s hardly any plot twists that saved THE SHAWSHANK REDEMPTION from accusations of being overlong All in all a very overrated overlong film based on a very weak Stephen King story . The fact that King`s original novellas were marketed through a gimmick says a lot about the uninteresting story . Is it any surprise that no one wants to adapt King novels for the big screen these days ?"},{"username":"bevo-13678","userUrl":"https://www.imdb.com/user/ur76062573","reviewLink":"https://www.imdb.com/review/rw5591833","warningSpoilers":false,"date":"30 March 2020","rate":"10","helpful":"3 out of 4 found this helpful.","title":"Zap","content":"I like the bit with the really really big man on death row"},{"username":"LeonLouisRicci","userUrl":"https://www.imdb.com/user/ur33374263","reviewLink":"https://www.imdb.com/review/rw2939488","warningSpoilers":false,"date":"11 January 2014","rate":"8","helpful":"0 out of 2 found this helpful.","title":"A Fine Film That Could Have Been Great","content":"An Emotionally Draining Film that is an Amazing Recreation of the Time Period. Its Greatest Flaw is its Enormous Length. It is Difficult to Maintain such High Melodrama for just Over Three Hours. It just Squeaks by with its Paranormality, Christ Analogies, and a bit of Humor from an Unbilled Mouse.Captivating, Manipulative, and thoroughly Engaging, it is an Old-School Movie that has Depression Era Atmosphere and is Elevated by some really Fine Acting. The Stephen King Story is brought to the Screen with a Professional Swagger but is Never Pretentious. In Fact, it is rather Simplistic.It's all Sentimentality with an Edge and Brutality through Belligerent Behavior. The whole Thing is Awesome the way it manages to be a Believable Fantasy. Kudos to the Production in General with its Cinematography, and Sets, Acting and Direction. It is a Fine Film and could have Arguably been a Great Film with just a Monicum of Restraint in its slightly Overblown Running Time."},{"username":"preppy-3","userUrl":"https://www.imdb.com/user/ur0463200","reviewLink":"https://www.imdb.com/review/rw0454430","warningSpoilers":true,"date":"21 December 1999","rate":"4","helpful":"10 out of 39 found this helpful.","title":"YAWN!!!!","content":"This film (a numbing 3 hours and 10 minutes) has got to be one of the WORST film of 1999. Yeah, it looks beautiful, the acting is very good, interesting special effects...BUT the movie is thuddingly obvious, subtlety goes out the window early on, and the film stretches out EVERY SINGLE SCENE for no point! SPOILERS AHEAD!!! WE get that the black prisoner is a savior (or something) early on--does it have to be proven FOUR times? What's the point of Mr. Jingles being in the movie--other than being killed and brought back to life? And really the initials of the guy (John Coffey--JC--get it?) was SO obvious it got annoying. It's also mentioned at least 5 times. Ending was pointless and stupid and the movie was just plain DULL!! This movie needs severe editing. A big waste of time and talent."}],"errorMessage":""}