{"imDbId":"tt0120815","title":"Saving Private Ryan","fullTitle":"Saving Private Ryan (1998)","type":"Movie","year":"1998","items":[{"username":"TheLittleSongbird","userUrl":"https://www.imdb.com/user/ur20552756","reviewLink":"https://www.imdb.com/review/rw2037628","warningSpoilers":false,"date":"15 March 2009","rate":"8","helpful":"18 out of 28 found this helpful.","title":"A strongly acted, powerful film that is unashamedly brutal!","content":"This is definitely one of the more powerful war films out there, if not the most powerful. I will admit, when I first saw it at school, I found the first half-hour extremely upsetting to watch.The acting is outstanding. Especially from Tom Hanks and Matt Damon, and the music alongside Schindler's List is John William's most haunting score I've heard.It does drag in the middle and the dialogue doesn't always flow as well as it should, but what we have is a historically accurate, extremely well made and directed and unashamedly brutal film. I mean, in the stabbing scene, towards the end, my English teacher had to leave the room. It was like watching Frankenstein's monster tearing out Elizabeth's heart.8.5/10 for a truly emotional and appropriately sombre war-film, that is a little slow at times. But it deserves to be in the top 250, really it is that good! Bethany Cox"},{"username":"Leofwine_draca","userUrl":"https://www.imdb.com/user/ur0482513","reviewLink":"https://www.imdb.com/review/rw3595855","warningSpoilers":true,"date":"10 December 2016","rate":"9","helpful":"17 out of 23 found this helpful.","title":"Everything you've heard is true","content":"I've long been a fan of war films but for some reason it took me eight years to finally get around to watch this, the often undisputed classic war film of all time. Why? Not sure really – I'm not the world's biggest fan of Steven Spielberg, although I'll admit that he's made some good films in his time. Still, it was with some excitement that I sat down to finally watch this lengthy epic of a film, in the best format possible – widescreen DVD, 52\" television, and surround sound system. Unsurprisingly, I was blown away by the production.At the heart, the film recalls dozens of other war films from THE DIRTY DOZEN to THE LONGEST DAY. A squad of men are sent on a suicidal mission, facing almost certain depth. Where the movie excels, however, is in the extra depth and layers that Spielberg adds. The characterisation is strong, the dialogue harsh and heartfelt. Technically, the film is perfect. The colours are faded and washed out and the hand-held camera-work is ten times better than that seen in the LORD OF THE RINGS trilogy. Sound effects are excellent, the best I've heard, especially the incredibly suspenseful sound of tanks approaching at the film's climax. All these technicalities combine to make the battle scenes some of the most desperately realistic I've seen. The opening twenty minutes on Omaha Beach, which show the infamous D-Day landings, are everything you've heard: exhilarating, utterly depressing, disturbing, exciting, and gruesome. This is certainly the goriest war film out there and it's all portrayed in a matter-of-fact way; blink and you really will miss it. People explode, lose limbs, and bleed copiously from wounds; only strong stomachs need apply.The acting is uniformly great, as you'd expect from the calibre of cast on view. Tom Hanks has never been better as the shellshocked hero, with unforgettable mannerisms – the shaking hand still haunts me. Tom Sizemore arguably steals the show as the gruff sergeant, and his larger-than-life persona is well suited to a role than the one he plays here. Edward Burns and Adam Goldberg put in solid performances but it's Jeremy Davies who the film focuses on throughout – a rookie, green-faced communications officer thrown straight into the hell of warfare. The viewer understandably sees the film through Davies' eyes and the subsequent journey is everything you would imagine it to be. Additionally, the film boasts great turns from actors in lesser roles – especially Barry Pepper as the sniper and Vin Diesel at his best. Lots of familiar faces pad out other roles, some in cameos: Dennis Farina, Ted Danson, Matt Damon, Giovanni Ribisi, Paul Giamatti, the list goes on.Despite the near-three hour running time, the film never slows up or stops for a minute. Every second is crucial and beautifully crafted. Things culminate in a set-piece climax, a fierce ambush in a bombed-out French town. Our heroes attempt to destroy a brigade of Nazi troops and their vehicles and heavy guns. It's sprawling, explosive, upsetting and, by the last frame of the film, incredibly moving. So, in retrospect, SAVING PRIVATE RYAN is everything everybody says it is. Spielberg's best film by far and one of the best war films of all time."},{"username":"SnoopyStyle","userUrl":"https://www.imdb.com/user/ur2898520","reviewLink":"https://www.imdb.com/review/rw2933698","warningSpoilers":false,"date":"2 January 2014","rate":"9","helpful":"3 out of 4 found this helpful.","title":"Great action sequences","content":"Captain Miller (Tom Hanks) and his men land in Normandy on D-Day. The group is ordered to find a Private Ryan after Ryan's brothers are all found to have been killed in action.Director Steven Spielberg creates some of the most thrilling action sequences in a movie. The D-Day landing at the start is some of the most visceral realistic war action ever. It is unforgettable. The movie is bookended with heart stopping war action. The final battle is just as epic. The hand to hand fight with Private Mellish is devastating. The goal doesn't have the same epic scale although it does have the sense of poetry which Spielberg often likes to inject. The only minor objection is the mission which strikes a different tone from the unrelenting realism of the opening landing."},{"username":"Hitchcoc","userUrl":"https://www.imdb.com/user/ur0278527","reviewLink":"https://www.imdb.com/review/rw0469427","warningSpoilers":false,"date":"24 January 2000","rate":"8","helpful":"7 out of 9 found this helpful.","title":"Horrors of War","content":"There's violence and there's violence. With the huge numbers of personal reviews of this movie, I'm hard pressed to add much. The first half hour affected me like no other in recent years. I wondered as the boys threw up on the amphibious carriers whether they were seasick or scared beyond belief. When one uses the expression \"cannon fodder\" so casually, do we realize that this means the second wave makes it's way to the beach over the dead and dying bodies of the first wave, like ants sacrificing themselves to ford a puddle. The ones that get through, get through because there are only so many bullets and so many people. They are exposed, disoriented, helpless--they have no place to go but ahead. I will be haunted forever by the soldier searching, then finding his dismembered arm in the carnage. I will remember those trying to get above water, only to be cut down below the surface. If anyone has a heart, his or her attitude toward war should never be the same. How can we who have never been there have a hint of what it must have been like. Like Schindler's List on the Holocaust, this should be a training film on war."},{"username":"Horst_In_Translation","userUrl":"https://www.imdb.com/user/ur3914439","reviewLink":"https://www.imdb.com/review/rw3755898","warningSpoilers":true,"date":"16 July 2017","rate":"4","helpful":"12 out of 101 found this helpful.","title":"I cannot see the appeal at all (probably due to personal bias)","content":"\"Saving Private Ryan\" is an American movie from 1998, so this one will have its 20th anniversary next year. The director is Steven Spielberg and this one is from the years that many probably consider his very best years in filmmaking. It came out half a decade roughly after his probably career-defining Schindler's List. But while I really love the latter, this one here did not make a lasting impression on me at all. I already stated in the title of my review that this may be due to personal bias as war movies are just not exactly my preferred choice. Knowing how it is considered such a classic, however, I thought why not give it a go nonetheless. But I had more than just a few problems with it. Let me mention some. The very long introduction of Hanks' character early on could have been left out completely if you ask me and the movie could have started with the scene where we find out that Mother Ryan lost all her sons during the very same day, which is admittedly not very realistic, even during the days of World War II. And still, it was one of the better scenes nonetheless I believe, probably also because of my aforementioned bias and I was grateful for every distraction that offered more than gun shootings, soldiers' uniforms and people crawling through the mud. I am also not a fan of \"Band of Brothers\", another Spielberg/Hanks collaboration. Hanks was probably the biggest film star on the planet at that time after having won two Oscars recently, so yeah given Spielberg was maybe also at the peak of his popularity, this certainly could have become something tremendous. And I like Hanks. A lot actually, which makes me even more sad this one here did not turn out to my liking at all.One reason may be the runtime. It actually comes pretty close to the 3-hour mark and I felt that it dragged a lot and that there were many lengths. And also that they kept introducing new characters all the time instead of elaborating on the old ones in a memorable manner. Honestly, I felt like I knew almost nothing about all the soldiers in here. It is somewhat interesting because they are played by famous names like Diesel, Ribisi, Damon, Giamatti or Farina at early/earlier stages of their careers, so the cast is not the problem at all. And Hanks also does a solid job with what he was given. The Oscar nomination may have been a bit too much, but well, that's bearable looking at everything the film won. Spielberg Best Direction? Nah. Then again, the technical categories are something that is tough for me to judge, so perhaps these were somewhat deserving. But the nomination for the script sure was a joke and I am not surprised at all that writer Robert Rodat never came close to writing a great screenplay again as obviously he hadn't done here either. I am not mad that the Oscars eventually went for the lighter \"Shakespeare in Love\" over this one and I am baffled by how many people still say SPR should have won Best Picture that year. Anyway, I am on the \"La vita è bella\" bandwagon 100%.Now back to this movie here. I think I have elaborated enough on all the many reasons why I did not end up liking this film at all. The story may be its biggest weakness. The references here are actually truly simple, like the group of soldiers finding accidentally the wrong soldier James Ryan at one point. This was also a weak scene and still it was far more memorable than the at least 90 minutes of battlefield action. It gets a bit less towards the end when they find Ryan. Still a long time before the film ends. The frame with the funeral also only works if you enjoyed everything in-between. To me, honestly it felt a bit on the melodramatic side to be honest. But again, I was somewhat grateful for it because it was not just boring random war action. As a whole, I give \"Saving Private Ryan\" a thumbs-down and I am baffled how people, also IMDb voters, consider this one of the greatest 50 films of all time. I strongly disagree. Watch something else instead and I'd only recommend this one to the very biggest war film fans. Oh well, I guess they have seen it already anyway."},{"username":"bob the moo","userUrl":"https://www.imdb.com/user/ur1002035","reviewLink":"https://www.imdb.com/review/rw0470869","warningSpoilers":true,"date":"11 September 2002","rate":"","helpful":"179 out of 329 found this helpful.","title":"Excellent despite some Spielberg slips into sentiment","content":"During the Normandy landings during WW2 two brothers are killed. In another part of the world another of the Ryan brothers is killed in action, leaving their mother with one remaining son and three telegrams due to be delivered. A group of men, led by Captain Miller set out to reach Private Ryan and not only break him the news but to safely return him for return to the US.What can I say - it is an excellent film despite some minor flaws. The plot is based on a real life situation during WW2 and allows for us to follow a group of men as they take part in the horrors (and humanity) of war. This is the film's strength and it is never stronger than in the first 25 minutes and, to a lesser extent, the final 20 minutes. The opening of the Normandy landing is simply pure emotional power and is really well done - it is so powerful that the actual plot itself is a bit of a letdown. I love Band of Brothers because the focus was on the war and what it was like to be involved rather than a sort of soap opera story. Here the plot is still very good but can't really follow that opening.It also sinks into sentiment a tad too often. For example Ryan's mother lives in this sort of Norman Rockwell painting that is Spielberg's vision of middle America. Also there is a little too much use of gawkish dialogue as well - although it's hard to criticise the death scenes for being emotional, because they should be.A minor flaw that is easy to get over is the lack of Brits. Like Band of Brothers (which had a few cockney accents) this is an AMERICAN film - so of course they will focus on the American experience. However it would have been nice to have some British (or any other) voices or faces among the Allies. I can understand why the film opens and closes with the stars and stripes and why the film focuses on the yanks but a little bit of perspective would be useful. There's nothing wrong with focus - but when it totally excludes huge bits of information then it's a problem. It always makes me think of the way that Michael Caine took his children back to the UK when they were taught in an US school that WW2 started in the 1940's (ie - when America joined).However this is a minor flaw as, in fairness, it's an American film - why be surprised when it's focus is Americans! Of the cast Hanks is good - he is much more subtle than his Oscar roles where he played to the crowd. He benefits from having a great support cast of good actors, current actors, old faces, up and comers etc. Sizemore, Burns and Farina are the good current actors. Damon, Ribsi, Diesel, Martini etc are all very good on the way up - although Damon has one of the simplest characters. They may all be slight stereotypes of Americans but it's not a major flaw - just a screen writer wanting to cover all bases I think, although it does grate that they cover all these backgrounds but can't squeeze any other Allies in to the edges.Overall it is excellent despite some stereotyping, US flag waving and the usual Spielberg love of sentimentality. Even if the actual plot is flimsy Spielberg expertly puts us as close to experiencing the horrors and the humanity within war as I hope we'll ever be."},{"username":"classicsoncall","userUrl":"https://www.imdb.com/user/ur2707735","reviewLink":"https://www.imdb.com/review/rw2480212","warningSpoilers":true,"date":"27 August 2011","rate":"10","helpful":"17 out of 21 found this helpful.","title":"\"Sergeant, we have crossed some strange boundary here. Our world has taken a turn for the surreal\".","content":"I read four or five pages of reviews for this film on the IMDb boards, and most of them fall into one of two camps - those who felt it was the best, or at least one of the best war movies ever made - and the Spielberg bashers who decry the very fact that America and it's Allies had even the slightest audacity to win the War. Granted, the concept of good Americans versus evil Nazis is a bit too simplistic when it comes to cinematic treatments. Those viewers who want to read so much of that into the picture are missing one of Spielberg's main goals - 'How do you find decency in the hell of warfare'? That question reverberates around the central plot, the mission to rescue a sole surviving brother who's three siblings have all perished in the same war already. For the eight members of the rescue team, the quandary is presented in terms of moral prerogatives - why potentially sacrifice so many soldiers at the expense of just one, who may already be dead anyway? Moral dilemmas abound in the story. Ed Burns's Private Reiben challenges Captain Miller's (Tom Hanks) decision to release a German soldier on his own recognizance to turn himself over to an American patrol. Private Caparzo's compassion for the young French girl in the bombed out town is seen by the Captain as a life or death threat to his unit, and must decide for the greater good of his men. Even when Miller's Rangers finally achieve their objective and find Private Ryan (Matt Damon), the situation does not play out in straightforward fashion. Ryan resolutely refuses to be 'rescued', instead seeing that alternative as abandoning his own men. By what right should he be so singularly absolved of his duty to serve and protect his country? My summary line above captures the essence of Miller's response and observation, knowing that his duty and his humanity are in obvious conflict.This conundrum creates another dynamic in the story, reverting back to the character of Private Reiben. When Ryan was anonymous, it was easy enough to dismiss him as some nameless, faceless soldier who didn't warrant any special kind of treatment. Up close and personal however, Ryan proves his value as a soldier in battle, side by side with Reiben in the German tank ambush at Rammel. These perspectives are not typical in your average war movie, and make the film far more interesting than if it had taken a more documentary like approach, as in the opening half hour of the film with the landing on Omaha Beach.Perhaps the most complex character, and the one I had the hardest time with was Corporal Upham (Jeremy Davies). By virtually all of his responses to battle conditions and enemy encounters, he was an outright coward. His singular moment of bravery was enacted with some measure of revenge against Steamboat Willie, the German soldier who's life was spared earlier in the picture. Willie provided Upham with a reason to overcome his distaste for war, by abrogating an implied trust they shared over a cigarette. Upham had his reason and motivation to kill Willie, while allowing the remaining Germans to escape. For Upham, the war had to become personal for him to take action, and that's no way to survive in conflict.So for me, \"Saving Private Ryan\" isn't just a war film, and if you view it through that lens, the film loses much of it's impact, even with the brutality of Omaha Beach and the tank battle at the bridge. To be sure, the picture succeeds at capturing the intense horror of war, but it's power as a film goes deeper when it identifies with it's characters and examines their relationships with each other as soldiers and men. How do you find decency in the hell of warfare? One man at a time."},{"username":"lee_eisenberg","userUrl":"https://www.imdb.com/user/ur4888011","reviewLink":"https://www.imdb.com/review/rw1371626","warningSpoilers":false,"date":"19 May 2006","rate":"7","helpful":"11 out of 27 found this helpful.","title":"still, it does seem that they could have looked at more","content":"I would have given \"Saving Private Ryan\" a higher score had it looked at more issues abundant during WWII (they could have focused on the various roles that each country specifically played in the war). But don't get me wrong: watching the movie, you can literally feel the bullets hitting you. Tom Hanks commands as strong a performance as we can expect him to, and the rest of the cast also does quite well.I guess that if the movie has any problems, it's in the characters themselves. Aside from the fact that the movie pretty much makes all Americans out to be good and all Germans out to be bad, the Americans are basically clichés. They're all wholesome, hard-working guys out to make something of themselves. Moreover, there's the wise-guy New Yorker and the cowpoke Southerner, and Pvt. Ryan comes from Iowa (read: America's heartland).But otherwise, it's a very good movie, and it goes to show what an incredible director Steven Spielberg is (although I still wouldn't have given the movie Best Picture; I would have given that to \"Life is Beautiful\"). Also starring Tom Sizemore, Edward Burns, Barry Pepper, Adam Goldberg, Vin Diesel, Giovanni Ribisi, Jeremy Davies, Matt Damon, Ted Danson, Paul Giamatti and Dennis Farina."},{"username":"gavin6942","userUrl":"https://www.imdb.com/user/ur1234929","reviewLink":"https://www.imdb.com/review/rw2236601","warningSpoilers":false,"date":"15 April 2010","rate":"8","helpful":"1 out of 4 found this helpful.","title":"Spielberg's Soft Heart and a Solid War Movie","content":"After discovering that three of his brothers have been killed in battle, the War Department orders a group of soldiers to \"save\" Private Ryan and send him home to his mother. This act creates a fair amount of conflict, and from there the story really picks up.Steven Spielberg, while a fine director, often becomes sentimental and smarmy. This is no exception. But for the most part, the battles are fierce, the wounds are bloody and the death toll is high. Considered by many to be the greatest of all war films, it easily ranks up there in my book.What I loved most about this film? The casting of Nathan Fillion and Jeremy Davies. Oh my, I can never get enough of those two gentlemen. Beyond that, the realism and the brutality shines through. I appreciate that the Americans executed surrendering Germans (and on one occasion, Czechs) rather than took them prisoner. Is it right? No. But it's realistic."},{"username":"jboothmillard","userUrl":"https://www.imdb.com/user/ur4248714","reviewLink":"https://www.imdb.com/review/rw1041089","warningSpoilers":true,"date":"17 March 2005","rate":"9","helpful":"70 out of 160 found this helpful.","title":"Saving Private Ryan","content":"Steven Spielberg (Jaws, Raiders of the Lost Ark, E.T. the Extra-Terrestrial, Jurassic Park) deservedly won the Oscar for directing Schindler's List, and he did it again with another World War II film, this time in the battle itself, he was also won the Golden Globe, and was nominated the BAFTA. Basically the film starts with the fantastic opening on Ohama beach with Captain John H. Miller (Oscar BAFTA nominated, and medal for Distinguished Public Service Award (highest US Navy Civilian honour) winning Tom Hanks) and his troops struggling for survival against the Nazi Germans. After surviving this, they are given a special mission that they don't understand the significance of, to find one man and bring him home. They are now on the search for Private James Francis Ryan (Matt Damon), and when they eventually find him, he doesn't know why he is needed to get home. This film may have its annoying chats and breakaways from battle, probably why it's four out of five stars, but this still sticks closer to the truth than fiction. Also starring Tom Sizemore as Sergeant Mike Horvath, Edward Burns as Pvt. Richard Reiben, Barry Pepper as Pvt. Daniel Jackson, Adam Goldberg as Pvt. Stanley Mellish, Vin Diesel as Private Adrian Caparzo, Giovanni Ribisi as T-4 Medic Irwin Wade, Jeremy Davies as Cpl. Timothy P. Upham, Ted Danson as Captain Fred Hamill and Paul Giamatti as Sergeant Hill. It won the Oscars for Best Cinematography, Best Sound Effects Editing, Best Film Editing and Best Sound, and it was nominated for Best Art Direction-Set Decoration, Best Makeup, Best Music for John Williams, Best Writing, Screenplay Written Directly for the Screen and Best Picture, it won the BAFTAs for Best Sound and Best Special Effects, and it was nominated for the Anthony Asquith Award for Film Music, Best Cinematography, Best Editing, Best Make Up/Hair, Best Production Design, the David Lean Award for Direction and Best Film, and it won the Golden Globe for Best Motion Picture - Drama, and it was nominated for Best Original Score and Best Screenplay. Steven Spielberg was number 56 on The 100 Greatest Pop Culture Icons, Tom Hanks was number 3 on The 100 Greatest Movie Stars, and he was number 39 on The World's Greatest Actor, the film was number 45 on 100 Years, 100 Thrills, it was number 10 on 100 Years, 100 Cheers, and it was number 1 on The 100 Greatest War Films. Very good!"},{"username":"rmax304823","userUrl":"https://www.imdb.com/user/ur0819382","reviewLink":"https://www.imdb.com/review/rw1213843","warningSpoilers":true,"date":"11 November 2005","rate":"8","helpful":"5 out of 11 found this helpful.","title":"The Fate of Rebels","content":"Seeing it again, nine years after its release, you can't help being struck by how familiar things are: the pale blue cast of the photography, the distinctive special effects, the squib charges exploding not with blood but with dust when a man is hit, the clank of bullet against armor, the shaky camera, the enemy seen as dark phantoms scurrying through the murk of the battlefield, the tiny fountain of cork chips as a bullet slams into the dirt, the attention to period detail, the necessity of reloading at particularly awkward moments.All of this is familiar now because it's been so often aped, often in strong films like \"Band of Brothers\" and \"Blackhawk Down\". I doubt that anyone could make an \"ordinary\" war film anymore. Slow, cheap ones like Sam Fuller's or even innovative grunt's-view stories like \"Platoon.\" If you're going to make a war movie now, Spielberg's \"Saving Private Ryan\" is the bogie you have to match. It is the fate of rebels to found orthodoxies.And what an innovation this movie was. Oliver Stone must be applauded for tackling a subject like the Vietnam war that was so controversial that the conflict was avoided for more than ten years, because of the still smoldering emotions the war had generated. If Vietnam had been a human being it would have had to stalk around dressed in rags, tinkling a little bell, and crying \"Unclean, unclean.\" \"Saving Private Ryan\"'s subject is less controversial. First, the enemy really WAS our enemy. (Germany declared war on the USA first, not the other way around.) Second, well -- we won, didn't we? But it is probably more original in its details. And candid too. A German and an American soldier are locked in bitter mano a mano conflict, and the German wins! And not by cheating either! He is the bigger man and finally overpowers the American and inch by inch sinks the American's own bayonet into his chest. He does not gloat or smile. It's no tennis game to the German, but a deadly necessity, just as it is for the American soldier. \"Relax,\" the German pants in a low voice, \"it's very simple,\" as the tip of the knife slowly penetrates the American's chest. The scene is phenomenally stark.The most complex character is Upham's. The rest of the Americans play their assigned roles, performing impossible feats of bravery. This is precisely what the Germans are doing too. But Upham fails at a crucial point and costs the lives of his allies. The viewer can sit back and make Olympian judgments about Upham's character, but consider that for every hour Upham spent in combat he was as valiant as everyone else for fifty-five minutes. He translated, was almost run over by a tank, ran across open spaces under fire, and carried ammunition. But those fifty-five minutes don't count on his side, only the five during which he was frozen in tonic immobility, a fundamental mammalian trait which -- not having been in Upham's place ourselves -- we can condemn him for.Maybe nobody can define an \"anti-war movie.\" They ALL claim to be anti-war movies. How could you possibly market a PRO-war movie unless we were formally at war with another nation? To many people, an anti-war movie is a simple excuse to give us more action and more blood. Put Steven Segal in combat boots. Others are anti-war because they give us a glimpse of the enemy's humanity somewhere along the line. But in all the anti-war movies we always seem to win, as indeed we do in \"Saving Private Ryan\". (The cavalry comes galloping to the rescue.) All war movies, even those depicting a \"defeat\" like Pearl Harbor, seem to endorse the same bumper-sticker slogan: \"No matter how sneaky or noble they may be, they can't whip us.\" I guess it takes an enormous amount of courage -- in Hollywood -- to ask an audience to pay money to see a movie in which we lose a war or a battle or a fist fight with an enemy. It's what I admire about a movie as flawed as \"A Bridge Too Far.\" And it's what makes me feel more involved in the tragedy shown in \"Saving Private Ryan.\" That hand-to-hand fight that the American loses contravenes established war narratives. What? We LOSE? It's as shocking as Hitchcock's killing of Janet Leigh half-way through \"Psycho.\" Don't miss \"Saving Private Ryan,\" a milestone at the time."},{"username":"ccthemovieman-1","userUrl":"https://www.imdb.com/user/ur4445210","reviewLink":"https://www.imdb.com/review/rw1301842","warningSpoilers":false,"date":"27 February 2006","rate":"10","helpful":"280 out of 476 found this helpful.","title":"I Agree: This Is The Best War Movie Ever Made","content":"Without looking, I am sure other reviewers here have headlined their article \"Best War Movie Ever Made\"\" and I agree. However, before briefly discussing the film, let me just say if you don't have a decent 5.1 surround sound system, you aren't going to fully appreciate this movie (DVD).It's a great film to start with, and sitting in a room surrounded by five speakers with bullets flying from all directions around you - as in that spectacular 22- minute opening scene or in the final 45 minutes of action against the Germans in tanks - is an astounding movie experience. The sound in this film elevates it even higher.The visuals are outstanding, too. I've never seen so many grays, beiges and olive-greens look this good: perfect colors for the bombed-out French city where the last hour takes place, perfect for the faces and uniforms of the gritty soldiers, for the machinery, the smoke-filled skies, etc.My only complaint is the usage of Lord's name in vain 25-30 times, but, hey, when you consider it's tough men in tough times, that's what you are going to hear. In real life, the profanity probably was worse than the film. It's hard to picture the brutality of war being any worse than you see here, but it probably was. This is about as graphic as it gets. The violence and gore was shocking when this film came out in 1997 and still is when watched almost a decade later. It's unbelievable what some of the WWII soldiers went through, but that can be said for any war. I believe the purpose of this film was to pay tribute to the sacrifices these men made, and it succeeds wonderfully. Hats off to Steven Spielberg and to Tom Hanks, the leading actor in here, both of whom have worked hard for WWII vets to get the recognition they deserve, not just on film but in a national memorial.Anyway, language or blood and guts aside, this is still an incredible portrait of WWII. The almost-three hour film is riveting start-to-finish, especially with that memorable beginning action scene, probably the most dramatic in the history of film.As \"entertaining\" as those action scenes were, I found the lulls, if you will, to be even better. Listening to Hanks and his men discuss various things as they look for Private Ryan, was fascinating to me. Hanks is just superb in here and once again shows why he is considered one of the best actors in his generation.The most memorable and powerful moment among the \"lulls,\" is the shot early on of the Ryan mother sinking to her knees on her front porch as she realizes she is about to get disastrous news from the war. Moments later, Harve Presenell, playing Gen. MacArthur, eloquently reads a letter by Abraham Lincoln that is so beautifully written, so profound that it is quoted near the end of the film, too, and I never get tired of hearing it.This is a man's movie, and shows the horrors of war as few others ever have. To say it is \"memorable,\" just doesn't do it justice. It is the greatest war movie ever made....period."},{"username":"paul_haakonsen","userUrl":"https://www.imdb.com/user/ur22654354","reviewLink":"https://www.imdb.com/review/rw3375247","warningSpoilers":false,"date":"19 December 2015","rate":"8","helpful":"5 out of 10 found this helpful.","title":"One of the best war movies ever...","content":"\"Saving Private Ryan\" is one of those movies that you can watch with regular intervals of time, and even if you've seen it multiple times and am familiar with the storyline, the movie is solid enough to be watched over and over, and keeps on being entertaining.The story, quickly summarized, is about a small squad of soldiers during the 2nd World War who are given a mission to find private Ryan in war-torn Europe after having survived the D-Day onslaught at Omaha Beach.What makes \"Saving Private Ryan\" good, is a combination of multiple things. First, of course, is the storyline. But also the way it is filmed, which puts the audience right in the midst of the action. Most importantly, though, is the more than impressive cast who perform above and beyond the call of duty so to speak, no pun intended.The action is formidable and impressive, showing that war is brutal and bloody. And it is presented in a very realistic manner, again adding to the conviction of the entire movie.The cast list for \"Saving Private Ryan\" was impressive. And there is a number of actors who really prove their acting talents and break out of the stereotypical roles and genres they tend to cling to. Tom Hanks, of course, is the center of the movie and he fitted so well into the role and the movie. Usually I am not particularly fond of Tom Sizemore, but he was perfect for this movie and did a great job. Ted Danson was a breath of fresh air, and he was a great addition to the movie, as were Paul Giamatti. Barry Pepper was phenomenal in his role and brought a good amount of flavor to the movie. However, for me, it was Jeremy Davies who was the most outstanding of all in the movie, proving once again what a phenomenal character actor he is.And it is always a plus when Germans actually do speak German in a World War 2 movie, and not have those awful German accents added when they in fact are speaking English.\"Saving Private Ryan\" is a movie experience that everyone should have, at least once. It is an impressive and very entertaining movie to say the least."},{"username":"moonspinner55","userUrl":"https://www.imdb.com/user/ur0989035","reviewLink":"https://www.imdb.com/review/rw1503783","warningSpoilers":false,"date":"22 October 2006","rate":"6","helpful":"13 out of 32 found this helpful.","title":"For war-movie aficionados, a personal epic...","content":"Director Steven Spielberg's usual homey touch (which infiltrated even \"Schlinder's List\" in its final act) is thankfully in slight evidence here, as WWII soldiers attempt to locate one particular man whose siblings have all been killed in combat. The set-up for the plot is a bit formulaic (and layered with Spielberg's need for romanticism), but the very fine performances and exhaustingly exact scenes of violence remain haunting and memorable. Vivid cinematography and frenetic editing won Oscars, as did Spielberg (who deserved it). I was rather surprised by how powerful this movie is, given the feel-good reputations by many of the principals involved. I'm not a lover of this particular movie genre, but the film pulls no punches in detailing many unrelenting scenes of battle. *** from ****"},{"username":"TxMike","userUrl":"https://www.imdb.com/user/ur0438066","reviewLink":"https://www.imdb.com/review/rw0470629","warningSpoilers":false,"date":"7 September 1999","rate":"","helpful":"4 out of 9 found this helpful.","title":"In many respects a tribute to those who fought, and many died, in the WW2 European battles.","content":"I first saw this in 1999 and now, in June 2021, I saw it again on the 2004 edition which in in honor of 60 years after D-Day in June 1944, on DVD from my public library. It is a 2-disc edition with the second devoted to various \"extras\" about the movie.Most of the first half-hour is devoted to recreating that invasion on the beaches of Normandy. It is very realistic and shows how perilous the mission was. That half-hour is very hard to watch, not only because of the very graphic violence and mutilation of war, but also the memory of all those who gave up their lives.The rest, about an additional 2 hours, is the quest for one particular soldier, and the mission to bring him home safely after his three brothers all were killed in combat. Tom Hanks, as always, if fine in his role, as the Captain leading a group of eight men in search of Private Ryan, played well by Matt Damon. We all need to see Private Ryan at least once, if for no other reason but to remember the ugliness of war.The movie is long because it in essence contains a series of mini-movies, as the team crosses France in their search. This is war, you can't just ignore new battles as you come upon them."},{"username":"dbdumonteil","userUrl":"https://www.imdb.com/user/ur1219578","reviewLink":"https://www.imdb.com/review/rw0470986","warningSpoilers":false,"date":"14 September 2003","rate":"6","helpful":"28 out of 56 found this helpful.","title":"some upsetting battle sequences for a plain story","content":"War movies have often been one of Steven Spielberg' specialities. This one achieved a huge public and critic success. What drew the attention in this war movie are fight sequences. They're extremely violent and bloody. We have been rarely so far in the reality of fights. It's difficult to forget the first half an hour of the movie during the Normandy landings. Spielberg's sober and showy directing increases the phenomenon.However, you must admit it, the movie is based on a trite, plain even conventional story. You could use this last word to describe the famous Ryan soldier. Indeed, he's told that he can go home because all his brothers have been killed. Instead, he wants to keep on fighting.Apart from this and in spite of a few weaknesses, \"saving private Ryan\" is a thrilling war movie."},{"username":"Quinoa1984","userUrl":"https://www.imdb.com/user/ur0453068","reviewLink":"https://www.imdb.com/review/rw0469429","warningSpoilers":false,"date":"25 January 2000","rate":"10","helpful":"5 out of 11 found this helpful.","title":"One of the Best War Films Ever Made!","content":"Steven Spielberg's \"Saving Private Ryan\" is one of Spielberg's greatest masterpieces and I loved it. It affected me like no other war film since \"Apocalypse Now\" which is saying something. Spielberg always makes great war films, and this is his best yet (he also won his second Oscar for his direction). With violent (yet necessary) war sequences (photographed by Oscar winner Kaminski) and some better than average acting by Tom Hanks and a great cast, this film will make you think twice about World War 2. The Best Film of 1998."},{"username":"wes-connors","userUrl":"https://www.imdb.com/user/ur15896852","reviewLink":"https://www.imdb.com/review/rw2095278","warningSpoilers":false,"date":"13 July 2009","rate":"10","helpful":"7 out of 12 found this helpful.","title":"Steven Spielberg salutes the Veterans of World War II","content":"\"Seen through the eyes of a squad of American soldiers, the story begins with World War II's historic D-Day invasion, then moves beyond the beach as the men embark on a dangerous special mission. Captain John Miller (Tom Hanks) must take his men behind enemy lines to find Private James Ryan (Matt Damon), whose three brothers have been killed in combat. Faced with impossible odds, the men question their orders. Why are eight men risking their lives to save just one? Surrounded by the brutal realities of war, each man searches for his own answer - and the strength to triumph over an uncertain future with honor, decency and courage,\" according to the film's official synopsis.Once again, the Steven Spielberg and his crew of filmmakers climb to the top of the mountain, and deliver a terrific motion picture. This time, it's a heart-tugging pro-war (significantly, pro-World War II) epic of astonishing power. Initially, \"Saving Private Ryan\" impresses with its violent depiction of the Allies' D-Day landing, on the shores of German-occupied France. With waves of blood, Mr. Spielberg shows the human cost of defeating Fascism - by what TV anchorman Tom Brokaw called \"The Greatest Generation\"; although, honestly, every generation has its greatest, this is a fitting term.Captain Hanks and his squad - Edward Burns (as Reiben), Jeremy Davies (as Upham), Vin Diesel (as Caparzo), Adam Goldberg (as Mellish), Barry Pepper (as Jackson), Giovanni Ribisi (as Wade), and Tom Sizemore (as Horvath) - are among the few to survive the invasion; and, are ordered to save Mr. Damon's \"Ryan\" (for the reasons given above). During quieter times, the personalities of the men emerge, with Spielberg and writer Robert Rodat creatively painting human portraits. The silhouette of the \"war mother\" dropping to her stoop as the military vehicle approaches is one of the film's most simple, and effective, portraits; it supports the film's prime directive.Hanks and the men are a more complicated literary group of characters than they seem. Spielberg is obviously manipulating the story through them; and, their strongly-directed, natural performances help make it work. The film's main message is delivered by schoolteacher Hanks' \"Miller\" in his final words to student Damon's \"Ryan\"; listen for them. And, don't miss the secondary message, told by Mr. Davies' multilingual \"Upham\" character; especially, watch how he pleads with Hanks to set a German hostage free, and note the consequences of their action.It's tough to rank performances in an \"ensemble acting\" film (they're all stellar), but, for literary greatness, you've got to add Mr. Ribisi's doctor \"Wade\" to most memorable list. He tells an incredibly introspective story about how he pretended to be sleeping when his mother would peak into his room; note, eventually, Ribisi goes home to \"Mama\". Also interesting is how Mr. Sizemore's \"Horvath\" serves as the \"voice\" of Spielberg/Rodat, exalting and purifying Hanks' character. He says both the film's title and tag-line (\"Except this time, the mission is a man\").Spielberg's use of \"flashback\" is one of the best you'll ever see; and, he definitively defines the term \"gut-wrenching decision.\" ********** Saving Private Ryan (7/24/98) Steven Spielberg ~ Tom Hanks, Jeremy Davies, Matt Damon, Giovanni Ribisi"},{"username":"searchanddestroy-1","userUrl":"https://www.imdb.com/user/ur17559480","reviewLink":"https://www.imdb.com/review/rw2900794","warningSpoilers":true,"date":"7 November 2013","rate":"","helpful":"2 out of 4 found this helpful.","title":"A turn in the war movie history, but...","content":"Yes, this is a great war film, and, as I have already said before, again and again, there will be a BEFORE and AFTER SAVING PRIVATE RYAN, speaking of visual grammar, hard boiled and realistic at the most battle sequences. Any movie made after this feature, any movie around the world: Russian, Korean, British, any movie was inspired by this one. But besides this side PRIVATE RYAN remains very classical in the meaning. You find here the good US soldiers vs the ugly German ones. OK, US troopers saved us, the french, but in war there is not good soldiers and evil ones. The scheme is more complex. I prefer the TV show made several years after PRIVATE RYAN: BAND OF BROTHERS, more accurate in the meaning, where we watch for instance GI's shooting German soldiers who surrender. In PRIVATE RYAN, we don't see this, as far as I remember. Even just after the \"meat chopper\" Utah Beach landing, when only one percent of US troopers reached the \"beach hotel\", I don't remember a sequence where those same soldiers shoot German ones who surrender. And this actually happened. Anyone who survived the Omaha Beach hell would have done the same. And me first!!Althoug some days after, in the middle of the woodland fights, in the deep Normandy countryside, the same scene would not have been less understandable. In resume, PRIVATE RYAN remains a great film, but I prefer THE VICTORS, a very different movie, yes. But that's the way it is."},{"username":"michaelRokeefe","userUrl":"https://www.imdb.com/user/ur0449021","reviewLink":"https://www.imdb.com/review/rw3163785","warningSpoilers":true,"date":"16 January 2015","rate":"9","helpful":"1 out of 2 found this helpful.","title":"Outstanding war epic! A masterpiece!","content":"SAVING PRIVATE RYAN is an instant American war epic. Directed by Steven Spielberg and deserving of its critical acclaim. The opening 27 minutes is a graphic and realistic depiction of the assault at Omaha Beach on June 6, 1944. An intensive and prolonged sequence featuring the brutality of combat. Captain John Miller(Tom Hanks)leads a Ranger Battalion ashore with intent of securing a beachhead. Graphic and intense images not for the faint of heart. Army Chief of Staff, George C. Marshall assigns Cpt. Miller and a select squad of six plus an interpretor to search for a paratrooper, Private James Francis Ryan(Matt Damon),the last surviving brother of four that have entered the war. At times Miller's squad wants to balk on the search, but pull together not in respect for Ryan, but Miller.This movie was written by Robert Rodat and features a musical score by the acclaimed John Williams. Cinematography is more than outstanding and features amazing camera positioning. There is an all-star cast that also features: Tom Sizemore, Barry Pepper, Giovanni Ribisi, Edward Burns, Vin Diesel, Paul Giamatti, Adam Goldberg, Jeremy Davies, Ted Danson and Dennis Farina."},{"username":"tedg","userUrl":"https://www.imdb.com/user/ur0643062","reviewLink":"https://www.imdb.com/review/rw1976566","warningSpoilers":false,"date":"16 November 2008","rate":"","helpful":"14 out of 29 found this helpful.","title":"Littoral","content":"Every once in a while, I go back to watch films that were celebrated in their time. These have to be films I saw when they were newly nested in their warm buzz, and which were conveyed as if they were a privilege. This is such a film, one that can perhaps serve even as the exemplar. It was touted as (at last) a serious film by Spielberg, chapter two of his \"real\" film which marketed the holocaust. It had Hanks, who it should be recalled was more uniquely respected then than now. It dealt with a sort of real history with direct pulls on patriotism and something called valor, in a way that would make Sinatra and Wayne blush (or at least hiccup). And its first 20 minutes was chocked full of effects that worked and conveyed a meaning of confused dread. It moved us all \u0097 how could it not? \u0097 and allowed the filmmaker to lazily move through an ordinary story, staged as if it had a different production crew.Seeing this again in my own context and with the objectiveness of distance, I am amazed at how effective that opening section is, and how typically bad Steven the rest is. That first part is tense, tight and close. It is horrible without forcing us so close that we recoil. You know, one of the biggest challenges in film-making is to introduce the audience to the world they will live in for perhaps a few hours \u0097 the film and the long tail of recalled experience afterward. Usually the filmmaker has only a few minutes. Some \u0097 especially when a strict genre film is coming \u0097 can even do it during the title sequence. We are prepared for this entry voyage; it is part of the contract we make when allowing a filmmaker to transport us. I cannot recall a film that took this much time to prepare us. Perhaps \"Pan's Labyrinth,\" but that setup was disjointed. So I have to admire Spielberg's craft in putting together a session that has impact, though it is all tone and no narrative. And I have to admire his ability to understand and exploit that twilight area where we are primed for such a thing. And then 20 minutes in, we start to ask why, why engage us? Why open us to be ready for something that matters and serve us bread?Ted's Evaluation -- 2 of 3: Has some interesting elements."},{"username":"Calicodreamin","userUrl":"https://www.imdb.com/user/ur29385135","reviewLink":"https://www.imdb.com/review/rw6812378","warningSpoilers":false,"date":"14 April 2021","rate":"9","helpful":"3 out of 6 found this helpful.","title":"Heartbreaking","content":"An authentic war movie that doesn't hold back showing the heartbreaking toll combat takes on men. The storyline was well developed and the cinematography was fittingly grim. The characters were well cast and well acted. Hanks at his finest."},{"username":"Theo Robertson","userUrl":"https://www.imdb.com/user/ur1532177","reviewLink":"https://www.imdb.com/review/rw0469824","warningSpoilers":false,"date":"25 January 2002","rate":"4","helpful":"64 out of 153 found this helpful.","title":"Overated","content":"I remember when the hype when SPR was first released: \" Gawd it`s so realistic , it shows the true face of war , it`s like being there man\" I also remember that these claims were made by civilians with no experience of the military or combat ( Maybe the next time a film audience wants to experience the horrors of war, the cinema might like to stick a sniper behind the screen to pick off sundry filmgoers. That would be realistic ) To this day I haven`t heard a single D-Day survivor comment on the realism of this film.Yes I agree that the opening 20 minutes of SPR are outstanding as is the final battle at the end but the outstanding visuals fail to disguise the very average script that is no different from a John Wayne or Errol Flynn star vehicle. There`s very little depth to the story which seems at odds with the anti war visuals.I will defend the film slightly from the allegation of pro American bias. It`s an American film , made by Americans , with American money for a primarily American public. For a more subjective view on the Normandy landings see THE LONGEST DAY , or better still read the book. But the comment on Monty was uncalled for , Bernard Law Montgomery spent 4 years on the western front ( 1914-18 ) he was disgusted by the slaughter he saw there and made needless casualties his main concern. I bet the red army wished for a general like that on the Eastern front. Oh and Monty won the battle of El Alamein , thought I`d just mention it.So just to sum up SPR has some graphic battle scenes overcoming a flawed script. It`s a good film but nowhere near being a masterpiece. Maybe if it`d been set during the Korean war and been a lot more cynical it`d might have been a true classic. But as it is it`s a case of a B movie script saved by a brilliant director"},{"username":"bevo-13678","userUrl":"https://www.imdb.com/user/ur76062573","reviewLink":"https://www.imdb.com/review/rw5588053","warningSpoilers":false,"date":"29 March 2020","rate":"10","helpful":"2 out of 11 found this helpful.","title":"War","content":"Romantic comedy set during the war time. Intense and emotional with plenty of laughs on the side"},{"username":"Doylenf","userUrl":"https://www.imdb.com/user/ur1048771","reviewLink":"https://www.imdb.com/review/rw1473993","warningSpoilers":false,"date":"13 September 2006","rate":"8","helpful":"2 out of 6 found this helpful.","title":"Among the top war films of all time...","content":"SAVING PRIVATE RYAN stands alongside SCHINDLER'S LIST as one of Steven Spielberg's greatest achievements as a director. And just recently, I had the pleasure of re-discovering his EMPIRE OF THE SUN, and realized then how well he captures on film the horror and brutality of war without going in for stereotyped characters.During the '40s, when war films were largely produced for propaganda purposes and for injecting much needed patriotism into all Americans while we fought Hitler and Mussolini and the Japanese, we had films like A WALK IN THE SUN or GUADALCANAL DIARY or SO PROUDLY WE HAIL. All of them were fine, in their own way, but often resorted to creating Hollywood stereotypes among the characters, the soldiers and nurses who fought during the war.Not true here. From the startling twenty-minute opening sequence on the D-day invasion, through the intricacies of inter-personal relationships among a disparate group of men, we never once feel we're watching stereotypes but real people. All of the performances are first-rate, beginning with TOM HANKS, whose everyman personality is put to excellent use here. Others too numerous to mention do great jobs in the large supporting cast.No cheap heroics here, just a compelling war story, extremely well done and holding interest from beginning to end. Recommended highly.Trivia note: John Williams' score is never intrusive enough to damage the stark reality of some of the most brutal scenes."}],"errorMessage":""}