{"imDbId":"tt0137523","title":"Fight Club","fullTitle":"Fight Club (1999)","type":"Movie","year":"1999","items":[{"username":"TheLittleSongbird","userUrl":"https://www.imdb.com/user/ur20552756","reviewLink":"https://www.imdb.com/review/rw2251723","warningSpoilers":false,"date":"18 May 2010","rate":"9","helpful":"55 out of 77 found this helpful.","title":"You love it or you hate it, personally I loved it","content":"Perhaps a little too long, but Fight Club is just a very well-made, brilliantly written and superlatively performed film. Essentially a satirical fable, it tells of an insomniac loser teaming up with a seditious soap salesman to form a no-holds-barred-fight club as an outlet for their direction-less aggression. This concept is an intriguing and original one, and works really well. Then there is the script, it is absolutely superb, with dialogue that will make you both laugh and think. Fight Club is very well made, with elaborate production design, great editing and startling images. David Fincher's direction is brilliantly handled and the performances of Edward Norton and Brad Pitt are superb. Overall, just a great film, a mesmerising ride through the 1990s male psyche. 9/10 Bethany Cox"},{"username":"Leofwine_draca","userUrl":"https://www.imdb.com/user/ur0482513","reviewLink":"https://www.imdb.com/review/rw3504332","warningSpoilers":true,"date":"14 July 2016","rate":"10","helpful":"40 out of 49 found this helpful.","title":"Fincher's tour de force is a bruising assault on the senses","content":"David Fincher's dark, brooding assault on the senses employs much of the same style as he used in SEVEN, to great effect. This is a complex, intelligent film which, for a change, doesn't take the viewer for granted. A big streak of black comedy runs through the centre, making things a bit easier to cope with, but it's still a morose, disturbing film, a good film, yes, but not one which makes you feel good after watching it.The plot twists and turns continually, from beginning to end. Things start off on a relatively small scale to become outrageous and explosive at the film's finale. There's also one of those very-clever twists at the end, so favoured by the likes of THE USUAL SUSPECTS. There is plenty of sick humour, the highlight being the hilarious scene involving the liposuction fat - you'll know it when you see it.With a film like this, the acting has to be brilliant, and it frequently is. Edward Norton excels as the narrator of the story, caught up in all the madness, and it's a multi-faceted, psychologically-focused performance. Brad Pitt doesn't really stretch himself but he fits the bill well and isn't afraid to put off his female fans by appearing broken and bloodied in a film like this. Other actors, ranging from Meat Loaf to Jared Leto, are also very good.The violence is extremely brutal and unglamourised. Heads are knocked hard against concrete, acid is poured over flesh, teeth are knocked out, and noses are split open. This is a hard film to watch, but fascinating at the same time. Fiendishly clever and highly suspenseful, I would rate FIGHT CLUB as one of the best films of 1999 - on par with THE SIXTH SENSE, and just under my favourite, THE BLAIR WITCH PROJECT. Buy it, rent it, steal it, but be prepared: you won't be the same afterwards."},{"username":"SnoopyStyle","userUrl":"https://www.imdb.com/user/ur2898520","reviewLink":"https://www.imdb.com/review/rw3145138","warningSpoilers":true,"date":"20 December 2014","rate":"6","helpful":"39 out of 101 found this helpful.","title":"love the premise at the start but not the twist","content":"A nameless man (Edward Norton) suffering from insomnia is a traveling investigator for a car company. He goes to a support meeting. He is addicted and starts going to all kinds of support meetings. He encounters another meeting groupie Marla Singer (Bonham Carter). She is uninhibited. On a flight home, he encounters Tyler Durden (Brad Pitt) who makes his own soap. They bond over their dislike of consumerism. Man with no name loses his apartment due to a gas explosion. Outside a bar, Tyler asks him to hit him. He starts staying at Tyler's dilapidated isolated mansion.I want to like this a lot more. I want this movie to say something about consumerism and effeminization of society. I want this movie to take a profound stance on the state of the male position in modern society. It also touches on the isolation of the modern world. It seems set up for something great but then the movie gives a twist that takes much of the punch away. The movie becomes about the twist and I don't know what the movie says about anything else."},{"username":"Hitchcoc","userUrl":"https://www.imdb.com/user/ur0278527","reviewLink":"https://www.imdb.com/review/rw1562527","warningSpoilers":false,"date":"3 January 2007","rate":"9","helpful":"26 out of 35 found this helpful.","title":"It's Hard to Take Your Eyes Away","content":"I'm not much into graphic violence. This film transcends that. It has wonderful direction, and, even though it is brutal, it takes things to another ledge. Edward Norton is really controlled as he realizes his power. It's too easy to throw in spoilers so I will leave things to the viewer. The search for self and the growing cult around Fight Club made me suspicious. Still, to watch what happens to the two men at the center and what they are without Fight Club is the core. One of the neat things about this film is seeing it a second town makes it even better. The mental byplay between Pitt and Norton increases tension to explosiveness. If you want to see what can happen to a story when put in masterful hands, read the book (which is outstanding), and see the movie. They show that art forms can treat the same material, each in their own ways."},{"username":"Kirpianuscus","userUrl":"https://www.imdb.com/user/ur61197531","reviewLink":"https://www.imdb.com/review/rw3379567","warningSpoilers":false,"date":"24 December 2015","rate":"","helpful":"4 out of 10 found this helpful.","title":"useful","content":"more than a good adaptation. or a form of cultural revolution. more than chain of questions about life, its purpose, its direction, solution to every day crisis. a not comfortable exploration of solitude. a parable about the search of happiness and the answers to a too long and deep silence. a film who has as basic virtue the perfect cast. because it is the stage for Brad Pitt to proof not only the talent but the nuances of a character who is too fragile to not become a strange sketch. Edward Norton is the same and the science to transform his character in the perfect picture of ordinary man looking the chance to escape from himself is far to be surprising. a film about power who, more than brilliant adaptation, is a new chapter of the novel."},{"username":"Horst_In_Translation","userUrl":"https://www.imdb.com/user/ur3914439","reviewLink":"https://www.imdb.com/review/rw3190193","warningSpoilers":true,"date":"24 February 2015","rate":"6","helpful":"7 out of 32 found this helpful.","title":"Solid character study and a good performance from Norton","content":"\"Fight Club\" is an Academy Award nominated (sound effects) movie from roughly 15 years ago starring Edward Norton (a two-time Academy award nominee at under 30), Brad Pitt, Meat Loaf and Helena Bonham Carter. It's possibly the most famous movie from director David Fincher, although it's far from his best in my opinion. That does not mean it's a bad film. Not at all. However, many of the characters are simply way over the top that the film always is in danger of surpassing the fine line of entertainment and ridiculousness. It's based on a Palahniuk novel and the script comes from Jim Uhls, who had a surprisingly insignificant career after coming up with the words for this cult film.The dialogs are witty and almost too hip occasionally. It's not a film for easily offended people as it tends to be vulgar at times and the violence is graphic frequently, although that is certainly not a surprise for a film titled \"Fight Club\". In general, it's a pretty insane film, most of the time in a good way. The fact that two characters visit meetings of dying people, so they can feel better says it pretty much all already. I clearly preferred Norton over Pitt here and it is self-explanatory that Pitt did not get a single awards nomination for his work here. He becomes pretty much a caricature at times. Then again, his character does not really exist, so this can be used as some kind of apology I guess. The final plot twist comes unexpected and reminded me of the one in \"The Usual Suspects\", only that the main character is still unaware of his true identity. By the way, Norton looked pretty much the same age in this film as now 15 years later when he scored another Academy Award nomination for his work in a Best Picture winner.The ending was pretty great though and I liked how, with the disappearance of Pitt after the gunshot, we finally see also the darker side of Norton's character when he and Bonham Carter's character watch the explosions. But how did that gunshot do so little damage? Did the pain make Pitt's character go away? Anyway, \"Fight Club\" is a good movie. Not one of my personal favorites, but an entertaining 140 minutes, during which it almost never drags. One of my favorite scenes was near the end at the police station when he gets interrogated and almost emasculated. That was pretty funny there. Recommended."},{"username":"bob the moo","userUrl":"https://www.imdb.com/user/ur1002035","reviewLink":"https://www.imdb.com/review/rw0521664","warningSpoilers":false,"date":"30 December 2002","rate":"","helpful":"14 out of 30 found this helpful.","title":"Visually stunning, conceptually brave and only the odd sag","content":"Our narrator is a white-collar worker who has his life to a point it could be called normal. His home is decked out in the pornography of IKEA catalogues and he is professional. However he is somehow dissatisfied with his life as it is and drifts from various support groups faking disease just to get love and emotional outlet. A chance meeting on an airplane with soap salesman Tyler Durden gives him pause and, when his flat is destroyed in an explosion, he turns to Durden for help. Together they begin to move into a world that isn't commercially based, where pain helps them to feel more alive. Together they start a small group called Fight Club where men can experience the thrill of a fight without the danger. However the groups grow rapidly and begin to carry out subversive activities at large. When confronted by our narrator, Durden disappears our narrator in charge of a semi-cult group that is operating without his knowledge.I didn't get round to seeing this film until it came to TV in the UK recently. So over several years I had generally been told that it was a `great movie\u0099' \u0096 mostly by people who had HEARD it was a great movie rather than those who had seen it. So I expected greatness and was taken a little aback by the fact that this wasn't a normal Hollywood film but something much more worth while. The reason I'm surprised that it ranks so highly and did so well is that it requires concentration and thought. The plot is basically a comedy, making fun of us. That's how I saw it \u0096 that we are like the narrator but we must accept that this is our lives to some extent, to go to the other extreme is just as bad if not worse. It is a very clever story and it only dipped in quality at one point for me \u0096 where the clubs first begin to become something more sinister (more!) and move into terrorism.Part of the reason it was so well watched is the stars but also the very cool direction that made it stand out to the student generation as something deep (even if they didn't get the film). I think this ironic as they haven't hit the stage of our narrator and can't fully relate. However the direction is praise worthy and Fincher was the best man for the job. Full of clever shots and great images the film is a joy to see. The one flaw I had was the sincerity of the film. Many love it because it is anti-capitalist in nature, making fun of IKEA-love etc. The film is preaching to us about this (and the other) extreme \u0096 but most people watching and making it will be living that exact life! However this is minor and it became less as the film went on and mocked both ends of the scale.The stars do well and I wonder if they worried this would be too highbrow and flop? Norton is simply a great actor when given the material and he delivers here. Even with the more extreme actions (that aren't real) he carries them off as convincing. Pitt enjoys himself well in the joint lead although his character is basically one dimensional (for obvious reasons). That said he is very strong and takes you with him as he gets more extreme. Carter is a weak link to me and I never really bought her character. A shame as she is quite central but it doesn't spoil it too much. Support cast are good, but putting a face like Meat Loaf in a very unusual role just made him stand out and distract from the role.Overall this is an excellent movie. Even if you don't get it, it is still great fun to watch. It is a brave story to try in a Hollywood film and it is superbly directed, acted and told. Some may rave about it too much but it is well worth a look. If only out of interest rather than to change your life."},{"username":"classicsoncall","userUrl":"https://www.imdb.com/user/ur2707735","reviewLink":"https://www.imdb.com/review/rw2479972","warningSpoilers":true,"date":"26 August 2011","rate":"8","helpful":"7 out of 17 found this helpful.","title":"\"We have front row seats for this theater of mass destruction\".","content":"There's a not so subtle irony in the premise of this picture that managed to intrude on my consciousness about the time I learned about Strinne green stripe patterns. Society's obsession with material goods has a dehumanizing effect on the individual, leading some to destructive behavior in an attempt to rid the shackles of mindless adherence to a herd mentality. Whenever this idea is presented in a commercial venture however, it itself falls victim to a form of circular logic. The success of the film depends on it's ability to denigrate itself as a form of commercial enterprise or achievement. The same can be said of the principal players; I highly doubt that Brad Pitt or Ed Norton go around bemoaning the fact that their wealth is somehow an obstacle to their self worth as human beings. There's an element of hypocrisy in all this, but I won't begrudge the actors or director for their part in it. They're trying to make a statement in a unique way, and often have to deliver a punch to the gut to get there.By the way, if you're paying attention, a clue to the identity of the narrator comes early when Tyler Durden (Pitt) opines on his views of life and mentions those same Strinne green stripe patterns. That line jarred me about as much as it did Ed Norton's character; the look on his face at that moment betrayed a moment of introspection that would be revealed at the end of the story. That was actually a clever clue planted by director Fincher, because the odds of two different people coming up with the exact same concept about home furnishing options defies probability.The troubling aspect about the film, aside from it's message however, is the glorification it seems to convey upon a youth culture bent on a form of self destruction. You see it in the copy cat rise of actual fight clubs in the wake of the picture, along with other forms of physical mayhem like extreme wrestling. One doesn't absorb the pain in real life quite as nobly as Tyler did while mocking the garage owner. But I guess some will only learn the hard way.Hey, did you catch that newspaper clipping that mentioned the street violence that was occurring after the fight club concept gained prominence - 'Missing Monkeys Found Shaved'. I wonder if there were twelve of them."},{"username":"lee_eisenberg","userUrl":"https://www.imdb.com/user/ur4888011","reviewLink":"https://www.imdb.com/review/rw1198245","warningSpoilers":true,"date":"21 October 2005","rate":"10","helpful":"29 out of 50 found this helpful.","title":"This is what great movies are all about!","content":"In the grand scheme of things, \"Fight Club\" is less about a group of people who like to fight than about how the commercialism inherent in our society drives people over the edge. The unnamed narrator (Edward Norton) joins up with soap-maker Tyler Durden (Brad Pitt) to found Project Mayhem, whose goal is to undermine everything corporate. Part of their modus operandi involves starting fistfights. But at some point, the narrator realizes that it's going too far...and he's helpless to stop the madness.\"Fight Club\" was certainly one of the best movies of 1999. Not just because it was a full-scale indictment of commercialism, but also because the acting, script and direction are all top-notch. This movie is one of the best examples of a modern classic."},{"username":"jboothmillard","userUrl":"https://www.imdb.com/user/ur4248714","reviewLink":"https://www.imdb.com/review/rw1345439","warningSpoilers":true,"date":"19 April 2006","rate":"8","helpful":"3 out of 60 found this helpful.","title":"Fight Club","content":"I first watched this film during my time at college, and then possibly once a couple of years later, and I'm glad I made an effort to watch it properly when I got the opportunity again, directed by David Fincher (Alien³, Se7en, The Social Network, Gone Girl). Basically, a nameless automobile recall specialist, known only as the Narrator (Edward Norton), is bored by his lifestyle and suffers severe insomnia. To help him sleep, he starts attending group therapy sessions for people who are living with various diseases, posing as a sufferer himself. At the group for testicular cancer, he meets ex-bodybuilder Robert 'Bob' Paulson (singer Meat Loaf), who went through hormone treatment after his testicles were removed. Then he meets fellow imposter Marla Singer (Helena Bonham Carter), whom he refers to as a \"tourist\", who attends the same groups, ruining his bliss. The two agree to split which groups they attend. On a flight home from a business trip, the Narrator meets soap salesman Tyler Durden (Brad Pitt). Tyler is also a part-time cinema projectionist, slipping clips of pornography between reels of movies, including during family films. The Narrator returns home to find his apartment and all his possessions have been destroyed following an explosion, a suspected bombing. Feeling lost without his material goods, he calls Tyler, and they meet at a bar. Tyler tells him he is trapped by consumerism, and in the parking lot he invites him to live with him. He asks the Narrator to hit him, and the two engage in a fistfight. The experience is surprisingly euphoric, and they agree to do it again. The Narrator moves into Tyler's home, a large, dilapidated house in an industrial area. Tyler and the Narrator have more fights outside the bar, soon attracting crowds of men, many of whom want to engage in fight themselves. Over the coming days and attracting more men, Tyler and the Narrator move from the parking lot into the basement of the bar, establishing the formal and official \"Fight Club\". The rules (decided by Tyler and the Narrator) of Fight Club: 1st rule: You do not talk about Fight Club, 2nd rule: You do not talk about Fight Club, 3rd rule: If someone yells \"Stop!\", goes limp, taps out, the fight is over, 4th rule: Only two guys to a fight, 5th rule: One fight at a time, 6th rule: No shirts, no shoes, 7th rule: Fights will go on as long as they have to, and 8th and final rule: If this is your first night at Fight Club, you have to fight. Marla telephones the Narrator to tell him that she overdosed on pills; he ignores, but Tyler goes to her apartment and saves her. They begin a sexual relationship, much to the Narrator's irritation. Tyler warns the Narrator never to talk to Marla about him. At work, the Narrator finally confronts his boss Richard Chesler (Zach Grenier) with knowledge about substandard practice and blackmails his boss for his company's assets to keep his mouth shut. When his boss objects and calls security, the Narrator beats himself up severely, leading the security to believe that the boss assaulted him; the Narrator quits his job and gets funding for Fight Club. More new members join Fight Club, including Bob from the support group. Then, without the Narrator's knowledge or involvement, Tyler recruits Fight Club members to become part of a new anti-materialist and anti-corporate terrorist organisation, Project Mayhem. The group engages in subversive acts of vandalism, gaining police attention and making the news, increasingly troubling the Narrator. One night, the group confront police chief Commissioner Jacobs (Pat McNamara), threatening to castrate him if the investigations continue. After the Narrator complains that Tyler has excluded him, Tyler reveals that he was the one who blew up the Narrator's apartment. When Tyler disappears for a while, Bob is shot dead by the police fleeing from a sabotage operation, and the Narrator tries to halt the project. The Narrator follows travel documents to try to find Tyler, and in the process, discovers Project Mayhem has spread throughout the country. In one city, a project member addresses the Narrator as \"Mr. Durden.\" Confused, the Narrator calls Marla to ask if they have ever had sex, she is irritated but confirms their relationship and refers to him as \"Tyler\". After Marla hangs up, Tyler suddenly appears and confronts the Narrator, revealing that they are indeed the same person, dissociated personalities because of his severe insomnia; the Narrator became Tyler when he believed he was sleeping. After blacking out, the Narrator returns to the house and uncovers Tyler's plan to destroy many buildings within the financial district, thereby erasing debt and all credit card company records. He apologises to Marla and warns her that she is in danger, she refuses to listen to him having become tired of his contradictory behaviour, but he gives her money to get out of town, without telling him her where she will go. He tries to warn the police, but the officers are members of the Project. Then he tries to disarm a bomb in one of the targeted buildings, but Tyler subdues him. Tyler holds the Narrator at gunpoint on the top floor of the building. The Narrator realises that, as he and Tyler are the same person, the Narrator is holding the gun. He fires it into his own mouth, shooting through his cheek, killing Tyler, ending his mental projection and control of him. Project Mayhem members bring a kidnapped Marla to the building, they leave them alone. Seeing him injured, Marla comforts the Narrator, and they hold hands as they watch the many the buildings collapse following the explosions. Also starring Jared Leto as Angel Face, Rachel Singer as Chloe, Van Quattro as Detective Andrew, Markus Redmond as Detective Kevin, Michael Girardin as Detective Walker, Terminator 3's David Andrews as Thomas. Pitt is fantastic as the anarchistic gang leader, Norton as the unnamed directionless insomniac loser, Carter is good as the heavy-smoking love interest, and Meat Loaf is terrific in his scenes. I thought it was going to be complicated, but I focused and found it intriguing and clever, the extreme violence is hard to watch, but the playful cinematic style, elaborate production design, unconventional editing, startling images, and great acting make this film stand out, no wonder it has gained a cult following, an impressive must-see satirical drama. It was nominated for the Oscar for Best Sound Effects Editing. Brad Pitt was number 15 on The 100 Greatest Movie Stars, he was number 5 on The 100 Greatest Sex Symbols, Pitt was also number 52 on The 100 Greatest Pop Culture Icons, and Helena Bonham Carter was number 41, and Pitt number 30 on The World's Greatest Actor, Carter was also number 13 on The 50 Greatest British Actresses, and the film was number 36 on Film 4's 50 Films To See Before You Die. Very good!"},{"username":"rmax304823","userUrl":"https://www.imdb.com/user/ur0819382","reviewLink":"https://www.imdb.com/review/rw1739696","warningSpoilers":true,"date":"1 October 2007","rate":"5","helpful":"20 out of 56 found this helpful.","title":"Rebels without a cause.","content":"It's very impressive visually, nicely directed, well acted, scripted in a literate way, and immeasurably depressing.I suppose the plot has been covered in detail elsewhere so I'll keep it brief. The narrator (Edward Norton)is a bored, anomic insomniac who doesn't know why he's alive. He runs into a creepy and insulting babe (Helena Bonham Carter) who seems to care about nothing. Then he meets a brutally honest Tyler Durden (Brad Pitt) who seems to see through everything and everyone, who actively hates and engages in combat against modern ennui and phoniness, and things start to pop. Pitt and the narrator found Fight Club in which men who would otherwise be leading lives of quiet desperation get to pound the crap out of one another. Fight Club franchises spring up everywhere as men search for their lost cojones. Pitt becomes a cult leader and wages war against corporate art with homemade explosives. The upshot of all this, I won't reveal.I didn't like it at all. At first I thought it was going to turn into one of those Gallic philosophical conundrums with a lot of pointless non sequiturs in the foreground. (Narrator: Is Tyler Durden in my dream? Or am I in his?\") Then it appeared to morph into an excuse for more bloodshed and violence. And then it got really twisted. I never realized a guy could shoot off a large-caliber pistol in his mouth and carry on a normal conversation five minutes later.It will, I suppose, be claimed that this is an original -- in contrast to the formulaic rubbish ground out by Hollywood these days. True enough, but it's not all THAT original. Proving your masculinity by enduring punishment? Is there a Rambo movie in which Stallone doesn't bleed, or get himself dipped in pig excrement, or electrocuted half to death, without flinching? In the stockade, in James Jones' \"From Here to Eternity,\" the guards treat the inmates with unspeakable brutality. So what do the prisoners do to prove their transcendance of authority? They beat hell out of each other, in games, in ways that the guards wouldn't have the imagination to dream up. Not to mention a hundred movies about The Big House and POWs and slaves biting their tongues during whippings.The punishment within the group is only part of the story, of course. It leads to a consideration of secret cults and their desire to rid the world of credit cards. We've had that before too, with Charlie Manson and the Reverend Jim Jones. And if Tyler Durden is going to insult the narrator by calling him \"Ikea Boy\", and if the group is going to assault society by demolishing icons like Starbucks, don't they have some kind of obligation to provide more constructive icons? Shouldn't they have some sense of beauty, truth, and logic that takes them beyond moral nihilism? Or is the movie actually saying that Western civilization SHOULD be destroyed? The film is ugly to watch, partly because the message itself is so banal, and partly because the imagery is so repulsive. The back of somebody's head is blown off. Human fat is boiled down to make soap. Fight Club members lives in an abandoned house near a toxic waste dump amid unutterable squalor. They don't seem to change clothes. (The narrator shows up for work at his office with his own blood on his shirt.) They don't bathe. Brad Pitt shuffles around in a filthy bathrobe wearing a pair of lady's slippers with clotted fur around the tops, as Doris Day might appear during a trip on battery acid. It isn't that I find such voluntarism necessarily bad. I'm sitting here writing this, wearing only a sarong and a pair of eyeglasses in the middle of the desert. But doesn't bodily filth reach a point at which it becomes intolerable to the self, never mind the person you're trying to sell your homemade soap to? Mostly, though, what a beastly message. If you want to swagger around, a member of a cult, dealing out summary punishment to those whose values aren't your own, why not join Blackwater or some other mercenary group and at least get paid more than one thousand dollars a day. Or if you really want to get in your face with respect to bourgeois verities, give away everything you have and serve soup to the homeless at St. Anthony's Dining Room. Or vote Libertarian? Or become a Theravada Buddhist monk, earning merit and living on alms? I guess, though, that nothing like that is going to get your testosterone pumping and that's what concerns this movie. Know when blood testosterone levels peak in men? During late adolescence, when our fantasies are even more limited than our brain power."},{"username":"ccthemovieman-1","userUrl":"https://www.imdb.com/user/ur4445210","reviewLink":"https://www.imdb.com/review/rw1315166","warningSpoilers":true,"date":"14 March 2006","rate":"5","helpful":"20 out of 86 found this helpful.","title":"Sordid Flick That AppealsTo Young Crowd","content":"Like \"The Sixth Sense,\" this is a film that has such a surprise ending that one almost needs to go back and see this again, from a different perspective. I can't say more without having to provide spoilers.This is a sick movie but I found it interesting in a perverse way. I am sorry so many young people love this movie so much because sordid and sleazy stories should not be so appealing.On the positive side, what I found most interesting was:(1) Pitt's character is totally without God but some of things he says about materialism sound really Biblical in nature. They were fascinating comments. (2) This film is stylishly-shot, a nice movie if you appreciate visuals as I do. (3) Edward Norton's narration was excellent.The characters in here are not clean-cut, high-ideal role models, to say the least. That includes Helena Bonham Carter's role in here. I couldn't take any of these people on the first viewing, but when a profanity filter was invented, I gave this another shot and the rating of the film was elevated from a 3 to a 6.5. Still, even with a filter, this is a bit too sleazy for middle-aged oldies like me. A sad comment that \"nasty\" seems to be so appealing to kids these days."},{"username":"BA_Harrison","userUrl":"https://www.imdb.com/user/ur0945066","reviewLink":"https://www.imdb.com/review/rw3406295","warningSpoilers":true,"date":"31 January 2016","rate":"5","helpful":"3 out of 27 found this helpful.","title":"Scrappy.","content":"After whinging to his doctor about his insomnia, a frustrated office worker (Edward Norton, whose character is simply called The Narrator) is advised to attend a support group for testicular cancer to see what real suffering is like; there, he experiences an emotional release that finally allows him to get some much needed shut-eye. Consequently, The Narrator becomes addicted to support groups, feigning illness to attend, but the appearance of another such 'tourist', Marla Singer (Helena Bonham Carter), makes him feel awkward about his dishonesty, and he once again struggles to sleep.While flying home from a business trip, The Narrator strikes up a conversation with travelling soap salesman Tyler Durden (Brad Pitt). The pair part company at the airport, but when The Narrator discovers that his apartment has been blown up in a freak accident, he calls the number on Durden's business card. The guys meet up and strike up an unlikely friendship which sees The Narrator discovering another solution to his sleep issues: bare knuckle bouts with Durden. Eventually, other guys looking for a release from their mundane existences join in the fun, and Fight Club is born.For a film dealing with ***Spoiler Alert!!!*** dual personality, it seems only fitting that I'm in two minds about Fight Club.I appreciated the sentiment that 'you are not your job, you're not how much money you have in the bank, you are not the car you drive, you're not the contents of your wallet', but disliked the script/story as a whole, which is full of contrivances, inconsistencies and quasi-intellectualism.I loved the dark humour and the brutality of the fight scenes (although cannot accept for one minute that men would line up to be beaten to a pulp), but I hated director David Fincher's showy approach to the rest of the film, which is over-reliant on slick CGI trickery (that actually looks very dated by today's standards).I admired Edward Norton's performance, but disliked Pitt's, and hated Bonham Carter's.I hated the silly twist that could be seen a mile away, but was amused by the subliminal image that appears seconds before the end, and enjoyed hearing The Pixies over the closing credits.To reflect my mixed feelings about Fight Club, I give it a middling rating of 5/10."},{"username":"moonspinner55","userUrl":"https://www.imdb.com/user/ur0989035","reviewLink":"https://www.imdb.com/review/rw0521522","warningSpoilers":false,"date":"24 May 2002","rate":"5","helpful":"19 out of 76 found this helpful.","title":"Scaled like an apocalyptic street-nightmare...","content":"...but \"Fight Club\" is much more intriguing in its smaller moments, where it finds a surreal, dream-like quality that seems to snake around at will. The film is tough and unyielding in its machismo, and although it is occasionally off-putting, I was never bored watching it. The acting, by Brad Pitt and Edward Norton in particular, is quite good; the two stars have obviously been put through the wringer in their roles, and director David Fincher keeps cranking up the tension and puts us through the wringer as well. But I felt the filmmakers slipped at the final gate, wherein the script concocts a major plot-twist that just doesn't jell, leading everyone to look a little foolish. **1/2 from ****"},{"username":"TxMike","userUrl":"https://www.imdb.com/user/ur0438066","reviewLink":"https://www.imdb.com/review/rw0521334","warningSpoilers":true,"date":"11 August 2000","rate":"","helpful":"13 out of 22 found this helpful.","title":"\"Fight Club\" requires a lot of viewer trust and patience, but the reward is a very fine movie.","content":"\"Fight Club\" runs a bit over 2 hours. For the first 1 hour and 51 minutes I found this movie very difficult to watch or enjoy. I kept wondering why Ed Norton's character continued to put up with Brad Pitt's out-of-control character. To me the movie seemed to be one big mess. However, my patience, and trust in the director, paid off and I had to watch much of the movie twice to really appreciate how good it is. I rate it 9 of 10 and predict it will be one of those ground-breaking films that viewers and critics refer to for years, much like \"The Matrix\" and \"The Sixth Sense.\" It is definitely for someone with a mature mind, who can understand subtleties, and who enjoys \"studying\" a film. This film is definitely meant to be a funny and absurd take on life, but with a very dark tone to it. It isn't really about \"fight clubs\", although the fighting is presented as an avenue for characters to deal with their inner conflicts. It is not intended to represent reality, nor to suggest that fighting is good. It's closest prior film is perhaps \"Doctor Strangelove.\"I saw this film on DVD. The sound is perhaps the best I've heard so far. There are several crashes and explosions throughout the movie and the realism is just so good it made me cringe. But you have to have a good subwoofer to enjoy it all.Now - CAUTION - SPOILERS FOLLOW - READ AT YOUR OWN RISK.However, I think most people will enjoy the movie more, on first viewing, if they understand the total concept. So here it is.Norton plays the \"narrator\", and in the introductory scenes we find out he has a conventional existence, a traveling job as a \"recall coordinator\" for a major automobile manufacturer. By his own admission he is \"a slave to the IKEA nesting instinct\", travels with his \"CK shirts and DKNY shoes\", and says of his total existence \"close to being complete.\" \"Fighting\" is completely foreign to him. But, deep in his subconscious he hates what he is becoming, and if he were to die now his life will have been meaningless.Brad Pitt's character, Tyler Durden, is Norton's alter-ego. They are one and the same person. In opening scenes you see various single-frame flashes (stop-action on DVD helps see this clearly) of Pitt's 'Tyler', we assume still in Norton's subconscious as he first begins to realize he hates his existence.Then, on a buisness flight, while talking to the lady seated next to him, Norton thinks \"I pray for a crash or midair collision\", which is quickly followed by a highly realistic \"dream collision\", then Pitt's Tyler Durden the rest of the trip is actually sitting next to Norton, conversing with him. This \"prayer for a crash\" is the consciousness that first makes Pitt's Tyler totally real to Norton.The rest of the movie has many scenes with both Norton and Tyler but, we see later, no one else ever sees Brad Pitt's \"Tyler\", they only see Norton as \"Tyler.\" Brad Pitt's Tyler is explained this way, \"You were looking for a way to change your life. You could not do this on your own. All the ways you wish you could be - that's me. I look like you want to look... am free in all the ways you are not. Little by little you're letting yourself become - Tyler Durden.\"The movie's title is unfortunately misleading, because only a small part of the movie is really about the fighting, which is used as a way for disillusioned men to get out their frustrations. One line by Norton, \"This kid from work, Ricky, couldn't remember if you ordered pens with blue ink or black. But Ricky was a 'god' for 10 minutes when he trounced the maitre d' of the local food court\", explains the gist of why they fight. It symbolizes the one area where they are in complete control of their pleasure and pain.That last comment, \"maitre d' of the local food court\" illustrates the comedic approach to much of the movie. Who ever heard of a food court having a maitre d'? How much lower in the food chain could you get? Or Ricky supplying ink pens at work? One of the fight club \"assignments\", to pick a fight with a stranger, then lose\", has a number of very funny sequences in it.The movie turns very dark when the fight club kicks itself \"up a notch\" and begins to plot the destruction of all major buildings housing credit card companies. The rationale - destroy them and all their records of debt, and everyone can start again at ground zero. When Norton's Tyler finally at 1 hour 52 minutes into the film finally figures out what he had done, he tries unsuccessfully to twarth the plan. The final scene shows him and his girlfriend standing before a window in a high-rise, and sequentially all bombs go off and the buildings crash into various piles of rubble. Reminiscent of the final scene of \"Doctor Strangelove\", where all the nuclear bombs are going off, destroying the world.The closing line, Norton says, \"Everything will be alright. You met me at a really strange time in my life.\" Again, dark humor.The genius of this film, if there is any, resides in the premise that the two main characters represent the two extremes of the same person, and in the end the \"real\" Tyler Durden meets them in the middle. Once you know this premise, and can watch the whole movie in this context, I found it much more enjoyable, made much more sense, and every scene with both Tylers is done completely in character with the premise.The DVD also has a second DVD which is devoted to extras which are in themselves very interesting if you like to study the art of film-making. However, plan to spend a minimum of 5 hours total in viewing and studying this film to get its full impact."},{"username":"blanche-2","userUrl":"https://www.imdb.com/user/ur0342623","reviewLink":"https://www.imdb.com/review/rw2304689","warningSpoilers":false,"date":"2 September 2010","rate":"10","helpful":"7 out of 13 found this helpful.","title":"Quite an accomplishment","content":"Brad Pitt and Edward Norton are in the \"Fight Club,\" a 1999 film directed by David Fincher and written by Jim Uhls. The movie also stars Helena Bonham Carter, Meat Loaf, and Zach Grenier.Edward Norton is Jack, the Narrator of the film (though there is some controversy over his name). Tired of his job, his life, and his boss, he finds great satisfaction by attending group sessions for alcoholics, drug addicts,compulsive gamblers, compulsive eaters, cancer victims, etc. He soon encounters another group groupie, the bizarre Marla Singer (Carter), and realizes that when she's in a group with him, he has no release of his feelings. So the two make a deal and split up the meetings and the nights they attend.When Jack returns from a trip, his apartment is in flames. With nowhere to go, he calls a man he met on the plane, Tyler Durden, and goes to live with him in an old, decrepit, filthy house. The two soon become involved in forming an underground Fight Club, where Jack finds the release he seeks, learns who he is as a man, and develops assertiveness and courage.Okay, like \"Mulholland Drive,\" that's the story on the surface, but the film isn't really about what was described above. It's a complicated, dark, violent story about tearing down superficial values, ripping into rampant consumerism, and really feeling and living instead of existing.\"Fight Club\" starts off as quite funny, actually, with Jack and Marla arguing over who's going to the prostate cancer meeting, and becomes progressively darker, stranger, and faster as it races to a surprising ending. Unfortunately for me, it took me too long to see the film, so the ending wasn't such a surprise. I would have loved to experience the full impact of it.The performances from Norton, Pitt, and Carter are fabulous. All three are shown to their absolute best advantage. Norton for some reason is always a little underrated. He does a beautiful job. Carter years ago made a seamless transition from ingénue to leading lady, and this, like Mrs. Lovett in Sweeney Todd, is more of a character role.\"Fight Club\" is horrific to watch in parts because of the violence, but it's worth getting through it to see a truly masterful film."},{"username":"dbdumonteil","userUrl":"https://www.imdb.com/user/ur1219578","reviewLink":"https://www.imdb.com/review/rw0520390","warningSpoilers":false,"date":"27 September 2001","rate":"10","helpful":"15 out of 29 found this helpful.","title":"The things you own ends up owning you.","content":"What's fascinating in David Fincher's work,is that it seems we deal with an auteur.He created his own universe,a nocturnal and filthy one,and a bit misogynous too:it's glaring in this movie;outside Bonham-Carter-made look ugly and dressed as a 1977 punk-,only a black woman has a line to say.Almost everywhere,it is a man's man's world where no women appear even in the settings.This movie was influenced by famous and not-so-famous predecessors:of course \"Dr Jekill and Mister Hide\" to which Bonham Carter hints at in the restaurant,\"a clockwork orange\" ,\"rebel without a cause\" \"bad influence\" and Joel Schumacher's \"falling down\",the latter seems with hindsight to have been overlooked and underrated.So why does this movie seem so original?it owes a lot to E.Norton (more than Pitt)who had already overshadowed R.Gere in \"primal fear\".Here he plays a very strange kind of peeping tom:watching mental suffering (therapy groups ,dealing almost essentially with male problems),then physical sufferings,eventually enduring them.Does he do that as he would opt for yoga,Buddhism or psychotherapy,to escape from a routine work?To get free from the material world?As Pitt says \"the things you...\"The problem is that Norton does not seem to be so free.At first,he may be, when he's only a simple spectator-and the scenes in the restaurant and in the projection room are peaks of black humor-,but,he's potentially a Stevensonian hero.There's a big coup de theatre in this movie, a breathtaking and unexpected twist ,à la \"sixth sense\" ,\"Jacob's ladder\" or\" Usual suspects\" ,and it's difficult to comment this movie :all you say is questioned when you KNOW.Of course I won't reveal it,but I think it's the biggest flaw of the movie.Unlike the three mentioned works,this does not seem logical,because of the lack of \"clues\":the only one ,regarding Bonham-Carter, is not really convincing.The last picture seems now terrifying."},{"username":"Quinoa1984","userUrl":"https://www.imdb.com/user/ur0453068","reviewLink":"https://www.imdb.com/review/rw0521028","warningSpoilers":false,"date":"10 April 2000","rate":"10","helpful":"8 out of 16 found this helpful.","title":"One of Norton's best, year too","content":"Chuck Palahniuck's Fight Club is a exciting, stimulating and surprising look at a typical macho porn (coincidence to porn, at the end of the movie, look real close for Brad Pitt's d***). The movie circles around a man (a usual great performance by Ed Norton, who plays this man but is only know as narrator) who has a dead-end job and life until he meets a man played by Tyler Durden (played well by Brad Pitt) who convinces him that the best way to live is to beat each other senseless. Soon a club starts, and a type of fascist society of fighting men are abound. This film takes many turns, many odd ones at that, but it is cool, action packed, and sometimes even funny. One of the best of the year and Fichner's best since Seven."},{"username":"wes-connors","userUrl":"https://www.imdb.com/user/ur15896852","reviewLink":"https://www.imdb.com/review/rw2073768","warningSpoilers":false,"date":"30 May 2009","rate":"10","helpful":"3 out of 10 found this helpful.","title":"Do Not Go Gently Into This Good Fight","content":"According to the official studio synopsis, David Fincher's film is described: \"A ticking-time-bomb insomniac (Edward Norton) and a slippery soap salesman (Brad Pitt) channel primal male aggression into a shocking new form of therapy. Their concept catches on, with underground \"fight clubs\" forming in every town - until a sensuous and mysterious woman (Helena Bonham Carter) comes between the two men and ignites an out-of-control spiral toward oblivion.\" Meatloaf again. As you'll discover, the film's official synopsis isn't even remotely correct; but, it's a good way to \"sell\" \"Fight Club\". This film is violent and *pornographic* - this is a WARNING - but, except for Jared Leto's silly putty face make-up, the cast cleans up well. The beatings are brutal, but help make the film's point, and are a part of the protagonist's madness. \"Fight Club\" is a comedy about the lead character's rejection of society's domestication of his life. Or, it could be about something else...To Be a Man.The film received an \"Academy Award\" nomination for the \"Sound Effects\" by Richard Hymns and Ren Klyce (beaten by the first \"Matrix\" and the latest \"Star Wars\"). \"Fight Club\" is excellent in many ways, but isn't (and shouldn't be) as polished a \"production\" as 1999's big winner, \"American Beauty\" - a film which opened simultaneously, and presented critics with more palpable male angst. \"Supporting Actress\" Carter deserved some consideration for her memorable \"Marla\"; she even sings gets in a few lines from the \"(Theme From) Valley of the Dolls\".********** Fight Club (9/10/99) David Fincher ~ Edward Norton, Brad Pitt, Helena Bonham Carter, Meat Loaf"},{"username":"michaelRokeefe","userUrl":"https://www.imdb.com/user/ur0449021","reviewLink":"https://www.imdb.com/review/rw2057977","warningSpoilers":true,"date":"26 April 2009","rate":"8","helpful":"8 out of 13 found this helpful.","title":"Self help to the extreme.","content":"A dark comedy with a cult following. Director David Fincher takes Chuck Palaniuk's novel to maybe a harsher and dangerous place. Known only as The Narrator(Edward Norton)is a corporate employee that is no longer enchanted by his elaborate apartment and its expensive furnishings and pretty much disenfranchised from life itself and is concerned with his lack of ability to sleep. He attends self-help groups to relish in not being as miserable as the people surrounding him. He meets a suicidal Marla Singer(Helena Bonham Carter), but wants to distance himself from her. Life changing is his meeting with a soap salesman Tyler Durden(Brad Pitt), who is anarchy's poster child. Durden thrives on being a roguish rebel and convinces The Narrator into staging impromptu boxing matches in parking lots and deserted building basements. These matches are bare chested and with bare knuckles. The fighters beat the living crap out of each other until one yells stop. Durden is credited with starting fight clubs across the nation; and eventually turns the clubs into aggression laden pranksters releasing their malice on corporate America.Brutal violence and strong language is to be expected along with some pretty graphic images. Also in the cast: Meat Loaf, David Andrews, Zach Grenier, Jared Leto and Eion Bailey."},{"username":"tedg","userUrl":"https://www.imdb.com/user/ur0643062","reviewLink":"https://www.imdb.com/review/rw0521215","warningSpoilers":true,"date":"24 June 2000","rate":"","helpful":"26 out of 50 found this helpful.","title":"Flashback Humor","content":"(Spoilers herein) Films like this frustrate. This is so competent, so engaging that I curse it for wasting the chance to say something memorable, or important or perhaps both.What's good is the way that they've solved the `narrator problem.' here, the narrator has imagined the hero (we find out), which is rather clever. We become cocreater of the hero because the narrator has cast the whole film as a conversation with us to explain the last scene which we see in flashback at the beginning of the film. Along the way, we are reminded that we are messing with the film, and the film with us. This latter goes so far as to have the hero work as a projectionist, explaining cigarette burns. He inserts subliminal pornography, which we see throughout with a longer, more noticeable flash toward the end. When we find out about Pitt's non-existence, it is underscored by images on `video.' Add to that the inherently cinematic nature of voyeuristic personal violence, and this film has us captured.When we return to the last scene, Pitt tells us that the whole thing is `flashback humor,' the most strongly selfreferential trick I know in film. Obviously, the self-referential notion of narrator is the reason for this film. That's why Ed Norton bought the film rights to `Motherless Brooklyn,' which exploits a similar experiment in the narrative mystery. In that case, the narrator has Tourette's.So the film competently captures us, and then what? A wasted opportunity. My major complaint is that this film meant nothing, imparted nothing, only thumbed its nose as if to say: I can capture you as easily as the doofuses in the story and for just as capricious a reason. We deserve better. You with talent should do better.Lesser complaints:Norton and Pitt are excellent, though Pitt has much the simpler requirement. Why waste Helena Bonham Carter? She's got the moxie; she's been memorable before. I think the director just didn't know how to use her beyond a vapid sullenness. Another wasted opportunity.Narrative tricks like this are best when they follow the detective story `play-fair' model. This is what `The Sixth Sense' does. On a second viewing of that film, everything works, but with new information. More, some minor problems become clearer. Not so with this film. The writers have played too fast and loose with motivations. It is rather in the `oh, that was a dream' or the `oh, time travel reversed that' category. And it could have been tidier in this regard without messing anything up.Most every scene was weird (a good) because it ran against short-term expectations. But the scene where Lou and thug visit the fight club is pure stereotype, and predictable. Why?I wish the last scene were more, more something. This is where it really begins to hit you that the whole thing was motivated by an illusion, with as much effect.Bottom line: this film is so good, and its makers so talented that should be held to higher standards. I give it a 9 for competence. You should see it for that reason. But it has no purpose."},{"username":"Theo Robertson","userUrl":"https://www.imdb.com/user/ur1532177","reviewLink":"https://www.imdb.com/review/rw0521695","warningSpoilers":true,"date":"12 February 2003","rate":"5","helpful":"53 out of 200 found this helpful.","title":"So Pretentious . So Overblown . So Overrated","content":"!!!! POSSIBLE SPOILERS !!!!!The premise of a lonely aimless soul attending cancer therapy groups and AA meetings might have been savagely funny if done right but here it`s badly executed as the first 20 minutes is taken up with Ed Norton droning on in an over literary voice over . I know a cinematic masterwork like APOCALYPSE NOW used voice over but so did THE DUKES OF HAZZARD so it`s just as likely to be the work of a buffoon than a genius . The themes of male grief , alienation and the back lash against 80s consumerism are just as badly developed FIGHT CLUB is good in parts like the scene where the members cover a car park with bird seed so that the pigeons s*hit all over the new cars , but the film is unworthy of the praise lavished upon it by large sections of IMDB voters . I can imagine 17 year old males loving this film - I`d be shocked if they didn`t - but for anyone else who`s old enough to have more mature and critical views should be able to recognise this as one extremely overlong overrated one trick pony . As for the metaphysical twist ending it just doesn`t make sense and brings the whole proceedings down . The narrator was beating himself up was he ? Yeah right .If FIGHT CLUB is the masterpiece it`s supposed to be then how come it was virtually ignored at the Oscars in one of the weakest years for films in a long time ?"},{"username":"bevo-13678","userUrl":"https://www.imdb.com/user/ur76062573","reviewLink":"https://www.imdb.com/review/rw5593562","warningSpoilers":false,"date":"31 March 2020","rate":"10","helpful":"6 out of 9 found this helpful.","title":"Delightful Romantic comedy","content":"A lot of people I know have never even heard about this film. Good to see the system works"},{"username":"LeonLouisRicci","userUrl":"https://www.imdb.com/user/ur33374263","reviewLink":"https://www.imdb.com/review/rw2880160","warningSpoilers":false,"date":"3 October 2013","rate":"1","helpful":"36 out of 107 found this helpful.","title":"Wretched and Unforgivable","content":"This is one of the most Unpleasant Films you are likely to see. Making you Squirm is perhaps one of its 'Charms\" and part of what makes it a Teen Favorite.This is an Ugly Thing, both in Tone and the way it Looks. It starts out with a lot of Unsightly Stuff. Like the Victim Self-Help Meetings where we have to look at a Homely Woman, about to Die, looking to \"just get laid one more time before it ends\" and Meat Loaf with Huge Man-Breasts drooping to his waste being hugged by Ed Norton while exchanging Affection and Sweat.That's just the beginning. It gets a lot more Repulsive as things go along their Merry Way. We have the Central Conceit and Title of the Movie, that Place where Lonely Guys meet to Beat and Bond. Then things really get out of hand with a Zombie Squad and a lot of Speechifying about the Evils of Capitalism, Consumerism, and Zen Stuff like \"when you own your possessions they own you\" and other Well Worn Witicisims that might have been Insightful a Thousand Years Ago.If you are a Fan of those Bare Knuckle Cage Matches, Guy Ritchie Movies, Neo-Nazis, or Anarchists Anonymous, this may be Entertaining. But it can also be a Pseudo-Intellectual, Inane, Disturbing Diatribe that is not Cathartic, just a Vile, Witless Waste, Pretending to be an Ultra-Cool, Post-Modern Philosophical Guidepost for the New Millennium. The Film is Objectionable, Hideous, Unsightly, Overrated, Trashy, Dumbed-Down, Unforgivable, and Absolutely Awful. The Stylish, Talented Director can not be Forgiven for this Wildly out of Control Poisonous Picture."},{"username":"zardoz-13","userUrl":"https://www.imdb.com/user/ur2079400","reviewLink":"https://www.imdb.com/review/rw1947435","warningSpoilers":true,"date":"17 September 2008","rate":"10","helpful":"2 out of 6 found this helpful.","title":"\"Fight Club\" is the main event of the millennium!","content":"\"Fight Club\" is a knock-out! Brad Pitt and Edward Norton star and spar in this bizarre but insightful bare-knuckled, no-holds-barred pugilistic parable. \"Fight Club\" takes some mighty savage but satirical swings at consumerism, anarchy, and male impotence. \"Se7en\" & Alien 3\" director David Fincher delivers another of his kinetically super-charged, darkly lensed, adrenaline-laced epics about guys gelded by a gilded society who come to life when they stain their fists with blood. Penned by \"Jumper\" scenarist Jim Uhls from Chuck Palahniuk's first novel, \"Fight Club\" appears to glorify violence, promote fascism, and degrade women. Instead, \"Fight Club\" denigrates the first, shows contempt for the second, and give Helen Bonham Carter her juiciest role in years.\"Fight Club\" spins a yarn every bit as audacious, manipulative and exhilarating as Fincher's earlier opus \"The Game.\" Edward Norton of \"Rounders\" serves as our narrator for this 140-minute marathon that goes the distance. Caged in a dead end job, Norton files reams of car accident statistics for a major automaker. Essentially, he must calculate when the best interests of the company are served by paying off car crash survivors rather than demanding a recall. Anyway, he flies everywhere to inspect these wrecks and begins to suffer from more than occupational jet lag.Inevitably, our anonymous narrator turns into a depressed white-collar insomniac. Lack of sleep drives him to the hospital. Incredibly, his doctor refuses to give him any drugs. He suggests instead that our narrator attend a support group for survivors of testicular cancer so that he can appreciate what constitutes real pain. Surprisingly, Norton discovers that he can purge himself emotionally without fear of humiliation. Afterward, his burden sloughed off, he goes home to his luxuriously appointed condo, hits the sack and sleeps like a baby. Franz Kafka couldn't have captured the malaise of modern society as crisply as Jim Uhls has in \"Fight Club.\" Soon our unnamed narrator begins to gleefully orchestrate his life around these 12-step meetings and support groups for habits and diseases that he doesn't have. He is hooked and happy about until Marla Singer (Helen Bonham Carter of \"Hamlet\") spoils these gatherings. He knows that she is a fraud and fears she will expose him. They snarl at each other but call a truce and form an uneasy alliance. They will alternate nights at different groups so they won't collide with each other.Marla poses few problems compared with Tyler Durden (Brad Pitt), a mysterious maverick of a man encountered by our hero during a bumpy plane ride. Durden epitomizes cool; he has everything our narrator lacks. Self-assured, scruffily clad, with all the hypnotic charm of a snake, Durden lurks around the narrator. Tyler attracts followers like a magnet. After an unknown arsonist destroys our narrator's condo, he hooks up with Tyler. They create \"Fight Club,\" a form of underground tough man boxing.Remember \"Every Which Way But Loose,\" with Clint Eastwood or Charles Bronson in \"Hard Times?\" They fight in dark, dank basements. Fincher pulls no punches when the combatants start swinging at each other. Quite simply, these fights are brutal, especially when a pretty boy (Jared Leto of \"Urban Legend\") is battered to a pulp until he resembles the elephant kid. Only the knuckle-headed will exit \"Fight Club\" looking for an excuse to scrap. The friendship between Tyler and our hero takes some wildly out-of-control turns. Tyler takes \"Fight Club\" to other cities, and then movies to the next level with \"Project Mayhem,\" a demolitionist's fantasy that involves destroying credit card corporations. Our hero balks at Tyler's outlandish aims and the mindless, skin-headed idiots that he recruits for his cause. But it isn't until the third act, so to speak, when \"Fight Club\" decks you with a shocking revelation: Tyler Durden may not be who we think he is.\"Fight Club\" will send some audiences reeling in disgust at its sicko shenanigans\u0097like when Durden urinates in the soap at an expensive restaurant where he waits tables. Don't ask what he puts in the clam chowder. When Tyler works as a projectionist at a movie theatre, he splices frames of male genitalia into family movies! If you cannot handle a film poling fun at you, you probably won't appreciate some of the subversive humor. Twentieth Century Fox appears to have gone out of its way to sanitize \"Fight Club,\" but Fincher is such a good director that his visuals contain more bite than his narrative. Like in \"The Game,\" where Michael Douglas' snotty rich guy had to run a grueling gauntlet\u0097a present of sorts for the man who has everything\u0097\"Fight Club\" lowers the boom on hypocrisy. The Uhls script brims with several snappy and quotable one-liners.\"Fight Club\" will strike some people as pretty strange, too. Any movie that never reveals its hero's name, especially when he provides the narration, is probably too pretentious for its own good. \"Fight Club\" emerges as an abrasive movie, and Fincher digs his satirical claws in deep. We live in a media jungle, and \"Fight Club\" smirks at the notion that we would want to destroy it to return to lives of quiet destitution. With \"Fight Club,\" Fincher matches anything that Stanley Kubrick helmed in his prime and shows Terry Gilliam a trick or two.\"Fight Club\" is the main event of the millennium."}],"errorMessage":""}