{"imDbId":"tt0245429","title":"Spirited Away","fullTitle":"Spirited Away (2001)","type":"Movie","year":"2001","items":[{"username":"MartinHafer","userUrl":"https://www.imdb.com/user/ur2467618","reviewLink":"https://www.imdb.com/review/rw1672532","warningSpoilers":false,"date":"11 June 2007","rate":"9","helpful":"28 out of 41 found this helpful.","title":"Exceptional, but perhaps not so much for the casual viewer","content":"I have seen many international films over the years and quite a few of these were Japanese. In addition, unlike many parents, I have seen a lot of anime that my kids have watched so at least I have some familiarity with the medium. Yet, with my background I still felt pretty confused and baffled by the strangeness of this movie. Now this isn't to say I didn't like it, but so many times I just couldn't understand exactly what was happening. Interestingly, when I saw the film again, I understood it much better and appreciated it much more. And this may be exactly how you might want to approach the film unless you already are a die-hard anime fan. See it, but be willing to see it without trying to think out the odd plot too much or even try seeing it several times. I know that each time I did, the film became more and more enjoyable and I began to notice so many cultural references. Now, several years after I first saw it in the theater, I have seen a lot more Japanese anime and films and it's practically second-nature to follow the film. So, for adults and those unfamiliar with the medium, this movie might take a bit of effort to fully enjoy, though with more and more children being familiar with and loving anime, it's very likely your kids will love it and will then be able to explain it to you!! As for the film, the animation is the best I have seen in any Miyazaki film, the story deep and fascinating and it's full of cute and endearing little touches that make the movie magical. See this with an open mind, please."},{"username":"TheLittleSongbird","userUrl":"https://www.imdb.com/user/ur20552756","reviewLink":"https://www.imdb.com/review/rw2231336","warningSpoilers":false,"date":"5 April 2010","rate":"10","helpful":"13 out of 23 found this helpful.","title":"Prepare to be enchanted!","content":"I love Studio Ghibli, and Spirited Away is one of my favourite films from the studio. This is coming from someone who was delighted by Howl's Moving Castle, blown away by Princess Mononoke, emotionally devastated by Grave of the Fireflies and touched by the simplicity of The Cat Returns all but to name a few. Spirited Away is a mystical, charming and truly enchanting animated fantasy, even with the long length and some slow moments. The animation is absolutely stunning, both the hand drawn visuals and the CGI graphics give an ethereal charm to the film. The characters move more than convincingly and the colours are beautiful. The music is also outstanding, I loved the simplicity of the piano and the drama of the more dramatic parts. The story is a pleasure, I know people have complained of some loose ends, but it is an original, touching and charming one I feel. I also loved the characters. Chihiro, voiced with real enthusiasm by Daveigh Chase, is sulky to begin with, but she is also brave and resourceful, traits I like in young heroines. Lin is kind and sympathetic, and Susan Egan who was also in Porco Rosso was unusually sensitive as the character. Jason Marsden is charming as Haku, and Suzanne Pleshette is perfect as the grotesque Yubaba and as her sister Zeniba. Overall, I loved Spirited Away, it is really charming. 10/10 Bethany Cox"},{"username":"Leofwine_draca","userUrl":"https://www.imdb.com/user/ur0482513","reviewLink":"https://www.imdb.com/review/rw2777112","warningSpoilers":false,"date":"4 April 2013","rate":"6","helpful":"22 out of 70 found this helpful.","title":"Needs a better story","content":"SPIRITED AWAY is a well-regarded Studio Ghibli animation about a young girl's adventures in a fantastic netherworld filled with all manner of strange and terrifying creations. While it packs more imagination into one movie than ten Disney cartoons, it feels a little aimless and meandering, in search of a decent storyline to go along with the madcap creations.In terms of visual spectacle, at times this is as good as it gets for an anime: every scene features all kind of kooky, uniquely-crafted monsters and creatures. My favourite has to be the three bouncing heads. Unfortunately, the protagonist - a sullen little girl - turns out to be rather irritating and her journey to greater understanding is slow and over obvious.I'm inclined to like these Ghibli movies, but SPIRITED AWAY is no classic; it starts well and tails off, with a stodgy middle and better ending. So far, my favourites are those that take place in the 'real' world - like GRAVE OF THE FIREFLIES and PONYO - rather than those that exist in a fantasy landscape, like this and the overrated PRINCESS MONONOKE."},{"username":"SnoopyStyle","userUrl":"https://www.imdb.com/user/ur2898520","reviewLink":"https://www.imdb.com/review/rw3546286","warningSpoilers":false,"date":"18 September 2016","rate":"10","helpful":"4 out of 6 found this helpful.","title":"magic and wonder","content":"Ten-year-old Chihiro Ogino is a spoiled unhappy girl moving with her parents to the countryside. Her father takes a wrong turn and ends up in front of the entrance to an abandoned theme park. They walk through a tunnel, across a dry artificial stream, and find one operating food booth. Her parents can't find anybody but starts eating anyways. She refuses and walks off when she meets a boy called Haku. He implores her to leave across the water before nightfall. She's too late and the dry riverbed becomes a vast river. The park becomes inhabited by spirits. Haku sends her to boiler-man Kamaji and tells her to beg for a job with the ruthless witch Yubaba who runs the magical bathhouse.This is possibly the first Hayao Miyazaki I saw and in my opinion still his best. He's done plenty of great work but this is the pinnacle. It's a simple coming-of-age story but filled with magic and wonder. It added to the language of animated cinema."},{"username":"Kirpianuscus","userUrl":"https://www.imdb.com/user/ur61197531","reviewLink":"https://www.imdb.com/review/rw3734903","warningSpoilers":false,"date":"20 June 2017","rate":"","helpful":"1 out of 2 found this helpful.","title":"special","content":"or different. or great. or, just, masterpiece. but not only for the artistic virtues or for an inspired story. but for magic. for the splendid manner to preserve and show the essence of childhood. for the delicate exploration of myths and for touching images. for the words behind the words and for the rare beauty of scenes descending from yours memories from early ages. because it is a film for who special is one of words who suggest something who must be feel not described. see it ! again. and again."},{"username":"Horst_In_Translation","userUrl":"https://www.imdb.com/user/ur3914439","reviewLink":"https://www.imdb.com/review/rw3374616","warningSpoilers":true,"date":"18 December 2015","rate":"8","helpful":"2 out of 4 found this helpful.","title":"A fantastic fantasy journey","content":"\"Sen to Chihiro no kamikakushi\" or \"Spirited Away\" is probably the most famous work (especially abroad) by Japanese animation legend Hayao Miyazaki, also because he won an Academy Award for it and non-English-language films winning in the Best Animated Feature category is certainly not the rule, which makes it an even more exceptional achievement. The film is already almost 15 years old and runs for roughly 2 hours. A little girl enters a fantastic world with her parents, but their greed makes them transform into pigs right away, the parents only, not the girl. And after that, she gets deeper and deeper into that fantastic world, makes friends and foes, both of which are the most fascinating creatures, including witches, dragons and many other mythical figures.One of the aspects I liked most about this film was that basically no character was either completely black or white. Even the evil witch loves the big baby and has to follow certain rules in her last scene for example. She has a good twin sister by the way, also an interesting inclusion. The animation is really good and memorable here and I personally believe this film is a great choice if you want to take a deeper look into Studio Ghibli movies, something that is considered the best animation film production studio these days together with the big famous American Pixar company. You can certainly see a lot of heart in their works and, hands down, it does not get much more creative than \"Spirited Away\".All in all, this film never dragged and that is always a decent achievement for films that cross the 2-hour mark. It has some nice lessons on friendship, motherhood, dedication and many other important subjects, which is probably the main reason this film is loved so much and so high in the IMDb top250. There is a lot lot more than wonderful animation here. I cannot really comment on the voice acting as I, of course, watched this one with subtitles as I don't understand a word Japanese, but I think they are probably doing a solid job as they are all fairly experienced and I never heard that this could be the film's one weakness. I cannot come up with a weakness while watching this. The drama was never over-the-top or unrealistic and even if it was, it could have been somewhat justified with all the fantastic stuff going on. Excellent watch and one of the best animated films of the 2000s. Highly recommended."},{"username":"claudio_carvalho","userUrl":"https://www.imdb.com/user/ur2488512","reviewLink":"https://www.imdb.com/review/rw2674717","warningSpoilers":false,"date":"17 September 2012","rate":"7","helpful":"8 out of 18 found this helpful.","title":"The Supernatural and Ambiguous Journey of Chihiro","content":"The spoiled and whiny girl Chihiro and her parents are moving to a small Japanese town in the countryside and Chihiro is missing her old house. Chihiro's father makes a wrong turn and drives through a lonely land road with dead end in a tunnel. Her parents decide to stop the car and explore the area. They cross the tunnel and find an abandoned cultural theme park on the other side with a ghost town.When her parents sees a restaurant with smelling food but no staff, they decide to eat to pay later; however Chihiro refuses to eat and decides to visit the place. She meets the boy Haku that tells her that her parents and she are in danger and they must leave the place. She runs to the restaurant and finds that her parents have turned into pigs. Further, the place is a bathhouse of spirits, monsters, gods and ghosts owned by the witch Yubaba. Now Chihiro counts on Haku to save her parents and return to their world.\"Sen to Chihiro no Kamikakushi\" is an entertaining and original Japanese fable with the supernatural and ambiguous journey of a girl named Chihiro to a world of witches, gods and ghosts the same way that Alice meets the Wonderland in Lewis Carroll's tale. Even the villains are lovable and the conclusion is open to the interpretation of the viewer. My vote is seven.Title (Brazil): \"A Viagem de Chihiro\" (\"The Travel of Chihiro\")"},{"username":"bob the moo","userUrl":"https://www.imdb.com/user/ur1002035","reviewLink":"https://www.imdb.com/review/rw0727476","warningSpoilers":false,"date":"21 September 2003","rate":"","helpful":"4 out of 8 found this helpful.","title":"Beautifully animated story with good characters and fantastic story of love and friendship","content":"While on their way to their new house in a new town, Chihiro and her parents take a short cut down a side road and come to a dead end with a dark passage way in a wall. Despite her fears, Chihiro goes with her parents to see where it leads. They come out in open space where they find what looks like an abandoned theme park. Chihiro's parents find a stall with lots of food prepared and start to eat while Chihiro refuses and goes to investigate a working bath house. As it suddenly gets dark she goes back to her parents to find they have been turned into pigs and suddenly shadows draw over the stalls. Chihiro hides with the help of a boy called Haku. He helps her to stay in the bathhouse by getting her a job (as dictated by Yubaba) and she settles into the resort for Japan's gods and spirits. However she still must work out a way of getting her parents back before they grow fat and are eaten.The first I had heard of this film was when it won the Oscar (sadly this was the one part of my combination bet that I had got wrong and hence won nothing). Since then the film has had world-wide promotion and arrived in the UK several years after it had first been shown. Despite the worrying `Walt Disney' legend at the front of the credits, this is very much a Miyazaki film and the mouse has not turned it into something else. My second worry was that the American team involved in the version I saw would bring out sarcasm in the same way as they (Lasseter) does in things like Monsters Inc etc. I enjoy that style of humour but `Sen to Chihiro no kamikakushi' was much better than just that.The plot involves the quest to recover Chihiro's parents from a spell that made them pigs, but the world in which the film is set is what makes it so enjoyable. The world is imaginative and filled with all sorts of characters. Chihiro's journey explores themes of understanding, trust and friendship \u0096 all around the central quest, and in this way it is good that some parents I know have been taking their kids to see this film even if it isn't tied into a Happy Meal marketing campaign. The characters are all pretty well developed and are interesting. Chihiro is afraid but brings bravery from inside herself, Haku is a mystery but appears trustworthy, the mysterious noface could be a friend or foe. What the film doesn't have is characters who do nothing \u0096 they all drive the story forward or provide the comic relief in some way.The American cast do good jobs dubbing the characters. Usually dubbed films are so poor that I always seek out subtitles, however here the job was as it were meant. Chase is very good in one of her two Oscar nominated films that year and Mardsen has much more to do than in the X-Men films! Support voices are all good and involve plenty of recognisable voices such as Chiklis, Holly, Ratzenberger and Stiers.The film is a lot more accessible than much anime \u0096 sure there are still monsters and spirits but there are no major battles and way out visuals to deal with, kids can watch this (and should). In fact I did quite like the simplicity of the tale. Whereas kids movies recently tend towards the more sarcastic, cruel humour as much for adults, here the film is more about spirit (no pun) and moral courage. It is also worth noting that, although there is magic, this is not some spectacle film like Harry Potter \u0096 Chihiro uses her brain and her heart to deal with things, not spells.The animation is fantastic \u0096 while CGI has been used, it never feels as totally computerised as Monster Inc etc does. This isn't BETTER because it was hand drawn but it does fell a lot warmer and a lot more recognisable in terms of style. The use of both techniques gives much to the look of the film. As always the world and the characters come to life on the screen and are fantastic, creepy and beautiful all at once.I don't mean to gush but I did enjoy this film for all it's simplistic plotting. The quest is a straightforward plot device and would be a problem if that's all this film had to offer. Happily the central story is supported by characters who are wonderfully drawn (both animated and developed) and set in a world that is visually impressive and imaginative. I looked at my watch and wondered where two hours had gone."},{"username":"kosmasp","userUrl":"https://www.imdb.com/user/ur5876717","reviewLink":"https://www.imdb.com/review/rw5883623","warningSpoilers":false,"date":"5 July 2020","rate":"10","helpful":"1 out of 2 found this helpful.","title":"Spirited inside","content":"Studio Ghibli does it again - actually if you don't mind animated movies and don't censor and lock away your fantasy or inner child, you probably will like a lot of the stuff they did. Doesn't look like there will be anything new coming, since they closed up shop.But they put out a lot of movies and you have quite a few things to watch therefor. This is about a little girl on a family trip ... well trip it will be. Especially for her and what she gets into. Very creative and very well done. Not just for the little ones, but for adults as well. Commenting further on the story would not do it justice, the pictures speak for themselves. I can only recommend it so much, you have to know if it is for you - if it is, you have one hell of a journey ahead of you! Enjoy!"},{"username":"classicsoncall","userUrl":"https://www.imdb.com/user/ur2707735","reviewLink":"https://www.imdb.com/review/rw2659227","warningSpoilers":true,"date":"15 August 2012","rate":"7","helpful":"6 out of 12 found this helpful.","title":"\"Finish what you started, Human.\"","content":"Quite often I'll use the IMDb reviews and ratings to recommend a film, and that was the case here. With a ranking in the Top #50 as I write this I was anticipating something really special but was left somewhat disillusioned when it was all over. Probably the biggest disappointment for me was the lack of a coherent story line, or more specifically, the way the story veered off in completely different directions as if it was being written while the filming was already in progress. Story continuity seemed unimportant, one such example would be Master Haku's insistence with Chihiro that she must persist in getting a job from Kamajii the Boiler Man and refuse to take no for an answer. Failing to do so so would put her in jeopardy with Yubaba, but Kamajii simply recommends that Chihiro request a job from Yubaba directly, which she does.There's also the instance when Chihiro, now Sen, recognizes the bloody dragon serpent as Haku. How did she know that, and more importantly, how does the viewer come to that same conclusion, other than Sen's say so? There was enough of this kind of stuff to bother me in terms of effective story telling.I would surmise that Japanese anime is directed specifically at teenagers and young adults, and that's OK, just as it was back in the Fifties and Sixties with the explosion of monster films a la Mothra, Rodan and Godzilla. But to elevate \"Spirited Away\" to the level of masterpiece as some would suggest is carrying things a bit far to my mind. Perhaps in terms of technical achievement, one would have a point. The film is beautifully made and quite colorful, and some of the concepts seem original like the bathhouse for the spirits, but overall I was left unimpressed. Perhaps this is an acquired taste or maybe I'm too old to appreciate the genre, but this film didn't really do it for me. But you know what, I watched \"Grave of the Fireflies\" and I thought that was more thoughtful and insightful, so I'm not closed minded about the whole thing. I guess I'll have to try some other titles to see what works for me."},{"username":"lee_eisenberg","userUrl":"https://www.imdb.com/user/ur4888011","reviewLink":"https://www.imdb.com/review/rw7695428","warningSpoilers":false,"date":"28 December 2021","rate":"10","helpful":"2 out of 4 found this helpful.","title":"What happens when you do nothing but consume?","content":"Hayao Miyazaki's \"Sen to Chihiro no kamikakushi\" (\"Spirited Away\" in English) is one of the most mystifying movies that I've ever seen. This story of a girl's quest to rescue her parents from an ugly fate is not like any animated feature that you've ever seen. As beautiful as it is horrifying, this movie is a true sui generis.Miyazaki noted that consumerism's effects on Japan is a theme. After all, Japan adopted a western diet and started seeing new kinds of health problems. What happens to Chihiro's parents is just an example of this.Anyway, an outstanding piece of work. I'm sure that it makes more sense to Japanese viewers, but foreign viewers will find plenty to like about it. The movie won a well-deserved Academy Award for Best Animated Feature (Hayao Miyazaki declined to attend in protest of the US invasion of Iraq)."},{"username":"gavin6942","userUrl":"https://www.imdb.com/user/ur1234929","reviewLink":"https://www.imdb.com/review/rw3121446","warningSpoilers":false,"date":"10 November 2014","rate":"7","helpful":"1 out of 16 found this helpful.","title":"Great Story, Maybe Not the Finest Animation","content":"In the middle of her family's move to the suburbs, a sullen 10-year-old girl wanders into a world ruled by gods, witches, and monsters; where humans are changed into animals; and a bathhouse for these creatures.This film regularly makes Top Ten lists, whether films for children, best animation, or even within IMDb's Top 250. And sure, it is a great story, with far more depth than the average children's cartoon. So if we are judging on writing, this cartoon is tops.But its overall presentation is somewhat different. This is not the greatest artwork, innovation or style out there. In many ways it is no improvement on many 1980s and 1990s cartoons. Why was this the Oscar-winning cartoon of its year, and why does it continue to be such a huge influence? At least the American version has John Ratzenberger."},{"username":"jboothmillard","userUrl":"https://www.imdb.com/user/ur4248714","reviewLink":"https://www.imdb.com/review/rw1260967","warningSpoilers":true,"date":"10 January 2006","rate":"8","helpful":"3 out of 6 found this helpful.","title":"Spirited Away","content":"I had only experienced Japanese cartoons with the mildly entertaining but ultimately terrible Pokémon and Digimon, but I have to say, I was looking forward more to this good looking film from Studio Ghibli, dubbed into English, from director Hayao Miyazaki (Princess Mononoke). Basically ten-year old Chihiro (Lilo & Stitch's Daveigh Chase) is moving to a house in the suburbs with her mother (Dumb and Dumber's Lauren Holly) and father (The Shield's Michael Chiklis). They get out of the car to walk down a lonely dirt road, and end up in open country surroundings, and finding a café which the parents eat in. Chihiro wanders off, and briefly meets the mysterious Haku (Jason Marsden) who warns her to leave immediately, but she can't when she discovers her parents have become pigs, literally. Haku finds her and promises to help by by getting a job at the bathhouse working for Yubaba (Suzanne Pleshette), who has a nicer twin sister Zeniba (also Pleshette) and the thousands of God and spirit customers. Chihiro does as well as she can in this strange world, but she must find a way to break her parents spell and be able to return home. Also starring Hercules' Susan Egan as Lin, David Ogden Stiers as Kamajii and John Ratzenberger as Assistant Manager. The story is a little strange, but bare in mind it is Japanese, but with good dubbing voices and aspiring animation, you'll enjoy the experience. It won the Oscar for Best Animated Feature, and it won the BAFTA for Best Film not in the English Language. It was number 68 on The 100 Greatest Family Films, and it was number 8 on The 100 Greatest Cartoons. Very good!"},{"username":"ccthemovieman-1","userUrl":"https://www.imdb.com/user/ur4445210","reviewLink":"https://www.imdb.com/review/rw1506194","warningSpoilers":false,"date":"25 October 2006","rate":"8","helpful":"14 out of 37 found this helpful.","title":"Entertaining Enough To Get Away With The Length","content":"How many people can sit through a 120-minute animated film? That's normally just too long for that genre. However, this one could meet that challenge. It only took me two sittings to make it all the way - that's very good, at least for me!The best part of the film was the color, stunning in parts, beautiful and with great detail. It also had some wild characters and a bit of humor here and there, which helped. Overall, a good mix of good and evil and a different kind of story.Being it's Japanese, you are going to get some different theology than you are accustomed to in the West (\"the spirits of the wind and water have healed you,\" etc.) but it's not presented in a heavy-handed manner.I was concerned early on as the young girl - the main character in the film - had a shrill voice that was not pleasant but she calmed down after the first part of the film. Overall, entertaining and worth several looks."},{"username":"Tweekums","userUrl":"https://www.imdb.com/user/ur13977076","reviewLink":"https://www.imdb.com/review/rw1900611","warningSpoilers":true,"date":"28 June 2008","rate":"10","helpful":"1 out of 2 found this helpful.","title":"A Masterpiece From Studio Ghibli","content":"This is probably Hayao Miyazaki's best film and given the very high quality of his other films that is saying a lot. As always with Studio Ghibli films the animation is absolutely beautiful and the story is enthralling.The story follows the adventures of ten year old Chihiro who finds her self trapped in a spirit world when her parents take a wrong turn on the way to a new house. They enter this world through a tunnel which they think leads to an abandoned theme park. Her parents help themselves to the food at a restaurant and while they eat Chihiro explores fearing they will get in trouble for eating the food. While exploring she meets Haku, a young boy, who tells her she must leave before it gets dark, unfortunately when she gets to where her parents were eating she finds two pigs and she can't return to the car as a river now blocks her way.As it is too late for her to leave and she wants to rescue her parents she has to stay. Haku tells her that humans are not allowed in the spirit world but if she can get a job there she will be allowed to stay. She manages to get a job in the bath house where she impresses the others when she deals with the stink god who isn't quite what he originally appears to be. She also lets the mysterious No-Face enter, at first he is welcome as he hands out gold to the workers but as he eats more and more they realise he isn't as benevolent as he seems. There are further adventures involving Haku, No-Face, Yubaba (a witch) and a giant baby amongst others.The film is full of strange and wonderful characters, some are friendly, some are creepy but none seem really malicious. This film is suitable for all but the youngest or most nervous of children, it ends with Chihiro earning freedom for herself and her parents not slaying some evil monster. If you enjoy traditional animation and have yet to see this then you really should give it a go, I'm sure people will be enjoying this for decades to come.These comments are based on watching the film in Japanese with English subtitles."},{"username":"BA_Harrison","userUrl":"https://www.imdb.com/user/ur0945066","reviewLink":"https://www.imdb.com/review/rw2817966","warningSpoilers":false,"date":"22 June 2013","rate":"3","helpful":"36 out of 73 found this helpful.","title":"I get the feeling that this review won't be very popular...","content":"As a huge fan of both animation and Japanese cinema, I have long felt more than a little embarrassed by my ignorance of celebrated director Hayao Miyazaki. Having tried to rectify this situation somewhat by watching the highly acclaimed animé Spirited Away, I no longer feel so bad about neglecting his work for so long: I found the film hugely undeserving of the glowing praise heaped upon it and I imagine it'll probably be quite a while before I tackle another of Miyazaki's 'classics'.Although Spirited Away is undeniably impressive visually, with stylish animation and imaginative design throughout, everything else about the film leaves A LOT to be desired, especially the trite story, in which a little girl, Chihiro, gets lost in a strange world and encounters a series of whimsical fantasy characters while trying to find her way home. It's The Wizard of Oz, but without the star quality of Garland, the amazing flying monkeys, catchy tunes, cute dog, and over-sexed dwarfs in garish outfits; it's Alice in Wonderland without the pungent whiff of opium; it's Labyrinth without the allure of a teenage Jennifer Connelly, the star power of Bowie, and the magic of Henson; it's Coraline, but .errr nowhere near as good (speaking of Neil Gaiman, it reminded a lot of Mirrormask, which also bored me to tears with its random, meandering narrative)."},{"username":"Quinoa1984","userUrl":"https://www.imdb.com/user/ur0453068","reviewLink":"https://www.imdb.com/review/rw0727199","warningSpoilers":false,"date":"27 September 2002","rate":"9","helpful":"2 out of 5 found this helpful.","title":"An anime treat","content":"Spirited Away, the latest film from writer/director Hayao Miyazaki (a genius to Disney animators, such as to Toy Story director Lasseter who executive produced the film for the US), is a wonderful family film, that works on numerous levels for kids, not the least being the creative storyline, and for older kids and adults there are lavish backdrops and characters right out of, well, an anime movie. The storyline, by the way, follows a girl and how she finds herself in a fantasy world where her parents have been transformed into pigs and spirits and other strange creatures prowl the landscape, and she has to everything she can to stay human and get a way back home, thought she'll need help along the way. A bit at times reminiscent of a Wizard of Oz or Alice In Wonderland in Japanese anime fashion (perhaps building just on the fantasy elements as Miyazaki usually does) doesn't disappoint for a moment as a marvel of imagination. Even those strident fans of maturer (err extra violent) anime pictures will want to look, maybe more than once. Works on many levels and I recommend it of course, if maybe a mild mark under Miyazaki's best work Princess Mononoke. Grade: A (or 9.5/10)"},{"username":"Doylenf","userUrl":"https://www.imdb.com/user/ur1048771","reviewLink":"https://www.imdb.com/review/rw0727428","warningSpoilers":false,"date":"2 July 2003","rate":"","helpful":"7 out of 30 found this helpful.","title":"Weird Japanese nightmare of epic proportions...not a charmer...","content":"I watched the English language version of this nightmarish film and I can't understand the lavish praise bestowed on this Japanese animated fantasy. Its colors have a muted, washed-out look as it tells at great length the murky story of a little girl (with a screechingly high-pitched voice that gets on the nerves) who gets separated from her parents and enters the dark world of an abandoned amusement park. None of it makes any sense--at least not to American minds--so there must be something either lost in the translation or lost in the vast differences between American and Japanese culture. If this is a picture kids can relate to, I can only suppose that more kids than I thought are living in a nightmarish world ruled by adults.The story goes on for two hours without presenting anything except turning the girl's world into a nightmare of dead spirits and mean-spirited elders against which she is supposed to eventually be reunited with parents who have been turned into pigs. It's all so weirdly incomprehensible to adults and let me say firmly that there is no enchantment here. Perhaps you have to have the imagination of a ten-year old to see what's fun about this strange and fearsome world. Instead of entertaining us in the manner Lewis Carroll did with ALICE IN WONDERLAND and his cast of weird characters, it is much too dark and intense to be called anything but a Japanese nightmare of epic proportions with elements of other famous fairy-tales working their way through the tale.The dubbing for the English version should have used a different voice than the grating one used for the little girl. Definitely not a charmer."},{"username":"dbborroughs","userUrl":"https://www.imdb.com/user/ur3079504","reviewLink":"https://www.imdb.com/review/rw0727539","warningSpoilers":false,"date":"26 February 2004","rate":"9","helpful":"3 out of 10 found this helpful.","title":"See this in English","content":"This is the rare bird thats better in English. I had picked up an import copy of this film prior to the English Disney release and was stunned at how much I didn't like it. Thinking I was mad after all the hype I watched the film seven times in the next seven days and was underwhelmed each time. When the John Lasseter supervised dub was finally released to theaters I went more to show support than out of desire to see the film again. Seeing the film in English was a revelation. Even for some one who has watched thousands of anime in Japanese I had to admit that the tiny little touches that were added made the film better and more understandable on an emotional level. This is a great film for everyone, but if English is your first language see it in English its so much better."},{"username":"grantss","userUrl":"https://www.imdb.com/user/ur2860723","reviewLink":"https://www.imdb.com/review/rw3218876","warningSpoilers":false,"date":"12 April 2015","rate":"5","helpful":"12 out of 35 found this helpful.","title":"OK, as a kid's movie...","content":"OK, as a kid's movie. Otherwise, fairly dull. Plot is random, and really amounts to nothing more than Alice in Wonderland with more far-out creatures and less structure and point.Animation is so-so. Has the look and feel of kids TV series I saw in the 70s and 80s.I really don't know what the fuss is all about. If you want a great animated movie, ideal for all ages, watch \"Up\" instead. The Toy Story series (esp #3) would work too.How on earth this got into the IMDb Top 250, and, even more, the top 40, I do not know."},{"username":"Boba_Fett1138","userUrl":"https://www.imdb.com/user/ur1416505","reviewLink":"https://www.imdb.com/review/rw1261731","warningSpoilers":false,"date":"10 January 2006","rate":"9","helpful":"7 out of 15 found this helpful.","title":"Great characters and story.","content":"What makes this movie so powerful and great are mainly its characters. The characters are well constructed and are mainly the reason why this movie is so unforgettable. Some of the characters are quite odd looking, even by anime standards but they are so wonderfully constructed that they all become believable.The story is just totally brilliant. It's odd but oh so beautiful. The imaginary world gives the movie a totally unique and beautiful look and feeling. It all helps to make \"Sen to Chihiro no kamikakushi\" an unique and unforgettable viewing experience. The beauty in the movie is in its unpredictability. Because its so unique and original, you never know what to expect next and everything comes as a pleasant surprise. My only complaint about the story is its love-story, if there even was meant to be one, wasn't really believable and felt underdeveloped and like a missed opportunity.It all is beautiful animated and with lots of eye for detail and I'm talking about both the characters and the imaginary world. It helps to make you believe in the totally imaginary world and the story.The musical score by Joe Hisaishi is just fantastic and fits the movie very well.This is once more another Hayao Miyazaki masterpiece. Once more he has succeeded in creating a unique, original and totally believable world, story and characters. It's both beautiful and unforgettable.9/10http://bobafett1138.blogspot.com/"},{"username":"TBJCSKCNRRQTreviews","userUrl":"https://www.imdb.com/user/ur2093818","reviewLink":"https://www.imdb.com/review/rw2154859","warningSpoilers":false,"date":"9 November 2009","rate":"10","helpful":"1 out of 3 found this helpful.","title":"Grand","content":"While I have not yet watched an awful lot of Animé, I can say that this is one of the greatest films I've ever seen. The animation is crisp and gorgeous, the style is excellent and with the right amount of motion to it, and design is impeccable, with beautiful, grotesque and amazing images presented for us to take in. Lighting and color palette are broad and well-chosen. An immense amount of imagination and creativity went into this, and you can feel it from start to finish. We are presented with a fascinating, strange world, an our trip to and around it is engaging. With a running time of just over two hours, this is the longest of its kind. However, it has spot-on pacing, never boring or overstimulating the audience members to the point where you take a break from your viewing, in spite of the odd, and once or twice even disgusting, things that this shows us. It is also open to interpretation. And in spite of that, it also tells a story so that anyone, of any age, can follow it. Not everyone will understand everything that's going on, but we can all enjoy it. I can only comment on the original actors, as I did not choose a dubbed version; their work is marvelous, and that goes for every performance. The dialog is well-written. Apart from some potentially scary and/or disturbing content, there is nothing offensive in this. The DVD comes with 18 minutes(!) worth of trailers for it, and, on the second disc, the whole movie in storyboard form, with a commentary track, subtitled in English, a well-done, informative and entertaining 47 minute making-of featurette made up of behind the scenes footage, concept art, clips and narration(in Japanese, subtitled). I recommend this to anyone who can let go of the expectation of realism in their fiction. 10/10"},{"username":"neil-476","userUrl":"https://www.imdb.com/user/ur7813355","reviewLink":"https://www.imdb.com/review/rw2418139","warningSpoilers":true,"date":"23 April 2011","rate":"9","helpful":"0 out of 0 found this helpful.","title":"Unsettling but brilliant","content":"As an English viewer, I can't bring any oriental appreciations to a viewing of Spirited Away: my lifetime of English experiences make Spirited Away an even more alien experience than it is for a native Japanese audience.But I think it is supposed to be disorienting. This odd story of little Chihiro, uprooted from her familiar neighbourhood by her parents moving, and then finding herself in a bathhouse populated by spirits, creatures, ghosts and so on following her parents turning into pigs... well, it's a long way from Disney (even if one of the characters in the US adaptation is voiced by Susan Egan, Megara in Disney's Hercules).This superb movie is imaginative, unsettling, visually entrancing, involving and, ultimately, moving.Any animation fan should make an effort to catch it."},{"username":"george.schmidt","userUrl":"https://www.imdb.com/user/ur0937743","reviewLink":"https://www.imdb.com/review/rw0727209","warningSpoilers":false,"date":"7 October 2002","rate":"","helpful":"3 out of 5 found this helpful.","title":"Japanese Alice In Wonderland and then some!","content":"SPIRITED AWAY (2002) **** (ANIMATED/JAPANESE \u0096 DUBBED) (Voices: Daveigh Chase, Suzanne Pleshette, Michael Chiklis, Lauren Holly, Susan Egan, Jason Marsden, John Ratzenberger, David Ogden Steirs. Fantastic animated fantasy by acclaimed Japanese filmmaker Hayao Miyazaki constructs a unique story about a little girl who winds up in an amusement park for the spirit world and must save her parents' fate of being turned into swine all the while encountering odd characters, both benevolent and malevolent. Awesome set pieces and colorful dreamscapes perpetuate the engrossingly entertaining storyline as it progresses with much humor, dread and sense of utter disbelief at just how magical animation can be. One of the best of its genre."},{"username":"morrison-dylan-fan","userUrl":"https://www.imdb.com/user/ur5424352","reviewLink":"https://www.imdb.com/review/rw2672808","warningSpoilers":true,"date":"13 September 2012","rate":"10","helpful":"1 out of 1 found this helpful.","title":"Remember your name.","content":"With last having viewed Spirited Away a few years ago,I was please to learn that the film had been chosen as the IMDb's Indian Cinema board next joint viewing,which would give me a chance to re- visit the movie that cemented director Hayao Miyazaki and Studio Ghibli's presence on the world's stage.The plot:Sitting in the car angry over having to leave all of her friends behind,Chihiro Ogino ignores her parents attempts to cheer her up,as they drive to their new location.Chihro's dad, Akio decides to take a short-cut down a newly discovered road.Speeding down the road,Akio suddenly stops the car in its tracks,when he sees the entrance,for what looks to be a \"lost\" forgotten building.Curious about this new discovery,Ogino's mum and dad decide to get out of the car and take a look around.Reluctantly joining her parents search, Chihiro and her family soon discover that the \"lost\" building is actually not a building but is in fact a \"closed down\" theme park!.Walking round the abounded \"theme park\" , Chihiro's family are shocked to find tables filled with freshly made food.Calling out to check if anyone's around,the parents start to eat everything,whilst Chihiro stays away from the food,due to being nervous about where the food has come from.Walking round the \"theme park\", Chihiro is surprised to find out that the abounded \"theme park\" is really a still-running bathhouse.Heading to the building which she suspects is the main bathhouse, Chihiro is shocked,when a strange boy appears and tells her that she and her family must get away from this place right away.Rushing back to her family, Chihiro begins to fear that this place is far from normal,when she discovers that her parents have transformed into pigs View on the film:For the screenplay of the movie,writer/director Hayao Miyazaki elegantly uses the film's 2 hour running time to create a magical dream/nightmare- logic world.Smartly not getting caught up in potentially overly complicated exposition about the various brilliant,strange monsters that co-inhabit the place with humans,Miyazaki instead allows the inhabitants to come fully alive,by spending a good amount of the time with focusing on the day to day activates of the workers in the bathhouse.Along with the daily activates.From the scene where Chihiro discovers that her parents have transformed into pigs,Miyazaki introduces a strong,dark fantasy element to the story as Chihiro begins to realise that she is going to have to leave her safe childhood behind,and face terrifyingly strange fears in order to save her parents.From the scene of Akio driving down the \"wrong turn\",Miyazaki uses a number of long tracking shots to cleverly fully show the skillful animation on display.Staying away from CGI animation as much as possible,the animators use warm,vivid colours to make the characters truly come alive in an unforgettable film."}],"errorMessage":""}