{"imDbId":"tt0253474","title":"The Pianist","fullTitle":"The Pianist (2002)","type":"Movie","year":"2002","items":[{"username":"Leofwine_draca","userUrl":"https://www.imdb.com/user/ur0482513","reviewLink":"https://www.imdb.com/review/rw3688500","warningSpoilers":true,"date":"19 April 2017","rate":"9","helpful":"6 out of 8 found this helpful.","title":"Heartfelt and enthralling","content":"THE PIANIST is a film that takes a dark and disturbing subject matter - the persecution of the Warsaw Jews by Nazis in the Second World War - and turns it into a spellbinding, enthralling journey of a movie. Roman Polanski could easily have made this maudlin and sentimental like Spielberg's SCHINDLER'S LIST, but he thankfully avoids that temptation and the result is the much better movie of the two.This film contains a documentary-style realism in its depiction of the various atrocities carried out by the uncaring Germans. It gets dark and darker as it goes on, and yet the viewer is unable to tear his eyes off the screen because it's all so well-realised and realistic. Adrien Brody plays the eyes and ears of the viewer in a subdued manner, yet delivers his greatest and most believable performance as a result. The story has a lot of darkness and violence, but Polanski's expert camera-work and endless style stops the subject matter ever becoming depressing; instead there's enough tension to keep you involved and wanting to find out what's next. Things build to a suitably touching and poignant climax that doesn't disappoint."},{"username":"SnoopyStyle","userUrl":"https://www.imdb.com/user/ur2898520","reviewLink":"https://www.imdb.com/review/rw3547407","warningSpoilers":false,"date":"19 September 2016","rate":"7","helpful":"6 out of 25 found this helpful.","title":"non-heroism","content":"It's 1939 Warsaw. Wladyslaw Szpilman (Adrien Brody) is a Jew and a pianist on the radio. He falls for Polish girl Dorota. The Germans invade and the Szpilman family expects to live through another war. However, their lives slowly deteriorate as government decrees force them into the Jewish ghetto. Itzak Heller tries to recruit Wlad and his brother Henryk into the Jewish police but they refuse. As his family is put on trains, Wlad is pulled out by Itzak. Wlad joins the resistance and smuggles in material. He sneaks out and finds friends who help to hide him. He witnesses the Germans battling their way into the ghetto from his hiding place. He finds help from Dorota who is now married and pregnant. From his hiding place, he witnesses the start of the Warsaw uprising.Roman Polanski delivers a depiction of a survivor of the Holocaust. He is more or less passive for too long until pushed. He survives due to kindness of others. He does not fight not due some moral stand but rather a lack of proactive heroism. It's a rather disengaging trait although I can see Polanski's point of view. The other annoying aspect is his surprise and constant reaction to the shocking inhumanity. None of this makes him less realistic. In many ways, he's a very human character and flawed not in any evil ways. It doesn't make him an easy, or appealing character. The world is well constructed. The most compelling scene is actually when the family is stuck waiting out in the sun for the train. The train has been done every time but to wait in a holding pen is more unusual. This is a great Holocaust movie but the leading character is unusually not so appealing."},{"username":"Hitchcoc","userUrl":"https://www.imdb.com/user/ur0278527","reviewLink":"https://www.imdb.com/review/rw2125003","warningSpoilers":false,"date":"10 September 2009","rate":"10","helpful":"9 out of 15 found this helpful.","title":"Tour de Force","content":"There have been so many fine films that deal with the Holocaust. Each shows the atrocities of the Germans, their random cruelty, their ruthlessness. This film has all that, but it also has Adrien Brody. This is a film that gets us inside the human being, the person who must run, whose iron will propels him forward. The thing is, though, he is not necessarily a hero in the traditional sense. We sense the fatigue of his character as he runs from situation to situation, just trying to stay alive. There are good people around him, many are good Germans. While we watch people shot in the head, beaten to the ground, mutilated, we see him moving aimlessly toward something (the thing is we don't know what that something is). He hears rumors about the Russians liberating Poland but he can't let up for a second. He watches as the underground makes sacrifice after sacrifice, their building burned, their people sent up in flames. He sees himself as a coward. He thinks about being dead, but his will to live drives him on. The title, of course, is him--the pianist--a nationally known classical pianist, suddenly dehumanized. We see his weaknesses and his strengths. We also get a more balanced though terrifying view of the situation in the Polish ghetto. This is a film we should all see."},{"username":"Kirpianuscus","userUrl":"https://www.imdb.com/user/ur61197531","reviewLink":"https://www.imdb.com/review/rw3377086","warningSpoilers":false,"date":"21 December 2015","rate":"","helpful":"1 out of 4 found this helpful.","title":"a meeting","content":"a film about Shoah. but not like many others. because it is a story about survive with universal roots. a film about war. and about the way to be yourself in bitter times. a film about courage as result of vulnerability. and, more important, a film about music as refuge , gun and tool. Adrian Brody does a splendid role. the mark of Polanski gives to the original book new connotations. a film who presents not a page of history but an individual victory march. dark. and hopeful. dramatic. and cruel. but useful for define a world in which an ordinary young man has the force to not be puppet of events. few beautiful scenes. and the music. as precious lesson. about yourself."},{"username":"claudio_carvalho","userUrl":"https://www.imdb.com/user/ur2488512","reviewLink":"https://www.imdb.com/review/rw0746878","warningSpoilers":false,"date":"18 January 2004","rate":"7","helpful":"9 out of 27 found this helpful.","title":"Another Movie About the Massacre of Jews in the Second World War, With an Outstanding Performance of Adrien Brody","content":"Wladyslaw Szpilman (Adrien Brody) is a Polish Jewish pianist very famous in Warsaw. When Germany invades Poland, his wealthy family and him are sent to the Warsaw Ghetto. Them they are sent to Treblinka, but Szpilman escapes in the train station. He struggles to survive, hidden in the most different places and depending on friend's sympathy to stay alive. He survives the war and died in the year 2000. This movie is a super production, very well directed by Roman Polanski and having an outstanding performance of Adrien Brody. However, this sad story does not present anything that was not showed before, like, for example, `Schindler`s List' did some years ago. There is a good movie (`Uprising' (2001), TV), showing better the events of the Warsow Ghetto uprising, but the intention of `The Pianist' is to show the true saga of Szpilman. I can perfectly understand that Jewish persons, who are majority in the cinema industry, have a great interest in keeping alive the atrocities of the Second World War. But these movies are very repetitive, showing horrible dramas of the most different survivors, or persons who died. However, there are so many other massacres of races to be explored through the human history and unfortunately they are not showed in movies like the murder of Jewish in the WWII. My vote is eight.Title (Brazil): `O Pianista' (`The Pianist')"},{"username":"bob the moo","userUrl":"https://www.imdb.com/user/ur1002035","reviewLink":"https://www.imdb.com/review/rw1331518","warningSpoilers":false,"date":"2 April 2006","rate":"","helpful":"5 out of 14 found this helpful.","title":"Far from cheerful viewing but an impacting and engaging film that helps keep history relevant","content":"Wladyslaw Szpilman is a musician living with his family in 1930's Warsaw. The rise of anti-Semitism starts to erode their civil liberties, making them have permits to work, requiring them to wear armbands that identify them as Jewish and generally treating them like second-class citizens and lesser people. This gradual slide becomes increasingly serious as all Jews are ordered into one small area of the city, where whole families are given flats with one or two small rooms to be shared among six or seven people. As the murders and control of the Jews continue, Szpilman is left to try and survive while the war rages across Europe.I didn't bother to watch this in the cinema despite the Oscars and rave reviews simply because I could never get my head in the right space to spend my time on a subject that was never going to be an easy watch. With it coming onto television recently though I decided it was worth a look and easily got into it, which the emotional power of the story doing enough to carry it along for the duration. At times it does feel like watching war porn, as Polanski wheels out one more shocking atrocity after another and occasionally feels like he is involved in a game of one-upmanship with other Holocaust movies (so we don't just have a man thrown out a window, but a disabled old man thrown out a window). This was a bit of a problem for me because I wanted more to the film that just the horror shown to me. However the film does do more than that and generally does enough to be as impacting in the study of Szpilman as it is in just yet again reminding us of the terrible things done in Europe barely 60 years ago.On both levels the film works while never being something you should try and watch expecting it to be a fun night in. Staying away from the front line of the war, the film focuses on the effects on the innocent, specifically Szpilman, who struggles to just stay alive. Up till this point the film had been a bit obvious, with bad things happening while the Szpilman's argue over what to do etc, with the film relying heavily on the shock and horror of what was happening. The rest of the film is more about him being left alone and hidden within Warsaw, which although slow is still impacting and engaging. At this point Brody also steps up and becomes much better than before, showing so much with just a horrified look but still containing enough of a character to be more than just our eyes. The rest of the cast are all good but generally it is Brody that carries the majority of the film. Polanski directs with a very good eye for the breakdown of this world and it looks totally of period and convincing.Overall then, not a film to come to if you are hoping for a cheerful night in but one to watch to gain a wider appreciation of the atrocities that can so easily be allowed to take place. Ethnic cleansing and wars continue even as I sit writing these words so those that think this film is just an unnecessary wallow in past horrors would do well to take a minute and think. At times it could have been better but it is impossible to ignore the power of the story and the impact of the delivery."},{"username":"classicsoncall","userUrl":"https://www.imdb.com/user/ur2707735","reviewLink":"https://www.imdb.com/review/rw2747794","warningSpoilers":true,"date":"3 February 2013","rate":"10","helpful":"29 out of 38 found this helpful.","title":"\"You musicians don't make good conspirators.\"","content":"Fortunately, I'm able to keep my personal feelings about Roman Polanski compartmentalized enough to say that this was a remarkable film. I've read many comparisons between \"The Pianist\" and \"Schindler's List\" on this board, and even though the films are quite different, the overpowering portrayals of Man's inhumanity against Man will leave the viewer forever affected. Adrien Brody's Best Actor award was stunningly achieved here, as his character arcs through an incredible series of circumstances to barely survive life in the Warsaw Ghetto during World War II. What little I knew of director Polanski outside of his marriage to Sharon Tate, the grisly Manson murders, and his rape conviction in the late 1970's, was put into an entirely different perspective when I learned about his own life in the Polish Ghetto. Much of what we see in the film must emanate from his own unique experience as a child during the War and experiencing Nazi atrocity first hand. I don't envy anyone who survived that experience enduring the painful daily memories of those times.Given the film's title, I guess I was somewhat surprised by the paucity of musical sequences, though what was offered was artistically presented. Particularly poignant was the scene when Wladyslaw Szpilman (Brody) was left to hide in an apartment where a piano was available, and he mimed his way through a selection from memory by the need to maintain silence.Many years following the end of World War II, a single film cannister simply marked \"The Ghetto\" was discovered, revealing valuable insight into how the Nazi propaganda machine attempted to manipulate public opinion about 'rich' Jews who lived in luxury alongside fellow Jews in squalid conditions. Even more intimate details of life in the Warsaw Ghetto are presented in \"Shtikat Haarchion\" (A Film Unfinished), describing conditions that are even more horrific than those depicted in \"The Pianist\" or \"Schindler's List\", if that can even be imagined. These movies exist for a higher calling as a constant reminder that the term \"Never Again\" be one to constantly take seriously in an ever increasingly dangerous world."},{"username":"lee_eisenberg","userUrl":"https://www.imdb.com/user/ur4888011","reviewLink":"https://www.imdb.com/review/rw1375316","warningSpoilers":false,"date":"23 May 2006","rate":"9","helpful":"5 out of 14 found this helpful.","title":"well done, even if it didn't quite equal \"Schindler's List\"","content":"In what I assume was Roman Polanski's most personal movie ever, he tells the story of Polish-Jewish pianist Wladyslaw Szpilman (Adrien Brody) doing everything possible to survive the Nazi occupation. As is the case with all of Polanski's movies, there are some very harrowing scenes, namely when the Nazi planes first start bombing the city, and when Szpilman has to hide. As Szpilman, Brody really brings out the most in the character (no doubt his sad face helps with that).I will say that the movie doesn't quite equal the profundity achieved by \"Schindler's List\". But maybe that's not a fair comparison, since Polanski probably wasn't aiming for that. Either way, this is definitely a movie worth seeing, as a message of hope in the darkest of times."},{"username":"gavin6942","userUrl":"https://www.imdb.com/user/ur1234929","reviewLink":"https://www.imdb.com/review/rw2252258","warningSpoilers":false,"date":"19 May 2010","rate":"7","helpful":"7 out of 16 found this helpful.","title":"An Excellent Movie, Of Course","content":"I don't have much to say on this movie, other than that it was very good. Adrien Brody is a fine actor and this is probably his finest role (though I'm partial to \"The Jacket\").My only real concern with this film ,and it shouldn't be seen as a slight against it, is that it seems that making a film about the Holocaust makes a film automatically better. I'm not sure if it's because it evokes emotions or what, but this film, \"Schindler's List\" and others quickly rise to the top of the list of good films... World War II in general seems to do this, but the Holocaust even more so. It's an odd phenomenon."},{"username":"jboothmillard","userUrl":"https://www.imdb.com/user/ur4248714","reviewLink":"https://www.imdb.com/review/rw1415972","warningSpoilers":true,"date":"10 July 2006","rate":"9","helpful":"2 out of 14 found this helpful.","title":"The Pianist","content":"From Oscar BAFTA winning director Roman Polanski, and based on a true story, this is the great story of one man's struggle to survive, and also his passion of playing the piano. Oscar winning, and BAFTA and Golden Globe nominated Adrien Brody plays Wladyslaw Szpilman, an Oscar winning role, he has a passion for playing the piano. He and his family, including Father (Frank Finlay) and Mother (Maureen Lipman) are threatened and ordered about by the Nazi Germans to obey their commands, otherwise by shot. It is really disturbing to see the Germans killing Jewish people, and also the state of places after bombs and stuff. Also starring Thomas Kretschmann as Captain Wilm Hosenfeld, Emilia Fox as Dorota, Ed Stoppard as Henryk, Julia Rayner as Regina, Jessica Kate Meyer as Halina and Michal Zebrowski. The best moments for me are while Wladyslaw has a beard, and is surviving amongst the wreckage of a town, and he plays the piano for a German commander. It won the Oscar for Best Writing, Adapted Screenplay, and it was nominated for Best Cinematography, Best Costume Design, Best Editing and Best Picture, it won the BAFTA for Best Film and the David Lean Award for Direction, and it was nominated for the Anthony Asquith Award for Film Music for Wojciech Kilar, Best Cinematography, Best Adapted Screenplay and Best Sound, and it was nominated the Golden Globe for Best Motion Picture - Drama. It was number 59 on The 100 Greatest Tearjerkers, and it was number 32 on The 100 Greatest War Films. Very good!"},{"username":"rmax304823","userUrl":"https://www.imdb.com/user/ur0819382","reviewLink":"https://www.imdb.com/review/rw1866580","warningSpoilers":true,"date":"30 April 2008","rate":"8","helpful":"17 out of 26 found this helpful.","title":"Survivor","content":"Film makers have to step carefully when dealing with issues like the Nazi extermination program. There have been equally brutal programs of ethnic cleansing in places like Southeast Asia and Rwanda, in which hundreds of millions died, but nothing like this in Europe since the Middle Ages. The victims here were not only Jews but Gypsies, the mentally ill, homosexuals, socialists, communists, and political undesirables. The Nazis eliminated not six million but some uncountable number between 12 and 15 million. An event like that can't be treated lightly and milked for easy tears, or the event itself is cheapened.Fortunately, the films that have explored the subject have been uniformly well done, as Roman Polanski's \"The Pianist\" is well done. Polanski himself suffered in much the same way as the protagonist, Vlad Szpilman (Adrien Brody). Polanski has a habit of embellishing his tales but there's no question that in this instance he knows what he's talking about.Szpilman is a well-known young pianist on Warsaw radio but the German occupation puts the station out of business. He and his family are herded into the Warsaw ghetto where they are subject to constant abuse and occasional murder. Szpilman barely escapes being sent to Treblinka with the rest of his family. And for the last half of the film, with the help of some friends who endanger themselves by lending him aid, he scuttles rat-like from one hiding place to another, each more dismal and perilous than the last. He suffers jaundice, his hair and beard grow long, his clothes turn to tatters, his food disappears, he's half frozen, and he seems to shrink.He's reduced to living in the attic of a nearly demolished apartment building and is ecstatic to discover a gallon can of pickles overlooked on the top shelf of a kitchen cabinet. The can falls out of his hands while he tries to open it and rolls across the floor to come to rest at the boots of a German officer, Captain Hosenfeld (Thomas Kretschmann). The only Germans we've seen so far have been brutes -- ridiculing the insane, executing Jews who ask simple questions, or simply shooting people chosen at random.We expect nothing from Hosenfeld except a quick shooting. But Hosenfeld is a human being and, having discovered that Szpilman \"is\" -- or rather \"was\" -- a pianist, he asks him to play a piano left in one of the flats. Szpliman has been unable to play for years and when he seats himself we worry that he might not bring it off and, indeed, his first chords are tentative, uncertain. Then his playing becomes automated, the old habits return, and he dashes off a dramatic and exquisitely executed piece of Chopin. Hosenfeld has been leaning back, enjoying the music, then leaves Szpilman quietly to his attic. He returns a few times later, before the Germans withdraw before the Russians, and unceremoniously hands him a few packages of food and, finally, his overcoat. The matter-of-fact compassion shown by Hosenfeld, and Szpilman's desperate need for contact with another human, are very moving.When the Russian troops finally arrive, Szpilman stumbles out of his hovel to greet them, but seeing his overcoat the Russians open fire on him. Szpilman finally convinces them that he is a Pole, not a German, and one of the befuddled soldiers asks, \"Then why the ****ing coat?\" Szpilman is trembling with fear but manages to gulp, \"I was cold.\" An epilogue tells us that Szpilman went on with his career and Hosenfeld wound up in a Soviet prison camp where he died in 1952, despite Szpilman's attempt to find him. Under the end credits, a smiling Szpilman plays a lively, sparkling composition by Chopin.It's a remarkable film. Polanski is no longer the Wunderkind but a mature film maker. Nothing is excessive. We need only as much as we need to know to understand Szpilman's travails -- one tragedy following another. There are no sentimental speeches at the final parting of Szpilman and his family. Szpilman himself never breaks down. He simply does what needs to be done to survive. And Adrien Brody captures what Szpilman must have been like. (From some angles he resembles the young Arthur Rubenstein.) Kretschmann gets Hosenfeld down pat as well. In their scenes together we sense their respective positions -- one man with nothing left to lose, the other with nothing left to gain. The story, and the historical facts it's based on, raise many questions about human nature, of course. I'm not at all sure that if we could find the answers to those questions we would like what we found.One of the better films of the year."},{"username":"ma-cortes","userUrl":"https://www.imdb.com/user/ur3270789","reviewLink":"https://www.imdb.com/review/rw1977291","warningSpoilers":false,"date":"18 November 2008","rate":"8","helpful":"9 out of 15 found this helpful.","title":"Intense biography about a Polish pianist named Szpilman during the Warsaw ghetto","content":"This is an emotionally tale and very decent drama about a pianist named Szpilman from luxurious life until terrible ending in the Warsaw ghetto. Polanski correctly directs a spellbinding portrait about the holocaust with his personal knowledge and proper experience on his childhood . Adrien Brody is excellent in a complicate and suffering role. Besides splendid actors, Frank Finlay,Jessica Meyer, Emilia Fox and Thomas Kretschman as a good Nazi officer who helps him. Evocative cinematography by cameraman Pawel Edlman, Polanski's usual. Musical score by Wojciech Kilar with brilliant piano sounds. Academy Award for best director Roman Polanski, Actor, Adrien Brody and adapted script by Ronald Harwood based on Wladyslaw Szpilman memories.Adding more details over largely described on the movie referred 'the Warsaw ghetto uprising', the events happened on the following manner : In 1939, after the invasion of Poland, Reinhard Heydrich chief of Gestapo began to place all Polish Jews in ghettos, where they could slowly die of hunger and disease. The campaign was to be administered by the Waffen-SS the party's military formations that fought as integral units in the armed forces. The Warsaw ghetto was the largest of these segregated areas established by the Nazis in Poland. In 1940 Heydrich, using the excuse that the spread of typhus had to be contained, set up a special section 11 miles in circumference enclosed by a brick wall 10 feet high. The cost was paid by the Judenrat, the Jewish Council of twenty-four-members, which was in charge of Jewish affairs inside the ghetto. In 1940 more than 80.000 gentile Poles living in the infected area were ordered to leave, and the next month about 140,000 living elsewhere in the city were moved in which the 240,000 still live in the ghetto. Some 360.000 Jews, a third of Warsaw's population, were herded into a 3,5-square-mile area. Meanwhile, Gestapo agents removed all Jews from the economic and cultural life of the city, from factories,shops, theaters, and libraries. On November 15,1940, the ghetto was sealed and its twenty-two entrances closed. No one was allowed to leave or enter, there was to be contact with the outside world.The situation soon became critical,Jews fought for jobs in the ghetto, including work with the labor battalions organized by the Nazis. Those unable to find work tried to exist by selling jewels,clothing, or anything else to obtain food. From 300 to 400 died daily in the Warsaw trap. More than 43.000 starved to death during the first year. Children crazed by hunger crawled through the sewers to the non-Jewish sectors of the city to smuggle in a bit of food. People were no longer moved by the sight of men and women falling dead on the streets. The Nazi authorities began intensified measure on July 22, 1942. As a memorial to Heydrich, Heirich Himmler ordered all Jews except those already in concentration camps to be deported .The ghetto and all labor camps would then be destroyed. Mass deportations to the gas chambers of Treblinka began. In two months 300.000 Jews were eliminated. The Judenrat was ordered to deliver 6.000 Jews daily for deportation. Each day thousands were driven by guards through the gates.Young Zionists, pioneers training to go to Palestine, mobilized first to be followed by members of the Polish workers party . On July 28, 1942, the Jewish Combat organization consisting about 1.000 men and boys was formed. All resolved to kill as many of their tormentors as they could before they died.The Jews fighting from rooftops, cellars, and attics,Poles outside the ghetto now began to send in more revolvers, grenades, and dynamite. In 1943 the guerrillas divided into twenty-two groups built an intricate network underground cellars and tunnels ,linked with command posts . In April 19,1943 German troops moved in on the ghetto to send all who were left to Treblinka in a final action. First came the armed trucks, tanks, and armored cars. The ghetto fighters poured a hail of bullets, grenades and bombs, the fighting went on for twenty-eight days. The guerrillas fought to the last. Many committed suicide at the moment before capture. The Germans dragged survivors from the cellars and rubble. Fewer than 100 escaped, the last 60000 Jews had been exterminated or killed in the explosions and fires.Polish sources reported that the fighters had killed 300 Germans and wounded 1000. From Warsaw Jewish resistance moved to swamps and forests."},{"username":"moonspinner55","userUrl":"https://www.imdb.com/user/ur0989035","reviewLink":"https://www.imdb.com/review/rw3392382","warningSpoilers":false,"date":"10 January 2016","rate":"7","helpful":"1 out of 4 found this helpful.","title":"\"Germans won't use Jewish toilets...the toilets are too clean for them.\"","content":"Devastating adaptation of Wladyslaw Szpilman's World War II memoirs as a Polish Jew and classically trained pianist in 1939 Warsaw who continually escaped the clutches of the invading Nazis over a five-year period. Saved from the concentration camps by the Jewish police, he relied on the Underground--as well as on one remarkable German soldier--to stay alive and eventually tell his story. Adrien Brody's sadly quizzical, sensitive face takes the screen like a beacon of light; he obviously put himself through hell to get this physically demanding role just right, and his emotional performance is incredibly rich. Not so some of the overacting supporting players, particularly those cast as Szpilman's close-knit family members (however, the scene where the father splits a piece of caramel five ways is a heartbreaker). Roman Polanski won the Oscar as Best Director; however, some of his bigger scenes (such as the Russian Liberation) don't pack the wallop expected. The filmmaker does catch the numbing brutality and violence of the time with an unerring eye, and his film is arguably a more lasting statement of Nazi-atrocity than Steven Spielberg's \"Schindler's List\". Lengthy, but hypnotic; an unsettling, intense dramatic achievement. Seven Oscar nominations in all, with three wins including Brody for Best Actor (well-deserved) and Ronald Harwood for Best Adapted Screenplay. *** from ****"},{"username":"TxMike","userUrl":"https://www.imdb.com/user/ur0438066","reviewLink":"https://www.imdb.com/review/rw0746918","warningSpoilers":true,"date":"26 June 2004","rate":"","helpful":"5 out of 13 found this helpful.","title":"Just trying to survive the war, so he could play piano again.","content":"This movie is too long for what it depicts, one Jew's struggle to survive Nazi-occupied Warsaw during the second world war. The movie doesn't cover any new ground, the audience doesn't learn anything new. However, being a personal project for the director may account for its length. I hadn't planned to see it, because if you've seen one holocaust film, you've seen them all. And that is not in any way intended to minimize the horror of the mistreatment of the Jews, but how many times does a person need to see it reinacted to grasp the message? It happened, it was bad, we all need to do our part to see that nothing like that happens again. But I saw it for Adrien Brody, the hawkish actor who won the best actor Oscar for his performance. And, after seeing it, I believe it was deserved. The first hour of the movie established the setting and danger, the middle hour spends too much time showing the protagonist trying to survive, hiding in bombed-out buildings, scratching for food. We know it all happened, but if you show everything, the movie is 6 years long!! The movie starts with actual black and white film footage of 1939 Warsaw, and we see its residents leading normal lives for that period. Then, cut to the movie, the pianist is playing for a live radio broadcast when bombs or artillery shells begin to explode and all Jewish families begin their fights for survival. Forced to wear identifying arm bands, eventually they were banished to their own ghetto, then the trains came. SPOILERS are contained in the rest of my comments, for my own recollection, please read no further. The last half hour of the movie pulls everything together. The pianist is helped by a German soldier who discovers him, has him play piano for him, then secretly brings him food as the war winds down. When the Russians finally come to Warsaw, the few remaining Jews are out of danger, the Germans are imprisoned, and eventually the pianist is playing again for the radio, and the final scene is his playing a concert before a live audience. The pianist was a real person, this movie is a true story based on his book."},{"username":"dbdumonteil","userUrl":"https://www.imdb.com/user/ur1219578","reviewLink":"https://www.imdb.com/review/rw1249882","warningSpoilers":false,"date":"29 December 2005","rate":"10","helpful":"9 out of 15 found this helpful.","title":"Spilzman? What a beautiful name for a pianist...","content":"In March 2003, Roman Polanski's \"the Pianist\" (2002) pocketed three Oscars including best actor (Adrien Brody) and best director (Roman Polanski). One month earlier, the ceremony of the French Oscars showered the movie with praise by attributing to it and his author similar prizes. Earlier in May 2002, the festival of Cannes crowned it of the most prestigious prize: the deservedly Golden Palm. Already in 2002 and chiefly throughout 2003, awards rained on Polanski's deeply moving piece of work and rightly so. It is a true return to form for him after an uneven career which started after the spooky \"the Tenant\" (1976) and wildly oscillated between duds (Pirates, 1986, Frantic, 1988) and palatable but not peerless works (Death and the Maiden, 1994, the Ninth Gate, 1999). \"The Pianist\" helped to rekindle the flame that made such treasures, hallmarks in their own domains (the wonderful \"Rosemary's Baby\", 1968 in the fantastic or the fabulous \"Chinatown\", 1974 in the film noir) and could be a stalwart success in the movie with the Second World War as the backdrop. It is perhaps Polanski's most personal film to date and the one he has always wanted to shot, surely to exorcise traumatic memories haunting him since his childhood. Like his main protagonist, Wladyslaw Szpilman, he experienced the horror of the ghetto of Warsaw.To get his demons out of his head, he preferred to adapt for the screen Spilzman's memories, a genius pianist and a man who bit by bit lost his family and friends on whom he could rely, a man who was deprived of his piano and thus of his \"raison d'être\". As Stefan Zweig says: \"to read is to live\", well for him \"to play is to live\". Even when he has the opportunity to play, he has to refrain himself. See the scene in which he has settled down to his flat. Before leaving him, the owner says to him: \"please, don't make noise\". Polanski makes us share his craving for playing by putting his main protagonist in front of the sacred instrument ans plays us the music in Spilzman's head without the latter touches the keys. He was also a man who saw sorrow, pain and the unthinkable (the sequences in which German officers and soldiers kill Jewish people give goose pimples because they're precisely unthinkable). Throughout his sufferings, chance didn't totally relinquish him: he was rescued at the last minute by a Polish policeman (and a fellow of his brother) who stopped him from going up in the train of death to Auschwitz. At this moment, he was saved from death but he lost his family. Then, he had to rely on his courage to survive and enjoyed the help of some fellows even if they absconded (the woman Spilzman made the acquaintance at the beginning of the film and her husband who found him a flat). At last, the German officer at the end of the film, was his ultimate glimmer of hope.Roman Polanski shot his film with a classic but startling directing for the sake of detail and realism. It has a linear but inevitable progression which has the look of a downward spiral: the tightening of the restrictions on Jewish people which become increasingly harsher (the armband to distinguish the Jewish from other peoples, then the delimitation and the encircling of the ghetto, the Jews chased away from their neighborhood and deported to the extermination camps) and the least sign of certainty is nearly automatically blighted: \"we have work certificates at last\" sighs Spilzman's father. Alas! Hopes blighted since just as he pronounces these words, a German officer asks them with other people to go outside. Some of them are killed while the others (including Spilzman's family) have to wait on a large square with thousands of others. Polanski also relates notable events with a minimum of means (the fight and shooting sequences are often perceived from a balcony or a window).The second part of the film strongly recalls Polanski's murkiest hours extracted from his masterworks. For example, in his flat, Spilzman tries to be as quiet as possible and while searching for food in his kitchen and drops crockery. The noise makes his neighbor intervene and by giving the alarm in the building obliges him to flee once again. At this moment, we find one of Polanski's trademarks: the eerie neighbor who has a harmful influence on the hero and contributes to his or her fall (the Castevet in \"Rosemary's Baby\", the offbeat inhabitants of the building in \"the Tenant\". In another extent, when Spilzman has to lurk in the destroyed ghetto (the distant shot where we can see him trudging in the ruins of this apocalyptic landscape deserves to rank among Polanski's most notable shots in all his filmography), Polanski really places us amid a \"in camera\" in spite of the sprawling scenery.The filmmaker should also be thanked for having chosen Adrien Brody in the main role. He works wonders in a part which seemed to be tailor-made for him, a far cry from his cardboard character in M Night Shyamalan's \"the Village\" (2004). He can act several persona in himself: a smart young man as well as a dirty and bearded tramp. His angular face, his acute and melancholic countenance stay with us for a long time. As for the German officers, they are often caricatured but ultimately Polanski eschews the trap of Manicheism which seemed to pervade the whole film thanks to the last sequences with the sympathetic German officer. Not all Nazis were beasts...Interspersed with either unbearable, either excruciating or either moving sequences and with striking shots, \"the Pianist\" has its place on the podium of Polanski's towering achievements. See it any costs! Unfortunately it would seem that the flame began to flicker again given the lukewarm critics \"Oliver Twist\" met this year. The slump again? Only time will tell..."},{"username":"Quinoa1984","userUrl":"https://www.imdb.com/user/ur0453068","reviewLink":"https://www.imdb.com/review/rw0746412","warningSpoilers":false,"date":"16 January 2003","rate":"10","helpful":"136 out of 182 found this helpful.","title":"Stoic, haunting tale of survival","content":"The Pianist tells the story of such a man in war time Poland, played by Adrien Brody, who from start to finish sees his life literally getting worse and worse and worse- starts off with new rules from the Nazis, then the stars on the arms, followed by the Warsaw ghetto, and while there he could play in the restaurant, that too soon ended, as the trains arrived and took his family and anyone else he knew away. During this he narrowly escapes, and from then on the film in a sense almost becomes not exactly a holocaust film, but more like a cross of that as the element and the basic structure of something a-la in Cast Away: this includes stretches of scenes showing Brody simply trying to keep out of view of the Germans, either in a small apartment provided by helpful Polish Christians/Jewish resistance, or as a scavenger in the abandoned sections of the ghetto, all while feeling the old rhythm of the piano in his head and fingertips. This is the kind of magnificent filmmaking that shows a director not only being as true to the story given to him (that of Painist Szpilman, based on his autobiography) but to his past as well- Roman Polanksi faced similar conditions as a boy in the early 40's, and has found the best line to show, never crossed or mis-stepped, in representing the characters and the period. There aren't any hints of tightened suspense, no clues as to where the film could veer to, it just is. The big difference to be seen between a film like this and Schindler's List is not just in the people and situations (Schindler's List was a film about two people, Schindler and Goeth, in the foreground while the Pianist is a total first person tale), yet also in the filmmaking qualities being here surely European. And while the accents on the Polish-Jewish actors sounds a bit too British, that is quite forgivable considering the scope of the project (thank heavens he didn't put in English speaking Germans).In conclusion, Brody turns in a superb performance, and this indeed is in with Polanski's best, a deserved of 2002's Palme D'Or. Great music too. A+"},{"username":"edwagreen","userUrl":"https://www.imdb.com/user/ur2542703","reviewLink":"https://www.imdb.com/review/rw1320869","warningSpoilers":false,"date":"20 March 2006","rate":"10","helpful":"1 out of 2 found this helpful.","title":"The Pianist- Destruction Hits A Memorable Chord ****","content":"Surprise Oscar winner Adrien Brody is magnificent in Roman Polanski's \"The Pianist.\" (It was thought by the experts that Daniel Day Lewis would win the award for \"Gangs of New York.\") Polanski's win was a surprise since the conventional wisdom had Martin Scorsese for \"Gangs\" winning the directing award as well.This tremendous holocaust film deals with the destruction of a family. The scene where a family had its wheelchair bound member tossed from a window and then shot as they ran was eerie and never to be forgotten.As a marvelous piano player, Brody captured the role with depth and a strong conviction. The scene where the family is placed on a train for their ultimate destiny can and must never be forgotten as well. From that point on, the focus of the picture becomes one of survival as Brody is able to elude the Nazi barbarians.A strong film in the tradition of \"Schindler's List.\" Surely, a film for humanity."},{"username":"tedg","userUrl":"https://www.imdb.com/user/ur0643062","reviewLink":"https://www.imdb.com/review/rw0746673","warningSpoilers":true,"date":"21 April 2003","rate":"","helpful":"14 out of 26 found this helpful.","title":"Film and Music, Pain and Fire","content":"Spoilers herein.Nearly any film is for me a double experience: the watching and the post-coital rumination. That second phase can make the experience worthwhile even when the film itself is ordinary or poorly done.But it works the other way as well, especially when a film is designed for discussion: the film delivered with so many opinions that themselves are ordinary or poorly done. This film comes so charged. Szpilman wasn't `Jewish enough' to be the center of an important holocaust film, goes the most ordinary and loudest of them. I suppose there are some things about the commingling of descriptive art and definitive life to be said there. But one likes to have more freedom in post-film thoughts and that whole topic is dominated by the sorts of reflexive responses manipulated by film.There's a second prepackaged topic concerning whether `Schindler' was better or `worse.' I don't consider Spielberg's film a holocaust film at all: he lives in a happy world, where justice and right (and lots of other happy values) always triumph. His observations are always external. His goal is always to tell a story, a stance that furthers the distance between his films and reality. Polanski's project has no story at all, merely a life of accidents. His camera is within the artist's personal space. His own mannerisms are Eastern European and depressed, congruent with what he shows. (Speilberg's Schindler really did have the silk unctuousness of the East, but as observed from California.) So I credit Polanski's vision as having more historical credibility than Speilberg's, knowing that despite the best efforts of us all to avoid having practical history made by the movie marketplace.(One exception, where Polanksi is offensively theatrical: when Szpliman runs from the destroyed hospital, he faces a street of desolation as far as one can see, `High Noon'-wise.)Much more interesting to my mind is the portrayal of an artist. Polanski has always been deeply self-referential in his work: always there is an examination of the artist within the art. And I make a minor hobby out of collecting film experiences that do this with music and mathematics because I have some personal experience to work with. For those who don't know: Poland\u0091s pride is Chopin, who invented a relationship to the piano that not only defined modernity but reinvented everything about musical performance. (Film would follow this lead in 1941.) Chopin built pieces designed to be bent in performance, designed with empty rooms that a pianist could explore. Unlike, Bach for instance, where the magic of the performance was in attuning to Bach and his intent, the performer of Chopin really could bring his own soul to parity with God. Szpliman was a strong pianist, and therefore more than a national character, instead a reflection of the Polish heart.Here, we watch this man compromise his own pride, eschew his religion, run away from every opportunity for dignity in order to keep his hands warm to play another day; and not just play, but play on the radio for Poles. So during this painful journey, we assume what we are meant to in films about tortured artists: that the pain we are watching will be transmuted by this man into great art that will lift us all. His own personal denigration - what is done to him and the denigrating choices he makes - are worth it overall.This is where the fatal pessimism of Polanski stops, because he doesn't let us know the musical truth. This is not Szpilman\u0091s playing of course, but not much unlike him. Szpilman was a `safe' player, one who never had the strength or desire to add much to Chopin. That's why he was on the radio: his `interpretations' were unchallenging and palatable. But he would never have been considered an artist of note at all if he had not survived the perfect brutality of the Germans, whose own music, though sentimental was constrained in ways that Chopin's never was. The payoff is supposed to be that after his trials, the artist is now - theoretically - capable of expressing the pain and yearning of the world. That we are meant to so think is clear from the end, where he plays with the glow of Dreyfuss from `Music of the Heart.'Ah, but not so. The sound we actually hear throughout is by Olejniczak, a similarly ordinary man. Szpilman did not in fact come through a better artist, but much worse: a meek pianist. `Shellshocked,' postwar contemporaries would say. Contrast this with Artur Rubinstein. Jewish Pole of the previous generation, and the first giant to explore Chopin's rubato. He had his own dark nights, but not because the world was inhospitable. Listen to his recordings (freely available) compared to Szpilman\u0091s (hard to get) or even Olejniczak\u0091s on the soundtrack. These are two different universes. One is merely pleasant, the other life-altering.Polanski has made some great films (including the under-appreciated `Ninth Gate'), and his thinking through of the intellectual reach of a project is extensive but he has ultimately let us down here. Implicit in much of modern Jewishness is the triumph of enrichment of the people through their tribulation. Perhaps that is true, but this film undermines the idea when selecting Szpilman as metaphor.Ted's Evaluation -- 3 of 4: Worth watching."},{"username":"Calicodreamin","userUrl":"https://www.imdb.com/user/ur29385135","reviewLink":"https://www.imdb.com/review/rw6818541","warningSpoilers":false,"date":"16 April 2021","rate":"8","helpful":"1 out of 1 found this helpful.","title":"Haunting","content":"A truly haunting film depicting the journey of one man through the Holocaust in German occupied Poland. The cinematography and music paired well to give this the desolate vibe it deserved. Beautiful acting and a well developed storyline."},{"username":"Theo Robertson","userUrl":"https://www.imdb.com/user/ur1532177","reviewLink":"https://www.imdb.com/review/rw2130004","warningSpoilers":true,"date":"20 September 2009","rate":"8","helpful":"9 out of 17 found this helpful.","title":"Despite The Over Familiarity A Good Film","content":"The problem with making a holocaust film is that it's a subject that's been done before . Everyone from Steven Spielberg to ( Amazingly and somewhat hypocritically I say ) Vanessa Redgrave has made a film centering around the Nazi attempt to exterminate European Jewry . I have a problem with this because it denigrates history to an extent . If people have to make a film featuring man's inhumanity to man as a reminder what does this say for the rest of humanity ? Can't the rest of humanity watch a documentary like SHOA or the Genocide episode of THE WORLD AT WAR ( My first introduction to The Holocaust ) or read a book of the accounts of Nazi mass murder ? Would it be too cynical to point out how well rewarded Holocaust movies are ? It's also noticeable how formulaic these type of movies are . We start at the beginning of the war and follow the protagonist's survival until they're liberated by the allies in 1945 That said THE PIANIST does have merits of its own even though it doesn't really bring much to the table originality wise . Actually the food allegory is appropriate though slightly confusing . Early in the film we see the terrible conditions in the Warsaw ghetto as its Jewish population are effectively walled up from the rest of the city and left to die . Cut to a restaurant interior as Wladyslaw Szpilman entertains the guests by playing the piano as the patrons grow fat by gorging themselves on food , fine wine and cigarettes as their fellow Jews fall dead in the streets . With a little editing you might find yourself thinking this part was directed by David Irving instead of Roman Polanski ! One thing THE PIANIST does do well is include the apocryphal tale of the Jews discussing their fate at the hands of the Nazis with no one wanting to believe for a second that the lone voice stating the Nazis are deporting them to be murdered may in fact be talking the truth no matter how unbelievable and horrific the truth may be Like I AM LEGEND the story suffers from the fact that the protagonist has no one to speak to for large portions of the narrative but there's so much incident on screen such as the Warsaw uprising it's not a major problem . You could make the point that Szpliman then becomes a spectator to Polish history rather than a character in his own right and you'd possibly be correct but these scenes are very well choreographed and filmed that it shouldn't be made as a criticism . There's also the introduction of \" A good German \" that we've seen before in films such as MUTTER'S COURAGE but Hosenfeld is so well drawn and acted by Thomas Kretschmann it's very difficult not to feel sorry for his fate In truth THE PIANIST follows the usual structure of holocaust movies but unlike some movies of this particular genre certainly deserved much of the critical acclaim hoisted upon it . As can be expected it's not a feel good movie but is definitely a well made and acted story of human suffering and endurance"},{"username":"bevo-13678","userUrl":"https://www.imdb.com/user/ur76062573","reviewLink":"https://www.imdb.com/review/rw5829299","warningSpoilers":false,"date":"16 June 2020","rate":"10","helpful":"2 out of 4 found this helpful.","title":"Classic","content":"Great War movie. Sequel to the piano most likely judging by the title"},{"username":"jotix100","userUrl":"https://www.imdb.com/user/ur1406078","reviewLink":"https://www.imdb.com/review/rw0746487","warningSpoilers":false,"date":"21 January 2003","rate":"10","helpful":"169 out of 219 found this helpful.","title":"To hell and back.","content":"The Pianist is an incredible film in many aspects. Roman Polanski's account of the survival of the pianist, Wladyslaw Szpilman, is a document about how one man can overcome the worst possible situations in a world gone completely mad around him.The only fault one can find with the adaptation of Mr. Szpilman's story by playwright Ronald Harwood, is the fact that we never get to know the real Wladyslaw Szpilman, the man, as some of the comments made to this forum also have indicated.There is a very interesting point raised by the the pianist's father who upon reading something in the paper, comments about how the Americans have forgotten them. Well, not only the Americans, but the rest of the world would not raise a finger to do anything for the people that were being imprisoned and made to live in the confined area of Warsaw. The exterminating camps will come later. What is amazing in the film, is the frankness in which director Polanski portrays the duplicity of some Jews in the ghetto. The fact that Jews were used to control other Jews is mind boggling, but it was a fact, and it's treated here matter of factly. Had this been made by an American director, this aspect would have never surfaced at all. Yet, Mr. Polanski and Mr. Harewood show us that all was not as noble and dignified as some other films have treated this ugly side of war. Wladyslaw Szpilman, as played by Adrien Brody, is puzzling sometimes, in that we never get to know what's in his mind. He's a man intent in not dying, but he's not a fighter. He accepts the kindness extended to him. He never offers to do anything other than keep on hiding, which is a human instinct. He will never fight side by side with the real heroes of the ghetto uprising. His role is simply to witness the battle from his vantage point in one of the safe houses across the street from where the action takes place.Adrien Brody is an interesting actor to watch. As the pianist of the story he exudes intelligence. There is a scene where Szpilman, in one of the safe houses he is taken, discovers an upright piano. One can see the music in his head and he can't contain himself in moving his fingers outside the closed instrument playing the glorious music from which he can only imagine what it will sound in his mind.The supporting cast is excellent. Frank Findlay, a magnificent English actor is the father of the pianist and Maureen Lipman, another veteran of the stage, plays the mother with refined dignity.In watching this film one can only shudder at the thought of another conflict that is currently brewing in front of our eyes. We wonder if the leaders of the different factions could be made to sit through a showing of The Pianist to make them realize that war is hell."},{"username":"Doylenf","userUrl":"https://www.imdb.com/user/ur1048771","reviewLink":"https://www.imdb.com/review/rw0746742","warningSpoilers":false,"date":"11 June 2003","rate":"","helpful":"9 out of 17 found this helpful.","title":"An extraordinary look at one man's survival...brilliant performance by Adrien Brody...","content":"Words are inadequate to describe the flawless flow of events in this absorbing account of Polish Jews facing extinction in the Warsaw Ghetto of the '40s during the Nazi reign of terror.Surely the most deserving Oscar award in years was bestowed on Adrien Brody who captures his character completely and carries the film with his amazingly real performance. He is at the center of vision throughout most of the action--so perfect in his role that he makes the story an unforgettable experience. His confrontation with a Nazi officer who discovers his hiding place and then asks him to prove that he is a pianist by playing the piano, is just one of the memorable highlights. This scene alone was justification for Brody's Oscar.Roman Polanski's direction is masterful throughout, never allowing the story to bog down in sentimentality but keeping the focus on survival and some of the horrific things that happen along the way.An inspired piece of filmmaking that is stunning to watch because it is so real and moving. Not since SCHINDLER'S LIST has the brutality and epic sweep of World War II been captured so accurately."},{"username":"dbborroughs","userUrl":"https://www.imdb.com/user/ur3079504","reviewLink":"https://www.imdb.com/review/rw1144399","warningSpoilers":false,"date":"7 August 2005","rate":"4","helpful":"13 out of 37 found this helpful.","title":"Over-rated story of survival","content":"I don't know what to say about this move other than it really didn't movie me. Sure Adrian Brody is excellent as the Pianist of the title who hides out in Warsaw as the city is destroyed around him, but I never really connected to the story. I never really cared. I'm not sure if its poor film making or simply the fact that for me this seemed as been there and done that. Many of the things that I dislike in the well financed movies concerning the Holocaust came into play, in particular the fact that everything looks so nice as to be unreal. I also have the sense that the film is insisting that I like and respect it simply because of the subject matter. Its not that simple you have to give me characters and a good story before I care. Unfortunately while Brody is an excellent actor however I never connected to him. I never had a reason to care other than what happened was truly remarkable, which means this movie meant nothing to me. This film is a major disappointment"},{"username":"lastliberal","userUrl":"https://www.imdb.com/user/ur2171244","reviewLink":"https://www.imdb.com/review/rw2256321","warningSpoilers":false,"date":"28 May 2010","rate":"9","helpful":"3 out of 5 found this helpful.","title":"It's an official decree, no Jews allowed in the parks.","content":"I have watched a lot of WWII films, but this is at the top of the list.Don't take my word for it, it won three Oscars, and should have won Best Picture; it did win Best Picture at the BAFTA awards, along with a Best Director for Roman Polanski (Chinatown, Rosemary's Baby). This is Polanski's finest film by far.Adrien Brody was magnificent, and his performance made you feel you were right there with him.It wasn't a pretty picture, the outstanding cinematography notwithstanding. Bodies lie in the streets, and people just passed them by. People were shot for asking a simple question. A man was so hungry that when his attempt to steal a woman's soup resulted in it falling to the ground, he fell to the ground and lapped it up.Amidst all the carnage and deprivation, Wladyslaw Szpilman (Brody) managed to survive until the end. An amazing story."}],"errorMessage":""}