{"imDbId":"tt0317248","title":"City of God","fullTitle":"City of God (2002)","type":"Movie","year":"2002","items":[{"username":"MartinHafer","userUrl":"https://www.imdb.com/user/ur2467618","reviewLink":"https://www.imdb.com/review/rw1214737","warningSpoilers":false,"date":"13 November 2005","rate":"9","helpful":"19 out of 37 found this helpful.","title":"a horrible movie that I strongly recommend","content":"When I say \"horrible\" I am referring to the vileness of the characters and terrible images in the film. Technically speaking, this is a great film--with some of the most amazing and innovative cinematography I have ever seen. The stories are interwoven very well and the film seems so very real. It is so unfortunate at the film's conclusion you find out that although these are actors, the story itself is true. It's just so hard to imagine living in this hell on Earth in Rio. After seeing this film, there's no way I am ever visiting Brazil!! I'm sure many viewers feel the same way due to the absolute brutality of their slums where the police do little to interfere with gangs who run it.FYI--there's an excellent and sobering documentary on the Criterion DVD of this movie about the drug problem in Rio in the present day. However, it and the film itself are very intense and bloody so I would not allow kids or even teens to view the film. It's really a shame, as most of the way through the documentary I realized it would be a great thing to show my high school world history class. But, the sight of a room full of naked teens with their penises a-dangling changed my mind!"},{"username":"TheLittleSongbird","userUrl":"https://www.imdb.com/user/ur20552756","reviewLink":"https://www.imdb.com/review/rw3727515","warningSpoilers":false,"date":"10 June 2017","rate":"10","helpful":"28 out of 32 found this helpful.","title":"A Brazilian masterwork","content":"Such an amazing film that deserves the accolades and acclaimed hype it's garnered. One of the best foreign language films there is and one of the best films personally seen recently, after a long time of being on my to see list but taking a while to get round to it due to being so busy and going through a difficult phase.Perhaps 'City of God' is not for everybody. It is not some audience members' idea of being entertaining, and is pretty unflinching, uncompromising and challenges the viewer. It does, with that being said, a superlative job bringing those qualities to life, and there are others, including myself, who judge films by what they set out to do rather than just wanting to be \"entertained\". There are many hugely entertaining films, while there are others that are clearly intended to be things other than entertainment and either are deep character studies, deliberate mood pieces and poignant dramas and shouldn't be denounced because of stereotypical views of what a film should be like.'City of God' is very well made, with some stunning and hard-hitting images, even if the budget is not high or enormous. It's all audaciously shot and edited with a lot of gritty atmosphere and sense of tension. The music fits well and has some haunting moments without being intrusive, while Fernando Meirelles's direction, particularly in the visual style, is superb.The story is not hard to follow, with lots of provoking thought, tension and emotion, while the action is positively explosive, frighteningly brutal and designed with a real meticulousness. In no way either does it glamorise crime and gives an unflinching view of gangland rivalry, provoking comparisons to Martin Scorsese and 'Goodfellas'.Alexandre Rodrigues and Leandro Firmino da Hora are fabulous in their roles and carry the film and their compellingly real characters adeptly.Overall, a masterwork. 10/10 Bethany Cox"},{"username":"Leofwine_draca","userUrl":"https://www.imdb.com/user/ur0482513","reviewLink":"https://www.imdb.com/review/rw3416784","warningSpoilers":false,"date":"17 February 2016","rate":"10","helpful":"9 out of 11 found this helpful.","title":"Sprawling crime masterwork from Brazil","content":"Wow, what a great movie! I'd heard plenty about this low budget Brazilian gangster film before I got around to seeing it when it showed on television in the middle of the night, but I was fully prepared to be disappointed. Many times a film has been hyped up so much that it's a let down when I finally see it, but not so this one: CITY OF GOD is a tremendous film, a masterpiece in fact. In many ways it's like a lower budget, more realistic version of the classic gangster films made by the likes of Martin Scorcese and Guy Ritchie and in many places it equals the heights of those two directors at the top of their game.The film follows the misadventures of various, almost feral children as they attempt to eke out an existence and then a living as they grow up in a Rio de Janeiro slum in the '60s, '70s and '80s. The central narrator isn't a gangster at heart; all he wants is to become a photographer and yet he's caught up time and time again in the violence surrounding his drug-dealing friends. Particularly good is Leandro Firmino as Li'l Ze, a psychotic hood who becomes a gang leader and who thinks nothing of having kids executed if they dare so much as get in his way.The direction is top notch, with Fernando Meirelles employing hand cameras on more than one occasion, so that this has a vivid, on the street look to it. The editing is slick and sleek, the music fits the action perfectly, and almost every actor seems to fit his or her role like a glove. I'm trying to think of things to criticise, but there's nothing, really: the story drew me in, got me interested in finding out what happened to the characters, and before I knew it a good two and a half hours had gone by while I sat back and was lost in this film's world. Of course, it's a tremendously violent movie, unflinching in its depiction of violence against children, and one of the most hard-hitting films I've witnessed, so not for those who prefer family-friendly fare; but if you're up for it, this just might be one of the best, most realistic crime films ever made."},{"username":"SnoopyStyle","userUrl":"https://www.imdb.com/user/ur2898520","reviewLink":"https://www.imdb.com/review/rw3259235","warningSpoilers":false,"date":"16 June 2015","rate":"8","helpful":"8 out of 9 found this helpful.","title":"The Godfather of Rio","content":"Li'l Zé and his gang is having fun chasing a runaway chicken in a Rio favela called the Cidade de Deus \"City of God\". The chicken comes to Rocket with his camera. Then flashbacks to the 60s tell the story of Rocket who becomes the photographer of his friends. Li'l Zé and his best friend Benny grow up to be the crime boss of the city. There's Carrot who is a criminal leader tolerated by Benny and there's Knockout Ned who turned away from crime.It is truly a new Godfather. It is the harsh brutality of the slums. It's the randomness of the world. It beats with a human heart. It's a little messy. It's visceral. The kids are played by kids. The criminals are remorseless. The amateur actors are authentic. The cinematography is terrific. The location can't get more real. It is a new crime masterpiece."},{"username":"Hitchcoc","userUrl":"https://www.imdb.com/user/ur0278527","reviewLink":"https://www.imdb.com/review/rw2163344","warningSpoilers":false,"date":"24 November 2009","rate":"9","helpful":"4 out of 6 found this helpful.","title":"Almost Too Much to Watch","content":"One must step back from an absolute sense of repugnance at the violence and look at what the filmmaker has done in this movie. Once you tune yourself into the lives of this cast of characters and their ongoing effort to stay alive and maintain dominance, you can reflect on the amazing cinematography and overall effect of the film. There is an ebb and floe that we watch, almost a dance in the slums of Rio. There is so much poverty that factions have grown up and the people are continually victimized by them as are there individual members. The police are perpetually on the take, so a military state is eventually set up. The main character is a participant early on and then an observer. His photographic skills are his ticket out and his ticket in. There is death and destruction, drugs and murder around every corner. Perhaps the scariest thing are a group of young boys called the Runts who are making a seamless transition into the horrors of the place, keeping things going for yet another generation. I think the most dominant theme of the whole thing has to do with the indifference toward death. Even those who are friends early on will kill their friends because a drug lord says so. It's an unforgettable film."},{"username":"Horst_In_Translation","userUrl":"https://www.imdb.com/user/ur3914439","reviewLink":"https://www.imdb.com/review/rw3380222","warningSpoilers":true,"date":"25 December 2015","rate":"6","helpful":"4 out of 23 found this helpful.","title":"Solid little crime flick","content":"\"Cidade de Deus\" is a Brazilian movie that is set in the slums of the same country. We follow two brothers over the years and their lives develop completely differently. It is a world of crime, drugs, desperation, but also a world of hope for a better future. We find out about their involvement with gangs, with girls and also about their hobbies in general. One big hobby of one of them is photography and it may shape the path to the better future I just mentioned. The film runs for over 2 hours and was directed by Fernando Meirelles and Kátia Lund. Bráulio Mantovani adapted Paulo Lins' novel and the result may be Brazil's most famous film of all time.This one scored 4 Academy Award nominations and won a BAFTA for its editing back over 10 years ago. I personally felt it was a pretty decent watch. I cannot see the real greatness that catapulted this movie into the top25 highest rated movies of all time on IMDb, but it's not a bad film either. There are 2 or 3 moments of greatness, but the rest is merely good. Sometimes, it even drags a bit, which is why I believe this film could have been kept down to 100 minutes without losing anything truly significant that would have hurt the overall movie. My favorite scene was probably the one in the club with all the hectic lights and actions and one guy taking out his gun which results pretty much in a catastrophe. Very intense moment. I wish there could have been more moments like these. Still, as a whole, I recommend the watch. Pretty good movie for the most part."},{"username":"claudio_carvalho","userUrl":"https://www.imdb.com/user/ur2488512","reviewLink":"https://www.imdb.com/review/rw0871189","warningSpoilers":false,"date":"1 November 2003","rate":"10","helpful":"25 out of 37 found this helpful.","title":"The Other (Sad) Side of the Wonderful City of Rio de Janeiro","content":"The story begins in the present days, in a barbecue party in the slum of 'Cidade de Deus', with some bandits chasing a chicken. Then, a teenager called Buscapé (Alexandre Rodrigues) tells the story of the Cidade de Deus and the main characters of the movie (Zé Pequeno, Bené, Cenoura etc.), since they were kids. This movie takes place in Cidade de Deus, a set of buildings originally built in the 60's for poor persons originated from a big flooding in Rio and from some slums. In the 60's, this area was isolated, without any infrastructure. Nowadays, with the construction boom, it is located close to Barra da Tijuca and Jacarepaguá, very valuables zones. Rio de Janeiro City is surrounded by slums, where the situation presented in the film is the reality of thousands and thousands of honest poor persons. This movie is remarkable: the screenplay, the direction, the performance of the cast, everything works perfectly. The frantic camera looks like a documentary. Today the DVD was released in Brazil, I bought it and I have just watched it with my family. I really can imagine the reaction of foreigners watching this sad side of Rio de Janeiro. It is strange, because a person who does not live in Rio probably may think that this movie exaggerates in some aspects. However, this is our reality. Lost bullets, robberies, violence is part of our day-by-day life. By the other hand, the same person may think that life in Rio 'stinks', and again it is not true. My city, like a golden coin, has two sides: heads and tails. If you can afford, you have wonderful places to live. But unfortunately, a great part of the population lives in slums, like the ones showed in this movie. The lack of perspective in life of the children, unemployment, ridiculous salaries, lack of education, lack of the faith, all of these factors contributes for the formation of the next generation of drug dealers and bandits. The traffic offers positions to the kids, like showed in this movie. And in the end, even when the 'grown-ups' are arrested or murdered, there is a bunch of children to occupy the spot. A sad social problem, but true. My vote is ten.Title (Brazil): \"Cidade de Deus\" (\"City of God\")"},{"username":"bob the moo","userUrl":"https://www.imdb.com/user/ur1002035","reviewLink":"https://www.imdb.com/review/rw0871205","warningSpoilers":false,"date":"25 December 2003","rate":"","helpful":"8 out of 15 found this helpful.","title":"A really slick and impressive gangster movie","content":"In the slums of Rio de Janeiro is an area called the city of God. In this area children often do not make it to adulthood. Rocket is a young man looking to use photography to get himself out of the slums and away from crime. We follow his story from a child through the 60's and 70's in the slums where he is witness as children Lil' Dice and Bene grow up to become the heads of the gangs, using violence and murder to increase their power.I had missed this in the ONE art cinema in the city I live in and had to wait for the DVD to come out. It was very much worth the wait. I wanted to resist the urge to call this film `the Brazilian Goodfellas' simply because everyone else has said it - but it is a fitting description. Like that film, this is a sprawling story of crime and violence across several decades. And like Goodfellas it is violent, stylish and a great story that is engaging. The overall plot focuses on the rise of Lil' Ze and the violence around him, as seen through the eyes of Rocket.Opening with a stylishly shot standoff, the film jumps back over twenty years and begins to introduce a range of characters who come and go throughout the film to give a back story of violence and crime. The film jumps around quite a bit but it serves to build up a picture of the area and the characters involved. The violence is not gory but it is sudden and shocking - children killing children, bloody sudden deaths and so on; but it is not sensationalised but rather very depressing and down to earth.The direction is very slick and the overall production and feel of the film is one of style and imagination. The opening of a 360 pan around Rocket is an indication of the style than runs through the whole film. It even manages to have a mix of styles - fast cutting edits work best in moderation, which is exactly what this film does. The soundtrack is great and the film definitely owes a debt to Scorsese.The cast are very talented and very natural considering that few of them have any experience acting. Alexandre Rodrigues is great as Rocket even if he gets overshadowed by Leandro Limrino attention grabbing Ze (in the same way as we all remember Joe Pesci over Ray Liotta). The rest of the cast is almost perfect to a boy. Even the young children are convincing and powerful and there are no bum notes in the performances - it is very impressive but the sad thing is that I suspect that for many of them, this was not a stretch as this is really their life.Overall this is a tremendous film - easily the best of the year. It is slick and stylish but not at the expense of the story, which is a dizzy collection of characters and action. If you like Goodfellas then you will simply love this film. Hell, if you like cinema - you will like this film."},{"username":"kosmasp","userUrl":"https://www.imdb.com/user/ur5876717","reviewLink":"https://www.imdb.com/review/rw1629170","warningSpoilers":false,"date":"2 April 2007","rate":"9","helpful":"11 out of 14 found this helpful.","title":"Down and dirty","content":"This movie does not take any prisoners. Although I have not been into any \"favella\" (= ghetto) and I don't really know if the movie depicts it realistically, I do know that it is a gripping story. About kids growing up in a violent environment. Not that this movie is an action movie. It's a drama, with action scenes in it.The style and the look remind you a little bit of a documentary, just to make things scarier/real. It fully achieves it's goal. The \"actors\" (the director mostly used people who really live or lived in Brazilian ghetto) are superb too. And since the story is well written and told, there is nothing more you could wish for. Of course if watch it in it's original version and don't speak Portuguese, than you will have to read the subtitles ... but it's more than worth it (and I personally prefer it that way)"},{"username":"classicsoncall","userUrl":"https://www.imdb.com/user/ur2707735","reviewLink":"https://www.imdb.com/review/rw2490322","warningSpoilers":true,"date":"18 September 2011","rate":"8","helpful":"0 out of 2 found this helpful.","title":"\"Kill... be respected\".","content":"Notwithstanding it's reputation and viewer rating on this board, this is a tough movie to watch. It's not what I'd call an entertaining picture, and it actually takes some work to watch with it's non-linear style and the fact that it's a foreign film with characters having unfamiliar names. I actually needed paper and pen to keep track of the players using street names like Rocket, Shaggy, Li'l Ze and Carrot. But even that all takes a back seat to the sordid nature of life in a ghetto of Rio de Janeiro called Cidade de Deus, the City of God. City of Satan might be more appropriate, as the area where the story takes place is a literal hell on Earth, and life has about as much meaning as the insect you crush beneath your footstep. Most of the picture is visually jarring; watching with my family produced more than a handful of gasps as random street violence was presented as commonplace. The worst to my mind was the decision a pre-teen gang member had to make regarding which of his contemporaries he would have to kill to show loyalty to his leader. I'm just horrified that there are people in the world who actually live this way, with little to no hope of ever escaping to a less turbulent existence. For mere existence it is, with very little chance of escape, except by death which seems the the most viable way out for many of these troubled youth."},{"username":"lee_eisenberg","userUrl":"https://www.imdb.com/user/ur4888011","reviewLink":"https://www.imdb.com/review/rw1195558","warningSpoilers":false,"date":"17 October 2005","rate":"10","helpful":"4 out of 8 found this helpful.","title":"It doesn't suffice to call \"City of God\" a Brazilian \"Mean Streets\".","content":"\"Cidade de Deus\" (called \"City of God\" in English) knocks the breath out of you. This story of life in Brazilian slums makes you feel like you're in the slums with the characters. It follows Rocket (Alexandre Rodrigues) as he grows up in these places, and then joins a gang. You see, in these slums, either you join a gang or nothing ever becomes of you. So, Rocket is pulled through a world of drugs, violence, and every ugly thing that you can imagine; it's his only ticket out of complete isolation.I figure that some people would jump to call \"City of God\" a Brazilian \"Mean Streets\". Methinks that such a description doesn't suffice. This movie is far more profane, far more graphic than \"Mean Streets\" (although they both treat the same kind of subject). Of course, it's extreme, no-holds-barred portrayal of the desperation and violence of this existence is what makes this movie so good. I think that Brazilian Pres. Luiz Inacio Lula da Silva actually praised the movie for its accurate portrayal of life in the country's slums. I don't know the slums personally, but either way, prepare to have the breath knocked out of you."},{"username":"gavin6942","userUrl":"https://www.imdb.com/user/ur1234929","reviewLink":"https://www.imdb.com/review/rw1170025","warningSpoilers":false,"date":"11 September 2005","rate":"8","helpful":"1 out of 6 found this helpful.","title":"City of God, You Have Stolen My Soul!","content":"This very long movie is entirely in Portuguese (what I call the devil's language). Yet, you quickly get sucked in and no longer notice you're reading subtitles. The story is more or less that of 2 boys in the hood, one who wants to be a photographer. The other follows a very Scarface-esquire path to rise to the peak of gangsterdom. Oddly, while neither one helps the other on purpose, neither could achieve what they did without the other.IMDb currently ranks this film at 18 of all time, which seems greatly over-rated. Good movie? Yeah. Great movie? Yeah. But 18th of all time? Maybe not. Three things I really liked about this film.1. The great use of Carl Douglas' \"Kung Fu Fighting\" during a party scene. 2. The explicitness. Full nudity of men and women, little kids swearing and doing drugs - shooting people in cold blood and laughing. It is this ability to shock and stun that really makes this film great and not just a knockoff of other gangster tales. 3. The interwoven tales. Like Pulp Fiction, all the characters connect to all the others - and not always in a linear direction. This film requires a minimum of three viewings to truly appreciate it. Very high recommendation!"},{"username":"jboothmillard","userUrl":"https://www.imdb.com/user/ur4248714","reviewLink":"https://www.imdb.com/review/rw1642447","warningSpoilers":true,"date":"23 April 2007","rate":"8","helpful":"3 out of 6 found this helpful.","title":"City of God","content":"I first heard of this on a countdown show, then we watched most of it in Film Studies as part of some coursework, and ultimately I found it listed in the book 100 Movies You Must See Before You Die, so I was glad to watch the whole thing, from Oscar nominated director Fernando Meirelles (The Constant Gardener). Basically the story takes place in a slum of Rio De Janeiro, Brazil, and we see the lives of two boys as they grow up in two decades and choose two different paths in life. Zé Pequeno - 'Li'l Zé', formally knows as Dadinho - 'Li'l Dice' (Douglas Silva) as a child, grew up surrounded by and embracing crime and violence. His best friend Bené Criança - 'Benny' (Phellipe Haagensen) (Michel De Souza Gomes as a child) growing up on the good and more sane side of the law, and not trying to get involved with the activities of The Tender Trio or any other gang culture. The story of the two decades, and from his own perspective as well, is seen through the eyes and narrated by Buscapé - 'Rocket' (Alexandre Rodrigues) (Luis Otávio as a child), a young man who has the ambition to become a professional photographer, e.g. for a newspaper. The 1970's and 1980's see the crime rate and gang culture rule most of the slum city, but Rocket tries to stay away from it, only being drawn into the madness by his photography, which prove very lucrative. Also starring Matheus Nachtergaele as Sandro Cenoura - 'Carrot', Jonathan Haagensen as Cabeleira - 'Shaggy', Seu Jorge as Mané Galinha - 'Knockout Ned', Jefechander Suplino as Alicate - 'Clipper', Emerson Gomes as Barbantinho - 'Stringy' and Renato De Souza as Marreco - 'Goose'. The non-professional actors and the characters they play are all intriguing in their own ways, the story I did find difficult to follow in small moments, but overall it is like another GoodFellas style concept, where one of the characters anyway wanted to be a gangster since they were young, and it certainly has eye catching visuals of violence and torture, and it has a good dark tone style, it is a crime thriller to be seen. It was nominated the Oscars for Best Cinematography, Best Editing and Best Writing, Adapted Screenplay, it won the BAFTA for Best Editing, and it was nominated for Best Film not in the English Language, and it was nominated the Golden Globe for Best Foreign Language Film. It was number 3 on Film 4's 50 Films To See Before You Die. Very good!"},{"username":"ccthemovieman-1","userUrl":"https://www.imdb.com/user/ur4445210","reviewLink":"https://www.imdb.com/review/rw1308099","warningSpoilers":false,"date":"6 March 2006","rate":"8","helpful":"83 out of 106 found this helpful.","title":"Shocking, Stylish & Brutal Story","content":"Wow, this is one of those different movies - meaning not run-of-mill by any means - and one of those which isn't pleasant to watch but one you might find yourself mesmerized by it.This also is one of those \"based on a true story\" films which makes it even more shocking, if its mostly true. The story is of the many young (pre and early-teen) criminals inhabiting an area just outside the big city of Rio de Janeiro in Brazil. It has the feel of a documentary with real-life street kids but is upgraded considerably by fantastic camera-work, some very innovative cinematography. In other words: stylish.Make no mistake: without that stylish look, the film might be too much of a downer. The street kids are interesting but really brutal, so be prepared. I mean, how often do you see 12-year-old killers portrayed on film? The violence, language and drug use are rough in here and what a sad comment on this social problem in Brazil, a country with a huge problem with these street gangs. Overall, a very tough but fascinating film."},{"username":"ma-cortes","userUrl":"https://www.imdb.com/user/ur3270789","reviewLink":"https://www.imdb.com/review/rw0948329","warningSpoilers":false,"date":"18 October 2004","rate":"7","helpful":"5 out of 6 found this helpful.","title":"Excellent and violent film based on real events","content":"The movie deals about children and adolescent factions in the impoverished Favelas , Rio Janeiro , for 1960 and 1970 years . And it centers upon a teen who tries to leave that world by means of the photography . The final confrontation among the motley gangs for Favelas control is pretty violent and bloody . In the motion picture there are shocks , emotion , sex , violence and a little bit of social criticism . Runtime film is overlong but it's fast moving and that's why it isn't boring but it results to be enjoyable . The picture is similar other film from 1981 : ¨Pixote¨ (Hector Babenco) that was likeness in atmosphere and showing the delinquent vagrants . It's a thought-provoking and clever studio of juvenile paupers and unflinching remark at the underbelly of Rio Janeiro city , where teens and children become into burglars and assassins . The movie was not actually shot in Cidade De Deus slum as it was too dangerous ; it was shot in a neighbouring , less dangerous área . Principal actors' interpretation is outstanding , in spite of most are newcomers . All of the amateur actors were recruited from Favelas (slums) in Rio de Janeiro, and a couple of them actually lived in the Cidade de Deus (City of God) itself . Fernando Mereilles direction is awesome and stylish , he even has been hired by Hollywood to make lavish films . The motion picture had an Oscar nomination and obtained a lot of success at box office around the world . The movie is produced by Walter Salles , the best director and production manager from Brazil .The film is rated ¨R¨ for crude murders and sex and isn't apt for boys , only for old people (+18) , neither squeamish. The flick will appeal to social drama and thoughtful films lovers . Rating: 7/10. Well worth watching."},{"username":"Quinoa1984","userUrl":"https://www.imdb.com/user/ur0453068","reviewLink":"https://www.imdb.com/review/rw0871164","warningSpoilers":false,"date":"8 August 2003","rate":"10","helpful":"3 out of 5 found this helpful.","title":"a powerhouse crime saga, with a fierce, daunting fusion of style","content":"City of God played for months on end at an the Angelika theater in New York City back in 2003, and I was hesitant whether or not I should go there to spend ten dollars and to sit in a little theater with a packed audience, or to wait in video. I gave in to my temptations to see the film, from what I heard from various reviewers, and by the end, I knew it was truly worth the admission, and then some. Director Fernando Meirelles, along with co-director Katia Lund, crafts a film that steams so much with a passion to tell this story, to reveal all these characters (most of which who wear their flaws right on their sleeves like badges of honor), and to be honest with how their tales unfold, that even the most die-hard of action film or gangster connoisseur will feel the visceral, hardcore nature of the City of God long after the lights come up, subtitles and all.This true story (from a novel by Paulo Lins, former resident in the slums) is told, much like Scorsese's master-work Goodfellas, in a kind of flashback format where the narrator takes us back to the City of God when the lower class were shuffled into the slums of Rio De Janeiro without much hope. Our narrator, who only calls himself Rocket until the end, lives amongst the Tender Trio, friends of his whom start out robbing oil trucks and whatever they can get their hands on to stay alive. An impromptu heist at a motel gets the cops swarming, and the trio becomes scattered, though not dissolved. As it proceeds into the seventies, we find out that some members of the group died, a few went to jail, and Rocket stays on the sidelines, hoping to become a professional photographer with little or no assets to become one in and outside of the City of God.Then there's Li'l Dice (played through most of the film by the equally terrifying and gleeful Firmino Da Hora), who in the first act of the film is a kid who's the smallest among the bunch of older teens who make more or less successful robberies, though as Rocket says \"You need more than guts to be a good gangster, you need ideas.\" In flashback (not to spoil) we discover what went down at the motel that night, and from there in a brilliant stroke of editing we see how Li'l Dice became Li'l Ze, who rises up little by little in the drug dealing schematics of the slum and soon takes over a supplier to sell cocaine. Rocket (Alexandre Rodrigues) may be the protagonist viewers can identify with, but Li'l Ze is as fascinating an antagonist as any I have seen in a long time, who masks his insecurities with boyish joy in all of the mayhem he creates. Otherwise without hope, Li'l Ze becomes the dominant supplier in the slums, something of a tyrannical businessman, and as his story unfolds as does Knockout Ned (Seu Jorge), who becomes Ze's rival in the eighties.The only way a movie like this could work is if we feel for the characters plights and heights and such, even if they're evil in nature like Li'l Ze, Carrot, and Knockout Ned. That's why the filmmakers plunge us right into the City of God, and the nature of the city, and while the narrator may pass judgment on people he's known his whole life, he like us know why they're up to no good. The thieves and dealers and killers became such by looking up to their role models, the older hoods of the region, and with each younger group of kids who want to smoke dope and vandalize is another and another. As long as you don't get caught with your pants down by the cops, or get raided by chance, the odds for anarchy are in your favor in such a place. We understand equally why Rocket wants to get out of the city his own way as much as we understand the wars between the gangs, and this crucial facet makes the film work extraordinarily well to its advantage. Indeed, we understand the tragedies of such minor roles as the Runts- the orphans of the streets- much as we would understand the importance of such roles as in a Dickens novel.Along with this technique of storytelling, is the way it's filmed that's eye grabbing. The first scene shows in fast action a chicken chase, and then our hero between the gang and the cops viewed in a tailspin fashion as we are sent back to the beginning. Then, we get all the energy of even the simplest of scenes, and the hidden passion (Rocket on the beach with Angelica, for example) all by the mostly hand-held photography by Cesar Charlone, and the break-neck editing (i.e. the montage of how Li'l Ze makes a name for himself, or the disco dance sequence) by Daniel Rezende."},{"username":"Gordon-11","userUrl":"https://www.imdb.com/user/ur0035842","reviewLink":"https://www.imdb.com/review/rw2725327","warningSpoilers":false,"date":"26 December 2012","rate":"","helpful":"0 out of 1 found this helpful.","title":"A spine chilling film","content":"This film is about the lives of the people in the City of God, a place full of violence and lawlessness.\"City of God\" is powerful, partly through the shocking events, and also the effective story telling. There is not a moment of boredom or time filler. The events portrayed in \"City of God\" are so shocking. Lives are constantly lost due to random fights and shootouts. Lives have no value, and we only see a mourning scene once in the entire film. Towards the end of the film, I feel my spine tingling with fear and shock. I am left in bewilderment as to how people can be so ruthless and merciless. City of God seems to be a place where humanity descends to the lowest level possible. \"City of God\" leaves me entranced even after the film ended. It's really powerful."},{"username":"tedg","userUrl":"https://www.imdb.com/user/ur0643062","reviewLink":"https://www.imdb.com/review/rw0871102","warningSpoilers":true,"date":"9 March 2003","rate":"","helpful":"16 out of 26 found this helpful.","title":"The Three-Body Problem","content":"Spoilers herein.The first choice a modern filmmaker has to make is deciding who is the camera. Everything flows from that decision, inheriting already maturing visual vocabularies for each path chosen. It's very hard to be novel today: most interesting projects come from careful integration of a novel eye with a novel narrative stance - parallels, time reversals, untrusted narrators, etc. But here is something new, thanks to the creative incubator of Brazilian TeeVee commercials, one of the more vital pockets of popular art around.In this case, we have three characters: a narrator/photographer, a dancer, and a `pusher' who literally pushes the linear logic each step at a time. Each of these is represented by a camera philosophy (and accompanying editing style) which are mixed up helter-skelter. The most obvious is the notion of the `running camera' which sometimes looks at the road or away as it moves in frenzy.This is interspersed with a rhythmic camera. This camera (Benny's eye) is the one that permeated most: it is reasonable yet hedonistic. In the first few seconds, we are introduced to these two in masterful composition: the observing, recording chicken who subsequently runs with a following POV. This is mixed with the aggressive logic of rhythm. If opening shots are promises, this is a strong promise. Over time, the third eye is folded in, literally a folding of linear stories. Each is tightly linear until it hits a node, then goes off on a tangent or a new direction usually paralleling something already seen. Garrison Keiller is the master practitioner of this sort of storytelling; not chopped Clancey-style; not shuffled Tarantino-like; but direct until hitting a capricious nexus, then direct again.All three are shooters. The story is irrelevant: kids killing kids, albeit sometimes viscerally. The characters are literally disposable. The experience is nominally about the place, but it is really about how we are shown the place. I do not think this will reinvent film like a few projects have (from Welles, Tarkovsky, Greenaway, Kurosawa, even recently Luhrmann) but it is a visual adventure worth taking and a fresh experience.Ted's Evaluation -- 3 of 4: Worth watching."},{"username":"jotix100","userUrl":"https://www.imdb.com/user/ur1406078","reviewLink":"https://www.imdb.com/review/rw0871079","warningSpoilers":false,"date":"7 February 2003","rate":"8","helpful":"7 out of 10 found this helpful.","title":"The gangs of Rio","content":"Quentin Tarantino, eat your heart out! At least in this film they outshot you big time. Watching this film is difficult at times. The violence is to such a degree, the viewer has a problem seating through it.Director Fernando Meirelles has an eye for realism and detail. The most disturbing thing about City of God is the fact that the killers are children playing adult games before they can be children. It is a well known fact that these kids' gangs created terror, not only in the favelas where they lived, which was unfortunate, but they mugged, robbed and just plain terrorized the big cities in Brazil. News about street children being shot in the streets of Rio or Sao Paolo were perceived as criminal because of the ages, but one can get a clearer picture in this film by coming to the realization these same children were killing real grown ups and getting away with murder.The only problem I had with this film is with the English subtitles. Sometimes, one doesn't know who's who. To make matters worse, the principal character grows from a young boy into a photographer who looks like a small boy himself. The plots and subplots are somehow hard to follow at times. The great accomplishment for the director is that he never preaches. He shows the world what went on at that particular time. The realism is extended to the way we see in gory details the corpses of the slain gang members. If Hollywood would have presented scenes that are so hard to take as these, many would be criminals would have been able to see first hand what bullets do to human beings: they kill!"},{"username":"view_and_review","userUrl":"https://www.imdb.com/user/ur3670492","reviewLink":"https://www.imdb.com/review/rw7708034","warningSpoilers":false,"date":"31 December 2021","rate":"8","helpful":"1 out of 1 found this helpful.","title":"Mesmerizing and Sad","content":"A few years ago I read a book titled \"Never Stop Walking\" by Christina Rickardsson. It was an autobiography about her life in the favelas of Brazil before being adopted by a Swedish family and moving to Sweden. I remember being shocked to read that children killed and were killed regularly in the favelas. And even with that knowledge that still didn't quite prepare me for \"City of God.\"\"City of God\" is based upon a true story as narrated by Wilson \"Rocket\" Rodrigues (Alexandre Rodrigues) who grew up in the City of God. In the 70's the City of God came under the rule of a sociopathic gangster named Ze \"Lil' Ze\" Pequeno (Leandro Firmino). He was a vicious hood with a voracious appetite for power. The only way to get power in the underworld was by taking it. He and his right hand man, Benny (Phellipe Haagensen), took over by killing all of the bosses of the City of God save one: Carrot (Matheus Nachtergaele). Eventually, Lil Z would go after Carrot's territory and that's when things got out of hand.Rocket grew up in this environment; an environment of poverty, drugs, and violence where crime pays and honest work doesn't. Kids who should've been in elementary school were enlisting in gangs, carrying weapons, and committing robberies like we play tag.The whole of it is sad, yet you want to watch. It is a strange thing in our DNA; we crave excitement and intrigue no matter what form it takes. Even if something perturbs us, we'd rather read, watch, or listen and be perturbed than not knowing at all. \"City of God\" satisfies that itching curiosity of ours. I was watching, stunned by the conditions of the \"City of God,\" hopeful that it could turn around for them, and expectant that it wouldn't. It's a terrific movie for all the reasons I've mentioned, even if to only stir up those of us who like to think such a world doesn't exist."},{"username":"grantss","userUrl":"https://www.imdb.com/user/ur2860723","reviewLink":"https://www.imdb.com/review/rw3377574","warningSpoilers":false,"date":"22 December 2015","rate":"10","helpful":"1 out of 2 found this helpful.","title":"Brilliant","content":"Brilliant.Set in a notorious slum of Rio - Cidade de Deus / City of God - the story of a boy who sees his friends and brother grow up or aspire to be gangsters, and decides to do something else. Meanwhile we also see the power struggles in the neighbourhood, how they developed, who the main protagonists are and the state of their feud.A superb story, well told. While the story ultimately spans a few decades, there is no excess detail, and the movie never drifts or is boring. Incredibly gritty.Solid performances too.A classic."},{"username":"Boba_Fett1138","userUrl":"https://www.imdb.com/user/ur1416505","reviewLink":"https://www.imdb.com/review/rw2538401","warningSpoilers":false,"date":"27 December 2011","rate":"8","helpful":"1 out of 2 found this helpful.","title":"Not perfect but certainly close enough!","content":"For me this was not a perfect movie but it still was a very good one!For some reason this movie really gave me a sort of \"Goodfellas\" type of vibe. Both movies are of course crime movies and both movies pretty much chronicle the life of a young, wannabe(es) gangster(s). I'm not saying that movies are also the same in style and story though, since this really isn't the case. \"Cidade de Deus\" is an original movie on its own and is taking its own approach on the genre.It's a movie that on the one hand is showing how cool the life of a gangster is, while at the same time its throwing in some pretty heavy and dramatic stuff as well. Because of its sort of lighthearted approach, the more heavy scenes make an all the more greater impact. I think this is why the movie and all of emotions and drama work out so well.The movie also really doesn't picks sides or condemns anyone. It just shows things how they are and how much more easy it is to make a living as a criminal, as opposed to by going to school and try to make an honest living, in the Brazilian suburbs. It's also not trying to look for any answers or solutions, it's simply showing the craziness and hopelessness of the whole situations as it was and still mostly is at some places, not only in Brazil of course.It's a pretty raw and straightforward movie, mostly with its violence, starring also mostly young non-professionals in it, which adds to its overall realism. Also the story feels like just a couple of random pages out of the lives of some Brazilian youngsters, each trying to make it in their own way. But this at the same time is also a bit of a complaint I have about this movie. I would had preferred some more focus at times and that the movie featured a better- or at least more clear, main plot line in it. It now feels a bit like a fragmentary movie instead, also because it's following multiple different characters at the same time. Perhaps one main character, which the movie could focus solely on, would had been a better choice.But obviously it didn't bothered me all that much, since I still really 'liked' watching this film. This was also really thanks to the way it got directed. It has a great style to it, which is often fast and adds both to the craziness and realism of the movie at times. It besides also makes the movie unique and 'pleasant' to watch, since it's also giving the movie a lot of pace.So while not perfect, it still is a really great and quite effective movie!8/10 http://bobafett1138.blogspot.com/"},{"username":"TBJCSKCNRRQTreviews","userUrl":"https://www.imdb.com/user/ur2093818","reviewLink":"https://www.imdb.com/review/rw2091996","warningSpoilers":false,"date":"6 July 2009","rate":"10","helpful":"0 out of 1 found this helpful.","title":"Incredible portrayal of the environment","content":"This is an amazing look into the slums here it is of Rio de Janeiro, but I can imagine it fitting a lot of other cities around the world, as well. It's a threatening, treacherous place, where innocence can only just barely survive, if at all. There are a lot of unconventional methods in this, it could perhaps even be called an experimental film, and it all pays off. The actors are unknowns, and a number of them grew up in the neighborhood this deals with. Not a single performance is lacking, and no one is miscast, and that goes for the children, too. The cinematography and editing also contain untraditional practices, and they aid in the magnificently storytelling. This is cut to evoke the frantic, gritty, and often brutal nature of the life in the slum, and it is unbelievably effective, involving and engaging. The use of music is excellent. This has strong and frequent violence and sexuality, and the language is harsh. The DVD has a well-done, 50-minute long featurette that goes into the process of making it, a nice and funny little 60-second animation, a theatrical trailer and a music video. I recommend this warmly to anyone who watches gang-movies. 10/10"},{"username":"evanston_dad","userUrl":"https://www.imdb.com/user/ur4532636","reviewLink":"https://www.imdb.com/review/rw1069886","warningSpoilers":false,"date":"29 April 2005","rate":"10","helpful":"9 out of 15 found this helpful.","title":"Visceral and Fabulous","content":"\"City of God\" is an adrenaline jolt of a film that for once manages to find a balance between stylistics and substance. The director, Fernando Meirelles, stuffs his movie to the brim with machine-gun editing, swirling cinematography and pounding music, but while this reliance on fancy tricks has ruined other films, Meirelles is so expert at blending them seamlessly into an engrossing story that the viewer quickly accepts them as inseparable from the world of the film. He delivers a deeply emotional and human story that obviously owes much to Scorsese and Tarantino---but his movie feels completely original, never like a rip off. And underneath all of the action and plotting, there is a compelling message about about the power of art (specifically the camera) and a suggestion that, just as the pen is mightier than the sword, the camera is mightier than the gun. Can't recommend it enough.Grade: A+"},{"username":"george.schmidt","userUrl":"https://www.imdb.com/user/ur0937743","reviewLink":"https://www.imdb.com/review/rw0871098","warningSpoilers":false,"date":"5 March 2003","rate":"","helpful":"2 out of 3 found this helpful.","title":"Brazilian \"Goodfellas\"; The kids are not alright ; excellent!","content":"CITY OF GOD (2002) **** Matheus Nachtergaele, Seu Jorge, Alexandre Rodrigues, Leanro Firmino da Hora, Philippe Haagensen, Johnathan Haagensen, Douglas Silva, Roberta Rodriguez Silvia, Alice Braga . Absorbing and compelling tale of young Brazilian boys who grow into gangsters/drug dealers and other dregs of society in the ghettos of Rio de Janeiro circa the late 1960s/1970s era that focuses on one attempting to leave his dead end environs by becoming a photojournalist and for pure survival at all costs. Astonishing in its matter-of-fact violent bluntness that sends a shock to the senses to see pre-adolescents brandishing all sorts of weapons and killing for the fun of it; rampant anarchy peppered with moments of innocence. Filmmakers Katia Lund and Fernando Meirelles transcend the feel of a docudrama's trappings in their adaptation of Paulo Lin's true-life account of the mean streets of Brazil with a decidedly improvisatory screenplay adaptation by Braulio Mantovani. Kudos to the inventive cinematography by Cesar Charlone and energetic editing by Daniel Rezende that owe much to Scorsese, Tarantino, and PT Anderson for its storytelling through flashback cuts , title cards, character intros, and overall mise en scene yet has a unique, original feel altogether as well. A truly excellent piece of dramatic filmmaking."}],"errorMessage":""}