{"imDbId":"tt0407887","title":"The Departed","fullTitle":"The Departed (2006)","type":"Movie","year":"2006","items":[{"username":"MartinHafer","userUrl":"https://www.imdb.com/user/ur2467618","reviewLink":"https://www.imdb.com/review/rw2581654","warningSpoilers":true,"date":"15 March 2012","rate":"7","helpful":"29 out of 66 found this helpful.","title":"It could make a psychiatrist's head explode!","content":"I realize that \"The Departed\" won four Oscars (one for Best Picture and one for Best Director and one for writing). I know that it has a HUGE overall rating on IMDb. I know it's a very popular movie. BUT, the film simply didn't do its homework when it comes to some of the characters. And, because of this, I was not especially impressed by the film. Now before you slam my review with another NOT HELPFUL, hear me out....Had the writers cared about consistency and believability, they would have cared about the only major female character in the film. However, she was a caricature--a lady with zero believability...NONE. While it's true that films often get psychologists, psychiatrists and counselors wrong, this is among the very worst cases. While she's described as a counselor, she prescribes medications (that's illegal by the way--only an MD can do that). And, personal boundaries mean absolutely nothing to her...nothing. Here we have yet another case where a supposed professional begins sleeping with one of her patients--and one of the most screwed up ones at that! There is no reason to believe this relationship--there is no chemistry and he clearly is a mess...so she sleeps with him!! Why can't a film show a mental health worker who isn't crazy? Does some Tom Cruise write all the roles for psychotherapists in movies?! How can anyone believe her character in any way?! How does this bad writing get rewarded with all these Oscars? To me, an Oscar implies perfection...or at least near perfection...and this is not it.By the way, since I am on a tirade, I am also irritated that the main baddie is called 'Frank Costello' (Jack Nicholson). Why pick this name since the real life Costello was a HUGE figure in the underworld and bore little semblance to the guy in the film (who is more like Whitey Bulger, by the way)? What not give him some totally fictional name? Why, if he's so much like Bulger, does his fate have nothing to do with Bulger's? I don't get it.Now I am NOT saying it's a terrible film or I hate it. It's just flawed. So, despite Leonardo DiCaprio's wonderful performance and a taut script, it is a film that didn't really seem good enough to have received all these accolades."},{"username":"TheLittleSongbird","userUrl":"https://www.imdb.com/user/ur20552756","reviewLink":"https://www.imdb.com/review/rw2366511","warningSpoilers":false,"date":"9 January 2011","rate":"5","helpful":"19 out of 143 found this helpful.","title":"For me, so far, this is my least favourite Martin Scorsese movie","content":"I really tried to like this film, but it didn't completely work for me. Granted it is very well made, with stylish shots and striking locations, the music is good, Scorsese's direction is excellent(though he has directed much better than here) and Jack Nicholson does do his best work in years here. However, I never did find the movie that compelling, the film does move in a somewhat mannered manner and there are parts that are either rushed, underdeveloped or even predictable- the sex scene was laughable. Also, I think The Departed is overlong, and the ending was very underwhelming. Then there is the script, while it has been lauded for its complexity, maybe I am being harsh but I found it too complex and needlessly convoluted too. In terms of acting, it was okay but nothing exceptional Nicholson excepted. Leonardo DaCaprio plays a different role but for me it is a role that does not suit him, while I didn't see anything special in Mark Wahlberg either. Out of the cameos, Ray Winstone's comes off best, while Matt Damon is the real weak link being very blank faced and monotone throughout. Overall, not terrible but a disappointment. As far as Scorsese movies go, I would put Goodfellas, Taxi Driver and Raging Bull over this any day. 5/10 Bethany Cox"},{"username":"bkoganbing","userUrl":"https://www.imdb.com/user/ur2483625","reviewLink":"https://www.imdb.com/review/rw2170460","warningSpoilers":false,"date":"7 December 2009","rate":"10","helpful":"19 out of 25 found this helpful.","title":"Moles And Rats","content":"When The Departed finally gained for Martin Scorsese a Best Director Oscar it was felt it might have been for the work of a lifetime. It's not my favorite Scorsese film, that honor belongs to Casino for me. But it certainly was the Best Film of that year as well, rivaled in my humble opinion by Blood Diamond.Instead of an Italian atmosphere for The Departed, Scorsese decided to use the Boston Irish who are the dominant group of that city in everything including crime. The film is simple enough, the police want to take down organized crime kingpin Jack Nicholson who plays a character named Frank Costello. That was Scorsese's little joke because the real Frank Costello was one of the Mafia overlords back in the day, although his real name was an Italian one.Nicholson's character is based on Whitey Bulger who was the real life organized crime chieftain of the Boston area. He came from a really interesting family because a brother of his William Bulger had a long political career that culminated in that Bulger being elected President of the Massachusetts State Senate. I didn't add the word distinguished because scandal crept around that man all his life.Getting this man won't be easy because he has a full bag of tricks. One of them being that years ago he put a young man played by Matt Damon through the Boston Police Academy, concealing a juvenile record and Damon moved gradually up the ranks and got to work in the Boston PD Internal Affairs Division. A great spot for a mole to keep an eye on pending investigations.But the Boston PD has put one of their own undercover in the person of Leonardo DiCaprio whose family knows Nicholson from the neighborhood. At that point the whole film becomes a cat and mouse game on both sides with each having their informants on the other side. There are no dummies on either side, the police aren't keystone cops and the criminals as shrewd and brutal as they come. Scorsese probably had a lot of help in having both Matt Damon and Mark Wahlberg in the cast. Both of these players are well known for their Boston roots and they fit really well into their parts. Mark Wahlberg for his role as one of the task force trying to take Nicholson down got an Oscar nomination for Best Supporting Actor. He lost to Alan Arkin for Little Miss Sunshine. Wahlberg was the only one who came up short at Oscar time. The Departed won additional Oscars for Best Adapted Screenplay and Best Film Editing to go with the Best Picture And Best Director Oscars for Scorsese. Leonardo DiCaprio had a career year, he might have been nominated himself if he wasn't up for Best Actor in Blood Diamond.The real Whitey Bulger is 80 years old now and in real life he was as full of tricks as Nicholson's character is in the film. If you think you know how this film ends, I guarantee you will be wrong. Nicholson's character has survived in many ways, that's all I can say.Scorsese has a nice feel for Boston's atmosphere, as good as what he had for Goodfellas in New York and Casino in Las Vegas. He assembled a great cast of people who all got a crack at working with one of the best film directors of all time. The cast didn't let Martin down at Oscar time and they won't let you down when you see it on the big screen or the small."},{"username":"Leofwine_draca","userUrl":"https://www.imdb.com/user/ur0482513","reviewLink":"https://www.imdb.com/review/rw3490372","warningSpoilers":true,"date":"19 June 2016","rate":"10","helpful":"17 out of 22 found this helpful.","title":"One of Scorsese's very best movies","content":"Martin Scorsese returns to familiar territory with this story of the lives of cops and gangsters living in America. However, a few things are different this time around – it's Irish gangsters rather than Italian, and for the first time in his life, Scorsese is shooting a remake, of the Hong Kong film INFERNAL AFFAIRS. I haven't yet watched the original film but I'm pleased to say that THE DEPARTED is an example of the director at the top of his game and I'm completely satisfied that he finally won his best director Oscar for his efforts here.To say too much would be to spoil the experience. Cinematography is spot on and the ensemble cast fantastic – headlined by DiCaprio, playing it on the edge as the undercover cop, and Damon as the hateful cool cucumber, a con on the inside. Jack Nicholson plays it OVER the edge as a past-his-prime gangster; gradually losing his marbles in a world of violence, while Ray Winstone's heavy is another weighty performance from this underrated star. Kudos to newcomer Vera Farmiga for holding her own among the established talent and Martin Sheen for taking a small role and running away with it. Mark Wahlberg also deserves mention for his Oscar-nominated supporting role as a foul-mouthed cop, the best of his career.The plot twists and turns and is chock-full of Scorsese's trademark violence, with bloody shootings and beatings taking place throughout. The story is complex, forcing the viewer to give the film their full attention, so the 2 ½ hours just fly by as you're watching it. Things culminate in what I think is a very effective, brutal, shocking, sudden climax, which some people have criticised as being too rushed and too violent, but which I think is perfectly realistic, an example of how a house of cards can come tumbling down so suddenly. A perfect ending to a perfect film – and a must for all fans of twisty thrillers and gangster flicks."},{"username":"Michael_Elliott","userUrl":"https://www.imdb.com/user/ur13134536","reviewLink":"https://www.imdb.com/review/rw1830762","warningSpoilers":false,"date":"29 February 2008","rate":"","helpful":"11 out of 27 found this helpful.","title":"Masterpiece","content":"Departed, The (2006) **** (out of 4) I went and saw Martin Scorsese's latest film today and afterwards one thing jumped into my mind and that was the word masterpiece. From the time I first got on the internet I've always told people they shouldn't label a film a masterpiece for at least 10-15 years so you could see how a film would sink into you. However, I guess I'm going to have to break my own rule because I thought this film was absolutely flawless and it's certainly the greatest thing I've seen in a very long time. I had a top ten of this decade but this here jumps right at #1. I was a major fan of Scorsese's previous two films but this one here is vintage Scorsese. I really feel sorry for those who have to pick Oscar winners because this film is full of possible nominees.DiCaprio once again turns in a super performance and Matt Damon gives the best performance I've ever seen from him. Jack Nicholson is someone you can always expect greatness from and he delivers here again but it was great seeing a great performance from him outside of a romantic comedy. As with Scorsese, this legendary teaming has Nicholson doing vintage work. I'm sure Nicholson will get a Supporting Actor nod but you could also throw in Damon, Mark Wahlberg, Adam Baldwin and even Martin Sheen. In most Hollywood films the movie would spend too much time with Damon and DiCaprio but I thought it was a brilliant move to make this thing more of an epic and give all sorts of character detail to the supporting players. Sheen really shines the most and I'd probably give him a nod before Nicholson.I haven't seen the film this is based on so I'm not sure how much is the same or how much is different but I felt Scorsese grabbed you from the very start with Nicholson's narration cut to a beautiful camera shot and then, of course, The Stone's Gimme Shelter. Seeing the rise of Damon's character through the division was something else that really worked and I personally feel the film could have told more of his story at the start. When the two eventually get undercover I thought Scorsese showed his master's touch again. Most Hollywood films would have just set up several bang-bang scenes but this one here carried the suspense throughout. Little by little plot developments would occur and little by little Scorsese would build the suspense. I was a little worried about the 150-minute running time but the way everything was moving this here could have been doubled in length and still worked just as good.No spoilers here but I thought the ending was brilliantly played out. I can't remember the last time I watched a movie and thought it was over only to be hit upside the head with a complete and utter shock where I was asking myself if something really happened."},{"username":"SnoopyStyle","userUrl":"https://www.imdb.com/user/ur2898520","reviewLink":"https://www.imdb.com/review/rw3193866","warningSpoilers":false,"date":"1 March 2015","rate":"8","helpful":"8 out of 12 found this helpful.","title":"Scorsese's Boston gangster opera","content":"Frank Costello (Jack Nicholson) is a Boston Irish mobster. He mentors Colin Sullivan (Matt Damon) ever since as a little kid. Eventually Colin joins the Special Investigation Unit in the State Police headed by Captain Queenan (Martin Sheen) and the unpleasant Staff Sergeant Dignam (Mark Wahlberg). He works directly under Captain Ellerby (Alec Baldwin). He begins a relationship with police psychiatrist Madolyn Madden (Vera Farmiga). Billy Costigan (Leonardo DiCaprio) is a new police recruit from a family of lowlife criminals. Queenan and Dignam put him undercover. After serving some time in prison, he works with his petty criminal cousin Sean (Kevin Corrigan) and catches the eye of Sullivan's henchman Mr. French (Ray Winstone).Director Martin Scorsese goes to Boston to film this gangster opera. The cast is second to none. There is great acting being done here. Leo is terrific holding up even against the peacock acting of Nicholson. Winstone is powerfully rough. Damon is twisting his sweet persona into something a bit more of a douche. There is a bit too much plot and sometimes, the movie tries to do too many things. For example, Scorsese doesn't need some of the camera moves or the back and forth editing which only distracts from staying with the plot. It may work even better with a simplified style. This movie is best at its bloody brutal core especially with Leo acting up a storm."},{"username":"Hitchcoc","userUrl":"https://www.imdb.com/user/ur0278527","reviewLink":"https://www.imdb.com/review/rw2183948","warningSpoilers":false,"date":"1 January 2010","rate":"9","helpful":"10 out of 13 found this helpful.","title":"Whom Do You Trust?","content":"Wow, this was exhausting. We have a cast of characters, each of which has a dangerous side. They are woven into a complex network of crime and honor. Some are spies; some are mobsters; some are weak; and some are strong. The one thing that fills the screen is no one knows when it's coming. There is so much danger out there and it could be around any corner. The performances are great, particular by Jack Nicholson and Mark Walberg. These are a couple of crazies who seem to enjoy the most insane, continuous process of interaction among crooks and police. They are suspicious and ruthless and absolutely great. The down side is having a hell of a lot of sympathy for anyone. Leonardo DeCaprio's character is probably the most sympathetic but we know the fine line he is walking and that disturbs us. There is so much graphic violence and disrespect for humanity that it's at times hard to like it. Still, it never stops, right up to it's dramatic finish."},{"username":"Kirpianuscus","userUrl":"https://www.imdb.com/user/ur61197531","reviewLink":"https://www.imdb.com/review/rw3610150","warningSpoilers":true,"date":"31 December 2016","rate":"","helpful":"2 out of 6 found this helpful.","title":"Scorsese mark","content":"a great work. without any explanation. because all is simple - the style, the theme, the tension, the force of story, the pressure of image are present. the old Scorsese is at duty. and this does The Departed an event. because all seems be perfect. first - the cast. then - the hunt and its risks. the ambiguity, the impressive details, the feeling to see a film who escapes from every genre for becoming a simple story about duty, risks, lies and the build of truth. a powerful film who seduce for the architecture of each scene. in essence, the meet with the art of an unique director. and one of the most surprising/ambiguous ends. this is it The Departed."},{"username":"Horst_In_Translation","userUrl":"https://www.imdb.com/user/ur3914439","reviewLink":"https://www.imdb.com/review/rw5382205","warningSpoilers":true,"date":"4 January 2020","rate":"8","helpful":"7 out of 10 found this helpful.","title":"A film that only gets better with each viewing","content":"\"The Departed\" is an American 2.5-hour live action movie and one of the biggest hits from the unique career of director Martin Scorsese, also because it won (him) Best Director and Best Picture at the Oscars. This film is from 2006, so almost 15 years old now and another Oscar that it won was for Best Screenplay and that one went to William Monahan, although the original is of course a Korean movie from a few years earlier or actually several Korean movies as this one here is just an adaptation, but the kind where most people would say it is superior to the original or where most people do not even know there is an original. Anyway, the only Oscar it did not win from its nominations was for Best Supporting Actor, but that was no surprise at all because Wahlberg being nominated over Nicholson (and DiCaprio) surely came as a bit of a surprise, even if he was nominated for a Golden Globe too. I mean I don't mind Marky Mark, but he definitely was not the best supporting player from the bunch here. I guess he surely profited a lot from the fact that he was basically the only bigger character who survived the movie in the end. He may have lost his job, but he did not lose his life and actually the last scene is just really memorable when he shows up at the central character's home and kills him because otherwise the bad guy would have gotten away with it. So he makes somewhat sure we get a happy ending if you can say so. Speaking of lead actors, I am also not sure if you can really call DiCaprio's turn a supporting performance like the SAG Awards did (unlike the Globes and BAFTAs), but maybe it was this category confusion that cost him the Oscar nomination eventually. He would have deserved it, more than for \"Once Upon a Time... in Hollywood\". In my opinion, he may not have been a lead as big as Damon, but surely a lead nonetheless. Also it really surprises me that Damon received no awards recognition whatsoever from the big awards bodies. He would have deserved it as well. But yeah, Scorsese-DiCaprio is just something that has worked so well for so long, so no surprise this is maybe what is more on people's minds. And of course, Di Caprio and Marty deserved all the accolades they got for this film.Now at its core, there are sub-plots that includes other genres (like romance), but at the very center this film is nothing but a crime drama / crime thriller. We follow two men who are in disguise. Damon's character is loyal to a local crime lord, but still has a successful career with the police force. DiCaprio's character struggles with his family background when trying to become a police officer, so he goes undercover to help bring justice to said crime lord. The result is a constant back and forth in terms of loyalty, life-threatening situations and graphic violence. But it works really well. Nothing feels for the sake of it and especially in the last half hour the film gains incredible steam. Of course this also has a lot to do with the marvellous cast. I already mentioned many names of actors you find in here and there are several others like Vera Farmiga and Martin Sheen for example. Also the rather young Anthony Anderson is one many will recognize thanks to his recent success and I personally was happy as always to see J. C. McKenzie in here, even if it was just one scene, because I love him on Dark Angel my favorite television show and he seems to work with Scorsese a lot. Anyway, speaking of Sheen, when his character dies, things get really steamy and everything escalates quickly.There are so many minor references that are really smart like the little letter with the background information about the criminals and how DiCaprio's character realizes towards the end that it is Damon's character he had been chasing that night. Or also the pregnancy reference: I still think it was not Damon's character's child, but yeah we will never find out. Still it's interesting how Farmiga makes on one occasion early on a statement about Damon's character's abilities in bed that also made me think so, but who knows. Another thing I liked about the film was the music. Not just the soundtrack, but there are also some really good songs used in here, one by The Rolling Stones, one by Pink Floyd and one by Badfinger. Also the music we hear at the very end when we see the rat at the window was the perfect way to close the film. Speaking of rats, this film is packed with references that are of course meant in a way where both sides are trying to figure out who is the one they can't trust in their team. I will not get into detail about all the rat references as you will recognize these yourself when you see them, so let me just say that my favorite is when we have Jack Nicholson giving us a face expression of a rat when he impersonates this animal. That was so funny.Nicholson in general did great and even if apparently he is retired now in his 80s I am truly happy he left us so many awesome films like this one here. I mean it's not a perfect movie and not even his approach and character works all the time like with the scene when he randomly starts singing a song that did nothing for me, but apart from that he still gave a really memorable supporting turn here and I believe he would have deserved the Oscar nomination. Not sure about the win, but the nomination definitely. Oh well, it's alright. Not being nominated does not make his portrayal any worse. Also around the age of 70, he still could be extremely scary like that scene when he violently takes care of DiCaprio's character's injured hand was pretty tough to watch. And on another occasion we see him say something pretty sadistic when he just killed two people and later on we see how he leaves a room where he just took care really violently of an enemy it seems. By the way, speaking of Nicholson's character, it came to my mind during this movie immediately how Di Caprio played a character in Gangs of New York that was sucking up to his arch enemy and (even without personal revenge motivation) this is also true for this film. I mean acting next to Day-Lewis and Nicholson back then, not too shabby.Okay let me think what else can I say about this movie. Oh yeah, Alec Baldwin is also in it and he survives the film too, but his character is not that major and I am not a big fan of him (anymore) either. Still he was somewhat fun in his scenes when he got physical towards a colleague who screwed up and also during his final scene with Wahlberg. It kinda felt to me that they just used some of the really exaggerated rage the actor keeps displaying in real life for his character here. And the ending wow, I already mentioned it and that sure came unexpected to see Wahlberg's character like that and what Damon's character says exactly knowing he's done. Then again, a lot in this film came unexpected, also the way DiCaprio's character is killed from one second to the next and how Damon's character is really such a gifted schemer to put everything in place for him to look good and get out of this gigantic mess unharmed. He kills another undercover guy, he kills his mentor even (even if he hesitates). And the good thing is, maybe the best thing about the entire film, how well everything works and how realistic it feels nonetheless, even if it is unexpected. A prime example of awesome screenplay penning. I am glad it won many Oscars, but this one in particular. I would not say it is my favorite film from 2006, but certainly one of the best I have seen from that year and like I said in the title of my review: Even if you know all that is happening because you have seen this film already 2 or 3 or even 4 times, it is still worth seeing once more because it is that good that you maybe always discover something new and never get bored. These 150 minutes flew by so quickly. I could easily write another three paragraphs about this film if my memory was completely fresh and I watched it two hours ago and not two days, but I'll leave it at that. There is only one thing anyway that is crucial for you when reading this review and that is that I think you totally need to watch this film because it is absolutely sublime. Unless you haven't already, or well watch it once more then. Big thumbs-up."},{"username":"claudio_carvalho","userUrl":"https://www.imdb.com/user/ur2488512","reviewLink":"https://www.imdb.com/review/rw1610867","warningSpoilers":false,"date":"3 March 2007","rate":"7","helpful":"14 out of 51 found this helpful.","title":"Oscar Nominated and Winner? Another Shameful Joke of Hollywood","content":"Two just-graduated officers from Massachusetts Police Academy follow opposite sides of the law: William Costigan (Leonardo DiCaprio) is assigned to work undercover with the Irish mobster Frank Costello (Jack Nicholson) to get evidences to arrest him. His true identity is only known by his superiors Dignam (Mark Wahlberg) and Oliver Queenan (Martin Sheen). The protégée of Costello, Colin Sullivan (Matt Damon), is promoted in the Boston Police Force and is the informer of Costello. Each police officer gives his best effort trying to disclose the identity of the other \"rat\".\"The Departed\" is a good movie, with a great cast, but never deserved to be nominated to the Oscar. There are dozens of better movies, and even \"Donnie Brasco\" is better and better. The exaggerated and absurd story and situations have no credibility; some dialogs are simply ridiculous; shows prejudice against the Catholic Church with free aggression; the romance between William and the incompetent psychiatrist is senseless; and the character of Jack Nicholson is full of clichés and awful lines. A guy with such stupid attitudes could never be a powerful boss. Now I understand why Martin Scorsese asked to double check whether his name really was in the envelope of the Oscar. He probably knew that this movie could never be an Oscar winner, and he was afraid that it could be a joke. Actually it was another shameful joke of Hollywood. My vote is seven.Title (Brazil): \"Os Infiltrados\" (\"The Infiltrated\")"},{"username":"bob the moo","userUrl":"https://www.imdb.com/user/ur1002035","reviewLink":"https://www.imdb.com/review/rw1516492","warningSpoilers":false,"date":"7 November 2006","rate":"","helpful":"41 out of 66 found this helpful.","title":"Enjoyable thriller but there are failings and missed targets across the running time","content":"The war between the police and the organised crime in Boston has reached new heights. Both Oliver Queenan and target #1 Frank Costello have placed a mole into each other's organisations. Billy Costigan is selected to infiltrate Costello's ranks thanks to a family background of criminals and working men, meanwhile Colin Sullivan has been groomed since youth to come up inside the ranks of the BPD. As Costigan makes progress it becomes clear to his police superiors that they too have a rat feeding information outwards. With only Frank knowing Sullivan's identity and Queenan and Dignam knowing Costigan's, a race begins with the first one to expose the other winning.Having enjoyed the original film, I was quite looking forward to this film and not really worried that Hollywood would mess it up. In a way it does deliver but it is hard to ignore the problems and failings in the film and if I didn't realise how IMDb put together their top 250 list, I would be amazed that the film is running so high up it. The original was a tight cop thriller which I remember thinking owed much to American cinema in style and tone, so surely America can only do it better? Well, if not better then this is certainly bigger, with stars oozing out of every pore, a big director and a long running time. In regards the latter, the film should be commended for moving slickly through the 150 minutes and not feeling as long as it is. The fact that it is cool, engaging and quite exciting will be enough for most audiences and indeed the sheer volume of positive votes on this site shows it has struck something of a chord, but this is not to say it is a classic and those putting it alongside Goodfellas are simply out of their trees.The script here tries to give more room for growth to the characters, to explore their feelings outside of the tension and fear of their situation. Unfortunately this produces many scenes that are a bit dull and unconvincing as they attempt to deepen the material. Specifically I am talking about the thread involving the girlfriend, her scenes add little and the dialogue in the session scenes is obvious and, as a Sopranos viewer, I was surprised by this. A secondary downside of this (although not totally to blame) is that it is not as gripping and claustrophobic as I would have liked. Yes it is thrilling at times but I wanted it to be consistent like a real cat'n'mouse game with the noose tightening palatably around each character's neck as they raced to hang the other first. The ending is also a little less effective than it should be because, added to the original's strong ending is an extra scene that doesn't have a strong foundation and is not as good as it should have been.Ironically for such a starry affair, some of the performances are a bit weak, and I'm thinking specifically of Damon. He never seems like the flipped version of Costigan and I never really got the feeling of him being trapped, panicked and hunted in the same way as his opposite number was. Conversely then DiCaprio is pretty strong and is convincing as he loses himself into Costello's gang of murderers. He works well alongside a scene-stealing Nicholson. At times he threatens to completely tip over into ham but for the most part he is just larger than life and provides a lot of energy to the film. This energy is harnessed well by director Scorsese who directs with this usual eye for a setup and also an enjoyable soundtrack. The use of sudden stops in the music and quick cuts is perhaps a bit much to get used to but it is strangely effective. The support cast is impressive in depth but they are not all that well used. Walhberg has all the best lines but it seems like he has wandered in from another movie at times and, funny as he was, he is never the developed and involved character that he needed to be for the way the narrative required. Baldwin is the same although he is more restrained and fits better, while Sheen is a nice touch of class. The woman playing the girlfriend is as weak as her material and although she did have an important part in the story, she adds very little beyond the writing on the page.Overall though, this is a strong and professional film and it is a shame that it isn't as good as I wanted. The attempts to paint detailed and complex characters makes it interesting but not as convincing as it needed to be \u0096 with Damon in particular left out there with little to work with in comparison to DiCaprio. The moments of slick tension and action are very good though and the only downside was that it made me wish for more of the same and that Scorsese had focused on keeping it tight and taut in the same way that the superior original had."},{"username":"kosmasp","userUrl":"https://www.imdb.com/user/ur5876717","reviewLink":"https://www.imdb.com/review/rw1652562","warningSpoilers":false,"date":"9 May 2007","rate":"7","helpful":"7 out of 11 found this helpful.","title":"Scorsese did a good job remaking an awesome movie","content":"Most of the people who went to see the Departed, didn't know anything about the movie \"Infernal Affairs\". A great Chinese movie (part one of a trilogy), that left viewers yearning for more cop thrillers like these. Although no one actually thought of an US Remake. But if you make an American version, at least use a great director. Which they did, with Scorsese.The story isn't exactly copied from the Chinese Original, but you get many high points from the Original. And some shock moments, might not shock you as much as they did with people, who haven't seen the Original. Some roles are also changed here. And here comes a funny fact (it might be written here on IMDb somewhere), that of one Jack Nicholson, who changed his role and the script as they went along with the filming. And even if his co-stars didn't mind (at least they didn't say otherwise), Ballhaus (cinematographer, DP) wasn't amused! And it seems as if this incident (like changing the whole set-up for a scene, just for Nicholson and lighting kind of everything, just to be sure to have Jack's spontaneous outbursts on film) causes Ballhaus considering, not working with Scorsese anymore.But that's just behind the scenes. What matters is the result on screen. And that is good enough to watch. After reading the Oscar nominations, one could feel, that it might be Scorsese time. And although it's not his best film he ever made, Scorsese was overdue for an Academy Award!. I haven't said anything about the movie's plot, because I think you should watch the Original for the full impact ... but only if you're not afraid or have prejudices against Chinese movies!"},{"username":"classicsoncall","userUrl":"https://www.imdb.com/user/ur2707735","reviewLink":"https://www.imdb.com/review/rw2747089","warningSpoilers":true,"date":"2 February 2013","rate":"9","helpful":"3 out of 4 found this helpful.","title":"\"Heaven holds the faithful departed.\"","content":"With it's inventive twists and clever writing, I found \"The Departed\" to be an exceptional gangster film, with a couple of undercover rats (Matt Damon and Leonardo DiCaprio) working against each other on opposite sides of the law. For films like this I find it helpful to keep a scorecard, because after a while things start to get a little confusing regarding alliances, and every new revelation becomes a 'whoa' moment. Like learning that Irish Mafia chieftain Frank Costello (Jack Nicholson) is working the other side of the tracks as an FBI informant. And speaking of rats and Nicholson, did you get a load of that rodent impersonation he did? That was so priceless I had to do a couple of quick re-winds just to catch it more than once. It was one of those Nicholson 'Here's Johnny' moments that just cracked me up when I saw it.Storywise, I'm not naive enough to think this one was entirely credible; I happen to agree with other reviewers who call into question Billy's (DiCaprio) light speed infiltration of Costello's mob and the less than professional conduct of counselor Madolyn (Vera Farmiga) when she conducts an affair with Billy. But those are minor points I'm willing to overlook in the bigger picture. What I was more intrigued by were the double crosses throughout the story and nuances like the cat and mouse text messaging that clued Colin Sullivan (Damon) that Costello's gang had an informer on the inside. Very slick.Anyway, I like a good gangster flick and the characters and portrayals here are top notch. I especially liked Nicholson even if he didn't make it to the end of the picture. The finish will drop your jaw not once, not twice, but three times with it's unexpected turns, and will make you retrace your steps to reassemble the characters and their alliances. I thought it was very well done."},{"username":"lee_eisenberg","userUrl":"https://www.imdb.com/user/ur4888011","reviewLink":"https://www.imdb.com/review/rw1606246","warningSpoilers":false,"date":"24 February 2007","rate":"10","helpful":"6 out of 14 found this helpful.","title":"This time, they gotta give Martin Scorsese an Oscar.","content":"The 79th Annual Academy Awards will run tomorrow night, and \"The Departed\" is one of the Best Picture nominees. All that I can say is that they have to award Martin Scorsese this time. \"The Departed\" hits you like I have almost never seen in a movie. It is an absolutely great movie in terms of the acting.First, we get narration from aging mafioso Frank Costello (Jack Nicholson). He's been pragmatic about many things throughout his life, but he's never given up his life of crime and being one of the nastiest people whom you could imagine. Then, there's Billy Costigan (Leonardo DiCaprio), joining Boston's police force but secretly infiltrating the mafia. Next, there's Colin Sullivan (Matt Damon), one of Costello's acolytes secretly infiltrating the police. Add psychologist Madolyn (Vera Farmiga) to the mix, and you have a practically explosive situation.One thing that you should understand about this movie is that almost every character is a total creep and there are basically no good guys; Dignam (Mark Wahlberg) is particularly bad. With all these characters being so vile, it is no surprise that we see violence and brutality that movies almost never show. It's the sort of stuff that makes you feel like the characters are pounding your face in. Don't be surprised if you walk away from \"The Departed\" feeling very shaken up. And you'll probably never want to be a cop after watching this.Anyway, I say that even if they don't give the movie Best Picture, they gotta give Martin Scorsese a Best Director Oscar. His direction is top notch (as is almost every other aspect of the movie). I wholeheartedly recommend it. Also starring Martin Sheen, Alec Baldwin and Kevin Corrigan."},{"username":"gavin6942","userUrl":"https://www.imdb.com/user/ur1234929","reviewLink":"https://www.imdb.com/review/rw1501850","warningSpoilers":false,"date":"20 October 2006","rate":"9","helpful":"5 out of 11 found this helpful.","title":"Without a Doubt, The Movie of the Year in 2006","content":"I saw The Departed last night, and already expecting a great movie I got even more: the BEST movie. I officially declare this the best movie of 2006, without a doubt.Jack Nicholson plays an Irish mafia boss, who is hunted by a rat in his mob. He also has a gang member who is a rat in the police department. The two rats do not know about each others' double identities. With Matt Damon, Leo DiCaprio, Alec Baldwin, Martin Sheen, Mark Wahlberg and more...What is great is not just the great double embedded story, but the way the two chase each other without knowing who to target. And the acting is phenomenal.Jack Nicholson returns as a villain and is the most evil and ruthless he's ever been (compare to \"Batman\" or \"The Shining\"). DiCaprio is intense, and delivers some of the best fight scenes captured on film. You will believe assault can be an art form. Matt Damon is in top form. Wahlberg is the most Irish you'll ever see him. And Martin Sheen is the father figure he obviously wasn't in real life.I want to pay special attention to the music. Twice, they use the Dropkick Murphys' cover of Woody Guthrie's \"I'm Shipping Off to Boston\". Once when Leo goes to jail and again later when the mafia marches into battle. This tune is loud, intense and violent... pure perfection. Scorsese could have just used incidental music, but he knows when to get a modern rock song and this was one of those times.Go see this movie and love every minute of it, just like I did."},{"username":"jboothmillard","userUrl":"https://www.imdb.com/user/ur4248714","reviewLink":"https://www.imdb.com/review/rw1616170","warningSpoilers":true,"date":"12 March 2007","rate":"7","helpful":"0 out of 28 found this helpful.","title":"The Departed","content":"I always wondered when Martin Scorsese was going to win an Oscar for Best Director, after 6 nominations, and he deserved to win for this inventive crime drama thriller. Basically years ago, Irish mobster Frank Costello (BAFTA and Golden Globe nominated Jack Nicholson) got Colin Sullivan to go through the many courses to become a professional cop, and now grown up, Colin (Matt Damon) has everyone's trust, but what they do not know is that is in fact keeping an eye out for any police activity that could come to an arrest. The police decide to get young undercover cop Billy Costigan (BAFTA and Golden Globe nominated Leonardo DiCaprio, Oscar nominated the same year for Blood Diamond) to get into Frank's gang, earn his trust, and hope to get evidence of his guilt, and crimes. It is when word gets out about two rats, in Frank's gang and the police that trouble brews for both groups. Also starring Oscar and Golden Globe nominated Mark Wahlberg as Dignam, Martin Sheen as Captain Queenan, Ray Winstone as Mr. French, Vera Farmiga as Madolyn, Scary Movie 3 & 4's Anthony Anderson as Brown and Alec Baldwin as Ellerby. I really like the idea of two rats in both groups, and the concluding scenes are the personal highlights. It won the Oscars for Best Editing, Best Motion Picture of the Year and Best Writing, Adapted Screenplay, it was nominated the BAFTAs for Best Editing, Best Adapted Screenplay, the David Lean Award for Direction and Best Film, and it won the Golden Globe for Best Director, and it was nominated for Best Motion Picture - Drama and Best Screenplay. Leonardo DiCaprio was number 94, and Jack Nicholson on The 100 Greatest Movie Stars, he was number 63 on The 100 Greatest Sex Symbols, and he was number 7 on The World's Greatest Actor, and Ray Winstone was number 32 on The 50 Greatest British Actors. Very good!"},{"username":"rmax304823","userUrl":"https://www.imdb.com/user/ur0819382","reviewLink":"https://www.imdb.com/review/rw1662379","warningSpoilers":true,"date":"26 May 2007","rate":"7","helpful":"4 out of 8 found this helpful.","title":"Pulls you in.","content":"\"The Departed,\" a complicated story of two cops undercover on each side of the law, one of them in the pay of head Irish mafioso, Jack Nicholson, has Martin Scorsese's usual dash. It would be hard to mistake the film as having been made by some unimaginative dullard. The camera swoops grandly about, punctuated by the odd overhead shot, the actors perform at their peaks, intrigue informs every act, the violence occurs as necessary and isn't exulted over. Scorcese knows what he's doing.I'm not sure, though, that he's able to get inside this loosely organized bunch of non-Latin thugs, or inside the justice system of Boston. This is a kind of tense story that really belongs in Sidney Lumet territory -- marginalized spies with multiple identities, and lots of frustration. Neither of the spies (Leonardo DiCaprio, the good spy, and Matt Damon, the boyishly charming instrument of Nicholson) manages to show any guilt or ambivalence about their jobs, which leaves the film with a considerable psychological and ethical lacuna. Damon is full of zest and worried about nothing but keeping his gangster boss informed of everything the cops are up to. DeCaprio is a neural shambles but not because he feels queasy about being a spy among people he's come to know. He's just frazzled over the possibility of being outed and killed. Still, everything rolls along so quickly that we hardly miss it. And everything is aided magisterially by the quick-witted dialog. Alec Baldwin, head honcho at the State Troopers asks Damon what happened to a suspected murderer. Damon: \"He got knifed in the hawspital.\" Baldwin: \"Yeah, but what I want to know is cui bono? Who benefits?\" Damon: \"Cui gives a ****? It's all wrapped up with a bow on it.\" Baldwin blesses Damon, making the sign of the cross in the air, says, \"I think you are on your way to becoming a cawp,\" and buries his face in a bowl of ice water. We have just witnessed about fifteen seconds of cinematic delight.Any weaknesses are not Scorsese's fault, though. Here he's working from a screenplay written by an Irish-American who's given him what amounts to an unusually mechanical plot, and the story itself is lifted from a Chinese source. So it's already gone through three step-up transducers and it's no surprise that it lacks the emotional grip of Scorsese's best work.It's still successful and it gets a lot of help from the cast. Nicholson is hilariously evil with his goatee and those of his improvisations that have been preserved. (When he shoots a babe in the back of the head, he looks down at her body quizzically and remarks, \"She fell funny.\" And, \"When there's a cop in my gang and I don't know who it is, I usually kill 'em all.\") Matt Damon does a fine job too, and he has his Boston accent down pat. He's so business-like and full of zest as a sergeant in the State Police that he comes across as the kind of cop we all wish were on the job. I haven't seen that much of Leonardo DiCaprio's movies but of the performances I've seen, this is his best. He's rather rattier looking than in the past and he demonstrates a convincing loss of control. There's a woman, too, who physically links the good and the bad undercover cops, who do not know each other. Vera Farmiga isn't synapse-fusingly gorgeous. The bony structure of her face is askew. She looks like a dozen actresses who might be found laboring in the fields of afternoon romantic dramas or support in modest situation comedies, but there's something still that distinguishes her from so many other women who resemble Jennifer Aniston. She can really act. She's not given the best dialog and her character is a little confusingly written but, boy, she can make a simple movement of her hand into a statement. Also she's built. Imagine Cate Blanchett, more petite and slightly lopsided. Ken Wahlberg, as Sergeant Dignam, may give the best performance of all.I enjoyed it. Maybe not immensely, but enough to have found a good deal of pleasure in it."},{"username":"ccthemovieman-1","userUrl":"https://www.imdb.com/user/ur4445210","reviewLink":"https://www.imdb.com/review/rw1604785","warningSpoilers":false,"date":"22 February 2007","rate":"6","helpful":"23 out of 46 found this helpful.","title":"The Good & Bad Of 'The Departed'","content":"THE GOOD - A big collection of well-known male actors headed by veteran Jack Nicholson give standout performances. Leonardo DiCaprio and Matt Damon play guys who are both working both sides of the fence and the big suspense revolves around their characters and if will be found out. Martin Sheen, Mark Wahlberg, ---- (the only female with many lines), Alec Baldwin, and Ray Winstone give superb support. My favorite was Winstone, a guy I'm familiar with from \"Sexy Beast\" and \"The Proposition.\" Despite the length of this movie, it keeps your interest all the way. I never got more bored... BUT....THE BAD - ....I did get tired of all the f-words. Usually I could care less about that, but over 250 of them? Sometimes it seemed like every sentence. It was ludicrous and after awhile, your senses seemed bombarded with it, such as too much action can numb you. It just wasn't necessary to have it said THAT many times, and by practically everybody in the film. That's my other main complaint: every character in here is a scumbag: an untrustworthy person who will sleep with anyone and lie to everyone. Baldwin's character, as an FBI director, was the most ridiculous of them all. Both of these faults are typical for a Martin Scorcese film. He's pathetic. Sorry, Marty, but not every person in the world is a low-life as you must be. OVERALL - Nonethelss, to be fair, his movies - like this one - are usually interesting, just the sordid stuff done to excess. If you can put up with the latter, you'll like this film a lot."},{"username":"Tweekums","userUrl":"https://www.imdb.com/user/ur13977076","reviewLink":"https://www.imdb.com/review/rw3499639","warningSpoilers":true,"date":"6 July 2016","rate":"9","helpful":"4 out of 6 found this helpful.","title":"An impressive remake of the Hong Kong film trilogy 'Infernal Affairs'","content":"Set in Boston this film follows two men who go deep undercover; a rookie Massachusetts State Trooper, Billy Costigan, who is placed within Francis \"Frank\" Costello's Irish mob and Colin Sullivan, a member of Costello's organisation who entered the State Police so he could feed information back to Costello. Neither man knows the other's identity but they both know that there are moles and that they could be exposed at any time. As time passes Costello gets more and more paranoid about the identity of the mole in his organisation.The basic plot of this film isn't that complicated but the story is still gripping. There is a constant threat that Costigan could be exposed and killed which keeps the tension high. This is emphasised by the fact that we are shown what happens to anybody who crosses Costigan. The cast is full of well-known stars but doesn't feel like a typical 'all-star' production; we get good solid characters. Most notable amongst the cast are Leonardo DiCaprio and Matt Damon who play Costigan and Sullivan respectively. There is also an impressive performance as Costello as well as fine performances from the likes of Mark Wahlberg, Martin Sheen, Ray Winstone, Vera Farmiga and Alec Baldwin. As one would expect from a Martin Scorsese gangster film there is a fair amount of violence but it isn't gratuitous, not is it dwelt on excessively. The only real weak spot of the story was the romance between Sullivan and police psychiatrist Dr. Madolyn Madden who goes on to have an affair with Costigan; a little unlikely given that the latter was her patient. Overall though I thought this was an impressive film; fans of gangster and police films should enjoy it."},{"username":"moonspinner55","userUrl":"https://www.imdb.com/user/ur0989035","reviewLink":"https://www.imdb.com/review/rw1757663","warningSpoilers":false,"date":"3 November 2007","rate":"6","helpful":"9 out of 17 found this helpful.","title":"\"Honesty is not synonymous with truth...\"","content":"Cocky Boston police detective with the Special Investigations Unit--who, as a young man, was mentored by a drug kingpin, an overgrown thug who is still making everyone shake in the old neighborhood--is still in-cahoots with this mob boss and attempts to ferret out the police cadet whose job it was to infiltrate the bad guys' circle and get hired on. In turn, the cadet--who is frustrated by his lack of identity--must find the spy on the police force who is playing both sides. Big Oscar winner from director Martin Scorsese is an Americanization of Hong Kong's \"Mou gaan dou\" from 2002. It is also very typical of this particular filmmaker: flashy, fast-moving, repugnant and yet reveling in its nastiness--to the point where one nearly feels the rampant ugliness and constant homophobia gets the director's seal of approval. As the undercover cop, Leonardo DiCaprio does some of his finest work yet; although he can't do much with the man-woman stuff involving a perplexing Public Service psychiatrist, DiCaprio is convincingly rough in a very difficult role to pull off. As the bad detective, Matt Damon is also first-rate, bravely playing a real pr*ck while giving the picture a smug swagger that suits the narrative well (I would have preferred more about this character's loss of morals however, which happens entirely off-camera). As the drug-lord, Jack Nicholson performs without vanity and slithers through the movie like a smiling cobra; his unpredictability as an actor is tailor-made for this role, and Scorsese is careful not to overload the screen with Jack (we get just enough of him, although one sequence in a porno theater goes over-the-top). \"The Departed\" isn't particularly shrewd, and it is not Scorsese's best work, but the linear structure of the complicated plot is nearly free of static and has many gripping scenes. **1/2 from ****"},{"username":"TxMike","userUrl":"https://www.imdb.com/user/ur0438066","reviewLink":"https://www.imdb.com/review/rw1764662","warningSpoilers":true,"date":"16 November 2007","rate":"","helpful":"4 out of 7 found this helpful.","title":"All-star cast and a truly captivating story.","content":"Set in Boston, it is a story about cops who may not really be cops and crooks that may not really be crooks, all compounding to confuse undercover investigations of a crime boss, Francis 'Frank' Costello, played expertly by Jack Nicholson.Leonardo DiCaprio is Ofcr. William M. 'Billy' Costigan Jr., but he wants to do undercover work. So he is set up, imprisoned for a while, given a non-traceable ID, then works his way into the group that works with Costello.Matt Damon is Det. SSgt. Colin Sullivan who, when he was but a young boy was given some advice and small jobs by Costello. An altar boy, Sullivan saw a different way for his life, and became a cop so that he could be an inside informant to Costello, to help keep his crime operations running smoothly.Mark Wahlberg is the tough as nails Det. SSgt. Dignam who, along with Martin Sheen as Det. Capt. Oliver Queenan run the undercover work. Only they know who Costigan really is.Ray Winstone, the fine British actor, is Mr. French, Costello's right-hand man.Much of the movie is a cat-and-mouse game to see if Costigan can get enough goods on Costello to convict him and put him away, while Sullivan is trying to expose and get killed the undercover guy, who happens to be Costigan.The only part of the movie that disappointed me was the end scenes, where several were shot point-blank in the head, executed, and the scenes were especially graphic. It seemed to coarse for the fine story-telling in the rest of the movie. Still, an above-average drama."},{"username":"blanche-2","userUrl":"https://www.imdb.com/user/ur0342623","reviewLink":"https://www.imdb.com/review/rw2096639","warningSpoilers":false,"date":"15 July 2009","rate":"9","helpful":"1 out of 8 found this helpful.","title":"Outstanding","content":"\"The Departed\" is a 2006 Martin Scorcese film, based on a film out of Hong Kong, \"Infernal Affairs.\" I haven't seen the latter, and from reading, I can see that some people liked that film more, some less. I only know that I loved this movie; the script, the performances, and the directing style were all excellent.\"The Departed\" is about two men who are leading parallel lives. One, Billy Costigan (Leonardo DiCaprio) is a graduate of the police academy, and, connected from the old neighborhood, is sent undercover to infiltrate the organization of Costello (Jack Nicholson). Another graduate, Colin (Matt Damon), working with the special investigations unit, is a mob informant. Their lives connect via the police psychiatrist (Vera Farmiga), who becomes involved with DiCaprio, though she's living with Damon. Nicholson is desperate to know who his mole is and puts pressure on Damon; Special Investigations knows they have an informant and want to catch him. The situation becomes more and more tense.The cast is superb - besides di Caprio, Damon, and Nicholson, Martin Sheen, Mark Wahlberg, Alec Baldwin play the top men in the special investigations unit.Scorcese does a masterful job with this film, cutting back and forth between the two men - in the hands of a less expert director, this might be confusing, but in his hands, it's not. He also builds the suspense and tension very well.Di Caprio is sensational as a hot-tempered, stressed out cop who more and more is in danger of being found out; Damon is excellent as the charming, collected Colin who, as he continues to move up in his department, comes closer to finding out the identity of Costello's mole.Martin Scorcese is no stranger to violence, and there's plenty of it to be had in \"The Departed.\" It's not everyone's cup of tea, but it's very strong. While I might argue with a few plot flaws, they didn't detract from me being totally absorbed in this film."},{"username":"Quinoa1984","userUrl":"https://www.imdb.com/user/ur0453068","reviewLink":"https://www.imdb.com/review/rw1491272","warningSpoilers":false,"date":"6 October 2006","rate":"10","helpful":"6 out of 18 found this helpful.","title":"\"...Do you lie?\"","content":"The Departed is the most entertaining kind of non-stop, intense crime thriller of the year, maybe in the past few years. Some critics have said that it's the best film that director Martin Scorsese has made since Goodfellas. I understand where the compliment comes from, though I slightly resent the subtle criticism in the charge as well, meaning that Scorsese hasn't made a film as great or powerful or entertaining in over fifteen years. I would even go far as saying this is Scorsese's best since, well, Scorsese's last film, or at least since Gangs of New York. Some may forget, or maybe just not really take in, how consistently strong Scorsese's career has been overall, how he keeps on taking chances and still keeping his style so instictually 'cinematic' (he is possibly the biggest \"film-geek\" ever), so distinctive, and even so fresh in the 21st century, that his is a career akin to the likes of Kurosawa (many masterpieces, and otherwise very good to excellent efforts). The difference though this time from some of his previous outings- and this is perhaps the correlation with Goodfellas besides the obvious of genre linking- is that it's pure, devilish fun, it goes by quickly but supremely satisfyingly over what doesn't really feel like 2 1/2 hours, and it's cast is uniformly good.Leonardo Di Caprio in particular is so impressive here- and this may be the first-viewing-buzz talking, it might be my favorite of all the performances I've seen him in up till now. Under Scorsese these past several years he's kind of grown up more and more from the oddly pubescent look to him even in his 20's. His performance as Costigan is often very ferocious and tough, but he also makes it a fully rounded character, one that he makes very much his own. He has a dark past, almost too dark to even be an informant for the Boston PD. His whole family is messed up, and there were even links to Frank Costello (Jack Nicholson). So, what better way then to send Costigan into Costello's wing and see what comes out? Then the flip-side comes with Matt Damon's Colin, who infiltrates the police department in legitimate fashion. Damon's is the flip-side as well in performance quality to Di Caprio; while Di Caprio, even when lying through his teeth, is truthful to the bone and always believable, Damon is pitch perfect as a bold-faced liar, as he never flinches for a moment, even when caught like a deer in the headlights.And the performances end up making a sort of square, with Damon and Di Caprio in their own corners, the bulk of the excellent supporting players (Martin Sheen, Marky-Mark Wahlberg, Ray Winstone, Vera Farmiga in a breakthrough role) on one, and Jack Nicholson all on his own. That was the first thing about hearing of the Departed that had me psyched, knowing that one of the great stars/actors of the past 40 years was teaming up with someone with a stature and track record like Scorsese's. With Nicholson in the role Frank Costello is at first already a character to feel is the 'man' in the room when he walks in and talks. But as far as performance goes, it's vintage Nicholson all the way, digging into it with the style, vigor, wit, charm, and all that and a bag of shark-grin chips that have made Nicholson so remarkable. His is such a dastardly character that it teeters on becoming self-parody, but both director and actor know how to reel the part in to being someone to fear, while also being someone who's a helluva lot of fun. It's worthy of an Oscar nomination, and not just because it's Nicholson in a movie.As for the director and his crew, they have assembled what could be by the bare essentials nothing more than a genre film with a premise that seems a little cooked-up. But, of course, it is a remake of a trilogy of Hong-Kong police pictures, so that may be why the premise and story feels not completely original, even as it's passing itself off as one. Yet that too didn't detract. If anything, I felt as if Scorsese was doing what very few filmmakers working today- particularly this year if you look at what's come out- don't do, which is to take material, and not just do a simple 'remake', but to do a re imaging, a refashioning, a full-on reinterpretation into the deeper aspects, in this case the morality and sense of loss among all of these characters. There's some religious bits put in, as it IS Scorsese after all, but this time there isn't something like in Mean Streets where it's always there in the background. Here the characters are on, like in Goodfellas, a version of hell, where things all do come to a head; the last thirty minutes had me laughing, cringing, and mouth-agape in equal measures.In other words, go see this film, if you think it might be up your alley, and you think you were burned by Scorsese ever since he left behind modern-time crime pictures ten years ago."},{"username":"tavm","userUrl":"https://www.imdb.com/user/ur11228318","reviewLink":"https://www.imdb.com/review/rw1491052","warningSpoilers":false,"date":"6 October 2006","rate":"9","helpful":"3 out of 9 found this helpful.","title":"Watch Scorsese's The Departed for Damon, DiCaprio, Nicholson","content":"Directed by Martin Scorsese. Starring Matt Damon, Leonardo DiCaprio, Jack Nicholson, Martin Sheen, Alec Baldwin, and Mark Wahlberg, The Departed is a compellingly dramatic story of moles in both the police and organized crime gangs in Boston. Nicholson is at his most charismatic over-the-top as mob boss Frank Costello, Damon is fine as Costello's informant at police headquarters, DiCaprio is excellent as the undercover cop trying to bring Costello down. Scorsese seems to show off his actors in the beginning but brings us full force by the time we find who Damon's \"father\" is on the phone. Also compelling is newcomer Vera Farmiga as Damon's girlfriend and DiCaprio's shrink and lover. Watch also for Anthony Anderson and from 24, James Badge Dale. Well worth seeing for Scorsese enthusiasts."},{"username":"edwagreen","userUrl":"https://www.imdb.com/user/ur2542703","reviewLink":"https://www.imdb.com/review/rw1507308","warningSpoilers":false,"date":"26 October 2006","rate":"5","helpful":"8 out of 18 found this helpful.","title":"I Couldn't Wait to Depart from the Violence **","content":"Martin Scorsese, the master of gang epics, is at it again. This time in \"The Departed,\" he uses modern technology to show what mobsters et al can do to create mayhem.The acting here is first rate as Jack Nicholson, who portrays a vicious criminal, is right on target. His antics are terrific. Leonardo De Caprio delivers a knockout performance as the guy working secretly for the police. Matt Damon does a fine job as the guy going in the opposite direction.The film deals with 2 young men recruited to serve in various capacities. One works for the mob to infiltrate the state police department in Boston, the other is a cop working for the mob boss. You would think that their lives would connect sooner as both see and fall for a female doctor.The violence and use of the 4 letter word is really too much to bear. Look for nice supporting performances from Martin Sheen, Alec Baldwin, and Mark Wahlberg as veteran cops.The film goes downhill in quality as the body count begins to mount. This film is certainly not for the squeamish."}],"errorMessage":""}