{"imDbId":"tt0468569","title":"The Dark Knight","fullTitle":"The Dark Knight (2008)","type":"Movie","year":"2008","items":[{"username":"MartinHafer","userUrl":"https://www.imdb.com/user/ur2467618","reviewLink":"https://www.imdb.com/review/rw1917490","warningSpoilers":false,"date":"24 July 2008","rate":"9","helpful":"52 out of 97 found this helpful.","title":"Amazing non-stop action and eye-popping skyscraper scenes!","content":"I first need to point out that I generally hate action films--they just aren't a genre I generally would go to see. However, my teenage daughter saw the film and DEMANDED that we immediately go to an IMAX-equipped theater and see it as soon as possible. Had I not agreed, I think she would have threatened force or threaten to leave home, so I reluctantly agreed. I'm pointing all this out up front so you'll understand that if I didn't give this movie a 10 and found a few minor problems with the plot, it's probably because of my bias. However, for me to give an action film a 9 is very, very unusual--it was a terrific film and almost earns a 10.As far as action goes, it was nearly non-stop and there were more eye-popping stunts in it than nearly any film you could see. Plus, I truly recommend that if you do have an IMAX theater nearby that is showing it you go there and not to a regular theater. The sounds, the sights and the action are just amazing on this huge screen--and in hindsight I probably should have taken my hearing aids out before the film began--I DIDN'T need them! For many, this will make the film a must-see, though I admit that it was was a bit tiring after a while--for an old fogy like myself, maybe there was a bit too much action--though teens and action fans will adore it.The characters were excellent--with the possible exception of Batman. He was fine, but I wish he'd have stopped mumbling in his deep voice. This made him a lot less interesting and perhaps less likable than the villains!! As for the villains, the Joker was great and very, very sadistic and I liked Harvey Dent as well (especially after his cool makeup job late in the film). Oddly, perhaps my favorite character was a guy who was only a bit character--Tommy 'Tiny' Lister who played one of the scariest prisoners I have ever seen in film. His bit part on the ferry boat was really exceptional.Overall, this film is better than any superhero film I have ever seen and much better than the earlier Batman films. My only serious problem was the ending--what Gordon and Batman agree to do made no sense at all and wasn't necessary. Still, with such amazing eye-candy, who am I to complain? A wonderful ride and a must-see movie for action and superhero fans. HOWEVER, it is a very violent film intended for adults--I would not take kids or even some teens to the film--it's THAT dark and intense.As of today (7/26/08), this is by far the highest rated film on IMDb. If these numbers can be believed, this film is better than THE GODFATHER, CASABLANCA, GONE WITH THE WIND and 12 ANGRY MEN! Let's have a bit of perspective here--it's a very, very good film but the cult members out there need to get a grip."},{"username":"TheLittleSongbird","userUrl":"https://www.imdb.com/user/ur20552756","reviewLink":"https://www.imdb.com/review/rw2230228","warningSpoilers":false,"date":"3 April 2010","rate":"8","helpful":"23 out of 50 found this helpful.","title":"Very well made, moody and gripping with a brilliant Heath Ledger, if a tad bloated","content":"I grew up on the animated series, loved the first two Batman films, sort of liked Batman Forever but disappointed in Batman and Robin. I have yet to re-watch Batman Begins, but I thoroughly enjoyed this film on re-watch having really liked it first time. It is very well made and gripping with some great performances, but personally I would put Casablanca, Wizard of Oz, Amadeus and It's a Wonderful Life over this.The film does suffer from being a little too talky, and the plot on occasions can be hard to follow due to a lot going on. Nevertheless it is extremely good, and not only one of the better Batman movies but also one of the better superhero movies. Visually and technically, the film cannot be faulted. The cinematography is superb and the spectacle of Gotham City is dazzling. Christopher Nolan's direction is taut, and ensures that the action is explosive.The plot is a little bloated, with the Joker bent on destroying organised crime for good and making Batman cross between hero and vigilante, and subplots about Harvey Dent and Rachel Dawes, and Hong Kong. But there are some truly effective scenes that are tightly structured, and the screenplay in general while a little too talky in the first twenty minutes is intelligent and sophisticated. The Joker especially has some very sinister lines that stay with you for a long while afterwards.The music by none other than maestro Hans Zimmer, who also composed music for The Lion King, Gladiator and the Pirates of the Caribbean movies, is outstanding. Rousing, beautiful, haunting, it is definitely memorable and doesn't become forgettable or generic like the music in The Hurt Locker for example. And I have to say the sound engineering here is phenomenal, particularly on very high volume the explosions sound very authentic as if they are coming from outside rather than from in the film.And I have to mention the acting, as that was terrific. Christian Bale manages to be dark, brooding and charismatic like Batman should be. Though if I did have a complaint, he does speak in a very hoarse voice as if he's got a sore throat and I somehow did not know what to make of it. It wasn't irritating or anything, just...odd. Anyway, Aaron Eckhart is terrific as Harvey Dent/Two-Face even if his storyline was a tad too rushed, and Maggie Gyllenhaal is very sensitive and caring as Rachel. Morgan Freeman does well in a smaller role, as does the excellent Gary Oldman, and Michael Caine is perfect as the loyal butler Alfred.There is no doubt in my mind that Heath Ledger gave the best performance of the film. He wasn't just brilliant, he was phenomenal, unpredictable, insane, extremely sinister and corrupt not to mention chillingly psychotic. I am torn on who I prefer over Jack Nicolson or Heath Ledger; it is a very close call. I admit I am more familiar with Nicolson's portrayal and liked his mix of the scary and comical and even tragic Joker, but the Joker here in The Dark Knight is truly sinister and even more of a threat to Batman and in my opinion this Joker has lines that linger longer into the memory.Overall, not absolutely perfect but it is extremely good thanks to primarily Ledger's performance and the dazzling visual spectacle. 8.5/10 Bethany Cox"},{"username":"Leofwine_draca","userUrl":"https://www.imdb.com/user/ur0482513","reviewLink":"https://www.imdb.com/review/rw3481206","warningSpoilers":false,"date":"3 June 2016","rate":"8","helpful":"8 out of 25 found this helpful.","title":"Dark, bleak, and uncompromising","content":"Following on from BATMAN BEGINS comes Christopher Nolan's second entry in the revitalised Batman film series. I thoroughly enjoyed the first movie and looked forward to this one, aware that many principal cast members were returning. Add to this all the fuss surrounding Heath Ledger's untimely demise and his supposedly terrifying performance as the Joker, and I walked into the cinema ready for a great time. I wasn't disappointed.This is Hollywood blockbuster film-making at its finest: intelligent, well-scripted, with great effects, acting and choreography. This is a powerful, brooding film, even darker than its predecessor, that packs a whole lotta violence into a 12a certificate movie. Okay, so this film ain't gory, but it's certainly one of the most violent and disturbing flicks I've seen in a while. A lot of that is down to Ledger's performance, which has rightly been called brilliant. Blowing memories of Jack Nicholson out of the water, Ledger is a virtuoso in the role, a real freak of nature, a repulsive killer stealing every scene. It's the best performance this actor ever gave, and it's a shame he died when he was just realising his true potential as an actor and not as a wooden pretty boy.The film kicks off with action and follows it with more action. Car chases, fantastic technology (the sonar stuff breaks new boundaries), some martial arts fights and the biggest and best explosion seen on film...they're all here and they never let up. The bone-breaking blows that Batman rains down on the villains are incredibly powerful and I still can't work out how this achieved a kiddie-friendly rating. The script has plenty of twists and turns, including the deaths of some notable leading characters, and plenty of characterisation as well. Themes of good and evil and what it means to be a hero are explored well and the actors all do their roles justice. Special mention goes to Aaron Eckhart, an actor who I've previously found bland but who's excellent as DA Harvey Dent here.If I had any complaints, it would be that Bale hardly gets a look in as Batman takes a back seat to the villains on display. But when they're so good, who cares? Old-timers Caine and Freeman add sparkle, humour and warmth to their parts and there are lots of laughs along the way to go with the shocks and chills. I found Gyllenhaal to be a lacklustre replacement for Katie Holmes, but she's barely around so that doesn't matter. Special effects are top-notch, with one make-up/CGI job surpassing Arnie's ruined face in TERMINATOR 3. So THE DARK KNIGHT is a fantastic film – dark, bleak and uncompromising. It may be a little too much for some viewers, but I loved every second of it – and I look forward to watching it again. A great film."},{"username":"Michael_Elliott","userUrl":"https://www.imdb.com/user/ur13134536","reviewLink":"https://www.imdb.com/review/rw1994531","warningSpoilers":false,"date":"23 December 2008","rate":"","helpful":"12 out of 29 found this helpful.","title":"Great Film","content":"Dark Knight, The (2008) **** (out of 4) I'll be honest and admit that I'm not much of a fan of the so called \"comic book\" movies out there. I'll also be honest and admit that I didn't care for the previous series of Batman movies from Burton and Schumacher. Batman Begins on the other hand was a different story as it found it to be incredibly good but a rare occasion as occurred as this sequel is even better. I've always felt that comic book movies didn't contain enough elements of a dark nature nor did they contain very much adult-themed stuff but that's certainly not the case here as this movie contains enough character development and moral questions for three movies. The epic nature of this movie makes it a one of a kind even though I think the 151-minute running time is the only fault in the film. It's rather amazing at how dark this movie is yet movie crowds ate it up but perhaps they ate so much of it up simply because of how dark it is. This film works on so many levels but I think the biggest are its screenplay and actors. The darkness of the story is perfectly brought to the screen by Nolan with his masterful direction, which paints the perfect picture of corruption, greed and moral responsibility. All of the characters from The Joker to Harvey Dent to even Batman must face various moral issues and this type of stuff not only makes for great drama but it brings a lot of depth to this \"comic book\" movie. The performances are all quite remarkable and that includes the late Heath Ledger as The Joker. Before seeing the film I kept asking myself if his performance could top that of Jack Nicholson but I think that question shouldn't even be asked as both performances are so completely different that you can't compare them. Ledger certainly steals the show and leaves the viewer with goose bumps each time he's on the screen. It really seems as if he just floats through each scene as if he were a ghost roaming around. The walk that Ledger brings to the character is so refreshing and original that I couldn't take my eyes off of him. That wonderful talk and the brilliant line giving just adds to the fun and was it ever great to see such a dark villain. Christian Bale is also once again very good in the role of Bruce Wayne and Batman. Again, the screenplay benefits Bale greatly by having him just as dark as the villains. Aaron Eckhart is getting overshadowed by Ledger but he too really deserves a lot of credit as he probably gives the best performance of anyone dealing with the moral issues. His stint as Dent is perfect for a hero and his turn as Two-Face is perfect for a villain. Maggie Gyllenhaal also does a good job in the love interests role as does Michael Caine, Eric Roberts and Morgan Freeman. Gary Oldman also shines in his role of Gordon. What makes the special effects so great is that the movie isn't in their hand as far as entertainment goes. Yes, the effects and chase sequences look great but they work even better because the screenplay gives us characters to care about. I won't go as far as to call this one of the greatest films ever made but I do think it has to change the way comic book movies are made."},{"username":"SnoopyStyle","userUrl":"https://www.imdb.com/user/ur2898520","reviewLink":"https://www.imdb.com/review/rw2897743","warningSpoilers":false,"date":"1 November 2013","rate":"9","helpful":"15 out of 23 found this helpful.","title":"Heath Ledger makes this great","content":"Batman takes on the crime lords with the help of Lieutenant Jim Gordon and District Attorney Harvey Dent. However an even bigger evil rises to terrorize Gotham.Maggie Gyllenhaal is an improvement over Katie Holmes as Rachel Dawes. Aaron Eckhart adds a good performance as Harvey Dent. In the end, this is Heath Ledger's movie. He overpowers everybody. His early death may have immortalized him, but my opinion isn't inflated. His presence is electric. It helps that his character is so ridiculously crazy. His motivation has nothing to do with power or money which is so mundane. He wants chaos and that is so much more fascinating. Heath Ledger makes this movie great. And it surpasses the series reboot 'Batman Begins'."},{"username":"Hitchcoc","userUrl":"https://www.imdb.com/user/ur0278527","reviewLink":"https://www.imdb.com/review/rw2006009","warningSpoilers":false,"date":"12 January 2009","rate":"9","helpful":"12 out of 22 found this helpful.","title":"I've Gone Batty!","content":"This movie has everything. The cameras, the sounds, the really cool characters. For me, it's one of few adventure movies worth watching more than once. And, of course, Heath Ledger is as awesome as everyone says. The characterization is so much deeper than the other films. We get to see multidimensional people with purpose, even if the purpose to to kill and maim. We care about what happens for a change and we go along for the ride. A small criticism is that it is awfully long and it takes so much time to resolve itself. Also, people do some pretty stupid things, considering what a threat this guy is. These are little things and without them we wouldn't have the huge finale."},{"username":"Prismark10","userUrl":"https://www.imdb.com/user/ur4569900","reviewLink":"https://www.imdb.com/review/rw5443093","warningSpoilers":true,"date":"28 January 2020","rate":"7","helpful":"9 out of 40 found this helpful.","title":"The Dark Knight","content":"After Batman Begins. Director Christopher Nolan went into a brooding nihilistic territory with The Dark Knight.It introduces The Joker (Heath Ledger) a psychopath laced with cynicism and determined to create chaos. It starts off with a punchy bank heist which The Joker uses to creatively eliminate his cohorts.In Gotham City, Batman (Christian Bale) is happy to see the new District Attorney Harvey Dent (Aaron Eckhart) to take on the villains. Dent is also seeing a lot of Rachel Dawes (Maggie Gyllenhaal.)However The Joker creates an alliance with the ring leaders of organised crime in the city and then takes the fight to Batman. Meanwhile Dent realises the extent of corruption in the local police with James Gordon (Gary Oldman) the only honest cop about.Nolan a fan of James Bond films has created several terrific action scenes. One set in Hong Kong is a more over the top homage to a Sean Connery circa Bond film.Nolan also deftly introduces a second villain in the form of Two Face. Much better here than Tommy Lee Jones unconvincingly camping it up with weak material In Batman Forever.Ultimately Nolan puts humanity to test here as The Joker places two bombs in two ships. One full of civilians and another full of prisoners being evacuated. The Joker wants destruction and turmoil. He simply wants to watch the world burn.The Dark Knight is also bloated and at times cumbersome with its long running time."},{"username":"claudio_carvalho","userUrl":"https://www.imdb.com/user/ur2488512","reviewLink":"https://www.imdb.com/review/rw1999145","warningSpoilers":false,"date":"31 December 2008","rate":"9","helpful":"20 out of 39 found this helpful.","title":"Sometimes the Truth is not Good Enough","content":"Batman (Christian Bale) joins force with Lieutenant James Gordon (Gary Oldman) and the incorruptible District Attorney Harvey Dent (Aaron Eckhart), who is his rival in the love for Rachel Dawes (Maggie Gyllenhaal), to fight the organized crime in Gothan City. However, chaos is installed in the city with the arrival of the sadistic psychopath The Joker (Heath Ledger) that brings a wave of violence and murders. The Joker promises to kill prominent citizens of Gothan City unless Batman discloses his identity, and tries to prove the malice and darkness of the human nature and destroy the hope of the dwellers of Gothan City.\"The Dark Knight\" is a great surprise for a blockbuster, with a solid and deep story, great direction, performances, special effects and make-up. The adventure is also dramatic, with magnificent lines and discussions about ethics, morality, human nature, hope and other important themes. The cast has great performances and Heath Ledger is excellent in the role of the psychopath The Joker, and using the movement of lips and tongue visibly inspired in T-Bag, from \"Prison Break\", and brilliantly performed by Robert Knepper. But his nomination is emotionally affected by his death. In the end, \"The Dark Knight\" is a great movie, the best of the Batman franchise and one of the best of the genre in 2008, but the IMDb User Rating (Top 250: #4) is absolutely overrated, ridiculous and disrespectful with the classics of the cinema history and the credibility of IMDb's Rating; but \"sometimes the truth is not good enough\". My vote is nine.Title (Brazil): \"O Cavaleiro das Trevas\" (\"The Dark Knight\")"},{"username":"bob the moo","userUrl":"https://www.imdb.com/user/ur1002035","reviewLink":"https://www.imdb.com/review/rw1944321","warningSpoilers":false,"date":"11 September 2008","rate":"","helpful":"10 out of 27 found this helpful.","title":"Impressive blockbuster with dark tone, plot, characters and delivery making its satisfyingly \"grown-up\"","content":"Batman has proved successful in cleaning up the streets and a fresh new DA, Harvey Dent, is keen to clean up the mobsters in one big conspiracy case. Naturally an unpopular move, particularly with the psychotic villain known as \"The Joker\", who makes it his mission to unveil the identity of the Batman, before killing him. The Joker begins his reign of terror, forcing the citizens of Gotham to wonder whether or not it was worth having a Batman if this is the sort of chaos that his presence unleashes. With the stakes raised higher than ever, Bruce Wayne struggles to hold onto his moral code in the face of villain whose only aim is to unleash chaos and panic across the city.I waited a few weeks for all the hype to die down, but I was looking forward to seeing this film because Batman Begins had done a great job of repairing a character and franchise that was in tatters as Schumacher's gaudy and unlikeable Happy Meal-selling film had finished with it. I was hoping for more of the same as The Dark Knight did not disappoint as the tone continues to be dark and as realistic as a film can be when it is about a man dressed as a bat. The film is a summer blockbuster but yet it manages to at least get close to a really engaging and interesting plot \u0096 this is a joyful far cry from The Fantastic Four and the like, this feels like a film that is marketed to me, not my children. As such the plot does offer some good moralising and conflicts that are what I expected from the damaged \"hero\" of Batman and the freaks he is up against. Again, it is not a \"proper\" drama but these elements are effective within the bigger picture and they only help draw the viewer into the story and characters.The fact that it does engage also means that the action is much more effective. I watched Wanted the other night where everything was so simplistic and dumb that I never cared and the action was only effects. Here the tone is deadly serious and the action feels urgent and dangerous. This has produced the problem in the UK over the rating and I do think that it should have been a 15, although I can understand why it got a 12A. Problem for the certification body is that the film doesn't contain much in the way of graphic acts but it is the tone that is so very harsh and dark, thus making it feel much more violent than it actually is. For me this is not a problem as the film is not for children and I am not a child, but I can sort of see why The Daily Mail jumped on it as the destruction of the mankind or whatever they said it was going to do to our children. I do like the dark tone though and it is not just a visual thing or something in a specific few scenes but rather woven through the whole film. It starts with the characters and performances and of course comes across in the direction and cinematography, which is suitably dark and Gothic without being camp or unrealistic.The cast do good work but all are in the shadow of Ledger \u0096 not because it is fashionable to praise him but because his is a great turn and makes the film. I do feel sorry for Jack Nicholson because his Joker now looks like a childishly simple creation that is a bit of cheesy fun but no more. With Ledger we genuinely feel unnerved with him on the screen, his clothes and make-up being all part of this unhinged creation with his ticks and hair-trigger air; his performance is part of the film working as well as it does as he sells the character and the material. If he does get an Oscar nod, it will not (just) be for sympathy, but because he genuinely is that good. Bale finds himself a supporting player in his own film but deals with it well; not sure about his laughably gruff voice as Batman though \u0096 it just distracts. Eckhart is a good bit of casting because he normally plays morally dubious characters, so the contrast works at the start and he can work with the later stages. Gyllenhaal has her critics but she is much better than Holmes and stands up well with the all-male cast. The supporting cast offer the usual quality in Oldman, Caine and Freeman as well as other faces in minor roles such as Roberts, a returning Murphy, Carbonell, McFarlane, White, Fichtner, Lister and others.The Dark Knight is a great film. The dark tone, good plotting, strong characters, performances and overall design and delivery all make for a grown-up blockbuster that is heads and shoulders above its peers. Ledger is impressive and drives the film forward in an adult and engaging way. Parents with the legal ability to take their four year olds should think twice, because this is not a kiddie blockbuster, but for everyone else there is a great deal to enjoy here."},{"username":"kosmasp","userUrl":"https://www.imdb.com/user/ur5876717","reviewLink":"https://www.imdb.com/review/rw1945885","warningSpoilers":false,"date":"14 September 2008","rate":"10","helpful":"31 out of 41 found this helpful.","title":"Watch the IMAX version if you can","content":"I had the pleasure to watch this movie in an IMAX theatre in London (it advertises itself, with the slogan \"Biggest screen in the UK\"), which was one of the greatest movie experiences I had in my life. And it was my first movie in an IMAX theatre. I can only recommend it for anyone who has the chance to watch it, even if not the entire movie is shot for an IMAX theatre, this still is able to blow someone away! Great visuals combined with a great story and superb acting.The movie could also have been called \"The Joker\", but even with Heath Ledgers great performance, this still is a Batman movie. And \"The Dark Knight\" is clear enough, even without the Batman in the title. I simply loved the movie, but I heard some complaints from some friends. It seems that some might have a problem with the depiction of the characters (I loved Heath Ledger, but there are a few out there who would have wanted to see him even crazier) or the plot threads (especially what is done with the character of Aaron Eckhart). Although I can see why that might be a problem for fans of the comic books, I still stand by my vote. This is the best Batman movie ever (until hopefully Nolan and Bale make the next one)!"},{"username":"classicsoncall","userUrl":"https://www.imdb.com/user/ur2707735","reviewLink":"https://www.imdb.com/review/rw1915570","warningSpoilers":true,"date":"21 July 2008","rate":"10","helpful":"33 out of 48 found this helpful.","title":"\"I think you and I are destined to do this forever.\"","content":"So it finally happened, a DC Comics movie adaptation that out-marveled the Marvel folks, and to such a degree that it might be quite a while before anything comes close to topping \"The Dark Knight\". This was the severely grim and gritty version of the Batman, ushered in by Frank Miller's initial treatment in the landmark graphic novel \"The Dark Knight Returns\" in 1986. Miller's portrayal of the iconic super hero took the gloves off as far as politically correct behavior goes. The movie explores this theme at many levels, and would have served up enough of a plot to keep this viewer interested even without the explosions, chases and general mayhem that modern day audiences need to get their fix on. Actually, the Joker summed it all up quite brilliantly hanging upside down from one of Batman's cables over the streets of Gotham, as noted in my summary line above. In the comic book world, they HAVE been fighting each other forever, or as long as forever exists since the creation of Batman back in 1939; the Joker came on the scene in 1940 in the comic, Batman #1.I don't think this could have been the same picture without Heath Ledger in the role of Batman's all time greatest nemesis. His portrayal blows away Jack Nicholson's performance in 1989's \"Batman\", and that's through no fault of Nicholson's. Today's films are a product of harsher and deadlier times, and it's striking that Ledger's characterization would define the Joker as an extremist, perhaps even a terrorist. More than once I found myself questioning what was going on during the opening bank robbery scene. The bad guys were offing each other based on instructions delivered by the Joker, and you suddenly come to the realization that this domino game had to end with one man standing. It's how we're introduced to Ledger's definitive Joker, a performance that won't be topped.Another thought came to me as I watched the story unfold, and that was how similar the coin toss gimmick paralleled the one in \"No Country For Old Men\". Harvey Dent (Aaron Eckhart) began using the tactic following the death of Rachel Dawes (Maggie Gyllenhaal), and I began picturing Javier Bardem in the role of The Joker. Hard to imagine who might have been the more evil character, Bardem's Anton Chigurh in a more realistic setting, or The Joker in a fictional Gotham City. Fortunately, not a choice one would normally have to consider.I'm a little bit on the fence as to Christian Bale's portrayal of The Batman. He's more than adequate as Bruce Wayne, but the voice he gives to the Dark Knight seems a bit melodramatic. Granted, he couldn't use the same voice as his alter ego, but there were times that it sounded so forced as to come across as parody, and other times just goofy, almost a throwback to the Adam West days of the TV Batman. Strange, but have you considered that no one ever calls him the Caped Crusader anymore either?All in all, great performances all around. Gary Oldman's portrayal of the new Commissioner Gordon was excellent, while Michael Caine as Alfred, and Morgan Freeman as Lucius Fox were solid even with limited screen time. I thought about Katie Holmes just once while making a mental comparison when Maggie Gyllenhaal first appeared on screen. Truthfully, they looked similar enough to effect the transition smoothly to the point where it wasn't distracting for me in the least.Obviously, the set up for the next sequel was firmly set in place with the creation of Two Face, the now alter ego of District Attorney Harvey Dent. The rendering of Dent's burned face was boldly executed and quite marvelous in it's own grotesque way. I'll be looking forward to the next installment.And NOW, for a personal rant. I probably should put this in parentheses because it doesn't have anything to do with the movie, but for this picture to be #1 on the IMDb list of all time best movies after 4 days of release is incomprehensible, if not downright laughable (and I did rate it a 10 myself). I think there should be a moratorium of at least a couple of years before a film qualifies for IMDb ranking, giving the dust some time to settle from all the grand opening hoopla that surrounds a picture like this. I feel the same way about other recent movies like \"No Country For Old Men\" and \"There Will Be Blood\", both of which garnered numerous awards and fan approval. But if they're to be considered among the best films of all time, they'll be considered that way a decade from now without the need for multiple votes from over zealous fan boys."},{"username":"lee_eisenberg","userUrl":"https://www.imdb.com/user/ur4888011","reviewLink":"https://www.imdb.com/review/rw1918846","warningSpoilers":false,"date":"27 July 2008","rate":"9","helpful":"9 out of 22 found this helpful.","title":"worlds of twisted morality","content":"Continuing on from \"Batman Begins\", Christopher Nolan has now given us \"The Dark Knight\", an equally brilliant achievement. Here we have the Caped Crusader (Christian Bale) battling The Joker (Heath Ledger in a blood-chilling final performance), while also trying to navigate the cesspool of crime and corruption that pervades Gotham City.I will say that I found the movie a little silly whenever Batman converses with someone. But what really impressed me was Harvey Dent's (Aaron Eckhart) role. As Gotham's hotshot DA, he represents hope for wiping out all crime; Batman is mostly known as a vigilante. And he can only be known as such, because...well, I'll let you find out what it means.You may have heard that this is a dark movie. Especially The Joker. Whereas Jack Nicholson's Joker was basically a live action Bugs Bunny, Heath Ledger's Joker is a maniacal, ruthless, vicious thug; he seeks only the creation, promotion and dissemination of pure chaos. And there are some REALLY intense scenes throughout the movie; not necessarily violent, but definitely not for the fainthearted.All in all, I wholeheartedly recommend this one. While I could predict some of what was going to happen, much of it surprised me. It will probably surprise you too. Also starring Maggie Gyllenhaal, Michael Caine, Morgan Freeman, Gary Oldman, and small appearances by Cillian Murphy and Vermont Sen. Patrick Leahy."},{"username":"gavin6942","userUrl":"https://www.imdb.com/user/ur1234929","reviewLink":"https://www.imdb.com/review/rw1924918","warningSpoilers":false,"date":"5 August 2008","rate":"9","helpful":"17 out of 31 found this helpful.","title":"About as Perfect as a Batman Film Could Ever Be","content":"After defeating the Scarecrow (Cillian Murphy), Batman and Bruce Wayne (Christian Bale) have little time to return to normal life. The mafia is growing, and there's a new menace prowling the streets: The Joker (Heath Ledger, in his last performance). Can the Batman handle a villain who has no morals, no goals, no methods and is completely unpredictable? Also, a love triangle forms between Wayne, Rachel Dawes (Maggie Gyllenhaal) and Harvey Dent (Aaron Eckhart).There's little use in writing a review of \"The Dark Knight\" -- the critics loved it, fans love it, the sales are going through the roof and are likely to pass every record ever set. And I loved it, too, making it easily the film of the year and both an action-packed thriller as well as a bit of a tear-jerker. Heck, even small amounts of comic relief were thrown in (especially if you like dark humor).I could make complaints: the spinning camera shots were overdone. The Batman voice -- digitally altered for no good reason -- was excessively gruff. The \"Bat-Sonar\" was far-fetched, cheesy and pointless. And bullet reconstruction to get a fingerprint? Doubtful. And the Wayne-Batman character was largely flat and uninteresting, encouraging fans to root for the Joker. So, there was room for perfection (which is why this film, as great as it is, cannot receive a perfect score).Concerns aside, the film was well done, as Christopher Nolan and Bale work well together (see \"Batman Begins\" and \"The Prestige\"). The action is intense, the violence superb for a PG-13 film. There's some suspense, plot twists, unexpected deaths. The romance aspect is a bit unclear (when does this film take place -- Rachel seems to have found a fiancé fairly fast). And Heath Ledger, oh my.The hype around this fill was very Ledger-centric, declaring him as Oscar-worthy. I thought this was exaggerated due to his untimely demise and was therefore disrespectful. However, the praise was well-deserved. This was the Joker, inside and out. I couldn't even visually Ledger under the makeup. I'll always love Jack Nicholson's portrayal, but Ledger brings his \"A\" game. If he is nominated, I accept it; and if he wins, that seems reasonable to me. Best performance so far this year, in any genre.As I said in the beginning, my review is pretty much just more or what you've already heard. The rumors are true, but judging by the sales of the picture, you've already seen it and know first-hand. If you haven't, see it in the theater while you can. Or rent it. Not sure if it's a movie worth owning (I can't see myself watching it repeatedly, depending on the special features). But this may be the superhero movie that defines the genre."},{"username":"jboothmillard","userUrl":"https://www.imdb.com/user/ur4248714","reviewLink":"https://www.imdb.com/review/rw1945777","warningSpoilers":true,"date":"14 September 2008","rate":"8","helpful":"5 out of 19 found this helpful.","title":"The Dark Knight","content":"The first film in the re-imagining of the series was a big hit, but this sequel was a global success, especially with the superb performance by the star of Brokeback Mountain who tragically died from a (prescribed) drugs overdose shortly after filming had finished, from director Christopher Nolan (Memento, Insomnia). Basically a criminal terrorist and mastermind calling himself the Joker (posthumous Oscar, BAFTA and Golden Globe winning Heath Ledger) robs the bank run by the mob, and to take on the Mafia district attorney Harvey Dent (Aaron Eckhart) becomes the new face for justice and hope in Gotham City, with the help of Batman aka Bruce Wayne (Christian Bale) and Lieutenant James 'Jim' Gordon (Gary Oldman). Mob bosses Sal Maroni (Eric Roberts), Gambol (Michael Jai White) and the Chechen (Ritchie Coaster), who have had Chinese accountant Lau (Chin Han) hide their funds, are confronted by the Joker because he wants to kill the, but they all refuse to help, putting a bounty on him. The Joker kills Gambol, and his gang go under his control, and meanwhile Batman, with new technology supplied by Lucius Fox (Morgan Freeman), has found and returned Lau to Gotham to testify in a court case to help bring down the gangsters. The Joker puts his plan into action by threatening the city, if the Dark Knight does not reveal his true identity he will kill people, and soon enough he starts killing the people involved in the mob boss court cases, including Commissioner Loeb (The Fast Show's Colin McFarlane) and Judge Surrillo (Nydia Rodriguez Terracina), and Dent may be next. Dent is hidden, and Rachel (Maggie Gyllenhaal) who has been dating Dent is being looked after by Bruce's faithful butler Alfred Pennyworth (Sir Michael Caine), but the Joker appears to kill Gordon, who sacrifices himself to save the Mayor (Nestor Carbonell), and when Bruce plans to reveal his identity to the press Dent claims he is the Batman. This means that the district attorney is taken into protective custody, but the Joker catches up and tries to kill him, but Batman inside his armoured car and then on his motorcycle is on their tail, and Gordon who faked his death catches the criminals, and gets promoted to Commissioner. Batman demands to know from the clown prince of crime where Dent and Rachel are, as they have disappeared, and eventually, after some beating, he reveals that they are both in separate buildings full of explosives, Batman planned to find Rachel, but he instead gets to Dent, so Rachel is blown up and dies, while Dent is taken out, but petrol on half his face ignites when the explosion happens. Using documents, Wayne Enterprises accountant Mike Engel (Anthony Michael Hall) has concluded that Bruce Wayne is Batman, so he plans blackmail, and meanwhile the Joker has escaped prison and kills Lau and the Chechen, and he threatens to bomb a hospital if Reese isn't killed. While the accountant is rescued by Gordon, the Joker visits Dent in hospital, who has become scarred on half his face and donned the persona of Two-Face, he tells him that the mob is responsible for the death of Rachel and convinces him to get revenge, on a coin flip decision. Gotham General Hospital was blown up, while Two-Face manages to find and kill Maroni and two corrupt cops who helped kidnap Rachel, and the Joker has rigged two ships, one carrying civilian passengers and the other Arkham Asylum inmates, with explosives, and both sets of people have the trigger for the opposite ship, with the demand to blow up the other ship before midnight, or both be exploded. With the help of Fox and a computer as a citywide tracking device, they manage to find where the Joker is, in a building, where hostages are wearing clown masks to look like criminals to the SWAT, but they are saved, both ships refuse to blow up each other, and the Joker despite being caught boasts that he has won when Dent's rampage will be revealed. Gordon is lured to the building where Rachel died where his wife and children are being held hostage, and Dent is threatening their lives from the flip of his coin, and after being shot while wearing body armour Batman tackles Dent, causing him to fall from the top of the building to the ground, and saving Gordon's son. So that Dent will remain a symbol of hope for Gotham City, Batman wants to take responsibility for the deaths of the people Dent murdered, Gordon is upset but is forced to agree, so he orders a manhunt for Batman, while Alfred spares Bruce anymore heartache by burning a letter that Rachel wrote announcing her engagement to Harvey, and Fox sees the tracking computer self-destruct. Also starring Monique Gabriela Curnen as Ramirez, Ron Dean as Wuertz, Cillian Murphy as Scarecrow aka Dr. Jonathan Crane, William Fichtner as Bank Manager and The Fifth Element's Tommy 'Tiny' Lister as Tattooed Prisoner. Bale is still fantastic as the silly playboy and the rough and ready dark hero, Ledger is fascinating as the psychopathic and intelligent scar-faced villain (the licking of lips is a great psycho touch), Eckhart is alright as the slowly maddened political figure turned Two-Face, and the other cast members are good too. Just with the previous film the story is much more grown up and sophisticated compared to the previous incarnations, the make-up is good, and of course the explosions and special effects used create many more exciting chase and fight sequences, a cool and entertaining action fantasy. It won the Oscar for Best Sound Editing, and it was nominated for Best Art Direction, Best Cinematography, Best Editing, Best Makeup, Best Sound and Best Visual Effects, and it was nominated the BAFTAs for Best Cinematography, Best Costume Design, Best Editing, Best Make Up & Hair, Best Music for Hans Zimmer and James Newton Howard, Best Production Design, Best Sound and Best Special Visual Effects. Very good!"},{"username":"rmax304823","userUrl":"https://www.imdb.com/user/ur0819382","reviewLink":"https://www.imdb.com/review/rw2235240","warningSpoilers":true,"date":"12 April 2010","rate":"3","helpful":"33 out of 143 found this helpful.","title":"Action Aplenty.","content":"I tried to get through this. Really I did. And I could appreciate the effort that went into the performances and the wads of dough that must have been spent on special effects. The atmosphere too is lucidly rendered -- night time in the big city.But my enjoyment was hampered by the fact that I'd outgrown most of this stuff about the time I entered High School, and that was when the comic-book Batman still looked like a human being, not a bemuscled behemoth.The experience, the viewing of this, as much of it as I could stand, was exhausting. You have never seen so many vehicles, large and small, racing through the gloomy and deserted urban streets. And every one of them seems to crash and turn into an exploding fireball emitting shards of glass and flaps of unidentifiable metal.The business is taken seriously too. The blows rained upon the victims seem to hurt. The occasional wisecracks from The Joker don't begin to make up for the realistic pain.It all makes me wonder if our peculiar civilization hasn't entered the decadent period that precedes its fall from dominance. At least in the comic books you had to READ the dialog bubbles. Here, no challenge at all. Just sit back and let the despondency overwhelm you.I know, I know. I missed the point. It's just a fantasy. Right enough, but it's somebody else's fantasy, not mine."},{"username":"ccthemovieman-1","userUrl":"https://www.imdb.com/user/ur4445210","reviewLink":"https://www.imdb.com/review/rw1976769","warningSpoilers":true,"date":"17 November 2008","rate":"10","helpful":"22 out of 45 found this helpful.","title":"This Film Entertains, Big-Time!","content":"This was extremely entertaining all the way through, which is quite a statement for a film that is two-and-a-half hours long. There are absolutely no dry spots in this fascinating film. Does everything make sense? Of course not; there are a lot of holes in the story, but it's a superhero action film and it's not meant to be dissected for credibility. It's just supposed to entertain, and that it does.A large part of the credit for that goes to Heath Ledger for his \"The Joker\" portrayal. Every scene in which Ledger appeared was riveting. His speech, mannerisms and his dialog were fantastic. For the latter, I have to commend the screen writers who gave Ledger some great lines!Actually, he and Aaron Eckert, who played \"Harvey 'Two Face' Dent,\" were most of the show, character-wise. Maggie Gyllenhaal was good, too, as \"Rachel Dawes,\" the woman of both Bruce Wayne and Harvey Dent's affections. Otherwise, the familiar good guys - Christopher Bale as \"Batman,\" Michael Caine as \"Alfred,\" Gary Oldman as Inspector/Commishoner Gordan\" and Morgan Freeman as \"Lucius Fox\" were okay but all more interesting in the previous film, \"Batman Begins.\" Speaking of Fox, his high-and-mighty attitude toward Wayne's surveillance system was disappointing to hear. I had thought he had trust in Bruce Wayne. Also, I was sorry to hear the language deteriorate in the final half hour with some unneeded profanity by some inconsequential character.Overall, however, this latest Batman movie ranks among the best of any I've seen, at least on the first viewing. I'm looking forward to watching it again when the Blu-Ray disc comes out next month. This is a great film to enjoy visually and audibly with some fantastic action scenes and excellent dialog.I had heard that Batman was a \"dark\" and almost unlikable figure, himself, in this film but I did not find that. Hey, he did what he had to do to stop a maniacal killer (which \"Fox\" didn't understand., nor some of the other main characters.) For a guy who has provided nothing but good deeds for the fickle citizens of Gotham over the years, this hero certainly doesn't appear to be appreciated......except by his fans of comics and film.In fact, that's the only main thing I would dispute with the writers of this movie: their conclusion at the end that Batman is \"not a hero, but a dark knight.\" No, I would say someone who continually risks his life to save others is quite a hero!"},{"username":"Tweekums","userUrl":"https://www.imdb.com/user/ur13977076","reviewLink":"https://www.imdb.com/review/rw2892248","warningSpoilers":true,"date":"22 October 2013","rate":"10","helpful":"6 out of 11 found this helpful.","title":"Lives up to the hype","content":"This, the second of director Cristopher Nolan's Batman trilogy opens with a bank robbery; the robbers are all wearing clown masks and when each has finished his part of the job he is killed by one of his colleagues. When only one is left he removes his mask to reveal a disturbing face; he is wearing predominantly white make up with black around his eyes and a disturbing red smile he is The Joker and clearly he is insane. It turns out the money he stole belonged to the mob and they are worried about losing the rest; either to The Joker or to the forces of law and order. Leading the campaign against crime in Gotham is a new white knight; DA Harvey Dent; a man who intends to take down the criminals by using the system rather than hiding behind a mask. Soon Dent, Lt. Gordon and Batman are after The Joker; and he in turn is after them and those they love.I put off watching this for a long time fearing I'd be disappointed; surely no film could live up to the hype this one received It turned out I needn't have worried; this is a fantastic film. The returning cast members perform well but it is the new characters that really stand out. Heath Ledger certainly deserved his Oscar; his Joker is genuinely disturbing, Aaron Eckhart is great too in the roll of Harvey Dent and Maggie Gyllenhaal shines as his girlfriend, and Bruce Wayne's old friend Rachel. Those wanting action will be pleased as it rarely stops and is spectacular; this doesn't mean there is any sacrifice of good characterisation and plot though. There are some good surprises along the way as well as a degree of tragedy. If you think superhero films are for children you should be aware that there are plenty of disturbing and even brutal moments here which might disturb youngsters I was a little surprised that it got a UK '12' certificate; it is certainly a 'high 12'. Overall I'd say don't worry about the hype just sit back and enjoy an excellent action film that just happens to have a superhero as its main character."},{"username":"ma-cortes","userUrl":"https://www.imdb.com/user/ur3270789","reviewLink":"https://www.imdb.com/review/rw2188630","warningSpoilers":false,"date":"9 January 2010","rate":"8","helpful":"10 out of 20 found this helpful.","title":"Noisy action ,thrills, chills and dazzling production design","content":"Batman/Bruce Wayne (Christian Bale) accords a deal with the lieutenant James Gordon (Gary Oldman), the district attorney named Harvey Dent (Aaron Eckhart) and his sweetheart-assistant(Maggie Gyllenhaal) for eliminate definitively criminality at Ghotam. However , a mysterious delinquent and psychotic villain named The Joker (Heath Ledger)begins a new wave of criminal rampage and terror. Batman is only helped by his attendant named Alfred(Michael Caine) and his scientific (Morgan Freeman).This is a dynamic, fast- paced and entertaining movie . Full of action , it's complemented by violent images, thriller and breathtaking scenes with overwhelming computer generator special effects. The picture relies in terrific flying sequences , impressive fights, and breathtaking pursuits. The dark story is made believable and the script has more pace to it than former film titled ¨Batman begins (2005)¨ also directed by Christopher Nolan ; booth movies result to be an intense variation on Bob Kane's comic book creation. Our superhero, well incarnated by Christian Bale dons the suit and cape, for that reason he can to be identified with the rest of his life as Batman and he deserves credit for remaining true to character.A well-intentioned and interesting plot by David S. Goyer based on the characters created by Bob Kane, following the events developed in Batman Begins and repeating some actors as Michael Caine, Gary Oldman, Cillian Murphy , among others. Suspenseful musical score by Hans Zimmer and James Newton Howard , and colorful, dark cinematography by Wally Pfister. The film takes off to provide some great moments and great fun as Superman swings into action. The picture is perfectly directed by Christopher Nolan who has directed excellent movies as ¨The prestige¨, ¨Insomnia ¨ and ¨Memento¨ and is preparing Batman third part. This live action Batman was one of the highest grossing movie made in that year, as well as, Nolan's most prestigious efforts in that field. Rating : Very good. Better than average."},{"username":"paul_haakonsen","userUrl":"https://www.imdb.com/user/ur22654354","reviewLink":"https://www.imdb.com/review/rw2782330","warningSpoilers":false,"date":"14 April 2013","rate":"8","helpful":"1 out of 5 found this helpful.","title":"The caped crusader steps up...","content":"Unbelievably enough, then it is only now in 2013 that I got around to actually watching \"The Dark Knight\". Why? Well because I am not much fan of superhero movies or comic book heroes who ventured to the big screen. However, having seen all the older Batman movies, I will say that with \"The Dark Knight\", then Christopher Nolan have really put the previous Batman movies to shame.And with good reason.The storyline in \"The Dark Knight\" is for a more mature audience, and it appeals to an audience capable of coherent thought, unlike the pseudo-comical older Batman movies.And with an impressive list of talent on the cast list, then \"The Dark Knight\" really does impress. However, I remember the hype about Heath Ledger's death and his performance of the Joker in this movie. With the risk of offending a great number of people here, then I don't really get that hype. His performance was good, sure, but it was a bit hyped up by the media. Jack Nicholson did a good enough job with his interpretation of the Joker back in the day, but he didn't get this much hype.Moving on, \"The Dark Knight\" offers a good storyline, spiced up with nifty action sequences, and of course a lot of bat utilities - as always.\"The Dark Knight\" was a major step upwards from \"Batman Begins\", and I must admit that this movie have sparked an interest in actually sitting down to watch \"The Dark Knight Rises\" as well."},{"username":"BA_Harrison","userUrl":"https://www.imdb.com/user/ur0945066","reviewLink":"https://www.imdb.com/review/rw2651501","warningSpoilers":false,"date":"29 July 2012","rate":"5","helpful":"61 out of 153 found this helpful.","title":"The film that the word 'overrated' was invented for.","content":"8.9 out of 10—really? The Dark Knight is undeniably visually impressive, full of flashy special effects, stunning production design and spectacular action set-pieces, but the fans who have rated this film so highly clearly have as little grip on reality as its antagonist The Joker (Heath Ledger).152 minutes of relentlessly dark, dreary, depressing drama—the enjoyment factor turned down to the lowest possible setting—this overly complex and frequently logic-free sequel to Batman Begins sees director Christopher Nolan once again presenting the antics of a man dressed as a bat in a completely humourless fashion. And if Nolan is going to take matters so seriously, then so am I...Could a man with half his face burned off really get out of bed the next day to conduct a vendetta? Why does Batman talk to Fox in his 'gruff' voice when the man already knows his real identity? How do you get hundreds of barrels of explosives onto two ferries without being noticed? Likewise, how did The Joker wire up a hospital to blow-up without being spotted? Who built Batman's underground silo? Does anyone really know what the hell was going on during that scene with that cell phone sonar equipment and the building full of baddies? Where exactly do you hire a butler who can arrange for a skyhook in Hong Kong? These are just a few of the many questions that arise from Nolan's so-called masterpiece.Rabid Batman/Nolan fans might be all too happy to overlook these somewhat awkward posers, but I can't—not when such a blatantly flawed film currently sits at No.8 in the IMDb top 250.5.5 out of 10, but not good enough to be rounded up to a 6."},{"username":"moonspinner55","userUrl":"https://www.imdb.com/user/ur0989035","reviewLink":"https://www.imdb.com/review/rw2373838","warningSpoilers":false,"date":"22 January 2011","rate":"6","helpful":"16 out of 42 found this helpful.","title":"A terrorist plot so complicated and convoluted, it would derail even 007...","content":"Gotham City no longer has an ethereal, poetic glow. In director Christopher Nolan's follow-up to his 2005 blockbuster \"Batman Begins\", Gotham is just another Metropolitan city full of embittered residents squirming under the stronghold of Mafiosos, psychopaths, blackmailers, and terrorists--namely the Joker, who opens the film robbing a bank owned by the Mob with his masked cohorts, whom he has no loyalty to. Heath Ledger won a posthumous Supporting Actor Oscar for his twisted portrayal of the Joker--playing the facially-scarred criminal mastermind as if he just escaped from a lunatic asylum--but it isn't a multi-layered, pleasurable performance. Christian Bale returns as billionaire Bruce Wayne (and his alter-ego, a flesh-and-blood Batman), putting his trust in Gotham's latest hotshot District Attorney who is dating Wayne's childhood sweetheart and going after the Mafia in court, if the Joker doesn't get to them first. Nolan stages an extended, fiery vehicle chase that is absolutely astounding, yet the rest of his film falls a bit short. The performances are variable, the mood is dour and depressing, and the illogical plot tied in endless, headache-inducing knots. Fans of the Superhero genre will no doubt revel in the sleek look of the picture, but the script (penned by director Nolan and his brother Jonathan) is a disappointment, not helped by the smash-and-grab editing which cuts off and mixes up sequences before the drama has even played out. **1/2 from ****"},{"username":"TxMike","userUrl":"https://www.imdb.com/user/ur0438066","reviewLink":"https://www.imdb.com/review/rw1991209","warningSpoilers":true,"date":"16 December 2008","rate":"","helpful":"0 out of 8 found this helpful.","title":"Smashing follow-up to Batman Begins.","content":"I really like the first one in this current series, 'Batman Begins', because it takes us from Bruce Wayne's young years and then through his mystical training, and his beginnings to fight crime in Gotham City. This second installment is better in many ways, but for me doesn't quite have the charm of the first.Christian Bale of course is back as Bruce Wayne and Batman. But his childhood sweetheart and now District Attorney lawyer is Maggie Gyllenhaal as Rachel Dawes. She does a fine job but is a definite step down from Katie Holmes.Most of the buzz has been, especially after his untimely death, Heath Ledger as The Joker. This Joker is quite different from the character Jack Nicholson played in the 1989 version, more sinister and more dangerous. He doesn't have any grand plan, he just enjoys wreaking havoc, and his mission here is to kill innocent people and cause destruction until he succeeds in having Batman's identity revealed. Ledger is chillingly good in this role.Aaron Eckhart is introduced as Harvey Dent who, after getting caught up in an explosion, becomes Two-Face. Michael Caine is back as Bruce Wayne's butler and father figure, Alfred Pennyworth, and plays the role just perfectly. As well as Gary Oldman, back as cop James Gordon. And Morgan Freeman as Lucius Fox, now head of the Wayne corporation and Bruce's personal scientific consultant.The new crime boss is Eric Roberts as Salvatore Maroni, and he is superb in the role. I have always been a fan of Roberts' and it is good to see him in a feature role as this.Overall a fine movie, both as a drama and as an action movie."},{"username":"Quinoa1984","userUrl":"https://www.imdb.com/user/ur0453068","reviewLink":"https://www.imdb.com/review/rw1913029","warningSpoilers":true,"date":"18 July 2008","rate":"7","helpful":"13 out of 31 found this helpful.","title":"Nolan, Bale, Ledger, Eckhart, all hit it out of the park","content":"I wasn't sure what to expect from The Dark Knight a sequel to Batman Begins and, by virtue of extended franchise, a remake of the Tim Burton 1989 Batman movie, which also featured Batman, the Joker, and Harvey Dent (though not Two-Face). The previews had all the action and excitement, and some cool-looking gadgets, but... despite the whole \"Heath Ledger is dead, this is final great performance\" hype, I didn't want to second guess myself. A Joker with no real \"origin\" story? Ledger playing him with slapped on, sloppy make-up and lots of facial tics? How will this work, and how could it be any better than Nicholson's Joker? Answers? It does work, very well, though it's dependent on the universe that director Christopher Nolan has set in place. Ledger's Joker wouldn't work in Burton's style, as his mix of camp and seriousness was perfect for an actor like Nicholson. But in Nolan's world, he fits in like a f***ing psychotic glove. To get it out of the way for this review, I'll say this: Ledger practically lives up to the hype. His presence is uncouth and strange, and not like one's used to (the slashes through his face are \"jokingly\" referenced that \"my dad did this, \"my wife did this\"), and he's totally ambiguous. But it's also the unpredictable Joker seen yet on screen, and only topped probably in the craziest of the comics. He's an unpredictable force that is the twisted ying to Batman's protect-by-all-means-but-murder yang. It's basically an anarchic punk rocker taken to the lengths of a terrorist.While this should make the Joker boring, there's nothing that Nolan isn't willing to do to make the audience jump or second guess the plot, which makes it extra exciting as he heads on in the last half hour, leading to an incredible double-catharsis of sorts. But if Ledger's performance is being touted for an posthumous Oscar nomination (which I'm still not sure about though will probably happen), then the amount of attention being paid to Aaron Eckhardt is minuscule in comparison. On his own terms, Eckhart delivers a performance that's even better than Ledger's (or, rather, he has a lot more complexity than \"I'm gonna blow stuff up and go chaotic here\"). He puts in everything that's needed for the perfect Harvey Dent, as a man who's the \"white knight\", someone who could be the one to take the place of Batman as the one to look after Gotham. His downfall, however, becomes the great, horrifying tragedy of this Batman. To say Eckhart blows all other interpretations (on film or TV) of Dent is putting it lightly, and the make-up given to his latter reincarnation is some of the best I've ever seen.In the interest of not coming off like a total crazy fan-boy for the Dark Knight, there are some likely criticisms to have. Despite Nolan's vision being epic and grand, and for the most part pulling off such a big story very well, the last section, however exciting and tense and posing moral questions, goes a little long. And, however staying true to the comics (which is great), the last section starts to pile on the exposition a bit much. But these are mostly mild quibbles. In the scope of delving into the Batman world as honestly (if not realistically) as possible, Nolan succeeds even further than in 'Begins'. The characters of Batman/Wayne, Gordon, Dent, and Rachel Dawson are all put into incredible circumstances throughout the film, and we're pulling for them and care about what happens all the way. It's all the more a credit to the storytelling power since we should know how things will turn out; a certain twist mid-way through had me thinking \"say it isn't so\", and when I knew I was had, I knew Nolan had done his job well.Another question: does Dark Knight live up to the hype? It depends on how you define it and how it pertains to the movie. A lot of the hype has been around Ledger's death, and the new characters, and some of the hype (i.e. box-office predictions) have become ludicrous. Yet, for what Nolan set out to do as filmmaker, delivering drama and action and pathos and a kick-ass-but-truly-conflicted Batman in his *very* dark city of Gotham, he succeeded admirably. It might not be the same amount of pure \"fun\" of Burton's films, but then again it doesn't need to be. It's an excellent, breathtaking experience, and one of the best pics of 08."},{"username":"tavm","userUrl":"https://www.imdb.com/user/ur11228318","reviewLink":"https://www.imdb.com/review/rw1915603","warningSpoilers":false,"date":"21 July 2008","rate":"9","helpful":"7 out of 14 found this helpful.","title":"The Dark Knight was another awesome Batman movie from Christopher Nolan","content":"Before I comment on the movie proper, I'd like to mention two things: One, the person I went with-who works at this particular theatre and saw the midnight premiere-thought the bank manager role was played by Jimmy Smits but I immediately recognized him as William Fichtner from \"Invasion\", the TV series he did with Eddie Cibrian. Also, when the Joker was threatening Rachel Dawes, it was the only time I was taken out of the picture since I said aloud that he was threatening Jake Gyllenhaal's sister with my friend mentioning her name since we both saw Heath Ledger and Jake in Brokeback Moutain a few years ago. Ledger is fine as the main villain though I stop at saying he's better than Jack Nicholson in the role or deserves an Oscar nomination though it would be fine if he did. And Maggie Gyllenhaal is an improvement from Katie Holmes as Bruce Wayne's former girlfriend though I remember liking Holmes fine too. And Aaron Eckhart as Harvey Dent, Dawes' new beau, is also fine with his initial role as \"white knight\" district attorney later turning into what would become known as Two-Face. And I loved having Michael Caine as Alfred the Butler having a previous background in the battling jungles of Burma so he can tell his master of his dilemma there. Throw in Morgan Freeman's Lucius Fox and you've almost got a perfect movie. Certainly, Christian Bale as the Caped Crusader is even better here than in Batman Begins and he is to me, like many viewers, The absolute Dark Knight here. While the movie may be longish in spots, Christopher Nolan lets it be that way so he can make us really care for the characters. I certainly was very touched by the sacrifices the new Commissoner Gordon, as played by Gary Oldman, had to make throughout the picture especially when he had to deal with Two-Face and his family's peril near the end. So the many who went to see this once and want to do it again, what are you waiting for? P.S. Having not recognized Anthony Micheal Hall previously, I'll have to look for him the next time I watch which may be soon too!"},{"username":"edwagreen","userUrl":"https://www.imdb.com/user/ur2542703","reviewLink":"https://www.imdb.com/review/rw1925442","warningSpoilers":true,"date":"6 August 2008","rate":"7","helpful":"4 out of 21 found this helpful.","title":"Dark Knight-Joker and Others Go Wild ***","content":"The film is good but is very much over-rated. The Daily News rated this movie *****. It is rather a *** as I shall try to explain.The acting is top-notch, especially Heath Ledger as the Joker and Aaron Eckhart, amazingly good as Harvey Dent, D.A.This is one film that is rare since good does not triumph over evil. Dent's transformation is magnificently realized. It just shows us what situations can lead someone so pious to go so wrong.The film is action packed. The special effects are marvelously arranged.As far as the Oscars for this year go, an argument can be made that Ledger's performance should be in the supporting category as well as Eckhart. Gary Oldham,as Gordon, should also be in the running for a supporting Oscar as well as Maggie Gyllenhaal, who has really shown a depth of maturity here in a breakout performance.My lone argument with this film is the last-half hour. Once the Gyllenhaal character is killed off, the film does go a bit down-hill. It becomes confusing at this point. Confusion we don't need as we wish to study the change in dimension depicted by Dent. That being said, the picture is one of a rare quality. A thin line is drawn between good and evil here and we wonder where we can go from here as the credits roll."}],"errorMessage":""}