{"imDbId":"tt0482571","title":"The Prestige","fullTitle":"The Prestige (2006)","type":"Movie","year":"2006","items":[{"username":"MartinHafer","userUrl":"https://www.imdb.com/user/ur2467618","reviewLink":"https://www.imdb.com/review/rw2193218","warningSpoilers":true,"date":"17 January 2010","rate":"7","helpful":"24 out of 58 found this helpful.","title":"Some very interesting plot twists and originality, though it's a bit grim and lifeless","content":"After seeing that this film is in the IMDb top 100, I thought it was a film I must see. Now that I've seen it, I feel a bit disappointed. Now I must admit that the film was terribly original and had some odd twists, though the film overall is awfully grim and lifeless--mostly because it was hard connecting with the characters.Christian Bale and Hugh Jackman play magicians who are partners. Things go very well for a while until Jackman's wife is accidentally killed doing a dangerous trick. Jackman blames Bale for this and you really can't tell if Bale did anything wrong or if it was just a sad tragedy. Regardless, Jackman spends the rest of the film persecuting Bale and trying to destroy him. After a while, Bale begins fighting back and it's an all-out war with horrible consequences. I won't say more--because I don't want to spoil the film. However, I will say that it gets really, really, really weird when Nicola Tesla (played very well by David Bowie) enters the fray--creating the ultimate magical box for Jackman.Aside from the magic box being ridiculously anachronistic, the film is so slow and hard to love--despite it's wonderful twists. It's hard to like either of the magicians (particularly Jackman) and after a while I lost interest--mostly because of the pacing and disagreeable characters. Overall, I greatly respect the film but also didn't particularly enjoy watching it."},{"username":"TheLittleSongbird","userUrl":"https://www.imdb.com/user/ur20552756","reviewLink":"https://www.imdb.com/review/rw3624935","warningSpoilers":true,"date":"22 January 2017","rate":"8","helpful":"4 out of 12 found this helpful.","title":"Imperfect but fascinating","content":"As said in my review for his masterpiece 'Memento', Christopher Nolan has always struck me as a very talented film-maker, and most of his films are ones that have impressed me a lot. Even weaker efforts, where his ambition can get in the way, have a good deal to admire. His films are all impeccably crafted technically, and often entertaining and thought-provoking, also knowing how to get good performances out of talented casts.'The Prestige' is not quite perfect, but is still very good and one of Nolan's better films. To me actually it was close to outstanding, which makes my issues with the denouement even more frustrating. And it is the denouement that's 'The Prestige's' biggest problem, being over-baked and with one twist too many, the second of which being a convoluted cop-out and like the other twists before the denouement didn't happen.Was also, to a lesser extent, expecting more from David Julyan's music score, having done such a great job with the score for 'Memento'. His score for 'The Prestige' works within the film and has a mystical and dread quality, but it is not one of those scores that is listenable or even re-listenable as music on its own, lacking the cleverness and mood and thematic complexities of his work for 'Memento' and being somewhat too simplistic to be entirely memorable.However, 'The Prestige' looks wonderful. The cinematography is slick and the production values in general are suitably gritty and audacious, complete with gorgeously evocative Victorian period production and costume design. Once again, Nolan directs impeccably, not letting his ambition get in the way of the storytelling, while the script is smart, thought-provoking and intricate without trying too hard and treating the audience with respect. The pacing is taut while deliberate, and while the film is long there is enough to keep one riveted.The story for 'The Prestige' is quite the fascinating tale, with an incredible period and darkly magical atmosphere and twists and turns peppered throughout but done in a way that the storytelling is coherent and taken with sincere seriousness while not coming across as emotionally cold.Fine acting all round, with a charmingly flamboyant Hugh Jackman and intensely charismatic Christian Bale perfectly cast and playing off against other wonderfully. Michael Caine brings class and dignity to his role, and seeing how he altered his voice and posture for it it was clear he was right in the zone. Rebecca Hall, Piper Perabo and Scarlett Johansson also do well, as does surprisingly David Bowie in an unlikely role. Andy Serkis is similarly memorable.Overall, imperfect film but also a fascinating one, flaws and all it is for me one of Nolan's better films. 8/10 Bethany Cox."},{"username":"Leofwine_draca","userUrl":"https://www.imdb.com/user/ur0482513","reviewLink":"https://www.imdb.com/review/rw3562929","warningSpoilers":true,"date":"16 October 2016","rate":"4","helpful":"27 out of 99 found this helpful.","title":"A film that cheats the viewer - and I hated it for that","content":"I'd been excited about seeing THE PRESTIGE, especially as it re-teamed two of my favourite film people from BATMAN BEGINS: the usually excellent Christopher Nolan, who delivered the excellent INSOMNIA and MEMENTO, and Christian Bale, an actor who can do no wrong in my eyes. Then what a shame it is that THE PRESTIGE turns out to be nothing more than a silly, muddled science fiction film masquerading as a serious and engaging drama.It starts off on a strong footing, with interesting characters and situations, but quickly loses these in a stupid plot that jumps all over the place and never bothers making much sense. The biggest kick in the teeth, however, is the ending, which ties things up with two plot twists that are frankly awful. The first is a sci-fi staple – cloning. What place does it have in a supposedly realistic Victorian thriller? It just turns this film into a fantasy and loses audience interest. The second twist is the one that's apparent early on, and one of the classic 'tricks' much beloved by writers of murder mysteries and crime thrillers. It's also been done to death and was outdated about a century ago, but no, it's resurrected here and had me groaning, feeling cheated when it appeared.THE PRESTIGE isn't a totally bad film and there are quite a few things to recommend it. It looks fantastic, and all of the electric special effects are tremendous. It also boasts a pretty good cast, with Christian Bale delivering another outlandish performance – his Cockney accent here is quite amusing – and Michael Caine presiding over things in his usual manner. Hugh Jackman I don't particularly like as an actor, and he's at best passable here; but in comparison to the hopeless Scarlett Johansson, who struggles with her British accent, he's Laurence Olivier! There are some fun minor roles for Andy Serkis and David Bowie, the latter playing the inventor Nikola Tesla and doing a good job of it. While the magic acts and tricks are engaging when they're on screen, it's just a shame that the film becomes so implausible and cops out towards the end. THE PRESTIGE contains nothing I'll want to sit through again."},{"username":"SnoopyStyle","userUrl":"https://www.imdb.com/user/ur2898520","reviewLink":"https://www.imdb.com/review/rw2922039","warningSpoilers":false,"date":"14 December 2013","rate":"9","helpful":"18 out of 22 found this helpful.","title":"Obsession and Revenge","content":"Around the turn of the century, Robert Angier (Hugh Jackman), his wife Julia McCullough (Piper Perabo), and Alfred Borden (Christian Bale) are assistants to the magician Cutter (Michael Caine). Due to hubris, Julia is killed in one of the tricks. It sets off a combative obsessive competition between Angier and Borden that ends in their eventual destruction. Rebecca Hall and Scarlett Johansson play other love interests.This is a dense complicated plot. If you figured it out before the ending, then you're much smarter than me. Christopher Nolan and his brother have woven an intrigue story of obsession and revenge. The twists will leave you stunned. The reveals of the tricks are jaw dropping. It doesn't get more mind bending than this one.In a way, the flashforwards are not that necessary. It throws a complicated story into more confusion. It's too much. The movie may be better to be more straight forward. Personally, I like the challenge."},{"username":"Hitchcoc","userUrl":"https://www.imdb.com/user/ur0278527","reviewLink":"https://www.imdb.com/review/rw1504670","warningSpoilers":true,"date":"23 October 2006","rate":"10","helpful":"25 out of 32 found this helpful.","title":"A Film with Intellect","content":"I thought this was an amazing film. It takes a period before the advent of the illusionist pyrotechnics of modern times and shows us the magic. Not only does it have the magic working for it, it has a great story of revenge, hatred, one-upsmanship, genius, you name it. The story teaches us about illusion which is a much more accurate term for what we see. I will never look at David Copperfield the same way again. There is incredible scenic effluence. The acting is impeccable and the direction and cinematography is unrivaled. For once a film that lives up to its hype. Using David Bowie as Tesla is marvelous. I've always thought that he should have had a much greater career as an actor than he has realized. Michael Caine is the voice of reason, but his voice is seldom listened to. Revenge is one of the oldest motives and it poisons one of the characters. Stay with this one; then see it again. It is a masterpiece."},{"username":"Kirpianuscus","userUrl":"https://www.imdb.com/user/ur61197531","reviewLink":"https://www.imdb.com/review/rw3403261","warningSpoilers":false,"date":"26 January 2016","rate":"","helpful":"10 out of 12 found this helpful.","title":"fascinating","content":"a film about magic at different levels. the magic as art. the magic as axis of life. art as only way to survive. beautiful, mysterious, ambiguous and almost impeccable. in fact, brilliant job. and this status is result of delicate-precise mixture of acting, impeccable story, splendid atmosphere and the feeling than competition escapes from the screen. a seductive detail - David Bowie as Nikola Tesla, a role who gives to film a special flavor. at first sigh, story of a cruel fight for success. or a portrait of manipulation art. in fact, fresco of a time. and one of admirable roles for Christian Bale and Hugh Jackman."},{"username":"Horst_In_Translation","userUrl":"https://www.imdb.com/user/ur3914439","reviewLink":"https://www.imdb.com/review/rw3245774","warningSpoilers":true,"date":"26 May 2015","rate":"8","helpful":"14 out of 16 found this helpful.","title":"So glad this movie did not stay an illusion...","content":"In the filmmakers' minds. Instead, it became one of the finest films of the year 2006. \"The Prestige\" is a perfect example of what a movie should be like if it does not rely on you liking and cheering for the central characters. Neither Angier (Jackman), nor Borden (Bale) are likable characters at all. And yet you are completely under their spell as this film goes on. This may be a bit of a subjective take as I quite like Hugh Jackman and find Bale a joy to watch most of the time as well. And Johansson and Hall are among my favorite actresses as well. But it's not only the cast that makes it so much worth watching. It's also the visual side. Art direction, set decoration, cinematography and costumes are top-notch and even the rare special effects are pretty nice. The film managed two Academy Award nominations for its visual side, both of them very deserved and I actually would not have minded if it had won one of these over \"Pan's Labyrinth\".The film's director is Christopher Nolan and he also wrote the movie together with his brother after the first Batman film. He also cast some of the actors from his superhero trilogy, including Bale and Caine, the only one who didn't do that much for me. Now back to Nolan's script: I think this is probably the heart and soul of the film. Such love to detail, so much suspense, so many surprises and all these great scenes like the doppelgänger parts or the suicide of Hall's character in the room with all the birds, which were actually the way how he met her when he talked to her nephew. Very very smart screenplay. All in all, the best thing about it, however, is how he wrote the two protagonists and their egos constantly clashing with each other, maybe because they weren't so different after all. Of course, Jackman and Bale give great performances too and that is why it worked so well, but still you cannot appreciate Nolan's effort enough. And his brother's. Lets not forget about him. People say, Nolan has problems when it comes to directing and writing realistic female characters, but I disagree. He managed in this film without a doubt and he also managed in others. When the two magicians fight each other or I should probably say get their hands dirty, literally everybody else in this film is constantly affected: their women, their assistants, their set creators...The accidental death of one character's wife sets off a deadly spiral which results in murder in the end. Or does it really? Nothing in this film is what it seems and we do not only get one major plot twist in the end, but two. Apart from that, the progress in terms of inventions and electricity also brings a completely new dimension of progress for the profession of a magician, actually for life in general, for everybody. So, we also get some interesting references on Nikola Tesla and Thomas Edison. I also liked how Nolan revealed some tricks, but not all of them, so the movie itself stays a bit of a mystery still. This was the second time I watched this film and it was as good as the first. I highly recommend watching the almost 10-year-old, 120 minute-long \"The Prestige\". It's possibly my favorite Christopher Nolan movie."},{"username":"claudio_carvalho","userUrl":"https://www.imdb.com/user/ur2488512","reviewLink":"https://www.imdb.com/review/rw1645625","warningSpoilers":false,"date":"28 April 2007","rate":"9","helpful":"22 out of 35 found this helpful.","title":"A Great Tale of Rivalry, Obsession, Revenge and Sacrifice","content":"In the end of the Nineteenth Century, in London, Robert Angier (Hugh Jackman), his beloved wife Julia McCullough (Piper Perabo) and Alfred Borden (Christian Bale) are friends and assistants of a magician. When Julia accidentally dies during a performance, Robert blames Alfred for her death and they become enemies. Both become famous and rival magicians, sabotaging the performance of the other on the stage. When Alfred performs a successful trick, Robert becomes obsessed trying to disclose the secret of his competitor with tragic consequences.\"The Prestige\" is a great tale of rivalry, obsession, revenge and sacrifice. The unpredictable screenplay has many twists, disclosing unusual situations and hooking the attention of the viewer until the very last scene. Christopher Nolan, after the masterpiece \"Memento\", offers another excellent movie for the cinema lovers, better and better than the Oscar winner \"The Departed\". The amazing dispute between the outstanding Christian Bale and Hugh Jackman is supported by the extraordinary Michael Caine and a wonderful cinematography. My vote is nine.Title (Brazil): \"O Grande Truque\" (\"The Great Trick\")"},{"username":"bob the moo","userUrl":"https://www.imdb.com/user/ur1002035","reviewLink":"https://www.imdb.com/review/rw1692171","warningSpoilers":true,"date":"12 July 2007","rate":"","helpful":"8 out of 18 found this helpful.","title":"A very well told story despite the lack of shine in the final reveal (spoilers)","content":"Magician Alfred Borden is on trial for the murder of fellow magician Robert Angier, allegedly by positioning a lockable tank of water below a trap door that Angier fell as part of a trick. With the prosecution pushing for the death sentence, Cutter, experienced mentor to both men, relates the history between the two men. Starting as friends working as plants to support an established magician, their friendship turns into professional rivalry at first but a tragic accident sees the two enter a personal battle.Like everyone else, I want to be liked. I want people to think good of me and perhaps respect me; I don't think it is an unnatural thing and, no matter what they say, most people feel the same. However I have never pandered in my opinion to the majority voice and the IMDb's ridiculous \"was this comment useful\" voting system will not deter me from questioning why this film is so highly thought of. On one level I can see why because it is a masterful piece of story-telling that weaves flashbacks within flashbacks as easily as moving between concurrent scenes set in the present (whenever that is in regards the narrative). In doing this it doesn't produce confusion as to when we are but rather makes the story much stronger and deeper. Nor did I have a problem with the sci-fi ideas being put into Victoria times; no, although the \"cloning\" machine is a jump, it is only a jump because my head is stuck in the period and not accepting such an idea as I would in another film.No, the problem I had with it was the build up to an ending that I had to spend a lot of time thinking about. I didn't think so much because I didn't get it \u0096 I thought about it because I didn't think it would be so straightforward (in sci-fi terms of course) and predictable. The boards are full of debate over whether the machine works or not, but I think that the reason for this is that many are keen to find a twist and trick that isn't really there. This was a letdown for me and the delivery of the final scenes suggested that I should be taking it as a twist or surprise, but really it isn't. To me this stops it being as good as everyone else seems to think it is, but I still can see the strengths that kept it interesting for two hours.As said the story-telling is very strong, even if the conclusion isn't all I would have liked. Visual themes (clues?) are run throughout the film in a way that isn't clear until after the plot becomes clear. Ahead of this stuff though, is an engaging story in regards the characters, which was what drove the majority of the film for me. The flashback structure compliments the narrative well and produces characters sucked under by envy, hate, bitterness. With this to work with both Jackman and Bale give strong performances that really drew the script out and made this aspect so interesting to me. Caine is a class-act as he often can be but some of the other casting is questionable. Serkis I have no problem with in a minor role, but Bowie is always a risky prospect (see Fire Walk With Me for proof \u0096 or rather lack of proof since he was cut down to a minimum to the detriment of the film). Here he isn't terrible but he certainly isn't any good. Johansson I'm not sure about as an actress. She is pretty as a young woman but her acting isn't always up to scratch and here she is pretty average at best.Overall then, not as brilliant as everyone would have you believe because the conclusion is nowhere near as strong (or surprising) as the delivery and build-up within the film would suggest (far less the gushing praise and theorising herein). The manner of telling is masterful though and works so well that perhaps it accounts for my problems late in the game. The lead pair respond well to this, both turning in very strong performances. A very good film then, just not as wonderful and flawless as the praise on this site would have you believe."},{"username":"kosmasp","userUrl":"https://www.imdb.com/user/ur5876717","reviewLink":"https://www.imdb.com/review/rw2326370","warningSpoilers":false,"date":"19 October 2010","rate":"10","helpful":"7 out of 10 found this helpful.","title":"(Magic) Layers","content":"I really don't know where to start. The great production design, the fabulous acting, the great cinematography, the superb writing, the awesome directing ... I really don't know. But I do know, that this is another Nolan movie. Which kinda is a trademark or became one for me. That is why the number one movie I was looking forward in 2010, was \"Inception\".But I will get into that other movie on its own page. If you haven't watched any Christopher Nolan movie yet ... well it's almost not possible. Even if you got away from all the buzz Memento created, it's almost impossible, that you haven't seen at least one of the Batman movies he made. Then again you might not be into that sort of movies. And that's the great thing about Nolan. Making entertaining movies, that have substance.Maybe Insomnia is his \"weakest\" movie (if you count the reception it got) and \"Following\" was just a student film, but even those two are a showcase of his talent. But then again, I might be just a fan-boy drooling about achievements that you think are not worthy mentioning. You have to make up your own mind ... start with this mind-boggling or with any other of his movies ... Repeated viewing is almost necessary! And you will most likely want to anyway!"},{"username":"classicsoncall","userUrl":"https://www.imdb.com/user/ur2707735","reviewLink":"https://www.imdb.com/review/rw2524436","warningSpoilers":true,"date":"27 November 2011","rate":"8","helpful":"10 out of 12 found this helpful.","title":"\"It is very rare to see... real magic.\"","content":"Oh man, this one had me right up to the part with the transporter/duplicator machine. Until then it was a compelling and complex tale dealing in murder, mystery and intrigue with a clever backdrop of magicians attempting to outdo each other with the grandest illusion of all time. What I'm not going to do is go back and watch this three times in a row like I did with \"Memento\" because when all is said and done, I won't be any better off. In a way I felt cheated that an 1880's era film would bring in a fictional sci-fi element the way it did. It seems to me the story could have gotten around that contrivance to come up with a more realistic resolution that confined itself to existing science and techniques of illusion. Then, when Borden (Christian Bale) had his final showdown with Angier (Hugh Jackman), he could have caught the bullet to end the picture on a more promising note. I don't really mean to sound so harsh on the film because like I said, up to the Tesla part this story was going great guns. Maybe because the guy portraying Tesla looked so much like David Bowie, it kept me off stride for a while as well. Then it turned out to be Bowie when the credits rolled, and I was back to thinking about that business with the cats and the hats. Maybe the whole thing was an illusion."},{"username":"lee_eisenberg","userUrl":"https://www.imdb.com/user/ur4888011","reviewLink":"https://www.imdb.com/review/rw1998115","warningSpoilers":false,"date":"29 December 2008","rate":"8","helpful":"8 out of 10 found this helpful.","title":"Batman and Alfred (outside Gotham) meet Wolverine","content":"In between the Batman movies, Christopher Nolan cast Christian Bale and Michael Caine in \"The Prestige\". It tells the story of magicians Alfred Borden (Bale) and Robert Angier (Hugh Jackman). Initially partners, they had a falling out and became rivals. From there the movie becomes a battle of wits, showing how the men have no aim except to destroy the other. Caine plays John Cutter, the state engineer who works for Angier.I notice similarities between this movie and some of Nolan's others. There's the non-linear plot, like \"Memento\"; one-upmanship, like \"Insomnia\"; the question of morality, like in \"The Dark Knight\". But what impressed me more than anything was all the stuff about magic tricks, how the characters use the tricks against each other, and how they both use Olivia Wenscombe (Scarlett Johansson). Angier's and Borden's rivalry mirrors Nikola Tesla's (David Bowie) rivalry with Thomas Edison.All in all, I recommend this movie. It's both a look into the world of magic tricks, and also the dangers of obsession with revenge. Also starring Andy Serkis (Gollum in the LOTR movies) and Ricky Jay (a real-life magician).PS: other 2006 movies dealing with magic tricks are \"The Illusionist\" and \"Scoop\" (also starring Hugh Jackman and Scarlett Johansson)."},{"username":"gavin6942","userUrl":"https://www.imdb.com/user/ur1234929","reviewLink":"https://www.imdb.com/review/rw1508562","warningSpoilers":false,"date":"28 October 2006","rate":"10","helpful":"16 out of 20 found this helpful.","title":"Give This Film Time to Sink In...","content":"Leaving the theater, I thought the film was just okay. An hour later, I thought it was pretty clever. And now, the next day, I think it was amazing. Why the change? It took that long for most or all of the subtle hints to sink in and the real twists to be discovered. The film doesn't end when you leave, it begins.The story is the tale of two magicians in a bitter rivalry, always trying to do a better trick than the other and trying to sabotage the other's success. At least, that's what you think the story is until you finally see \"the prestige\".I can't discuss much of this film because giving almost anything at all away would ruin some of the fun. But a few notes: Christian Bale, as always is awesome. An incredible actor with a wide range and screen appeal. Christopher Nolan works well with him (see \"Batman Begins\") and I hope they continue this Burton-Depp relationship they have. I foresee only greatness.Hugh Jackman is also spectacular, probably giving the most diverse performance in the film, easily the most demanding. And he does this convincingly.Scarlett Johannson is Scarlett Johannson... if you've liked her before, you should like her here (though her role never really gets the full story it needs). And David Bowie... wow, he is so much better than \"Labrynth\" would have you believe.The visuals are stunning, but the real credit goes to the makeup department, who deserve an Oscar for this picture. Outside of horror films where extensive makeup is often required, this film probably does more to change the actors' appearances than any other film I've ever seen. And I was going along with the ride the whole time.If you see one film from 2006, see \"The Departed\". But if you see two, \"The Prestige\" better be on your list."},{"username":"jboothmillard","userUrl":"https://www.imdb.com/user/ur4248714","reviewLink":"https://www.imdb.com/review/rw2390250","warningSpoilers":true,"date":"24 February 2011","rate":"8","helpful":"3 out of 8 found this helpful.","title":"The Prestige","content":"From director Christopher Nolan (Memento, Insomnia, The Dark Knight, Inception), released near about the same time as The Illusionist starring Edward Norton and Paul Giamatti, both films have strong similarities, I was interested to see which of the two I'd find better. Basically, in 19th Century London, famous magician Alfred Borden (Christian Bale) is on trial for the suspected murder of rival magician Robert Angier (Hugh Jackman), and through flashback we see how their story played out all the way to the trial. So Alfred and Robert were originally good friends working as magician assistants for performer Milton (Ricky Jay), and their engineer for all the tricks and illusions on stage was Cutter (Sir Michael Caine). Their friendship turns into strong rivalry between each other when Robert's wife Julia McCullough (Piper Perabo) is put in the glass box of water to perform the famous escape trick, but Alfred supposedly tied a different knot for her to untie, therefore Robert blames him for her death from drowning. Separately they both become magician performers with their own stage show acts, Borden calls himself The Professor, while Angier becomes The Great Danton, and trying to ruin each other's performance, and maybe get new ideas for astonishing acts, they both disguise themselves once or twice to do just this. Robert has a new wife Sarah (Rebecca Hall) who gives him a daughter, and he has Cutter and his new assistant Olivia Wenscombe (Scarlett Johansson), but he is looking for a new and revolutionary illusion. In disguise he attends the performance of his Rival, and he astonishes the audience with his new act, The Transported Man, and he wants to try and recreate the act, i.e. steal it, for himself, so Cutter finds him a very convincing lookalike to achieve this. But Robert wants to find out the real way to do the trick, or better create his own extraordinary alternative to it, and he finds that with some new technological marvel for real transportation, almost like teleportation. When he has perfected the act, and he knows Albert will be disguised in the audience and watching, that is when he lures him backstage to witness him fall through the trap door for the trick, and drown in the below water tank. That is how Albert is caught and imprisoned for the \"murder\", however he is shocked when he finds out that Robert is still alive, in disguise, and that he framed him. The film mentions the three important magic trick components: 1) the setup - show the something ordinary, 2) the performance, make something change, and 3) the prestige, bring the something back. The final shock of the film is not Robert being alive, but being killed by Albert, and the revelation that he has an identical twin brother, and that the real man is not the one in prison, oh, and that's how The Transported Man worked. Also starring Samantha Mahurin as Jess Borden, David Bowie as Tesla, Andy Serkis as Alley, Daniel Davis as Judge and Roger Rees as Owens. Jackman and Bale are equally matched as the mentally duelling magicians, Caine is really good as the man in amongst it all, Johansson gets her moments too, and the direction by Nolan is perfectly timed. The special effects for the magic is really good, the tricks themselves look as though they could be done for real, and the story is engaging, as for whether this is better than The Illusionist, it is, a terrific period mystery thriller. It was nominated the Oscars for Best Art Direction and Best Cinematography. Very good!"},{"username":"rmax304823","userUrl":"https://www.imdb.com/user/ur0819382","reviewLink":"https://www.imdb.com/review/rw1708084","warningSpoilers":true,"date":"7 August 2007","rate":"7","helpful":"3 out of 9 found this helpful.","title":"Never ask me about my business.","content":"Dark, brooding piece about the rivalry between two turn-of-the century stage illusionists outdoing each other. One of the young men, Borden (Christian Bale) may have been responsible for the death of the other's beloved blond wife, the other being Angier (Hugh Jackman). Angier and his mentor, Michael Caine, continue their careers, while Borden builds his own.The emotional tumult caused by the death of Angier's wife leads him to sabotage Borden's performance, actually shooting two of his fingers off. Borden, filled with resentment, retaliates by putting a major crimp into Angier's career. It gets a little complicated but they both wind up more or less at the top of the prestidigitative heap before the end.There are romances flung into the pot too, functional to the extent that they illustrate character development in the two magicians and act as links between the two competitors. Scarlette Johansson is surprisingly good as the bosomy stage assistant with the working-class Brit accent, even though the dialect suppresses her usual croak. Rebecca Hall is splendid as the perceptive woman who takes up with the lower-class Borden, even though she knows he's lying half the time when he tells her he loves her. (He's married to his job, you see.) Enter Nicolas Tesla, the very real historical figure who did all sorts of things, conceptual and physical, that strike some of us as a little outré today. A man ahead of his time, played by an unrecognizable David Bowie.At this point, what was a more or less cogent drama turns into something else. Tesla, like Baron Frankenstein, pulls off something that's half scientific and half supernatural. If you've seen \"The Fly\" you have some idea, only the idea you have is a little simpler than the one presented here. I was a little confused by the ending in which \"all is explained\" but somewhat too perfunctorily for me. Maybe I'm dull but the jigsaw puzzle remained mostly a table full of scattered and disjointed pieces.The photography captures the time and place nicely. Too nicely, maybe, because it's hard to imagine anyone wanting to live in a landscape of perpetual poverty and gloom. If there was a scene in bright daylight, I missed it. Do we learn anything about the tricks of stage magicians? Are you kidding? Illusionists have the kinds of social borders (us inside, them outside) that cops have, or airline pilots or doctors. The trick is told when the trick is sold. We do see some of the machinations but they're ones we might have easily figured out for ourselves. The ultimate trick, the one devised by Tesla, is of course never explained because it never happened.I hope you don't find these comments confusing. If you do, the film will present an even greater challenge. Still, it's worth watching for anyone with mature sensibilities. Confusing, maybe. Pandering, no."},{"username":"ccthemovieman-1","userUrl":"https://www.imdb.com/user/ur4445210","reviewLink":"https://www.imdb.com/review/rw1953427","warningSpoilers":false,"date":"29 September 2008","rate":"10","helpful":"142 out of 174 found this helpful.","title":"Just As Intriguing The Second Time, Too!","content":"I've seen this film twice now - about a year ago and then yesterday - and thoroughly enjoyed it both times, even the second time when I remembered some of those fantastic twists in the last half hour. Sometimes it's even more fun to view a film like this when you know a few things, because earlier scenes take on new meaning.It's not an easy film to totally digest, even with two viewings, because that ending has some mind-boggling revelations. Without having to resort to spoilers, let me just say the story is extremely interesting, the acting very good, the period pieces fun to view and it's a pretty clean movie so grandma can also enjoy it, too, without language or sex concerns.Basically, it's a story about obsession between two magicians in the last decade of the 19th century. They continually try to top one another and things get nasty along the way. Hugh Jackman and Christian Bale are both fun to watch in those roles, as are Michael Caine and Scarlett Johansson in supporting roles.This is one movie guaranteed to have you thinking about it when it's over!"},{"username":"Tweekums","userUrl":"https://www.imdb.com/user/ur13977076","reviewLink":"https://www.imdb.com/review/rw3476339","warningSpoilers":true,"date":"26 May 2016","rate":"9","helpful":"3 out of 5 found this helpful.","title":"Rivalry and obsession in the world of magic","content":"This film tells the story of two rival magicians, Robert Angier and Alfred Borden, in late Victorian London. After a brief introduction we see Angier drown as a trick appears to have been sabotaged by Borden and the latter in put on trial for his murder but are things what they seem? The story then unfolds from the time they were friends to the final revelation concerning what really happened in that opening scene.Angier and Borden's friendship is irrevocably broken when Angier's wife is killed when a trick goes wrong; Angier is convinced that it was Borden's fault. The two go their own ways and put on rival magic shows. Angier sees a chance for revenge when Borden attempts the famous 'bullet catch' trick; he hides himself amongst the crowd then volunteers to be the man who pulls the trigger, slips a real bullet into the gun and pulls the trigger; Borden survives but loses two fingers. Time passes and Borden develops a new trick; 'The Transporting Man'. This seemingly impossible trick sees Borden enter one cupboard then emerge from another almost instantly. Angier is desperate to replicate the trick but can't figure out how it is done. His ingénieur (trick creator), Cutter, is certain that it must involve a double but Angier is certain that the only man on stage is Borden. He performs his own version, using a double but is unsatisfied; determined to learn the truth he sends his stage assistant, Olivia Wenscombe, to pretend to work for Borden to learn the secret; she steals his notebook but it is encrypted. Angier forces Borden to tell him the key word (Tesla) and this leads him to search out scientist Nikola Tesla in Colorado to get the equipment he needs this ultimately works but not in a way anybody would expect.Anybody familiar with the films of director Christopher Nolan will know to expect the unexpected and shouldn't be put off by the non-linear narrative it isn't just that the story is told in flashback; instead it moves back and forward revealing aspects of the story. This isn't just a gimmick as it works to make things interesting. The way the two magicians' rivalry escalates perfectly encapsulates their obsessions; not just to be the best but also to destroy the other. The cast does a fine job; most notably Hugh Jackman, Christian Bale and Michael Caine who play Angier, Borden and Cutter respectively. They are ably supported by Rebecca Hall and Scarlett Johansson as Borden's wife Sarah and Olivia Wenscombe, there is also an enjoyable cameo from the late David Bowie as Nikola Tesla. The final resolution is rather surprising; largely because it is blatant science-fiction rather than a magic trick this might disappoint some viewers although others will enjoy the dark twist when they realise the secret behind Angier's version of 'The Transporting Man'. Overall I'd certainly recommend this impressive and intriguing film."},{"username":"ma-cortes","userUrl":"https://www.imdb.com/user/ur3270789","reviewLink":"https://www.imdb.com/review/rw1987559","warningSpoilers":false,"date":"9 December 2008","rate":"8","helpful":"10 out of 13 found this helpful.","title":"Imaginative and intriguing crash of wits between two famous magicians","content":"This enjoyable and fresh story about intense rivalry among magicians is set in turn-of-the last century, London.Robert Angier(Hugh Jackman) his wife Julie McCullough(Piper Perabo) and Alfred Borden(admirable Christian Bale) are friends and magician's assistants. Then Julie accidentally deceases during a sideshow , Robert accuses Alfred for her killing . A new assistant named Olivia(Scarlett Johansson) helps Robert and he falls in love with her, though later she fell in love with another man. The magicians use their powers to combat among them. Both become prestigious magicians and get mutual envy. Magician Robert sees the Borden's transportation show and he becomes obsessed with his magic trick. They battle each other for their magic tricks and Robert attempts disclose the secret about disappearance from his contender with fateful results.This splendid movie is stunning in many aspects and blends appropriately various genres: the lush romantic period piece during nineteenth century Victorian Era, mystery thriller and fantasy.The picture gets it all : suspense, mystery drama, star crossed lovers,plot twists, murders,tragedy and supernatural illusions . Featuring an excellent casting, as main actors, Jackman, Bale, Johansson as eclectic secondaries, Caine,David Bowie,Andie Serkis and Rebecca Hall.Luxurious attention to period detail in brilliant costumes and spectacular production design . Beautifully and mesmerizing cinematography by Wally Pfister. Intriguing and evocative musical score by David Julyan. The motion picture is perfectly directed by innovator director Christopher Nolan, author of various masterpieces: ¨ Insomnia,Memento,Batman begins, Dark night¨. At the same time was made another film(2006)with similar theme titled 'The illusionist'by Neal Burger with Edward Norton, Paul Giamatti and Jessica Biel which also achieved much success. Rating : Above average, it was throughly amusing and exciting, and no as predictable as you would think. The film results to be a complete pleasure to watch these actors at this work,it's highly recommended and keep you guessing until final."},{"username":"moonspinner55","userUrl":"https://www.imdb.com/user/ur0989035","reviewLink":"https://www.imdb.com/review/rw2040087","warningSpoilers":false,"date":"19 March 2009","rate":"6","helpful":"8 out of 20 found this helpful.","title":"How many times can you double-cross your audience?","content":"In 1890s London, two magicians--once protégés of the same aging illusionist--consistently undercut each other on and off the stage, reveling in the one-upmanship; Hugh Jackman has the show business flair, while rough-hewn toughie Christian Bale is more intent on conquering the intricacies of unexplainable magic. Using rather obvious ploys (like phony beards and wigs, not to mention Scarlett Johansson as an assistant/secret agent), they each work as much on sabotaging the other's latest success as developing their own skills. This fantastic tale, directed and co-written by Christopher Nolan from the novel by Christopher Priest, might have bowled us over with a few cunning twists; unfortunately, the baffling screenplay reminds one more of H. G. Wells than \"Sleuth\", coming up with a bag of tricks so far-fetched it removes the film's core of inherent reality. The film is remarkably well-dressed and crafted, although the jumpy editing at the start (darting around in time before settling into a more conventional mode of storytelling) is rather a nuisance. The acting is solid throughout, even as the plot-gimmicks become more and more ridiculous, leading to a depressing and flat conclusion. **1/2 from ****"},{"username":"TxMike","userUrl":"https://www.imdb.com/user/ur0438066","reviewLink":"https://www.imdb.com/review/rw1618163","warningSpoilers":true,"date":"15 March 2007","rate":"","helpful":"1 out of 7 found this helpful.","title":"In 'magic' it's all about the third act! The Prestige.","content":"\"The third stage is sometimes called the effect, or the prestige, and this is the product of magic.\" (Christopher Priest) That is the derivation of the movie's title. The whole plot involves two magicians who are competing ever since they were magician helpers together. Their jealousy and desire to learn of each others' best magic tricks provide the tension in the story.Hugh Jackman is Robert Angier, eventually the lesser of the two, and who spends much of the movie time trying to avenge a death. Christian Bale as Alfred (Freddy) Borden is the better of the two, always seeming to one-up Angier. Michael Caine is Cutter who designs the illusions and equipment, and is ready backstage with an ax in case the escape from the water tank is not made on time.Scarlett Johansson (with British accent) as Olivia Wenscombe becomes the 4th member of the circle. She at first assists Angier, but he sends her to get a job with Borden, to learn the secret to his \"transported man\" trick.An interesting casting is David Bowie as Nikola Tesla, a real historical scientist who experimented with electricity. Many recognize his name for the \"Tesla coil.\" I didn't recognize Bowie during the movie.We found it a very interesting 2 hours. All the cast members are good and the twists and turns held our attention.SPOILERS. Early when Angier and Borden are working together, and Angier's young wife is part of the act, she drowns after being dropped into the water tank because she cannot get out of the wrist knot that Borden tied, and thus could not reach around and unlock the trick lock. Angier never forgives Borden, and much later a trial found Borden guilty of killing someone else and sentenced to a hanging. Eventually Angier develops a transported man illusion, using a very close double they find, on one side of the stage Angier opens a door to conceal his dropping below the stage, while behind the door on the other side of the stage the double surfaces from beneath. Trouble with the double (doubt planted by Borden in a pub) cut that act short. Meanwhile Borden was doing his amazing trick and only at the end, while Angier is dying, do we learn that there were 2 Bordens, identical twins. One was loyal to his wife, the other was in love with Olivia. There was no cheating.Within that story, was a highly fictional one where Angier paid Tesla to develop an electrical device which \"transported\" him by actually creating an exact double of himself, which of course he had to drown each performance to hide the fact. He framed Borden with one of those drownings."},{"username":"blanche-2","userUrl":"https://www.imdb.com/user/ur0342623","reviewLink":"https://www.imdb.com/review/rw2220774","warningSpoilers":false,"date":"14 March 2010","rate":"9","helpful":"4 out of 6 found this helpful.","title":"Obsession is a young man's game","content":"Hugh Jackman, Christian Bale, Michael Caine, and Scarlett Johansson star in \"The Prestige\" a 2006 film directed by Christopher Nolan.Jackman and Bale play Robert Angier and Alfred Borden, magicians in turn of the century London. The story is told in flashback until close to the end of the film. Angier and Borden start out as friends and colleagues, working as a magician's assistant. Tragedy strikes, and they become mortal enemies. Each becomes famous as a magician, and when Borden performs the ultimate illusion, Angier becomes obsessed with trying to find out how he did it and becomes determined to top it.This is an excellent film that will have you with your jaw on the ground at the end. In my own case I had to go back and re-watch the ending. This isn't a movie you can watch and zone out - the plot requires active following, as Nolan switches points of view between Angier and Borden, and skips from the past to the present. However, he does it with a master's skill. The other interesting thing about the film is the bad guy/good guy concept, which he turns upside down and inside out.\"The Prestige\" captures the atmosphere of 19th century London perfectly. All of the actors - and the casting is superb - are in top form, with Caine giving an steady performance as the old magician who tries to keep Angier grounded and David Bowie as the mysterious Nikola Tesla. Jackman and Bale are well-matched as adversaries - both volatile and ambitious, driven men.Like a magician, Nolan distracts the viewer with one thing and then pulls a rabbit out of the hat. Sheer brilliance.You'll want to see this movie again. Highly recommended."},{"username":"Quinoa1984","userUrl":"https://www.imdb.com/user/ur0453068","reviewLink":"https://www.imdb.com/review/rw1509001","warningSpoilers":false,"date":"29 October 2006","rate":"8","helpful":"3 out of 5 found this helpful.","title":"a basic tale of one-up-manship, but done in a great fashion of professional storytelling and acting","content":"The Prestige is like a machine of tricks and wonders, and it ends up pulling off a lot more than it might have not been able to chew. Co-writer/director Christopher Nolan is very much in his territory here with this picture, and the sort of jigsaw-figure-out effect he had on his breakthrough Memento is redeployed here in a style that is never too deterring. He focuses so well on the two main characters, and the people focused around them, that there's no need to really feel as if one is being pulled away from the real emotional drive of each character. It's basically one big game that becomes something very dangerous once obsession becomes part of it (as Michael Caine's character notes is what children do). But all the while I went along totally well with what the story went through, in all its twists and pulling seemingly simple little turns out of a hat, because Nolan made the storytelling seamless and has actors that are utterly dependable and pitch-perfect in their roles.Christian Bale and Hugh Jackman play the magicians, who start out as partners under the tutelage of Michael Caine's Cutter, who perform acts of not-totally-simple 'magic', which follow three main principles which are listed by Cutter at the start and end of the picture. After a tragedy that befalls their assistant (Piper Perablo), the rivalry and, more crucially, the aims and wills of each side is put into play. On one side is Bale's Borden, who is, according to Jackman's Angier, living his entire life as a trick, which may not be far from the truth (hope that doesn't spoil things). On the other is Angier, who becomes involved with the burgeoning technology of Nikola Tesla (David Bowie, who is one of the lesser factors of actors in the film), who may be able to figure out how to make something truly unbelievable. Their fates become entangled in each side's pursuit to out-do the other in the public eye, with Cutter and the change-around mistress (Scarlet Johanssen, in a spiffy English accent that works), on the sidelines.What makes a lot of this more compelling that it almost has a right to be is how much we're steeped into the mind-sets of these characters, who they get fractured by their own separate ambitions amid their skills. One is a better magician, while the other is a better showman, and each can't stand the other's talents in the midst of being somewhat intrigued and drawn to a kind of madness. And yet at the same time the personal also finds its way into the trickery of the film, and actually grounds things- seemingly of course- particularly with Borden's wife (Rebecca Hall, one of the best in the film acting-wise) who feels betrayed by the pack of lies and secrecy. The fates then of both characters becomes that of dealing with mortality, and how one can cheat death or not, or again, and again. Towards the end it does teeter much on becoming one extra ending that might not be needed, or a couple of minutes that feel packed in too tight.But all the while Jackman and Bale are constantly compelling, with little things they have in their characters that make them very much real for us, and then makes the final twist not too unworthy of what led up to it. It's like a twist mountain, or rather, a prestige. It might not be the best kind of 'prestige' I've seen, yet I still highly recommend it as a cool treat of splendid storytelling in a story that teeters on leaving the audience with too much of a gasp in the extraordinary, and has just enough to pull back and have a few good surprises. It's one of the best productions to come out this season."},{"username":"tavm","userUrl":"https://www.imdb.com/user/ur11228318","reviewLink":"https://www.imdb.com/review/rw1525000","warningSpoilers":false,"date":"19 November 2006","rate":"5","helpful":"4 out of 21 found this helpful.","title":"The Prestige was interesting if maybe a little slow to wade through","content":"When I watched The Prestige with my friend and some of his siblings and friends, I partly fell asleep during some of the passages so I'm not sure if I got the gist of the plot. But I did understand that it went back and forth in time and I understood most of what happened, I'm just not sure if it was compelling enough to really care about what happens during the whole thing. Now Hugh Jackman, Christian Bale, and Michael Caine were fine as were Scarlett Johansson, Piper Perabo, and David Bowie in a small role. Maybe if I were to watch again with a more alert eye I'd give this one a better rating but for now I'm giving this one a 5."},{"username":"edwagreen","userUrl":"https://www.imdb.com/user/ur2542703","reviewLink":"https://www.imdb.com/review/rw1622613","warningSpoilers":false,"date":"22 March 2007","rate":"1","helpful":"16 out of 65 found this helpful.","title":"The Prestige- Don't Need this Type of Honor 1/2*","content":"Christian Bale and Hugh Jackman have a field day torturing each other and ultimately all who see this nonsense.As two magicians, one's mistake led to the tragic death of Jackman's wife and the two spend the rest of the picture trying to outsmart the other.Interesting to see Daniel Davis show up in this film as a British judge. He received well deserved praise as Niles, the butler, in the television show \"The Nanny.\" Apparently, the American Davis had such a good strong British accent on the show, he was thought of when this film was made.The film is hopelessly confusing as we go on. It is never properly explained who these Edison people were and what they were actually trying to do.The end is a joke and a mystifying one at that.Veteran pro Michael Caine is in this for the ride I guess. Don't run to see magic shows when you see this eerie film. Strange things are happening."},{"username":"Coventry","userUrl":"https://www.imdb.com/user/ur2020269","reviewLink":"https://www.imdb.com/review/rw1573648","warningSpoilers":true,"date":"15 January 2007","rate":"6","helpful":"1 out of 12 found this helpful.","title":"LOVED the trick with the canary!","content":"Performing magic shows is literally a 'tricky' business. Unquestionably these magicians are good artists, as they have to disguise a presumably very simple and logical trick and build a whole show around it, but at the same time the whole concept quickly tends to get boring. Just because you automatically presume there's a simple explanation for every illusion, you risk losing interest and I was more or less worrying that the movie would suffer from this exact same problem. It isn't very interesting to hear Michael Caine enlightening us about the different phases of a successful trick and it's even less interesting to constantly hear about two beginning magicians wanting to become the biggest performers of their time. Personally, I wasn't really hoping for a thriller revealing a lot of magic-secrets. I was merely anticipating a dark & sinister post-Gothic portrait revolving personal vendettas and macabre set pieces. And for the largest part, The Prestige actually delivers! The man in the director's chair is Christopher Nolan, and both \"Memento\" and \"Insomnia\" already proved he's a terrific storyteller, as he has the talent to bring an ordinary tale much more complex than it actually is. Nolan once again uses as irregular narrative structure, with jumps back and forward into time and well-camouflaged hints that eventually all lead to a gigantically grotesque denouement. Robert Angier (Hugh \"Wolverine\" Jackman) and Alfred Borden (Christian \"Batman Begins\" Bale) are two gifted pupils of the already legendary 'engineer' Cutter (Michael Caine), both treasuring the ambition to become the nation's biggest magician. A regretful accident, resulting in Angier's wife tragic death on stage, causes their friendship to turn into intense competition and pretty soon they spend even more time sabotaging each other's shows than actually building up their own acts. When Alfred Borden eventually presents his perplexing Transported Man trick and Angier can't possibly decipher the logic behind it, the rivalry turns into a dangerous obsession that will require large sacrifices. The main attraction of this film is probably meant to be the guessing along for the tricks and the detailed exposition of a handful of basic magical acts, but honestly that whole aspect impressed me the least. With just a tad bit of concentration and the experience of having seen similar mystery-thrillers, the red herrings are fairly transparent. Also, the whole set-up of Robert Angiers ultimate act (with the help of pop star David Bowie in a remarkable role) is simply impossible to take serious. Whatever remains, however, is definitely worth watching. The mysterious late 19th Century set pieces are intriguing, especially the transporting machinery which seems to be inspired by the \"telepods\" in David Cronenberg's \"The Fly\". The detailed illustration of magical tricks didn't really fascinate me, although there's one notable exception: the disappearing canary! It's a cruel and pretty offensive old-school trick, but hilarious in case you have a weird sense of humor. Quite embarrassing, because I was the ONLY person in a sold-out theater who was laughing with this sequence. The acting performances are top-notch, but with an ensemble cast like this we wouldn't accept it any other way. Particularly Christian Bale is terrific, since his naturally mysterious charisma is ideal for a role as a magician. Scarlett Johansson's part is rather small, but her beautiful appearance helps cheering up the dark sets a lot."}],"errorMessage":""}