{"imDbId":"tt0816692","title":"Interstellar","fullTitle":"Interstellar (2014)","type":"Movie","year":"2014","items":[{"username":"MartinHafer","userUrl":"https://www.imdb.com/user/ur2467618","reviewLink":"https://www.imdb.com/review/rw3189254","warningSpoilers":true,"date":"22 February 2015","rate":"8","helpful":"59 out of 155 found this helpful.","title":"Why tack on an ending where everything works out perfectly?!","content":"The first 80-90% of \"Interstellar\" I absolutely loved and was prepared to give this movie a 10. Sadly, the ending inexplicably had an ending that didn't make a lot of sense and only seemed there in order to tack on a nice Hollywood ending and wrap everything up perfectly. It's sad, but apparently the public embraced this sort of ending...so who am I to complain?!As for the film, there are a bazillion reviews so I will be brief. The film has incredible special effects and is a film best seen in the movie theater. On a HUGE screen at home, it would still lose something. Like the wonderful \"Gravity\", it just needs the big screen...trust me with this. The story is exceptional and offers many wonderful twists (up until the disappointing ending that is) and there are a lot of wonderful performances. Overall, the good certainly outweighs the bad and it's a film to see. But as for me, an ending with more sadness and vagueness would have been okay."},{"username":"TheLittleSongbird","userUrl":"https://www.imdb.com/user/ur20552756","reviewLink":"https://www.imdb.com/review/rw3624381","warningSpoilers":false,"date":"21 January 2017","rate":"6","helpful":"50 out of 283 found this helpful.","title":"Often impressive and very beautiful, but less than stellar","content":"As someone who likes the cast, loved the concept and who considers Christopher Nolan very talented and has enjoyed a good deal of his films, 'Interstellar' was somewhat of a let-down. It has a lot of great elements, but also has its flaws and one admires Nolan more for his ambition than his execution.Starting with the praises, 'Interstellar' does look spectacular. It's majestically shot, seamlessly edited and boasts audacious set design and fantastic special effects. The music score from Hans Zimmer is perhaps his best effort for a Nolan film, it has subtlety but also an unnerving eeriness and haunting and heart-wrenching pathos. The sound effects and sound mixing are expertly managed and give a real sense of authenticity.'Interstellar' however has more than just being technically spectacular. It is thought-provoking and awe-inspiring frequently, with some fascinating ideas, and does have a lot of heart, making the emotional elements genuinely poignant. The Cooper/Murph relationship, which is really what takes centre stage, is beautifully done and often very heartfelt. Nolan directs with great ambition, strong direction of the actors and flawless technical command.Matthew McConaughey proves that his Best Actor Oscar for 'Dallas Buyers Club' wasn't a fluke, he holds everything together in a committed, charismatic and deeply felt turn. MacKenzie Foy matches him beautifully as does Jessica Chastain. Anne Hathaway is sassy and emotive, and there is fine support from John Lithgow and Michael Caine.However, 'Interstellar' is overlong and, because of the wildly variable pacing and that the story doesn't quite have enough content to justify it, it feels it. The pacing is wildly variable as aforementioned, there are times where it's fine but there's some choppiness and stodginess too.Dialogue isn't a strong suit either, there are many times where it's thought-provoking and poignant, but too much of it also consists of confused and at times illogical science (the time and space stuff was convoluted sometimes), forced sentiment and things being over-explained and preachy. Matt Damon's character felt thrown in and not particularly necessary, also somewhat silly, while the ending is far too idealistic and too falsely pat.Overall, less than stellar and was expecting much better. This said, 'Interstellar' is often impressive and very beautiful (especially technically, though the central relationship was also beautifully realised). 6/10 Bethany Cox"},{"username":"Leofwine_draca","userUrl":"https://www.imdb.com/user/ur0482513","reviewLink":"https://www.imdb.com/review/rw3619081","warningSpoilers":true,"date":"14 January 2017","rate":"4","helpful":"38 out of 391 found this helpful.","title":"Another bloated, overrated space epic","content":"Another outer space film from Hollywood, this time directed by INCEPTION's Christopher Nolan. Thankfully it's better than the overrated GRAVITY, but INTERSTELLAR soon turns out to be overrated in turn. It seems that as soon as a film comes out these days with a half intelligent premise, critics and audiences lap it up and rate it as one of the best ever. INTERSTELLAR is far from that. It has plenty of interesting moments, but the overlong running time is padded and bloated with endless sentimentalism and extraneous characters.It also takes a heck of a lot of time for anything to actually happen. Matthew McConaughey is all earnestness as the protagonist and comes across as a dullard; Anne Hathaway's character is completely extraneous and lacking in charisma. Only old timers like John Lithgow and Michael Caine shine, although Wes Bentley is underutilised in his role. An unexpected appearance from Matt Damon is undoubtedly the story's highlight.For much of the running time this follows the template of a typical space adventure, but around the middle part of the film it starts to get weighed down with endless CGI effects and the whole end part of the production gets muddled and predictable in equal measure, coming across like a rip off of 2001: A SPACE ODYSSEY but not nearly as good."},{"username":"SnoopyStyle","userUrl":"https://www.imdb.com/user/ur2898520","reviewLink":"https://www.imdb.com/review/rw3264860","warningSpoilers":false,"date":"25 June 2015","rate":"7","helpful":"15 out of 85 found this helpful.","title":"some problems but a few great touches of 2001","content":"In the near future, Earth is devastated by blight where corn is the only surviving crop. Joseph Cooper (Matthew McConaughey) is a former astronaut pilot who has turned to farming like everybody else. He and his daughter Murph find an underground NASA site run by Dr. John Brand (Michael Caine). Brand calculates that the blight will wipe out mankind in a generation. He is working on plans to save humanity after wormholes have been discovered leading to other worlds. Coop goes on a mission with Brand's daughter Dr. Amelia Brand (Anne Hathaway), Romilly and Doyle. However the mission runs into problems of relativity and sabotage. Meanwhile Murph (Jessica Chastain) grows up and tries to finish the calculations by Brand.I have problems with the setup to this movie. The idea that everybody needs to turn into farmers seems laughable. There are all kinds of problems with the start. The blight seems to be a catch-all for Nolan to use as a tool to explain away whatever he needs. It's inelegant and clunky. Apparently, science is not necessary anymore in this world. It's not like this dystopian world has run out of oil. A lot of it seems unlikely.Once McConaughey goes up into space, the movie gets better. It has touches of 2001 but generally, it is more like 2010. There are still some problems with unlikely human reactions. The whole conflict between Tom and Murph seems overblown. It's trying to up the drama without setting it up properly. I like McConaughey's side of the story. I would have preferred to stay mostly with him and lose some of Chastain's. I'm afraid the time relativity ideas may be lost on some of the audience. Even the best parts of the movie do have some nagging questions. It is still an awesome movie despite its problems. Although, I thought he might turn into a space baby at the end."},{"username":"Hitchcoc","userUrl":"https://www.imdb.com/user/ur0278527","reviewLink":"https://www.imdb.com/review/rw3261047","warningSpoilers":false,"date":"19 June 2015","rate":"7","helpful":"16 out of 90 found this helpful.","title":"Intellectual, Although Sometimes Flawed Science Fiction","content":"I'm treading on some little used ground. From reading previous user comments, it seems that people give this movie a ten or a one (really?!). While this movie is, at times, a little confusing in the implications of time and space, it is still quite challenging and interesting. Earth is dying. Technology and war are blamed for the current conditions. Apparently, because of some serious dust, crops are slowly being destroyed. Also, the dust presents health hazards. The solution is to find a way to get people to a new place...or...to let the chips fall and send a few into space to inhabit a new planet or asteroid or moon or whatever, and start the whole thing over. A group of people who have maintained NASA (which is now seen as the deceivers of mankind) are building ships to explore the possibilities. The problem has to do with a limited time to manage this because of the laws of relativity. I thought it sort of devolved in a kind of sentimental mess, but the presentation of the problem is worth a viewing. There is some preachiness here which I find a bit hard to take, and a couple stated lessons that an eighth grader would know, let alone these experts. But it did keep my interest. One short criticism: It is way too long."},{"username":"Horst_In_Translation","userUrl":"https://www.imdb.com/user/ur3914439","reviewLink":"https://www.imdb.com/review/rw3147970","warningSpoilers":true,"date":"25 December 2014","rate":"8","helpful":"45 out of 60 found this helpful.","title":"Maybe the most spectacular movie of 2014 and one of the best","content":"To this day , many people still talk a lot about Christopher Nolan's \"Batman\"-trilogy, but here is his newest work: \"Interstellar\". He gets help from Michael Caine and Anne Hathaway again and a couple more familiar faces. One year after Cuarón with Gravity, he discovers the endless widths of space as well. The difference, however is that a large part of his movie, including the first 40 minutes or so completely, plays down on Planet Earth. However, it is also about survival in space, including two people instead of one though. Or you could probably say the whole human race and not one individual fate.This is like our generation's \"Armageddon\", only that it is much better and much more edge-of-the-seat. The lead character is played by Matthew McConaughey, whose career is still on a massive high after numerous critically lauded performances and an Academy Award win. \"Interstellar\" is much more than Sci-Fi though. I personally found the film was at its best when it touched more the emotional relationships of the characters. The water planet sequence was incredibly well done. And right afterward, when Cooper (McConaughey) sees how his beloved family has aged and become parents, it is truly moving as well. I had a lump in my throat just like I did when he meets his very old daughter at the end of the movie. The inclusions with the old people telling about the past seem a bit odd at first, but make sense towards the end as we find out who is speaking there really.Then, I also had a love-hate relationship with the Matt Damon parts. I found it pretty boring to be honest initially, but when we found out about his true intentions, it quickly turns into one of the best parts of the film. Nicely done. When Caine's character mentioned him with high praise early on, I felt there could be something fishy (like with Pixar's Up) there and yes it was. The ending of the movie with Hathaway's character completely alone out there made me think maybe there will be a sequel. Saving Private... ehh I mean Dr. Brand. Who knows? The time during which the whole film plays is also interesting. Somehow, the NASA lost a lot of their reputation and the moon landing is called fake in American school books. It is some point in the future. That much we know. David Oyelowo plays a small role here as one of the teachers. He has \"Selma\" in the race for an Academy Award nomination this year.The ending of the film was not among the best scenes in my opinion, but I still liked it. The whole ghost explanation about Cooper being actually the one giving the signs was pretty exciting. The effects are brilliant of course, but that does not really need be mentioned for Nolan movies. A given. Hans Zimmer did a good soundtrack and there is also some comic relief coming from McConaughey's charm (if you like that) and some droll robot creatures. Anyway, I found the film interesting enough that I found it a bit sad they did not get to visit the third planet (with Hathaway's character's lover), only the water planet and the ice planet. I'd have loved to see that. However, maybe that could be a nice inclusion for a sequel as well. The movie never dragged despite coming pretty close to the three-hour mark. It could have run for another hour and I probably would not have been bored. There really was hardly anything wrong with it. Affleck's character did not do too much for me. He wasn't particularly well-acted and the character felt just included as a simple man who quickly gave up on his dad in order to show the contrast compared to Chastain's character: the ambitious loving smart daughter with a true connection to Cooper. John Lithgow plays a small role too and is fun to watch as always.This is one of the movies I really recommend to watch, preferably on the big screen due to its sensational visual aspects. It's also good for a rewatch I believe, also to evaluate the characters' actions, especially Caine's for example. And the story of course. I believe, after one viewing, I am still far away from having understood everything that was going on, especially the scientific aspects. That however, does not hurt the viewing experience at all thanks to the film's great acting and emotional impact. If you are interested in space, you really have to see this too. It has distant planets, wormholes, black holes, spaceships and a lot more. Let me finish this review with two little snippets: First, the actress who played Murph as a child was the same that played Renesmee in the last two Twilight movies and, secondly, that fittingly Hathaway's character was called Amelia like the aviation pioneer Amelia Earhart. That can't be coincidence, can it? Especially with her last shot."},{"username":"bob the moo","userUrl":"https://www.imdb.com/user/ur1002035","reviewLink":"https://www.imdb.com/review/rw3280147","warningSpoilers":false,"date":"19 July 2015","rate":"","helpful":"16 out of 49 found this helpful.","title":"It doesn't all work, but it is beautiful in its efforts","content":"I'd heard fairly mixed things about this film, and often heard praise for elements that I think one shouldn't lead with, so I did put off seeing it until very recently. The reason for this mixed reaction I guess if that it is a very mixed bag of a film, and I can see why people love it, hate it, and a bit of both. The plot sees a series of unexplained events bringing a farmer and former pilot into a group looking to save humanity from the earth, which is currently killing itself and threatening to take mankind with it. Looking to the stars, in particular a black hole which seems to have been placed nearby to allow for travel to much more distant worlds, he learns of previous missions to scout out other planets on the other side, and that he is needed to lead a mission to follow up the promising leads, leaving his family behind potentially forever.To get it out of the way, there is a lot not to like about the film. It runs very long, and at some points this almost seems deliberate – like it has to be a certain length to be able to be called an epic. It also has variable pacing and plotting across this time, with some elements not making logical sense without even having to nitpick on technical details. However, while it doesn't all come together, the film is no less beautiful for what it does while it is trying to do it all. The visual effects are stunning, with believable space travel and worlds created, to the point that although a lot of it is technobabble, you do tend to go along with it and accept everything being laid out. Just as important as the technical, visionary stuff, is that the film has a very human heart throughout. It is surprisingly emotional, even when in the context of pure sci-fi elements; you do tend to buy characters as people, with their flaws, their pain, their motivations – it is surprising how strong the film is in this regard.Part of this working is that the performances are universally strong, although to just pick one – Mathew McConaughey is really great throughout. His down-to-earth elements bring the viewer into the film, while he completely nails the emotional content, which again helps convince us of the reality of the situation and passage of time – because we see how it hits his character, so it must be real. The director marshals all this in a feast for the eyes, heart, and brain – it doesn't all work, like I say, and it is far from being the perfect, flawless film that some would suggest, but it is engaging, thoughtful, heartfelt, and very well made."},{"username":"nogodnomasters","userUrl":"https://www.imdb.com/user/ur77881167","reviewLink":"https://www.imdb.com/review/rw4456506","warningSpoilers":true,"date":"13 November 2018","rate":"7","helpful":"7 out of 37 found this helpful.","title":"START PULLING YOUR WEIGHT","content":"Matthew McConaughey portrays Cooper, a former near astronaut only a daughter (Mackenzie Foy/Jessica Chastain) could love. The Earth is dying from...well it is dying so the government rewrites history books to make the space program fictional, apparently attempting to appease right wing audiences and alienate left wingers...but wait, that's just a bad hook.Based on lines in the dust in the library, Cooper discovers a top secret NASA location near his house (built on \"magnetic ore\" ) in farm country. It seems somebody has deliberately placed a wormhole out in space near Saturn that leads us to another galaxy where there are some earth-like planets...maybe. Yes, in this near future world NASA has been able to solve suspended animation and create a ship to transport people to Saturn and beyond, start colonizing planets and be able to send signals back through the wormhole...but they can't green Mars.Now the science behind it is an extrapolation of what we know and believe theoretically, except for maybe that library scene which I found very very hard to swallow, but it was the climax of the film. It was needed to bring the film full circle. Many people will get lost in the science as they toss around terms. Yes, let's send a robot through the event horizon of the black hole so we can get the missing gravitational data we need to fill the gap in our anti-gravity quantum physics calculation...which we can immediately make into something to transport the human population. I had more problem with the practicality of applying the science then the science itself.They go to one planet landed on by Miller. They called it Miller's planet. Then they go to landed on by Mann, apparently it was a Mann's world too. Not to reveal more than the trailer, The question in the film is about how much would an individual sacrifice to save the species in the future. The underlying question screams about how we are killing the planet for the future, but are not willing to sacrifice anything in carbon emissions now. Yes, the theme of the film touches on the modern debate of Global Warming and the sacrifice asked of us to stop it and save the only planet we will ever live on for generations unborn.What are you willing to do to save the world for generations unborn?Worth while view for the science and Omni crowd...others do so at their own risk.Parental Guide: No sex or nudity. 2 F-bombs for the kids. Thank you Christopher Nolan"},{"username":"kosmasp","userUrl":"https://www.imdb.com/user/ur5876717","reviewLink":"https://www.imdb.com/review/rw3248454","warningSpoilers":false,"date":"31 May 2015","rate":"10","helpful":"149 out of 167 found this helpful.","title":"Out of this world","content":"A lot has been said and written about Interstellar. You can obviously take apart any movie that is out there. You'll either love this one or you won't. I kind of would have loved to have watched this on an IMAX screen, the sheer scope of the whole thing. It's just amazing, what Nolan has put on screen here. It's not only the visual experience (there is no 3D here by the way), it's the story/ride you take with it. It might be clear to some earlier than to others, where it's heading (no pun intended), but it doesn't change the fact that it's beautiful ... and terrifying at the same time.Going out and saying this will be considered a classic, might not be too far stretched, but you still can never predict those things. The deserved love the movie gets on IMDb and other places would be an indicator that this will ring true though. The acting is really good, but I can understand if some people have issues with the ending. But the movie had to end in one way or another. It's the best possible way this could go, even if it's not in our grasps just yet ..."},{"username":"classicsoncall","userUrl":"https://www.imdb.com/user/ur2707735","reviewLink":"https://www.imdb.com/review/rw3124610","warningSpoilers":true,"date":"15 November 2014","rate":"8","helpful":"29 out of 52 found this helpful.","title":"\"We're not meant to save the world, we're meant to leave it.\"","content":"Uh-oh, here I go again. The movie's out, what, a week or so as I write this, and IMDb voters have it ranked the 11th best movie of all time!!?? If there's justice in a rational world this would never happen. But it's not a rational world anymore now, is it, when an MIT professor can be found on tape explaining how the President's signature health care law was built on lies and deceit, and the media isn't even interested in covering the story.I could rant on but what's the point. I guess if your name is Nolan, any movie that comes out with the director's fingerprints on it will be hailed as monumental. I don't have a beef with Nolan personally, I think he makes some visually fantastic films (this is one to be sure), but most of the time I think the hype precedes the product and then everyone else falls in line singing the praises.Case in point - \"Interstellar\". Nominally a sci-fi thriller, the picture devolves into something of a time travel anomaly that leaves the viewer scratching their head when hero Cooper (Matthew McConaughey) finds himself on the wrong side of the bookshelves in one of the picture's pivotal moments. I'm sitting there thinking 'this is what I came to see the movie for'? I'm not even going to start on Coop's selection to save the planet just by showing up at Professor Brand's (Michael Caine) facility. Which by the way, didn't it start out as some shack in the desert? When we get a tour of the place, it's got NASA central looking like a global conglomerate.Speaking of which, how is it NASA's still around for this massive undertaking to repatriate all of Earth's citizens to another planet? Unless I'm mistaken, NASA's primary goal now is Muslim outreach and all the best and brightest brains have farmed out. My head is starting to hurt.It was a small theater crowd last night, and I usually don't do this, but since a gentleman ahead of me held the door as I filed out, I asked him what he thought of the movie. His exact words were \"That was a piece of excrement\", only he used the more colloquially popular term for excrement. I wouldn't go that far, but if one hour in the wormhole equals seven years of Earth time, you're going to get old real fast trying to understand this picture."},{"username":"gavin6942","userUrl":"https://www.imdb.com/user/ur1234929","reviewLink":"https://www.imdb.com/review/rw3170297","warningSpoilers":false,"date":"25 January 2015","rate":"9","helpful":"53 out of 68 found this helpful.","title":"Absolutely Brilliant","content":"A team of explorers travel through a wormhole in an attempt to ensure humanity's survival.Going into this I had mixed feelings because some have praised it, others have panned it, and some say it is good with reservations. There were allegedly issues with he sound in theaters, and any number of other issues. Then, when we get to the Oscars, the film gets nominations in the technical fields but not in the top honors.This was wrong. Maybe this is not the best role from Matthew McConaughey or Anne Hathaway. Though, the fact that a \"Hathaway hater\" like myself enjoyed it should say something. And I think Jessica Chastain should have received a Best Supporting nomination. She easily outshines Laura Dern in \"Wild\".This may be the greatest ever film about physics."},{"username":"jboothmillard","userUrl":"https://www.imdb.com/user/ur4248714","reviewLink":"https://www.imdb.com/review/rw3139652","warningSpoilers":true,"date":"11 December 2014","rate":"7","helpful":"11 out of 58 found this helpful.","title":"Interstellar","content":"I saw the poster for this film long before its release, and it was billed to be a big blockbuster, the success of space movie Gravity probably helped the hype, directed by Christopher Nolan (Memento, Insomnia, The Dark Knight, Inception). Basically, in the near future Earth is facing the extinction of the human race due to drought, famine and extreme climate change. Widowed former science engineer and NASA pilot Cooper (Matthew McConaughey) runs a farm with his father-in-law Donald (John Lithgow) and lives with teenage son Tom (Timothée Chalamet) and ten year old daughter Murphy \"Murph\" (The Twilight Saga: Breaking Dawn's Mackenzie Foy), she believes her room is haunted, the \"ghost\" she and Cooper discover is communicating through gravitational waves, leaving binary coordinates in dust. These coordinates direct Cooper to a secret NASA installation led by Professor John Brand (Sir Michael Caine), there may be hope for the human race to survive; a wormhole, created by alien intelligence, discovered in the further reaches of the solar system, leading to another galaxy, surrounding the black hole Gargantua three potentially habitable worlds have been identified, named Miller, Edmunds, and Mann, after scientists who surveyed them. Cooper is recruited to pilot the spacecraft Endurance to explore these planets, if one of them can sustain life then humanity will follow in space stations, but this means he will be away from home for many years, but this mission is important, Murph is devastated by his departure, they part on bad terms. On Endurance, Cooper is joined by Brand's biologist daughter Amelia (Anne Hathaway), scientists Romilly (Cloud Atlas's David Gyasi) and Doyle (American Beauty's Wes Bentley), and robots TARS (voiced by The Grinch's Bill Irwin) and CASE (voiced by Josh Stewart), the scientists go into hibernation while the craft travels towards the black hole, once close they awake and try to withstand the turbulent effects. The first head to planet Miller, but it being so close to Gargantua means it experiences severe gravitational time dilation: every hour on the surface is seven years on Earth, it is inhospitable, being covered by shallow ocean that experiences enormous tidal waves, Amelia tries to recover data, but Doyle is killed and departure is delayed, returning to the shuttle Cooper and Amelia find 23 years has passed. Back on Earth, adult Murph (Zero Dark Thirty's Jessica Chastain) is now a NASA scientist assisting Brand with his equation to enable NASA to launch the massive space station, near death Brand admits he already solved the problem and determined it is an impossible project, he covered this up and put faith in \"Plan B\": using fertilised embryos to start humanity anew, however Murph says the equation could work with additional data from a black hole's singularity. The Endurance only has enough fuel to visit one more planet, after a tense vote they decide Mann is best, however landing they find it is icy and inhospitable, they do however find Dr. Mann (Matt Damon) in hibernation, awoken he tells everything he knows about the mission, he knew \"Plan B\" was the true goal, he faked data to be rescued. In a moment of madness Mann breaks Cooper's spacesuit visor and leaves him to die, fleeing to Endurance on a shuttle, Romilly is killed by a bomb Mann planted, Amelia rescues Cooper and they get to Endurance, just as Mann docks improperly and causes the airlock to explode, serious damage is caused, but Cooper gets Endurance under control using the shuttle. Nearly out of fuel Cooper and Amelia plan to slingshot Endurance around Gargantua towards Edmunds, Cooper sacrifices himself with TARS to collect data on the singularity, detaching into the black hole and propelling Amelia by dropping the ship's mass, Cooper and TARS enter an extra-dimensional \"tesseract\", where time appears as a spatial dimension and portals show glimpses of Murph's childhood bedroom at various times. Cooper realises the alien beings may be human from the future who have constructed this space for him to communicate with Murph and save humanity, the coordinates from previously were in fact Cooper himself, finding adult Murph in the \"tesseract\" he uses gravitational waves to encode TARS's data on the singularity into Murph's watch, with this she solves Brand's equation and the process of evacuating Earth begins, the \"tesseract\" is closed and Cooper ejected from Gargantua back into the Solar System near Saturn. Time dilation from the entire mission means that humans have evolved to become an advanced space faring race, Cooper is found by a space police vehicle before his oxygen level drops, he wakes on-board \"Cooper's Station\", he explores the alternative world, and he reunites with elderly Murph (The Exorcist's Ellen Burstyn) who led the exodus of humanity, she advises Cooper and TARS to search for Amelia, who has begun preparation on the planet Edmunds. Also starring Casey Affleck as adult Tom Cooper, Spider-Man 3's Topher Grace as Getty, The Last King of Scotland's David Oyelowo as School Principal and William Devane as Williams. McConaughey holds it together well as the forthright pilot into space, Hathaway is good being informative, Chastain does well as the angry but important daughter, Damon is a welcome surprise, and Caine gets his moments as the wild old man. The majority of the film has similar scale and vision to 2001: A Space Odyssey, utilising fantastic special effects for spectacular visuals and extra-terrestrial worlds, I can see elements of Silent Running as well, it does get soppy towards the end with a concept like Contact (coincidentally also starring McConaughey), but overall it is a majestic space film with plenty to offer, including heart, a worthwhile science-fiction adventure. It won the Oscar for Best Visual Effects, and it was nominated for Best Music, Original Score for Hans Zimmer, Best Sound Mixing, Best Sound Editing, and Best Production Design, it won the BAFTA for Best Special Visual Effects, and it was nominated for Best Cinematography, Best Original Music, and Best Production Design, and it was nominated the Golden Globe for Best Original Score. Very good!"},{"username":"Tweekums","userUrl":"https://www.imdb.com/user/ur13977076","reviewLink":"https://www.imdb.com/review/rw3403922","warningSpoilers":true,"date":"27 January 2016","rate":"9","helpful":"23 out of 29 found this helpful.","title":"A journey across the galaxy to save humanity","content":"Set in a future where crop species are going extinct one after another former test pilot Joseph Cooper is now a farmer growing corn. His daughter Murphey thinks there is a ghost in her room; Cooper doesn't believe in ghosts but accepts that something is there when the dust on the floor is a set of coordinates in binary form. He goes to that location and finds himself at a NASA base where he learns of a secret programme to find another habitable world involving a wormhole discovered near Saturn. He is asked to take part in a mission to find the best planet out of three orbiting a black hole; each of which has a scientist who went on a one way mission sending data back. The plan is to find a world to transfer humanity to but if that is impossible there is a back-up plan for the crew to raise the 5000 embryos stored aboard their ship. Time is an issue as it moves at a different rate near the black hole; this means that as hours pass for Cooper years are passing back on Earth.This film starts at a gentle pace gradually explaining what has happened to the Earth before getting the mission to save the world started; this means the separation of Cooper and Murphey is more emotional. Once the mission is underway there is plenty of tension, including some particularly gripping moments on the second planet they visit. The small cast does a fine job; especially Matthew McConaughey, who plays Cooper; Anne Hathaway, who plays Amelia Brand a scientist aboard the mission; and Mackenzie Foy and Jessica Chastain, who play the younger and older Murphey. The effects looked great, as one would expect in a film from Christopher Nolan, and I was pleased that space was depicted as silent; something that is both scientifically correct but also more impressive. Things do get a little confusing near the end but in a way that made me want to watch again rather than causing frustration.Overall I'd recommend this to somebody looking for intelligent science fiction in the mould of '2001 – A Space Odyssey' although this has more emotion to it than that classic."},{"username":"paul_haakonsen","userUrl":"https://www.imdb.com/user/ur22654354","reviewLink":"https://www.imdb.com/review/rw3382139","warningSpoilers":false,"date":"28 December 2015","rate":"6","helpful":"10 out of 35 found this helpful.","title":"Great up towards the end...","content":"I finally got around to watching \"Interstellar\" after having been told how good and fantastic this movie was by several people. I will agree with them for the most parts. It is a beautiful movie and it has a captivating storyline. Well, right up to the point where Cooper went into the Black hole. Then it just turned ludicrous.However, from the way I had been told about the story in \"Interstellar\" I had expected a bit more from it. I found it to be a bit too brisk in getting past most of the events that took place throughout the course of the movie.The effects in the movie were really good and came off as being believable, which really worked in favor of the movie, obviously. And the acting was also quite good, even with Matt Damon in it.There are some interesting elements in the storyline, I just wish that Nolan would have put more emphasis on the science and theoretical aspects of the movie's storyline; in regards of black holes, wormholes, relativity theory, etc.All in all, an enjoyable movie for sure, but for me it just wasn't as grand and epic as most people had made it out to be."},{"username":"BA_Harrison","userUrl":"https://www.imdb.com/user/ur0945066","reviewLink":"https://www.imdb.com/review/rw3121497","warningSpoilers":true,"date":"10 November 2014","rate":"7","helpful":"37 out of 94 found this helpful.","title":"Disappears up its own black hole.","content":"As directed by Christopher Nolan, he of the pretentious, derivative, mind-bending crap-fest that was Inception and the vastly over-rated Dark Knight trilogy, I fully expected Interstellar to have plot holes you could pilot a space station through—and, with a whopping running time of 169 minutes, I figured staying awake would be a task almost as gargantuan as the film's black hole (which is actually called Gargantua—that's just how gargantuan it is!!!).Sure enough, the preposterous pseudo-scientific plot can be picked apart with ease, but the film itself is something of an anomaly: although it is a grossly indulgent pile of pretentious hooey that stretches plausibility to breaking point, I found myself entertained throughout. Interstellar is so far up itself that it actually transcends all the laws of cinema and proves to be a rather enjoyable piece of big-budget baloney as a result.For starters, we get Matthew McConaughey's farmer Cooper, who is chosen to pilot NASA's only spacecraft, despite having spent the last decade or so growing corn. Then we get two of science-fiction's most aesthetically awkward robots in the form of A.I. units TARS and CASE. After flying through a worm-hole, Cooper lands his spacecraft in several inches of water and then surfs a massive tidal wave. We see a planet so cold that its clouds are solid ice. We have a mad scientist who rants about the human instinct for survival while head butting Cooper with his space helmet. Although Michael Caine's character spans 23 years, he doesn't look a day older than when we first see him (his voice just gets a bit hoarse, but not Batman hoarse). And Cooper enters a black hole where he ends up behind a 5-dimensional bookcase that allows him to manipulate gravity to send a message to his daughter via wristwatch!!!And that's just the stuff I can recall right now (it's waaay past my bed-time and I'm very tired).If only there had been a few ninjas, some gratuitous female nudity (perhaps a race of insatiable, sexy alien maidens with over-sized breasts), a planet of space zombies, and a laser battle, this would have been the perfect so-bad-it's-good movie.7/10: it's too wonderfully silly for me too hate on it as much as I really should."},{"username":"TxMike","userUrl":"https://www.imdb.com/user/ur0438066","reviewLink":"https://www.imdb.com/review/rw3213700","warningSpoilers":true,"date":"3 April 2015","rate":"","helpful":"7 out of 17 found this helpful.","title":"This is my kind of movie, Sci-Fi with a good story and lots of action.","content":"I am a Scientist, and I have always been fascinated with travel into space, ever since I looked up in the 1950s with my dad and spotted the Russian Sputnik satellite overhead in the night sky. This movie, \"Interstellar\", is my kind of movie. I saw it at home on Blu-Ray.As one would expect for this type of movie the picture and sound are both superb, and many times the deep, rumbling bass rattled the fireplace grill and the framed posters on my wall. It is long, at 2 hours and 45 minutes to the closing credits, but every minute was attention-grabbing. I will watch it again.The setting is the future, not too distant, and Matthew McConaughey is former Astronaut Cooper, now a corn farmer. Where he lives are recurring giant dust storms, a barometer of how close the planet Earth is to no longer being able to support human life. Everyone is worried but also busy surviving.Cooper also has a bright 10-yr-old daughter and together they make sense of some strange happenings in her bedroom, books falling off the shelves, dust making patterns, they figure out some coordinates that take them to the top secret location of the remaining NASA headquarters. In secret they have been developing a space ship capable of going to the outer reaches of the Solar system to encounter a wormhole, they think put there by intelligent beings, to allow passage into a distant system that may have planets that can support human life. Cooper is needed as pilot for the mission, not knowing if he will ever return to his family.One of the scientists making the trip is Anne Hathaway as Brand, daughter of the old scientist leading the project. Plus several others. There is an intelligent robot with Bill Irwin as the voice of TARS. (As an aside, Irwin had a recurring role on the old TV series 'Northern Exposure' and his presence here brought back fond memories.)So the whole story gets pretty complicated and cannot always follow good science. Still it is extremely well presented, with a totally novel ending. Writer/director Nolan borrows from his \"Inception\" bag of tricks, when every hour on a planet near a black hole is like 7 years back home, so everyone on Earth ages far ahead of the crew. Really, really good movie.SPOILERS: (For my own recollection.) In the end Cooper and his ship are being sucked into a black hole, the ship is being ripped apart, he ejects and, instead of being consumed he ends up in a type of matrix behind the walls and bookshelves of his daughter's room, he can see her, he realizes it was actually him who those years earlier had given her the signals. Forward to a few years later, he is on an orbiting sanctuary, while he contemplates joining Brand now on a new planet trying to colonize it."},{"username":"tavm","userUrl":"https://www.imdb.com/user/ur11228318","reviewLink":"https://www.imdb.com/review/rw3134080","warningSpoilers":false,"date":"1 December 2014","rate":"9","helpful":"25 out of 39 found this helpful.","title":"Interstellar is quite an intriguing space movie requiring some attention to the narrative","content":"Just watched this on IMAX with my movie theatre-working friend who had seen this before. It has Matthew McConaughey and Anne Hathaway going to space and seeking possible livable planets for places to move the earth people when that planet becomes uninhabitable. Christopher Nolan directs quite a long but mostly intriguing tale of how long this journey lasts and the effect on McConaughey's offspring when they grow up without having him around during those times. I have to admit that part of me was ready to sleep during some scenes but something exciting does always come up and it gets a little better as the narrative keeps on going. So on that note, Interstellar is very much worth seeing if you're patient enough to watch quite a long movie requiring you to think."},{"username":"Gordon-11","userUrl":"https://www.imdb.com/user/ur0035842","reviewLink":"https://www.imdb.com/review/rw3118303","warningSpoilers":false,"date":"6 November 2014","rate":"","helpful":"12 out of 18 found this helpful.","title":"Emotionally captivating and intellectually challenging","content":"This film tells the story of an ex-pilot in a world full of dust storms. He is chosen to travel to the uncharted parts of the space in search for a new habitable planet.\"Interstellar\" is a long film, and the first two hours of it does not seem like a typical Christopher Nolan film. Most of the scenes are (literally) down to Earth, with no fancy visual effects. It spends much time building up the story, telling the story of a father and his daughter who sees 'ghost' in her bedroom. Through this ghost, one thing led to another, and the man is in space. When the film is not down on Earth, it looks more like a disaster film. The first adventure is a spectacular feat involving water. It also introduces the physics of relativity, on how time slows down in another world, leading to a misguided decision of the astronauts in retrospect. This sets the foundation for future plot involving more relativity.As the film progresses, there is more adventure, both in the form of adrenaline pumping adventure and humanity and integrity testing conditions. Matt Damon's character forms a central subplot that makes me reflect on what lengths would people go in order to achieve a certain goal. It reflects on the reality that people are driven by egocentric instincts. It is not a pretty truth, but it tells that human are not idealistic creatures.The final half an hour is what a typical Christopher Nolan film is like. It makes me hold my breath because it is so intense, both emotionally and cognitively. The ending gives me inexplicable exhilaration. Things come to a full circle, and it is filled with joy.It is not a film for everyone, as the story is long and takes a lot of time to build. Two people walked out of the cinema an hour into the film, and someone sitting behind me remarked after the film ended that he opined it was the most boring Christopher Nolan film ever. For me, I enjoyed \"Interstellar\" thoroughly, because it is emotionally captivating and intellectually challenging."},{"username":"michaelRokeefe","userUrl":"https://www.imdb.com/user/ur0449021","reviewLink":"https://www.imdb.com/review/rw3119754","warningSpoilers":true,"date":"8 November 2014","rate":"9","helpful":"21 out of 36 found this helpful.","title":"Absolutely thrilling! A can't miss movie!","content":"Christopher Nolan directs an enthralling space odyssey, co-written with his brother Jonathan. This movie lives up to the hype and is one not to be missed. The earth is chocking as it is a starving Dirt Bowl. The future is dim as farmers are producing less and less to feed the population. Cooper(Matthew McConaughey)is a former test pilot and widower raising two children, fifteen year old Tom(Timothee Chalamet) and ten year old Murph(Mackenzie Foy), who is suspended from school for fighting. She refuses to believe the school books being right, saying the Apollo missions were faked in order to bankrupt Russia's space program.Cooper and daughter stumble across the remnants of the believed to be defunct NASA, where Professor Brand(Michael Caine) convinces Cooper he is the only one to command a mission to be launched into space in search of a new planet that can sustain life. The flight must enter a wormhole that will warp time, but allow a crew to rescue data from explorers, who preceded them. A member of Cooper's mission is Brand's daughter(Anne Hathaway). Deep on the mind of Cooper's daughter is the fact that if and when her father makes it back to earth, he will be the same age or older than her due to the time warp.No little green men, no aliens in sight. There are a couple of highly intelligent computerized robots, so to speak. Visually awesome and enhanced by Hans Zimmer's score. McConaughey seems driven and invested. Young Miss Foy is very watchable. And Jessica Chastain is excellent in the role of the adult Murph. Also in the cast: John Lithgow, Wes Bently, Matt Damon, William Devane, Casey Affleck and Ellen Burstyn. Plus the voices of Bill Irwin and Josh Stewart. INTERSTELLAR is stellar!"},{"username":"tedg","userUrl":"https://www.imdb.com/user/ur0643062","reviewLink":"https://www.imdb.com/review/rw3141428","warningSpoilers":true,"date":"14 December 2014","rate":"","helpful":"16 out of 30 found this helpful.","title":"Dissymmetries, sight","content":"The good news that we have the brothers reunited and again working on circular narrative. Again, we have a powerful narrative arc that shifts in unexpected and engages in expected ways.The device is hackneyed: messages from the future, but is handled deftly. Where it is clumsy, we are competently distracted by narrative and visual process. The love story that drives this is novel enough to not fall into one of the three formulas commonly used for 'love,' (despite McConaughey) or two for father-rescues-daughter. We have a chosen child who saves the world by supernatural intervention, but again, this doesn't distract. These accomplishments alone make this worth experiencing because many devices are used to reset our expectations from formulas. Some fail horribly and that keeps this film from my absolute essential viewing list; I'll get to those in a moment. But all that are under the control of the filmmaker are so well considered that they bear mention.Take, for example the visual setting. The story itself is about the folding of time, but in a subtle way. The time of the story is in the future, but the setting is in the past. We refer to the dustbowl. All the cars, buildings, clothes and verbal expressions are vaguely from that era. We never see a brand that would pin down the time.More powerfully, the film itself is made as a science fiction film would be in the 50s-60s, using notions and tropes from that era. The robot is from \"Forbidden Planet.\" The notion that a world-saving enterprise rests on the mathematical attempts of one man alone. That a vast enterprise is actually secret and located in one spot, with no suppliers. That construction of a spaceship requires welding sparks. That a heavy lift launch can occur in a building.Look at the computer screens. Nearly all are commandline interfaces. The switches and control panels are from the DEW line era. They haven't managed to use legacy fonts in the signage, but it looks like they avoided the most obvious: helvetica.Even the drone is a currently obsolete model. Underscoring all this is setting the film in Texas. Malick, and before him Bogdanovich, Hooper, Welles exploited the fact that Texas lives in two eras, sucking riches from the present while defining itself in some fictitious and better past.The film is also clearly in a future, after antiscience politicians have written technology out of the textbooks, denying the moon landing and forcing something named NASA underground. The ambiguity of time is conveyed subconsciously and works. I think they used some recorded interviews from the actual dustbowl era.But the flaw, the underlying decay in this film is in who they relied on for the science. They clearly separated the science of the adopted genre (noted above) from the science used in the actual extraterrestrial events. They chose renown physicist Kip Thorne as their authority.The man is an important scientist and reportedly very engaging. But the world of such scientists is divided between those who believe in the primary eminence of geometry and those who believe instead in ordered mechanics. This is a deep divide, highly polarized when the work gets going. Which is better for the problems at hand is irrelevant here. But which is better for cinematic depictions of encounters with the forces of the world well there is no contest and Noland chose unwisely. I may write about this. A good title may be the Carl Sagan effect.On other unrelated matters, some unresolved minor plot threads remain. The finished film exceeded the time budget for story-before-launch as it is, but we'd like to know what the reason for introducing the drone was and why it was important.A bit worse: In the film, we have a very hard won ability to send messages back in time, describing deep science from inside a black hole. I get that. But 'before' all those events, some other souls sent back messages and the physical artifact of the wormhole. Why not use that mechanism, unless the much-mentioned notion of the urges of love are essential to the bridge?"},{"username":"Theo Robertson","userUrl":"https://www.imdb.com/user/ur1532177","reviewLink":"https://www.imdb.com/review/rw3210792","warningSpoilers":true,"date":"29 March 2015","rate":"4","helpful":"28 out of 120 found this helpful.","title":"Worm-Holes ? What About Plot Holes ?","content":"One of my all time favourite novels is The Death Of Grass by the late John Christopher . Written in 1956 it tells off a virus that destroys the cereal crops of Asia , Africa and Europe plunging most of humanity in to famine . It was adapted by Cornel Wilde in a 1970 film called NO BLADE OF GRASS , a very bleak and hard hitting film but one that was also painfully disjointed and ultimately unsatisfying . That said the power of the premise is clear to see and one has high hopes it will be remade one day . Along comes Christopher Nolan a director so highly regarded that if he did a selfie on his I-phone then that clip would automatically find itself on the IMDb Top 250 film list and he takes the premise of The Death Of Grass as a plot device and manages to make a film far more unconvincing than Cornel Wilde's movie not t mention far more expensive As I said humanity is being starved in to extinction and live on a diet of corn . Being set in the American mid-West corn is obviously easy to come by but would this be true of other people living on other continents ? I'm not a farmer or a geologist but surely there's a good reason why some countries have a staple diet of wheat while other countries have a staple diet of rice ? Perhaps the countries that no longer can grow wheat now grow root vegetables as their staple diet ? I suppose you've got to join up the dots for yourself but it's rather annoying the way the rest of the world goes unmentioned almost as though the film makers have failed to think the scenario through properly . Especially later where mankind seems to be facing greater dangers from sand storms than famine Some other things the makers haven't thought through with the film In this near future world armies no longer exist ? A noble ideal perhaps but surely if a nation state exists so would an army if only to protect itself from other nation states ? It's official - everyone thinks the Moon landings were faked . I can see Nolan having a dig at creationism being taught in American schools but this ties in with another plot turn NASA still exists as a secretive organization ! Right so the government agency that sent men to the Moon and back exists as a real though somewhat underground organization and yet everyone thinks the Moon landings are faked ? Can't see the logic behind this . It also adds more confusion when ...NASA send the protagonists to a wormhole just off Jupiter . It's never revealed if these space journeys have US government approval but if not why would a government scrap standing armies and not totally shut down an agency that can send people to the ends of the solar system if you're going to teach conspiracy theories in school ? In reality it also be technically and monetary prohibitive for an agency to do this without government approval , Certainly internal logic and continuity is not the films strong point . It's also a film that's over long and contains an ending straight out of the more prentious episodes of SPACE 1999 This is a pity because it's more than competent on a technical level and I can see Nolan is trying to make an intelligent space epic that will try and grab the audiences attention and fire up their passion for real life science . Unfortunately he's left out the intelligence in crafting a drama and when this fails so does everything else"},{"username":"LeonLouisRicci","userUrl":"https://www.imdb.com/user/ur33374263","reviewLink":"https://www.imdb.com/review/rw3250483","warningSpoilers":false,"date":"3 June 2015","rate":"7","helpful":"3 out of 14 found this helpful.","title":"Sometimes Dull and Overwritten but Worth a \"Watch\"","content":"In this Film Director Christopher Nolan can't Decide if He wants to be Steven Spielberg or Stanley Kubrick. He doesn't have the Talent of either but is a Good Filmmaker at times. He was 2 for 3 with the \"Batman Trilogy\", \"Memento\" (2000) was Unique, and has done some other Fine Films. Here, Not so Much.The Overt and Heavy Handed Sentimentality was better Restrained in \"Contact\" (1997). The unnecessarily Complicated and Thick Script reminds of \"Inception\" (2010). It tends to Confuse more than impress.It seems, when Matthew Mcconaughey asked the Director for Motivation He was told to Whisper and Mumble. The other Stars that Show up are OK if Nothing Special, although when Matt Damon wakes it Provides the Film with one of the better Pieces of Space-Drama.There are a few Good Lines...\"Humanity was born on Earth but not meant to stay here.\" and \"We used to look up at the sky and wonder at our place in the stars, now we just look down and worry about are place in the dirt.\" But the Overwritten Science-Babble and Over-Complicated Plot seems to try and Impress those Viewers that Think that \"The 5th Dimension\" is a Singing Group.A few Interesting and Artistic Scenes that are Outstanding, like the \"Library\" are what makes the Film rise Above Mediocre. But there's a lot of Technological Stuff considering the Time Frame and Events that really are Strange and Bewildering. The Social behavior that got Humans to turn the Planet into a Dust-Bowl isn't Even Mentioned. Gravity, not the Movie, the other thing, is Mentioned Frequently. It's Worth a Watch but is mostly Disappointing and highly Derivative in both Style and Concept. Science-Fiction, Contrary to most Haters of this thing, does not have to Obey Current Knowledge. It can, and often does, come from Made Up Stuff from Creative Minds. Directors and Writers are Free to Explore anything They can Imagine. That's why it is called Science \"Fiction\". So No Problem there."},{"username":"preppy-3","userUrl":"https://www.imdb.com/user/ur0463200","reviewLink":"https://www.imdb.com/review/rw3123411","warningSpoilers":false,"date":"13 November 2014","rate":"1","helpful":"104 out of 331 found this helpful.","title":"Long, dull and WAY overpraised","content":"A simple farm guy named Copper (Matthew McConaughey) and a few other experts go into outer space to explore other worlds that might sustain human life. It seems that that life on Earth might not survive due to to some unexplained environmental disaster. Naturally nothing goes right.WAY overpraised and terrible sci-fi movie. When I heard the plot from this I expected the worst. Writer/director Christopher Nolan has never been a favorite for me--I HATE what he did to Batman in his movie trilogy. I thought that he as trying to imitate Stanley Kubrick (\"2001\") here but it's far worse--he's doing Steven Spielberg! The movie runs WAY too long (165 minutes) and they're constantly pushing family friendly values in your face. Cooper's non-stop yammering about his daughter got on my nerves instantly. Also that stupid fake southern accent he adopts is immediately annoying. The story is very slow and all the characters are cardboard cutouts you've seen in other movies. The special effects are flawless and there's some beautiful cinematography here but the extreme length and boring story really weigh it down. Any sort of statement they're trying to make on time and life is completely deadened by the script. Also this movie is very manipulative and way too sentimental. They go out of their way to make the audience cry--like at a Spielberg movie. Well I did cry--tears of joy at the end that this was over! Also the gaps in logic and plot holes here are very annoying. I lost track of how many times I rolled my eyes at the dubious \"logic\" served up here. The acting was as good as it could be (I guess) but, at the end, they throw in a surprise guest star (who I won't name). It didn't help because I think he's a terrible actor and this didn't change my mind. I was bored and looked at my watch MANY times while this played. It's boring, obvious and manipulative. Why is this getting so much praise? Skip it."},{"username":"writers_reign","userUrl":"https://www.imdb.com/user/ur2567136","reviewLink":"https://www.imdb.com/review/rw3119414","warningSpoilers":true,"date":"8 November 2014","rate":"6","helpful":"16 out of 44 found this helpful.","title":"Gone To Earth","content":"I'm probably not the target audience for the freres Nolan as I tend to notice things instead of being seduced. Take the opening. We're in East Jesus in the heart of the dust bowl. An ordinary family, a wooden home one step up from a tarpaper shack. Inside an equally ordinary kitchen THEN, in the bedroom of the daughter of the house, Murph, we find FLOOR-TO-CEILING BOOKSHELVES? Fully stocked. You're putting me on, right, Chris. More? Seems the father of Murph is an ex pilot who has retired to become a farmer. No real problem there BUT, he and Murph stumble on some co-ordinates and follow them to a top-secret NASA base where the head honcho is Professor Michael Caine. They show the intruder the latest space-ship, explain that earth is running out of food and the only solution is to find a planet that will sustain human life AND THEN invite him to lead the mission. This is a guy who hasn't flown in x amount of years and may or may not be in shape. There is no training programme, no vetting, the whole thing resembles a car salesman offering someone who walks in off the street a chance to test drive the latest top-of-the-range Lamborghini. If you can get past this nonsense you may well enjoy what follows. Unlike, say, Gravity, which was virtually one hundred per cent in space, Intersteller does introduce a human element and is all the better for it. Clearly the Nolans are interested in exploiting technology at the expense of constructing an even halfway plausible screenplay and there are probably enough overgrown schoolboys out there who will respond to cgi the way Pavlov's dog responded to a bell."},{"username":"zardoz-13","userUrl":"https://www.imdb.com/user/ur2079400","reviewLink":"https://www.imdb.com/review/rw3130772","warningSpoilers":true,"date":"25 November 2014","rate":"10","helpful":"30 out of 39 found this helpful.","title":"A Sci-Fi Masterpiece","content":"Hollywood science fiction spectacles about antagonistic aliens abandoning dying worlds to occupy not only Earth, but also to oust us have been popular with moviegoers. Typically, like the European explorers who invaded and disenfranchised millions in the Western Hemisphere during the 15th century, these extraterrestrials—either bug-eyed behemoths with lobster claws or pod people whose seeds have drifted across the cosmos—show up to evict or absorb us. \"Inception\" director Christopher Nolan's latest extravaganza \"Interstellar,\" toplining Matthew McConaughey, Anne Hathaway, Jessica Chastain, Michael Caine, and John Lithgow, is a superior space opera that reverses the action. Earthlings must abandon mother Earth because an environmental blight has devastated farming and millions have starved to death in overpopulated continents. No, \"Interstellar\" doesn't pit Earth against multi-colored \"Guardians of the Galaxy\" aliens or immaculate looking storm troopers in white outfits from the \"Star Wars\" and \"Hunger Games\" franchises. Instead, the \"Interstellar\" scientist heroes must search for a new home for humankind. Rather than an outlandish adventure epic with evil extraterrestrials, \"Interstellar\" qualifies as an intelligent, realistic, sometimes provocative, sci-fi saga similar to Stanley Kubrick's landmark movie \"2001: A Space Odyssey.\" Mind you, Nolan doesn't chronicle mankind's evolution from the dawn of time the way Kubrick did in as \"2001.\" The casts of \"Interstellar\" and \"2001: A Space Odyssey\" differ, too. Kubrick relied on an unknown cast, while \"Interstellar\" boasts a charismatic array of superstars. If you haven't seen \"2001: A Space Odyssey,\" you won't appreciate some of the clever allusions to the legendary 1968 film. Anybody who has seen \"2001\" will be amused by a joke that a robot makes about blowing an astronaut out of an airlock. Ultimately, the most obvious \"2001\" references in \"Interstellar\" are those bizarre, oblong, Minecraft-style robots that resemble the black monoliths in Kubrick's film. Some of the sci-fi terminology may fly over your head, but Christopher Nolan and his brother Jonathan concern themselves with more than speculative science fiction ideas. They focus on relevant contemporary themes, such as father & daughter relationships and the environment. They forge interesting characters with philosophical dialogue that you will ponder long after the movie. \"Interstellar\" occurs in the late 21st century, after things have waxed really wretched. Bad enough that farmers can grow only corn. Blight has destroyed wheat and okra. Public opinion about NASA has curdled. History textbooks have been rewritten. Everybody believes NASA faked the Apollo moon landings to bankrupt the Soviet Union. A former NASA test pilot, Cooper (Matthew McConaughey of \"Mud\"), has turned to farming and reaped rewards where many others have failed. Although his wife died from a brain cyst that an MRI could have detected had an MRI had been available, Cooper perseveres as a farmer and a father of two children, his fifteen-year old son Tom (Timothée Chalamet of \"Worse Friends\"), and his precious ten-year old daughter Murph (Mackenzie Foy of \"The Conjuring\") who adore him. Cooper and his kids live with his father-in-law, Donald (John Lithgow of \"Terms of Endearment\"), and they contend with tumultuous dust storms on a daily basis. These dust storms recall the Depression Era drought and dust storms of that prompted millions to flee from the plains states. Dust gets into everything, and Donald wages a never-ending war to keep everything clean. Meanwhile, books have been toppling randomly from Murph's bedroom bookcase. She suspects a ghost is responsible, but nothing ghoulish like \"Paranormal Activity.\" Naturally, Cooper dismisses the presence of ghosts. One day after a particularly turbulent dust storm, father and daughter examine the way the books have fallen out of the shelves, translate it into code, and come up with coordinates that lead them to a classified NORAD facility. A monolithic robot named Tars confronts them. Later, Murph and Cooper find themselves sitting around a table talking with high-ranking NASA officials. One of them is Professor Brand (Michael Caine of \"Batman Begins\"), and Brand confides in Cooper that the world is living on borrowed time. Moreover, he tells him about the 'Lazarus' project. NASA has dispatched manned missions to other parts of the galaxy to find a new home for mankind. He convinces Cooper to sign on as a pilot for one last launch that will take his daughter, biologist Amelia (Oscar winning actress Anne Hathaway of \"Les Misérables); physicist Romilly (David Gyasi); geographer Doyle (Wes Bentley of \"The Hunger Games\"); and two robots TARS (voice of Bill Irwin) and CASE (voice of Josh Stewart) deep into space to a recently discovered wormhole which will enable them to explore new worlds. Predictably, Murph isn't happy about her father's departure. During their flight to the wormhole, Cooper and company lose contact with Earth, but Professor Brand can still transmit messages. Gradually, however, things take a turn for the worst. The final quarter hour of \"Interstellar\" will absolutely boggle your mind. Cooper goes where no man has gone before in a desperate bid to save mankind! \"Interstellar\" is a serious sci-fi movie. The computer-generated visual effects are nothing short of dazzling, and Nolan orchestrates the flight sequences so we don't hear any sounds in the vacuum of outer space. The different spacecraft and the Endurance mother ship look as authentic as the outfits that our heroes wear. The strange but new worlds that they encounter during their search to locate a new Earth are breathtaking. One world consists of an eternal sea with towering waves that loom like mountain ranges, while another is as stark and icy as it is inhospitable. The theme of deception runs throughout \"Interstellar.\" The faked Apollo moon landing and Dr. Brand's mind-blowing revelation are a few surprises that will maintain your interest throughout \"Interstellar.\" Nolan generates several suspenseful set-pieces that will keep you poised on the edge of your seat. Matt Damon has a startling cameo as another astronaut who has succumbed to effects of isolation. Clocking in at 169 minutes, \"Interstellar\" amounts to an unforgettable epic with intense white-knuckled suspense, top-notch performances, and a terrific ending."}],"errorMessage":""}