{"imDbId":"tt1675434","title":"The Intouchables","fullTitle":"The Intouchables (2011)","type":"Movie","year":"2011","items":[{"username":"MartinHafer","userUrl":"https://www.imdb.com/user/ur2467618","reviewLink":"https://www.imdb.com/review/rw2768802","warningSpoilers":false,"date":"17 March 2013","rate":"8","helpful":"13 out of 23 found this helpful.","title":"Very nice acting.","content":"According to IMDb, \"The Intouchables\" set all sorts of box office records--the second most successful French film in history in France as well as the number one film for 2012 in Germany. So, because of this very impressive pedigree I was perhaps expecting a little more. Now this is NOT to say it's a bad film--it's wonderful. It just didn't seem quite THAT wonderful. But it IS well worth seeing.As for the plot, this movie is a true-life account of a quadriplegic man (François Cluzet) in search of a new aide. However, all the folks who apply for the job seem the same--boring and sterile. On an odd lark, he chooses an unqualified man who doesn't seem interested in the job at all (Omar Sy). And, oddly, they form a friendship that seems to reinforce the old adage that opposites attract.While the plot is amazingly thin and seems to be missing chunks of the story, the film is masterful in several ways. The acting (particularly by Sy) is just terrific. But even more terrific is the artistry of the film itself. It takes a somewhat ordinary story and injects it with class--including some wonderful cinematography and one of the nicest soundtracks I have ever heard. It is a lovely film."},{"username":"Michael_Elliott","userUrl":"https://www.imdb.com/user/ur13134536","reviewLink":"https://www.imdb.com/review/rw2654813","warningSpoilers":false,"date":"5 August 2012","rate":"","helpful":"4 out of 6 found this helpful.","title":"Marvelous Film with Two Great Performances","content":"The Intouchables (2011) **** (out of 4)Terrific comedy-drama from France about Philippe (Francois Cluzet), a rich man who was left paralyzed from the neck down after an accident and Driss (Omar Sy), a man from the ghetto who hasn't had much going on in his life until he gets the job of taking care of the handicapped man. THE INTOUCHABLES has been breaking box office records around the world but I decided to stay away from it because of some rather lukewarm reviews. I'm certainly glad the trailer kept telling me to go see it because no matter what the critics say, this here is a complete winner and it's easy to see why so many people have fallen in love with it. I'm really not sure why so many critics have bashed it for being a \"crowd winner\" or \"too happy\" because neither makes much sense. I thought the film was quite remarkable because the pre-credit sequence is just so touching and funny that you can't help but fall in love with these two characters and the journey of their friendship that follows was incredibly touching and best of all is that it felt real. A lot of credit has to go to the two leads who deliver remarkable performances and I'd be willing to bet that you're not going to see better from anyone the rest of the year. If so, more credit to whoever is better. Cluzet and Sy are simply so terrific in their roles that you really do feel as if you're watching real people with real issues. The way to two play off one another is so remarkable to watch that once you've seen it I don't see how you could forget them. Directors Olivier Nakache and Eric Toledano do a remarkable job balancing the comedy with the drama and in the end they really create such a special atmosphere that it's impossible not to get caught up with it. THE INTOUCHABLES is without question one of the best films of the year and hopefully the strong word of mouth from around the world will get more people to check it out."},{"username":"SnoopyStyle","userUrl":"https://www.imdb.com/user/ur2898520","reviewLink":"https://www.imdb.com/review/rw2864419","warningSpoilers":false,"date":"6 September 2013","rate":"6","helpful":"21 out of 111 found this helpful.","title":"8.5 Rating? Really?","content":"This is a feel-good French movie full of all the stereotypes based on a true story. I won't rate the real story. But how does it stand as a movie? Philippe is an aristocratic quadriplegic white millionaire living in Paris, and he's interviewing for a personal carer. Driss is an arrogant African who is only interviewing to get a signature for his social assistance form.The characters are truly stereotypes. On top of it all, I don't particularly like either characters. Philippe is uptight but his paralysis really restrict his acting. Driss is Arrogant Without Reason. Add a stereotypical large immigrant family, and you've got the standard street hustler.When Driss draws a painting, everybody is surprised. Why? I didn't know black people can't draw. Are the French really that racist and ignorant? The actual man this character is based on is a Muslim. That would have been a fascinating in-depth character rather than this simplistic caricature. There was one possible great moment. Driss stole a Fabergé egg from Philippe. When Philippe brings it up, there were many different ways it could have gone. The film chooses one of the least interesting. That's indicative of the whole movie. I don't hate the movie. I'm just ambivalent. Definitely no more than 6/10. It's insane that this is a 10 in anybody's rating."},{"username":"Prismark10","userUrl":"https://www.imdb.com/user/ur4569900","reviewLink":"https://www.imdb.com/review/rw4924004","warningSpoilers":false,"date":"9 June 2019","rate":"6","helpful":"3 out of 19 found this helpful.","title":"Chasing the clouds away","content":"I was surprised by Untouchable. I did not think that a French film about a wealthy quadriplegic and his black working class carer would be a comedy. Instead I thought the film would be bogged down with race, cultural and class issues.Francois Cluzet who looks a lot like former F1 world champion Nigel Mansell plays Phillipe. A wealthy widowed aristocrat living in a fabulous Parisian mansion paralyzed from the neck down in a paragliding accident. He needs round the clock care and none of them last long.Philippe meets Driss (Omar Sy) who is of Senegalese origin. He only attends the job interview to get a signature so he can get his unemployment benefits. Despite being a small time criminal, Philippe likes his irreverence and verve and employs him.Driss is physically strong but he also brings Philippe to life as he drives him around in one of Philippe's fast cars rather than his adapted disabled friendly van. Driss's lack of stuffiness is exactly what Philippe needed.Untouchable is a feel good buddy comedy of two men from different tracks of life who bond. It is really a simple story based on true facts, although the real life carer was a French Arab. It is an engaging enough film despite its stereotypes. There is a scene where Driss steals a Faberge egg that was given to Phillipe by his late wife.The film decided to go for the funk feel of Earth, Wind and Fire. It helps that both stars have an easy chemistry together."},{"username":"claudio_carvalho","userUrl":"https://www.imdb.com/user/ur2488512","reviewLink":"https://www.imdb.com/review/rw2734258","warningSpoilers":false,"date":"10 January 2013","rate":"9","helpful":"23 out of 32 found this helpful.","title":"Beautiful and Uplifting Story of Friendship","content":"In Paris, the aristocratic and intellectual Philippe (François Cluzet) is a quadriplegic millionaire that is interviewing candidates for the position of his caretaker with his red-haired secretary Magalie (Audrey Fleurot). Out of the blue, the rude African Driss (Omar Sy) cuts the line of candidates and brings a document from the Social Security and asks to Phillipe to sign it to prove that he is seeking a job position to receive his unemployment insurance.Philippe challenges Driss and offers a period of adaptation of one week to him to gain experience helping him. Then Driss would decide whether he would like to stay with him or not. Driss accepts the bet and moves to the mansion, changing the boring life of Phillipe and his employees. \"Intouchables\" is a beautiful and uplifting story of friendship based on a true story. My daughter had watched this movie a couple of months ago when she was traveling on vacation and recommended it a lot to me and yesterday I saw it on DVD.The screenplay is excellent and the directors and writers Olivier Nakache and Eric Toledano have a magnificent work. This theme in the hands of a weak director could transform the uplifting story into a corny or melodramatic movie. But they succeeded making a funny and touching comedy.The cast is also fantastic, and the chemistry between François Cluzet and Omar Sy is amazing. Anne Le Ny is also wonderful and Audrey Fleurot is a very beautiful woman and excellent actress in her ambiguous role luring Driss. In the end, I went to bed late but feeling good. My vote is nine.Title (Brazil): \"Intocáveis (\"Untouchables\")"},{"username":"bob the moo","userUrl":"https://www.imdb.com/user/ur1002035","reviewLink":"https://www.imdb.com/review/rw2916967","warningSpoilers":false,"date":"4 December 2013","rate":"","helpful":"6 out of 12 found this helpful.","title":"Shamelessly feel-good and sentimental but it works despite how simplistic it all is","content":"I'm not sure how I came to be watching this film; I had heard of it some time ago and added it to the queue without knowing too much about it other than it was successful in its home market. Supposedly based on a true story, the plot sees a rich quadriplegic employ a rather colorful young man to be his new live-in caretaker. We open the film with a flash-forward but quickly go back to the start of the relationship and quickly are let in on the ground floor regarding how this film will be. Basically Philippe is uptight and locked within himself mentally almost as much as physically, while Driss is carefree and very different from those in Philippe's world. Will the odd-couple become friends and perhaps benefit one another's lives somehow? Well, only time (and the genre) will tell.Of course this is pretty much what happens but you know this from the odd-couple comedy/drama feel that it has from the getgo and it is fairly shameless about doing it. There isn't really a depth to the film but rather a superficial but entertaining pace and plot. It feels cynical for the most part but yet somehow it works if you can get through some cringe-inducing \"heart-warming\" moments. A big part of it working is plain and simply the two actors in the lead roles. Neither gives a brilliant performance individually but together they have real chemistry and their banter and shared moments do have a certain genuine and intimate feel that is all down to the delivery. By themselves Cluzet is solid and Sy clowns it up for all he is worth, but yet both are quite charming and likable all the way to the end.Ultimately it is fairly shameless crowd-pleasing fare which airbrushes life into a series of fun set-pieces. It really never touches a real nerve but it is still enjoyable thanks to the warm tone and strong chemistry between the two leads."},{"username":"kosmasp","userUrl":"https://www.imdb.com/user/ur5876717","reviewLink":"https://www.imdb.com/review/rw2591352","warningSpoilers":false,"date":"3 April 2012","rate":"9","helpful":"16 out of 24 found this helpful.","title":"Best friends","content":"A comedy like that is tough to master. Balancing the funny and the dramatic stuff and still keep enough character development inside. And while I wouldn't say that both characters really redeem themselves (wholly), it gives them nice touches. Touches that include quite a lot of non-PC behavior (be alert and do not watch, if you are sensible to that sort of thing).It is a french comedy with heart. And it was a sleeper hit in Germany. Word of mouth made this a big success. A bit of credit has to go to the people who dubbed it I guess (I watched the original version with subtitles), because they must have done a phenomenal job. It is not perfect, but that fact makes it even weirder and more adorable"},{"username":"classicsoncall","userUrl":"https://www.imdb.com/user/ur2707735","reviewLink":"https://www.imdb.com/review/rw3065337","warningSpoilers":true,"date":"9 August 2014","rate":"8","helpful":"4 out of 5 found this helpful.","title":"\"Hope keeps us going.\"","content":"I didn't know what to expect with the odd sounding title, and I still don't know if it has any application to what occurs in the picture. However the story is a genuinely inspiring one of two individuals from widely disparate backgrounds who decide to give each other a chance. As the movie unfolds, one's own preconceived notions about having a handicap as severe as Philippe's (Francois Cluzet) are challenged. I found it fascinating when he explained that his real handicap was living without a wife rather than being a quadriplegic. I really had to stop and think about that. Omar Sy provides the film's energy with his indomitable spirit; his birthday party dance to Earth, Wind and Fire's 'Boogie Wonderland' was a trip and did a wonderful job of further breaking down barriers between himself and the upper crust acquaintances of Philippe. Had this not been based on a true story, I would have found it hard to believe coming from some writer's creative imagination. Which only further suggests that sometimes reality is truly stranger and more wonderful than fiction."},{"username":"lee_eisenberg","userUrl":"https://www.imdb.com/user/ur4888011","reviewLink":"https://www.imdb.com/review/rw3156627","warningSpoilers":false,"date":"5 January 2015","rate":"10","helpful":"3 out of 5 found this helpful.","title":"modern France","content":"Olivier Nakache's and Éric Toledano's \"Intouchables\" looks at the friendship between people of dissimilar backgrounds. Philippe (François Cluzet) is a paraplegic tycoon who hires African immigrant Driss (Omar Sy) to be his caretaker. That paragliding scene made me want to go paragliding.Beyond the obvious plot, I see the movie as a look at France's - and much of Europe's - growing diversity. Even if a person in France or Germany doesn't like immigrants, he's still bound to have exposure to them (much like how racist southerners in the US are going to have exposure to blacks whether they want it or not). Of course, most important is the different backgrounds that the men have: Philippe is a modern aristocrat, while Driss is from the ghetto. Both have something to teach each other.Anyway, it's a really good movie. I recommend it."},{"username":"gavin6942","userUrl":"https://www.imdb.com/user/ur1234929","reviewLink":"https://www.imdb.com/review/rw3122036","warningSpoilers":false,"date":"11 November 2014","rate":"7","helpful":"0 out of 7 found this helpful.","title":"A French Look At Race And Class","content":"After he becomes a quadriplegic from a paragliding accident, an aristocrat (François Cluzet) hires a young man from the projects (Omar Sy) to be his caretaker.The Independent called it a \"a third-rate buddy movie that hardly understands its own condescension....Why has the world flipped for this movie? Maybe it's the fantasy it spins on racial/social/cultural mores, much as Driving Miss Daisy did 20-odd years ago – uptight rich white employer learns to love through black employee's life-force. That was set in the segregationist America of the 1940s. What's this film's excuse?\" While \"the Independent\" is right to call out the film's unrealistic portrayals of race and class, perhaps it somewhat misses the point. This film is obviously humorous, clearly not based on reality, and is probably not meant to be taken seriously. The movie has very much the same spirit as \"The Birdcage\" (at least the American version, if not the French one).Now, this means the film also happens to be overrated, currently (November 2014) sitting high on IMDb's Top 250. A good comedy, yes, but not a film that offers any sort of deeper meaning or one that will remain important over the long term. While popular and a box office record holder, this is not a title one expects to be considered a \"classic\" later on."},{"username":"TxMike","userUrl":"https://www.imdb.com/user/ur0438066","reviewLink":"https://www.imdb.com/review/rw2820988","warningSpoilers":true,"date":"27 June 2013","rate":"","helpful":"3 out of 5 found this helpful.","title":"Very entertaining telling of a story based on real people.","content":"My wife doesn't watch foreign movies with English subtitles, so I had to go it alone. I know some French so it was easy to just glance at the subtitles to understand the conversations. On DVD from my public library.This is a superb movie based on real people. It is a serious subject, a wealthy quadriplegic otherwise in the prime of his life, victim of a para-sailing accident. But it is done with such style, hopefully reflecting the real person, that it is constantly interesting and entertaining.Established French film star François Cluzet (I call him the French Dustin Hoffman, for his looks and acting style) is Philippe, very wealthy and living in Paris, but only able to move above the neck. He has nurses and other attendants, but as the story opens he is interviewing hard men for the job of personal caretaker, someone able to help him take showers, get dressed, move him to and from his wheelchair, drive him places, things like that. Tall, strong, and very dark, Omar Sy is Driss, a smart and capable young man who has had a hard life growing up and now knocking around as an adult. He is at the interview just for one reason, he has to have proof he is looking for work to collect government assistance. But he doesn't really want the job, he does nothing to endear himself. But just as hospital roommates Edward and Carter hit it off in 2007's \"Bucket List\", Philippe and Driss seem to need each other. Driss gets hired, to his own surprise, and the arrangement works out famously.What makes it work as a relationship, and as a movie, Driss never takes pity on Philippe, nor does he let him drift into self-pity. He makes jokes, in good taste, about Philippe's inability to move. In one scene, Driss has a letter for Philippe, and puts in on his chest. After smiling and watching in twitch for a few seconds, Driss says \"OH, you can't move your arms. Let me open it for you.\"There is even a scene where, after flying to the Alps by private jet, Philippe and Driss have a session to go paragliding, of course strapped in with experienced men. Then, as the movie ends we get a short glimpse of the real men, still good friends.Good movie!"},{"username":"Quinoa1984","userUrl":"https://www.imdb.com/user/ur0453068","reviewLink":"https://www.imdb.com/review/rw3349494","warningSpoilers":false,"date":"5 November 2015","rate":"6","helpful":"4 out of 14 found this helpful.","title":"it's hearts in the right place and never bad, it's just too... safe for me","content":"I don't doubt the reasons that people have given for liking very much/loving this film to the point where it became one of France's biggest hits in years and then, not surprising in the least, became a Weinstein Company release in the USA. The Intouchables is the epitome of a \"feel-good\" buddy movie, the kind of movie starring a big black dude that you can show your 90 year old grandmother and she'll take a liking to it as well (unless they have an aversion to, say, pot or Faberge eggs). It's the case of a movie with the kindest, inherently liberal message there is: a man from the projects lucks into a job (via Earth, Wind & Fire and Kool and the Gang as his 'references' at a brief interview), and it's taking care of a very rich man who is a quadriplegic. Over the course of this story they'll grow and become best friends and while the rich white guy can learn to relax a little more, smoke some weed (no, really) and listen to that Kool & the Gang, the dude from the projects gets some Vivaldi, makes an abstract painting that sells for 11 grand, and goes paragliding.Other stuff happens as well, but suffice it to say there's no surprises in this movie. That may not be an issue for most out there. For me, as the movie went along, it was just a little too... safe. That may be a word that doesn't really give much critical credence to what's here, and to be fair the actors really help to ground it in a number of scenes. Francois Cluzet and Omar Sy keep things at a good, even keel as far as making the material work for their equal levels of charm and (sometimes) dismay. Sy especially shows that he can take what could have been a super-typical \"magical negro\" stereotype and not let us forget he's from a slightly less educated background (and a little rougher - see his comments about the rich man's adopted daughter when she mouths off). So on the acting front it's perfectly fine and in the first half I was interested in where this would be going.When I say 'safe' I mean to say that nothing really dramatic is left out there for any of the characters. Any possible conflicts get swept up and resolved even before the third act begins (it almost seem,s like Driss gets some time off working just so he can resolve his small conflicts, or those with his sorta-brother, and then come back). Even with the overriding emotional beat of Philippe's correspondent-love-interest, I never felt any sense that these people would not be together by the end; there's one little bump in this road, maybe two, though it's only with the sense that 'hey, I'm quadriplegic, can't let her see that'. I get that it's something to make us feel for him, that he needs to overcome his fears. But I think a big part of it is an overall 'light' touch; yes, Driss may have a criminal background, and yes he has a big family to support in the projects (not that we see much of them, which seems like an odd choice that they just accept this), and sure Philippe has seemingly all the money in the world (where does he get it from, who knows, rich family, they never say).So in other words, there are stakes here, but given that this man can't walk or move, or that Driss has an upward climb in life, it all comes back to just... silly jokes in a lot of scenes, playful flirting between Driss and a woman in the main house not having it, life lessons learned in montage. It's a movie that has a heart in a good place, I can't question that, and being that it's based on a true story (and boy does the ending remind you!) it's hard to say this wasn't credible in the sense of it coming from real life in a certain way. It may be a certain feeling like it's running through things I could see in a lessor TV movie, the beats of conflicts that one might see on a sitcom even (again the teenage girl plot, where she never feels like a character, just a thing that gets used from time to time to move little events forward). Even the moment where the third act gets into gear, a little conflict as Driss has to go away to fix some things and they call it quits, it's just... OK.If you love this movie, I'm happy for you. For me, it just didn't win me over completely - not so much manipulation or pulling at the heartstrings (though it tries at times), just an overall feeling like it's missing some things that could make it FEEL more important, more substantive."},{"username":"Gordon-11","userUrl":"https://www.imdb.com/user/ur0035842","reviewLink":"https://www.imdb.com/review/rw2979184","warningSpoilers":false,"date":"14 March 2014","rate":"","helpful":"0 out of 0 found this helpful.","title":"A beautiful tale of mutual inspiration","content":"This film tells the story of a rich paraplegic man in Paris, who gives a chance to a man who was just released from prison.\"Intouchables\" is a really touching and inspirational story. I really like the fact that both Philippe and Driss are so wildly different from each other, but yet they can complement each other and make each other grow. Philippe is cultured but reserved, while Driss is playful and hedonistic. I like the scenes where Philippe is selling the painting by Driss, the scene in the opera and the final scene. They complement each other so well, and they both treasure each other's friendship. It's a beautiful tale of mutual inspiration. I love it."},{"username":"Calicodreamin","userUrl":"https://www.imdb.com/user/ur29385135","reviewLink":"https://www.imdb.com/review/rw6535476","warningSpoilers":false,"date":"28 January 2021","rate":"10","helpful":"2 out of 3 found this helpful.","title":"Heartfelt","content":"This film instantly draws you in with a real emotional connection to the characters. There is a good mix of humor and reality. The storyline has good flow, great acting, and vivid cinematography. Overall a well made film."},{"username":"writers_reign","userUrl":"https://www.imdb.com/user/ur2567136","reviewLink":"https://www.imdb.com/review/rw2676975","warningSpoilers":true,"date":"21 September 2012","rate":"9","helpful":"7 out of 12 found this helpful.","title":"A Touch Of The Poet","content":"Unlike their counterparts in the rest of the world critics in the UK - where it opened today, months after its initial release last year - have been giving this movie a hard time. I would have thought that people who spend their working lives watching one violent film after the other punctuated by mindless horror, teenage pap and worse would find a film like Untouchable a pleasant antidote but that doesn't seem to be the case and the fact that it's all true - we learn in end captions that both men remain close - appears irrelevant. So much for hacks; the International public have already embraced it and it's more than likely the UK will follow. For many non-French audiences Francois Cluzet appeared on their radar first only six or seven years ago when Tell No One was an International hit. Jazz buffs had registered him as far back as 1986 when he co-starred with Dexter Gordon in 'Round Midnight' (coincidentally another 'true' story based on an unlikely friendship between American Jazz pianist Bud Powell and a young French fan). I personally have yet to see him give even a mediocre performance let alone a bad one; as for Omar Sy this is the first time I've heard his name. There are, of course, precedents for unlikely male bondings in fact Francis Weber, the French writer-director, specialized in the genre in such titles as Le Chevre, Les Compreres, Tais-Toi etc, Daniel Auteuil has also joined in at least twice (Mon meilleur ami, Apres Vous) and so on but despite it being well-worn Untouchables applies a new lick of paint to the genre and delivers a feel good title to remember."},{"username":"view_and_review","userUrl":"https://www.imdb.com/user/ur3670492","reviewLink":"https://www.imdb.com/review/rw7720193","warningSpoilers":false,"date":"4 January 2022","rate":"9","helpful":"2 out of 2 found this helpful.","title":"Tweaked a Known Formula","content":"\"The Intouchables\" took a tried and true formula, tweaked it a bit, and made a sensational movie. The idea of \"The Odd Couple\" has been around for ages. We see it most in buddy cop movies, but it also rears its head in other genres. I, for one, have gotten tired of the idea of polar opposites becoming friends. It's not that I don't appreciate or like the idea, it's just that it has been done so often. The very thought of having to watch two people get to know each other and appreciate their differences makes me roll my eyes. \"The Intouchables\" takes the idea, guts it, and gives us a gem.Francois Cluzet and Omar Sy star as Philippe and Driss. Philippe is a wealthy, paralyzed, white Frenchman who is in need of a caretaker. Driss is a poor, somewhat hood, African Frenchman who is just looking for a job. Driss has no passion for healthcare nor is he at all sensitive towards Philippe's condition, he just wants a paycheck. What you don't expect is that Philippe admires this about Driss. Philippe doesn't want a caretaker who feels pity for him, he wants one that treats him like any other able-bodied human being. And I think that's where the movie distinguished itself. Instead of us suffering through a contentious relationship that slowly transformed into something special, they were practically friends from the start, even if they didn't recognize it. Philippe wanted Driss as a caretaker and Driss wasn't going to pass up a good paying job.Their relationship grows over time from one of employer and employee to friendship. It's a funny movie that seems to hit all the right buttons. Driss is not so hood and criminal as to repulse you while Philippe is not so steeped in self-pity so as to depress you. I think their personalities were perfect for each other and perfect for the big screen."},{"username":"grantss","userUrl":"https://www.imdb.com/user/ur2860723","reviewLink":"https://www.imdb.com/review/rw3551046","warningSpoilers":false,"date":"26 September 2016","rate":"8","helpful":"0 out of 1 found this helpful.","title":"Great - funny and moving","content":"Great movie - funny and moving. Engaging and emotive, with some hilarious scenes. Takes a while to get going, but once it does, it moves along at a brisk pace.Great performances by Francois Cluzet and Omar Sy in the lead roles. Good supporting cast too.Historic movie too. The first funny, non-dull and unpretentious French movie. Also the first French movie to not be all about people contemplating the meaning of life for 90+ minutes and then at least one of them committing suicide at the end (spoiler alert)."},{"username":"Boba_Fett1138","userUrl":"https://www.imdb.com/user/ur1416505","reviewLink":"https://www.imdb.com/review/rw2619406","warningSpoilers":false,"date":"31 May 2012","rate":"9","helpful":"13 out of 20 found this helpful.","title":"This is how a genre movie should be done!","content":"This movie so easily could had become a forced and melodramatic one but luckily it's one that got made with lots of tact and skill, making this one fine drama, with a comical touch to it as well.Guess that I really like contrasts in movies. The two main characters are complete opposites of each other, in about every way imaginable. Driss is poor, Philippe is rich. Driss is vibrant, Philippe is a quadriplegic. Driss is black, Philippe is white, etcetera. They are a complete mismatch on paper but yet they become best friends, which forms the central point of this movie and works out so well because it gets made believable.They don't just become good friends, they also learn from each other and I believe that they also become better persons because of that. This is were the movie its warmth and soul comes from, in my opinion.It doesn't ever dwell on it that Philippe is bound to a wheelchair and can only move his head, or that Driss is poor and also has a poor relationship with this family. If anything, this movie is a celebration of life, rather than than a movie that will bring you down. The effect of these sort of movies often is that it actually strengthens its drama because you feel far more involved with it, also since the movie doesn't shoves its drama down your throat constantly.There are some small side-plots in the movie but the good news about them is that they don't distract from the main theme and storyline of the movie and the movie never puts its emphasis too much on any of the side-plots or its secondary characters. It keeps a great and effective focus on its main subject, throughout pretty much the entire film.It's a great movie, in every way. It has a good look to it, that isn't cheap or rushed. It's a respectful and professionally made movie, which all paid off for it.Also the acting is just great. Everybody seems perfectly cast in their roles and know how to handle their characters and manage to fit within the style and tone of the overall movie. Of course François Cluzet and Omar Sy carry most of the movie and they did a more than great job with this.It's just a movie I can't say anything bad or negative about. It's well made and effective, which makes this one of the better genre movies out there!9/10 http://bobafett1138.blogspot.com/"},{"username":"ferguson-6","userUrl":"https://www.imdb.com/user/ur0806494","reviewLink":"https://www.imdb.com/review/rw2622053","warningSpoilers":false,"date":"4 June 2012","rate":"8","helpful":"4 out of 8 found this helpful.","title":"Let's Dance","content":"Greetings again from the darkness. Sometimes acting elevates material to a level far beyond what a film might have otherwise deserved. Such is the case with this based-on-a-true-story effort from co-writers and co-directors Olivier Nakache and Eric Toledano. Despite the elements of truth, the core material here is a sentimental tale that we have seen before. Francois Cluzet (Tell No One) as Philippe and Omar Sy as Driss turn it into an extremely entertaining story with characters we quickly connect with.Philippe is a wealthy quadriplegic widower who is interviewing candidates for a caregiver. Driss is a recently released from jail street hustler who is just trying to qualify for state benefits by going on the required interviews. Philippe is struck by Driss' direct approach and energy level, and chooses Driss over the room full of more qualified types.The rest of the movie is really a buddy flick where the polar opposites bring much to the other. Philippe slyly gets Driss to use his sharp mind a bit more effectively, and Driss taps into Philippe's hidden lust for life. Though the supporting cast is fine, the film's best scenes are those featuring Philippe and Driss.This is a film from France and much as been made of the filmmakers' decision to change the caregiver from the real life Arab to a more cinema-friendly Black man. The Earth, Wind & Fire dance may be a bit too much, but I choose to believe the casting of Omar Sy was the deciding factor, not his race. He lights up the screen and draws us right into his world and his choices - some of which are better than others.The film shares much with The Sea Inside, Scent of a Woman, and The Diving Bell and the Butterfly, but this one has much more humor and bonding than any of those. It doesn't shy away from the melodramatic moments and isn't above trying to generate tears in viewers. There will be a US re-make of this one, but the two lead actors here (especially Mr. Sy) make this one worth seeing."},{"username":"morrison-dylan-fan","userUrl":"https://www.imdb.com/user/ur5424352","reviewLink":"https://www.imdb.com/review/rw3850154","warningSpoilers":true,"date":"5 November 2017","rate":"9","helpful":"0 out of 2 found this helpful.","title":"The Untouchables","content":"Despite hearing about the film for years,the chance to see it has somehow always slipped out of my fingers. Taking a look on BBC iPlayer to see what they had replaced their recent run of rare RKO titles with,I was thrilled to see the movie on the site,which led to me finally getting in touch with a viewing.The plot:A widow quadriplegic called Philippe asks his assistant Magalie to interview candidates for the job of being his care giver. Believing that he will never successfully re-apply for a job again, Driss goes for an interview with Magalie and Philippe,and asks if they can just sign a paper,so that he can claim benefits for attending an interview. Finding his abrupt manner refreshing,Philippe decides to take a gamble and offer Driss the job. Accepting the job,Philippe and Driss soon get in touch with a new chapter in their lives.View on the film:Looking like they have been friends for years, François Cluzet and Omar Sy give utterly superb performances as Philippe and Driss. Appearing in almost every scene together, Sy and Cluzet make the fast bond the appears between them to feel completely natural,with the comedic playful side Sy brings out of the worn-down Driss, perfectly complimenting Cluzet bringing Philippe out of his self- imposed shell.Placing Driss and Philippe on different sides of the wealth/class divide,the screenplay by co-writers/co-directors Olivier Nakache & Eric Toledano unearth the common ground that binds them, as the delicate brush strokes used in Driss getting Philippe to look for love with a new optimism,are used in Philippe guiding Driss to express himself in art. Closing with footage of the real Driss and Philippe,the co-directors and cinematographer Mathieu Vadepied draw their friendship with excellent close-ups that focus on the changes they bring out in each other,as Philippe and Driss become the intouchables."},{"username":"gradyharp","userUrl":"https://www.imdb.com/user/ur3223254","reviewLink":"https://www.imdb.com/review/rw2763828","warningSpoilers":false,"date":"7 March 2013","rate":"10","helpful":"3 out of 5 found this helpful.","title":"'Art is the only trace we leave behind.'","content":"Films such as THE INTOUCHABLES come around far too seldom and when they do the public should somehow be advised that here is a cup of magic that could alter the manner in which we relate to each other and to the world tainted by schisms of societal errors. Written and directed by Olivier Nakache and Éric Toledano the film was inspired by the true story of Philippe Pozzo di Borgo and his caregiver Abdel Sellou, discovered by the directors in 'A la vie, à la mort', a documentary film. Of note, the book version of the film's story was written and released after the film enjoyed great success. Written by Abdel Sellou the book 'You Saved My Life' tells the extraordinary true story of the charming Algerian con-man' friendship with a disabled French aristocrat. Sellou's book shows the real man behind Sellou/Driss's smiling face. The book takes us from his childhood spent stealing candy from the local grocery store, to his career as a pickpocket and scam artist, to his unexpected employment as a companion for a quadriplegic. Sellou has never before divulged the details of his past. In many interviews and documentaries, he has evaded or shrugged off the question of his childhood and his stay in prison, until now. He tells his story with a stunning amount of talent, with humor, style, and--though he denies that he has any--humility. Abdel Sellou now lives in Algeria with his wife and three children, where he runs a chicken farm. He remains close to Philippe Pozzo di Borgo, who lives in Morocco with his second wife and two children.The cinematic version of this relationship is an irreverent, uplifting comedy about friendship, trust and human possibility. After he becomes a quadriplegic from a paragliding accident the aristocratic intellectual Parisian millionaire Philippe (François Cluzet) is interviewing candidates for the position of his caretaker with his secretary Magalie (Audrey Fleurot). Out of the blue, the rude ex-con African Driss (Omar Sy) cuts the line of candidates and brings a document from the Social Security and asks to Philippe to sign it to prove that he is seeking a job position to receive his unemployment insurance. Philippe, impressed that Driss is the only candidate who does not look at him with pity, challenges Driss and offers a period of adaptation of one week to him to gain experience helping him. Then Driss would decide whether he would like to stay with him or not. Driss accepts the bet and moves to the mansion, changing the boring life of Philippe and his employees, especially under the watchful and compassionate eye of the head of the house staff Yvonne (Anne Le Ny). As Driss reluctantly learns to move, feed, and clean Philippe, the two men discover a blunt but vital humor that not only bridges the cultural and class divide between them, but gives Philippe a renewed joy in life - and a chance to turn his passionate epistolary relationship with one Eleanore whom he has never seen into a chance at a second go at life.The only aspect of this film that is somewhat distracting is that the film opens with a car adventure involving both Philippe and Dris which is terrific film making and very funny but does make the film's beginning (after the credits) seem less surprising. A very minor point, especially when the film ends with the same activity but this time drives it to an incredibly touching completion. Highly recommended on every level: both François Cluzet and Omar Sy are brilliant! Grady Harp"},{"username":"DICK STEEL","userUrl":"https://www.imdb.com/user/ur0317399","reviewLink":"https://www.imdb.com/review/rw2723713","warningSpoilers":false,"date":"23 December 2012","rate":"10","helpful":"4 out of 8 found this helpful.","title":"A Nutshell Review: The Intouchables","content":"Just as how Jack Neo's Ah Boys to Men Part 1 finally took over the box office crown held by Money No Enough more than a decade ago, so did Intouchables take over the French box office equivalent from the quirky comedy Amelie, which was the champ over about the last decade. As the French entry for the Oscar's Best Foreign Film picture next year, I was glad I held out against watching this while on a flight, patiently waiting for it to make its big screen bow here, which it finally did outside of the 2nd Rendezvous of French Cinema earlier this month.There were many moments that made it so easy for me to identify with the movie, especially coming from caregiving, which is never an easy thing to do. Those who have never done it, I'm talking about full time, real time, on the job alertness, and doing everything you can to make things comfortable for the other party. There's no Off button you can use, and anyone in this for full time employment, gets my utmost respect. And watching how the characters here go about their routine, bring back memories that are forever dear to me, and needless to say, these routines and close contact interaction, bring about a new level in relationships.Lifting someone up from bed in back-breaking fashion, it brings new meaning to \"He ain't Heavy, He's my Father\". Tucking someone into bed. Did that too. The gloves for the toilet visit, nothing new, gross that it may be at first. Wheeling someone out to soak in sights and sounds outside of one's home, well, it may be the most inconvenient, but seeing someone's face light up for the rare trip out, is priceless. And these life-affirming, relationship building events may seem to stem from mundane tasks, and tasks we take for granted, such as bathing or just sheer presence to interact without distraction, but to the physically infirm, it means the world.And this is what The Intouchables is about, the story of two men thrown together by fate in what would be an employer-employee relationship that develops into firm friendship, a bromance even if you'd like. Inspired by a true story, Francois Cluzet plays the rich aristocrat Philippe, who is quadriplegic from the neck down from a paragliding accident, and has to rely on an army of helpers and assistances to get through every day. But his primary caregiver never lasts more than a week, given his rather stiff (pardon the pun) ways, until Driss (Omar Sy), a young man with not the most polished resume - he responded to the ad just to chalk up mileage to get welfare - gets hired despite verbally crossing swords during the interview, and soon, a bet turns into what's life-changing for them both, bringing out the best in each other.You can half expect writer-directors Olivier Nakache and Eric Toledano's story to contain the usual clash of cultures and background, with one refined in the arts and the other being quite the rough and gruff, obviously no time to enjoy the finer things in life when one has to worry about bringing home the bacon for an extended family, with trouble brewing when members trying to stay in line with the law. But their story is tinged with so much sensitivity and truth, that it's hard to quibble with the loads of humanity on display, going by the adage that one shouldn't judge a book by its cover, or by one's background or resume. One may be rich, but getting someone else to wait on you, even if providing him or her with a comfortable life, is a different ballgame altogether, especially when one is not kin or kith.But throughout the story, one cannot deny that life can still go on quite comfortably in a material way, with wealth on display, and if there's a minor grouse about this, is how old money gets flaunted around, with Meseratis and private jets being part of the arsenal to enjoy life. Then again, this is part of the true tale, so it's not debatable. Not forgetting the extended ensemble cast of assistants in the form of Yvonne (Anne Le Ny) and Magalie (Audrey Fleurot) amongst others who pepper the scenery, the former serving to fill in the blanks for Driss as he tries to gather background, while the latter coming in as an object for Driss' romance, with a little surprise up in store.There's no qualms The Intouchables is a delight to sit through, being a story of hope and friendship. And in some ways, even for the most able amongst us, this is a tale that reminds us of the importance of humour, which is medicine enough to get us through some of the toughest situations we'll encounter from time to time. Both Francois Cluzet and Omar Sy put in amazing performances, and their delivery of their characters, screen charisma and banter, are more than reasons enough to catch this. A definite recommendation!"},{"username":"siderite","userUrl":"https://www.imdb.com/user/ur3146136","reviewLink":"https://www.imdb.com/review/rw2726980","warningSpoilers":false,"date":"28 December 2012","rate":"8","helpful":"0 out of 0 found this helpful.","title":"Emotional tale of true friendship","content":"If you are looking for a feel good movie that has also deep meaning and true characters, look no further: Intouchables is for you. It is the story of the friendship between a very rich white paraplegic and his low class dark skinned caretaker. Best of all, it is based on a true story, something that brings an extra bit of authenticity to the film, not that the excellent play of the actors needed more.Now, at times it seems too idealistic and probably it is, with the \"lord\" giving a chance to the \"peasant\" and then becoming friends when intimate enough to learn about each other; a bit like a fairy tale. And I am sure some of the film is just invented. But it doesn't matter. The idea is true, the acting is true and the characters bring a lot of humour and compassion into it.All in all a very nice movie, one that can bring a little joy in an all too serious and dark world."},{"username":"jdesando","userUrl":"https://www.imdb.com/user/ur1391596","reviewLink":"https://www.imdb.com/review/rw2642764","warningSpoilers":true,"date":"15 July 2012","rate":"","helpful":"2 out of 3 found this helpful.","title":"Best Bromance in Years","content":"\"I don't empty a stranger's butt.\" Driss (Omar Sy)But he will, and you'll not see a comedy this year on either side of the pond than The Intouchables. Or a better treatment of disability, without pity and filled with humanity. Or a better buddy story than this one about quadriplegic Phillipe (Francois Cluzet) and his aide, Driss (Omar Sy).It's a bromance without sex, a hands-across-the-social-divide that avoids clichés but still gives anticipated humorous setups a new vigor.Expecting tears and pity, I found laughter and love as Driss, a poor black man with a very big heart and personality, is hired by wealthy entrepreneur Phillipe to tend him. Although the eventual reinvigoration of daredevil Phillipe under the exuberant if rough Driss is to be expected with this formula, the wholesome affection and lack of pity are infectious.Intouchables has numerous moments of hilarity and humanity such as when the two men speed down the highway almost hoping for police who will fulfill Driss's prediction that the two end up with an escort. Both men are speed freaks; both men are happy to indulge that passion.Another mirthful moment is Driss's reaction to his first opera. Opera lovers will especially like his unaffected amazement and amusement that this is how the rich spend their time. Sy is so good as Driss that even I would enjoy his spontaneous disruption of a serious operatic production.Buried in the joyful surface is the subject of class differences. Driss comes from living with several cousins in a small apartment, may have been a druggie and a dealer, and avoids work. Phillipe is a wealthy entrepreneur who went too high on a para sail to fulfill his danger lust. Beyond a small fee Phillipe wrangles from a friend for Driss's painting, Driss gets no other improvement in his living situation and Phillipe deteriorates while he makes a tough decision about Driss.It's not difficult to see why the film has been seen by over 300 million people so far and just begun to flourish in the US."},{"username":"StevePulaski","userUrl":"https://www.imdb.com/user/ur23483288","reviewLink":"https://www.imdb.com/review/rw2652505","warningSpoilers":false,"date":"31 July 2012","rate":"10","helpful":"8 out of 15 found this helpful.","title":"Defines \"wholesomeness\" and then some","content":"Now here is a film that perfect defines the word \"wholesomeness.\" The Intouchables is a moving parable about a wise but poor black man who becomes the caregiver and mentor for a wealthy tetraplegic in a series of unlikely but not unbelievable events in modern-day France. The film begins by showing the man's assistant, interviewing candidates for the job of being the man's hands and legs, but as the man sits close behind her, he becomes increasingly unsatisfied with the candidates due to their lack of motivation or their mundane nature.The man, named Philippe, played by François Cluzet, is brought to a smile when he is acquainted with Driss (Omar Sy), a man who has been through relentless struggles with money and social-status, but still manages to push through it with a smile. Driss is only looking for a signature on his unemployment checks so he can continue receiving welfare benefits and has absolutely no ambition to get this job.The next day, he is called up to begin the trial period as the role of Philippe's caretaker, and while Driss is clearly unqualified for a job of this nature, Philippe casually accepts him because he finds the man to be charming and good-natured. While both men come from the Parisian-area, Philippe lives in a heavenly mansion, while Driss inhabits the lowest end of the slums. Despite this setback, the men have an incredibly easy-going friendship, with deep, touching talks of inspiration and motivation throughout the picture. Subplots involve Driss demanding that Philippe maintain better control of his only daughter, Elisa, and trying to get the man back on his dating game with a digital lover.I'm aware the story sounds like cliché-after-cliché, but the film perfectly abides by my law of films with a seemingly cliché premise. The Intouchables knows its story functions with moments of incredulity and utter sappiness, but it doesn't try to overcompensate and milk those moments for more than they're worth. It also does more than give us contrivance, but inflates its moments of sentiment with wit, charm, attitude, style, and poignancy, making this for a very emotional experience on every level. Sometimes, we are greeted with a film we know is relatively simple, cliché, and unassuming, yet we are mesmerized unconditionally up until the final frame.The film became a colossal hit in France, selling over nineteen million tickets and is currently the second highest grossing film of all time, in France. Due to its very minimal promotion in the US, I could see some people going into this film expecting a somber, relatively monotone film depicting the life of a tetraplegic tragically and with a numbing aftertaste. The Intouchables has a talent much like the Alexander Payne film, The Descendants, which is depicting a relaxing environment, which includes making a character out of the setting, handling tragedy with a sustainable amount of poignancy, and providing touches of extremely funny comedy throughout its entire runtime.As of now, French cinema is one of the strongest cinemas in the world, as it has been for decades now. Rather than try to recreate the New Wave it experienced many years ago, try out a gimmicky, self-indulgent style, or even worse, replicate Hollywood formulas, it is at a stage now where it can take even the most basic storyline and rework it into a magnificent portrayal with humanity and lavishness subtly and majestically. The Intouchables is a beauty that will definitely be taken for granted.Starring: François Cluzet and Omar Sy. Directed by: Olivier Nakache and Éric Toledano."}],"errorMessage":""}