{"imDbId":"tt2582802","title":"Whiplash","fullTitle":"Whiplash (2014)","type":"Movie","year":"2014","items":[{"username":"MartinHafer","userUrl":"https://www.imdb.com/user/ur2467618","reviewLink":"https://www.imdb.com/review/rw3279715","warningSpoilers":false,"date":"18 July 2015","rate":"9","helpful":"31 out of 39 found this helpful.","title":"This is review #572....so is there really any need to say more?!","content":"\"Whiplash\" is a terrific film...no doubt about that. Normally, I'd spend several paragraphs talking about how great it is except that I am the 572nd review and many people have already gone on and on about what a terrific film it is....so what can I add?! It's the 40th highest rated film on IMDb after all! J.K. Simmons clearly deserved the Oscar for Best Supporting Actor because although he was no the star of the film, he dominated every moment he was on the screen. Was he a likable guy? No way..but he was mesmerizing. Kudos also for the young actor in the lead and everyone else with this film. It's among the best films of the year and one that impressed me so much because it did not have a complicated script of mega-million dollar special effects--it just had terrific acting, writing and direction. See this film and see how a quality film is crafted. 'Nuff said..."},{"username":"TheLittleSongbird","userUrl":"https://www.imdb.com/user/ur20552756","reviewLink":"https://www.imdb.com/review/rw3640829","warningSpoilers":false,"date":"16 February 2017","rate":"9","helpful":"8 out of 11 found this helpful.","title":"Blistering","content":"Nominated for five Oscars, and winning three (editing, sound and Best Supporting Actor, with nominations for screenplay and Best picture), 'Whiplash' is positively blistering, with a darker and more realistic view on aspirations and done in a way that's tense and inspirational.Visually, 'Whiplash' looks great with grittily atmospheric photography with plenty of beautiful, gripping shots (like close-ups of the drum playing) and some of the tightest, cleverest and most audacious editing of any film that year. The sound is also thrilling in its intense authenticity, and really add to the impact of the pulse-racing Jazz soundtrack. There is in particular unbelievable drum playing that serves as a fond reminder of iconic drum players of the classic Jazz Age, the final drum solo is long but exhilaratingly played and a huge part of why the ending sends up a storm as much as it does.The script is sharp and cutting, sometimes uncompromising and at other points patient. The story is not new, but makes a point of aspirations and talent having its dark and less glamorous side, competitiveness and that there are always obstacles (including dictatorial bullies). While not quite as extreme in life as shown here situations and people like seen in the film exist. The story is at its most successful in its tension between Andrew and Fletcher, which is thrilling and nail-biting, and Andrew's very relatable and inspiring drive and passion, and much of it is very taut and rarely laborious in pace.Damian Chazelle directs with a clear love for film and the jazz style and passion for the subject. 'Whiplash' has great performances all round. The secondary cast do much with little and Miles Teller more than holds his own in a telling lead performance. This is JK Simmons' film however, proving that his Oscar win was one of that year's most deserved wins. He doesn't just dominate the film with his ruthless manner as a terrifyingly dictatorial character, but actually IS essentially the film, one's terrified of him but also understands his point of view.'Whiplash' could have been slightly better this said. Most of the supporting cast, especially Andrew's family (the film at least tries to say why the romance was rushed and dropped, in that it didn't mean anything to him like his playing of music did), are severely underwritten and underused. The car crash scene and the aftermath also feels out-of-kilter and even the most committed musician wouldn't be in the right function to do what happens after that scene.Otherwise, this is a blisteringly great film with a huge amount to recommend. 9/10 Bethany Cox"},{"username":"Leofwine_draca","userUrl":"https://www.imdb.com/user/ur0482513","reviewLink":"https://www.imdb.com/review/rw7641029","warningSpoilers":true,"date":"13 December 2021","rate":"6","helpful":"1 out of 20 found this helpful.","title":"Real depth","content":"Something very different out of Hollywood: a relationship drama of a very small scale, focusing almost exclusively on the volatile mentor/student relationship between a drummer and his tutor. Obviously it's the J. K. Simmons show here and he really shines in the part, relishing the dialogue he's asked to bark, and nobody else really gets a look in. But in the second half it moves into unexpected territory and offers a lot more real depth than I was expecting."},{"username":"Michael_Elliott","userUrl":"https://www.imdb.com/user/ur13134536","reviewLink":"https://www.imdb.com/review/rw3171248","warningSpoilers":false,"date":"26 January 2015","rate":"","helpful":"6 out of 13 found this helpful.","title":"One of the Best of 2014","content":"Whiplash (2014) **** (out of 4) Hard-hitting drama plays out much like a thriller as Andrew (Miles Teller) dreams of becoming a great drummer no matter what the cost is. He ends up attending the best music school in the country and it doesn't take long before he's hand picked by Fletcher (J.K. Simmons), the best teacher there who will stop at nothing to get the best out of his students.WHIPLASH is a film that pretty much came out of nowhere and is leaving a major mark on those who see it. I will admit that I hadn't really heard too much about the film but it seems with each passing day there was someone new singing it's praises. Well, having now seen the movie I'm going to join the crowd and tell everyone how wonderful it actually is. I think one of the hardest things to do is take a familiar genre (teacher- student relationship) and trying to bring new life to it. Director-writer Damlen Chazelle manages to do just that because we've seen this type of film several times before but it's done in such a way here that you can't help but feel you're watching something fresh and original.I think one of the biggest reasons it feels fresh is due to the actual subject of a drummer. You'd expect to see something about singers or guitar players but to set this in the world of a drummer and Jazz music was something that works so well because of the wild, frantic style of the jazz score works perfectly well with the work and abuse that the main character forces on himself. The scenes of Andrew working his hands to blood are just so flawlessly edited with the score that you can't help but feel every drop of blood that drips from his hands. Another major plus is the actual editing, which is incredibly fast-pace but falls well short of that MTV-style that has become so worn out the past two decades.Of course, the film's highlight is without question the performance of Simmons who is simply wonderful. Again, we've seen angry people countless times before and we've seen caring teachers countless times before. What's so memorable about the performance here is how quickly Simmons is able to change emotions from caring to pure rage in the matter of seconds. Getting the eyes to tell you what you need to know from a scene is extremely hard but just watch Simmons' eyes throughout the picture.The rage he shows isn't just mindless screaming and cussing because you can still see a certain emotion and caring in his eyes. Teller is also excellent in the role and manages to stand his own against Simmons. Both Paul Reiser and Melissa Benoist are also very good in their supporting parts.What also makes WHIPLASH so memorable is the fact that it really plays out like a thriller. I'm not going to ruin anything that happens but we can see the main character falling apart due to the abuse from the teacher and we know something is eventually going to happen to cause havoc. The film plays this suspense out as if you're watching a thriller and it really pays off in the final twenty-minutes as there are a couple excellent twists. The film certainly has everything you want from a movie and it's clearly one of the best of 2014."},{"username":"SnoopyStyle","userUrl":"https://www.imdb.com/user/ur2898520","reviewLink":"https://www.imdb.com/review/rw3196542","warningSpoilers":false,"date":"5 March 2015","rate":"8","helpful":"6 out of 8 found this helpful.","title":"terrific performances","content":"Andrew Neimann (Miles Teller) is a first year student at the prestigious Shaffer Conservatory. His father Jim (Paul Reiser) is a sweet high school teacher. He gets picked by Terence Fletcher (J.K. Simmons) to be the backup drummer in his winning Studio band. He gets enough confidence to ask out Nicole (Melissa Benoist). Fletcher is a cruel manipulative dictatorial teacher.J.K. Simmons gets a great juicy part to show his skills that he has shown all these years. He fully deserves his Oscar win and it's not a surprise. He's certainly done great work in many TV and movie roles before over the years. Miles Teller take a great step up. He has done good work but this is something much more. It's a compelling character who develops and changes. He's able to play through it all."},{"username":"lor_","userUrl":"https://www.imdb.com/user/ur1287548","reviewLink":"https://www.imdb.com/review/rw3204795","warningSpoilers":false,"date":"19 March 2015","rate":"","helpful":"53 out of 264 found this helpful.","title":"Fake, fake, fake","content":"My contrary reaction to the phony film WHIPLASH:1. Fake jazz: Jazz is the vehicle to tell this story, but what we get is not jazz but rather the academic teaching of big band/orchestral music, emphasizing arrangements and perfecting the technique of one's instrument. Same film could have been better scripted about a classical symphony orchestra at a university. Jazz is about improvisation and the interplay between musicians, as seen in a small group context. Big bands as seen here are more evident nowadays at sporting events. The only solo was the hero's mediocre drum solo at film's end.2. Fake theme/ending: Theme of the movie is the importance of motivation & rigor to promote excellence, in the context of a student, and the pitfalls of the martinet. In movies, for audience manipulation and dramatic purposes a theme is often betrayed at the end, most famous case being Alec Guinness's sudden reversal at the climax of THE BRIDGE ON THE RIVER KWAI, because an audience expects the damn bridge to be blown up, even though his character spent the previous 2 hours with every fiber of his being symbolically building it. In WHIPLASH the finale contradicts everything previously in the script, not to be even-handed but to falsely convey a message that \"maybe\" true artistry and achievement stems from the horrible inspiration we've witnessed. Totally bogus and phony.3. Fake characters: Given jazz's history, the two major characters - protagonist and antagonist, should have been Black. The filmmakers have every right to make them whatever they want, perhaps a female teacher and a girl drummer would have been interesting, but that also would not have fit the use of jazz as movie's central core. My reaction to the whitened-up story was the same reaction as I would have to a '50s movie biography of Fats Domino played by Pat Boone, whose early career was essentially spurred by the industry (and specifically his record label) customarily ripping of a Black artist (Fats) with a white artist (Pat) singing his songs for a general audience. Same crappy approach here.4. Fake gimmicks: Many gimmick scenes in WHIPLASH would have been blue-penciled and not made it into the final script had this been a TV episode rather than an independent (\"anything goes\") feature film -the writers' room would not have permitted them to slip through. Most notable is the hero's car accident and arriving late and bloody to unsuccessfully try and perform at the big concert contest, when the band's other drummer was perfectly capable of going on in his stead. Not merely unbelievable but farcical as directed here. Final reel of him conned into appearing with no charts for songs he had never seen or heard before was an asinine gimmick, almost as stupid as him returning to suddenly lead the orchestra himself, all for fake-dramatic purposes. And maybe even worse the scene that made me want to leave the screening: his blow-off of his girl friend telling her his need to practice and succeed would not leave enough time for their relationship to continue. That must have looked bad on the page and it didn't play at all on the screen.5. Fake performance: I have praised J.K. Simmons many times, and you can read my rave review for him on IMDb for his role in the obscure comedy NEW IN TOWN. But his facile, surface performance here is just the kind that wins awards (it surely did), but pales into comparison to many others playing essentially the same role. I will merely cite Robert Duvall in THE GREAT SANTINI or Lou Gossett Jr. in AN OFFICER AND A GENTLEMAN as the most vivid in recent memory. I found his playing closer to the psychotic of Humphrey Bogart in THE CAINE MUTINY than to what the role called for.6. Fake icon: Buddy Rich is elevated to god-like status in WHIPLASH, a reactionary and outdated concept that I reject entirely. In show biz history I would nominate Rich for iconic status as a jerk, not a musical artist. In jazz history, the logical icon and role model here would be Art Blakey, since not only is his importance in modern (post-WWII) jazz secure but more to the point he became the archetypal leader and inspiration to hundreds of musicians who graduated from his band, ranging from formative stints for Wayne Shorter and the Marsalis Bros. to little-known connections with artists as varied as Chick Corea and Chuck Mangione, both of whom I saw appear with Blakey's Jazz Messengers in Boston in 1966.. Unlike the teacher posited in WHIPLASH as a Dick Cheney-like nut, Blakey motivated rather than tortured his young acolytes. Buddy Rich and his mediocre '60s big bands yielded nothing, and as a drummer he was all technique and zero jazz.7. Fake porn: Categorically WHIPLASH (the title is perhaps the key hint) is a type of soft-core pornography, among other things. It's another movie example of the trends in recent years to substitute sadomasochism for traditional sexual porn - namely the thousands of horror films about torture and sadism appealing to the audience to alternately identify with and then hiss the sadist as protagonist, or more recently the oncoming trend that will be inspired by the success of 50 SHADES OF GREY. The movie's domination theme is obvious, but the submission aspect is way more subtle -masked by the hero's natural rebelliousness. Looking beyond him we have a score of submissives -his fellow band mates who are humiliated (a key element of BDSM cinema) throughout the film. This as entertainment is the definition of pseudo-porn, acceptable to the masses because it does not involve \"money shots\" and explicit penetration making it soft-core rather than hardcore. The absence of sex in WHIPLASH is no different than the absence of actual sex in most BDSM exercises.8. Fake setting: L.A. substituting for NYC = zero atmosphere."},{"username":"Hitchcoc","userUrl":"https://www.imdb.com/user/ur0278527","reviewLink":"https://www.imdb.com/review/rw3256850","warningSpoilers":false,"date":"12 June 2015","rate":"8","helpful":"2 out of 6 found this helpful.","title":"A Brutal Character","content":"A previous reviewer mention Full Metal Jacket, the Kubrick film about the vicious Drill Sergeant who dehumanizes his men, but one of those men in particular. However, in that movie, the young Marine probably had no business being where he was. Here, a young man wants to be a drummer who will be remembered, like Gene Krupa or Buddy Rich. He has awesome ability which is recognized by Fletcher (Academy Award winner J. K. Simmons). His method involves brutalizing and horrifying his charges and humiliating them in front of their peers. People know he's the best there is, but what a price to pay. He justifies his intensity by repeating some incident where another band member threw cymbal at Charlie Parker's head. While this is good entertainment, if we were to look into the successes of many great performers, most of them were never terrorized. The drumwork is astounding, but all the bleeding is pretty far fetched. Ask some drummers you know. The final scene is all Hollywood as most reality goes out the window. Still, if you buy into the possibility that such a psychotic can command these musicians, it's very entertaining. The drumming is beyond belief, although I'm sure there were some strategic cuts along the way."},{"username":"Horst_In_Translation","userUrl":"https://www.imdb.com/user/ur3914439","reviewLink":"https://www.imdb.com/review/rw3204483","warningSpoilers":true,"date":"18 March 2015","rate":"8","helpful":"4 out of 12 found this helpful.","title":"Mindblowing, our generation's \"Amadeus\"","content":"And it does not even need a Best Picture win for this description. Damien Chazelle's \"Whiplash\" was one of the big players this awards season mounting in three Academy Award wins. J.K. Simmons basically dominated the supporting actor (so happy for him, he is such a likable guy, but was he really supporting?) category from start to finish and Chazelle himself managed a writing nomination with the Academy. Given he just turned 30 and has a bright future ahead of him, I am sure he can live without the director nomination. \"Whiplash\" is a great film. It starts off good, but quickly has you on the edge of your seat for the rest of the film. They kept it at clearly under 2 hours, which helped a lot as it would have sucked if they had filled the film with unnecessary scenes. This way now, it's really all essential from start to finish.There were a few scenes I struggled with initially, like the protagonist breaking up, but in retrospective I have to say it all makes sense now. His self-confidence grows with his dedication for his art mounting in the explosion of his anger when he physically attacks Fletcher (Simmons). Fletcher is possibly this year's most interesting character. No black-and-white as he walks the fine line between genius and insanity in every single scene. One great example would be how he talks to a little girl and asks her gently if she wants to join his band one day and in the next scene he talks to his band the way he always does. The monster shows again. The ending was great too. I was a bit unsure as they missed a good ending scene when Fletcher asked Teller's character if he wants to fill in in his new band, but the actual ending was at least as good. Fletcher really gets his Bird in the end. By the way, I wondered if he could shoot the young man on stage (nice \"Birdman\" reference). Everything seemed possible, but the path of the wrong sheet was a brilliant one as well.No doubt that Teller is a real competitor for best actor under 30 right now after his performance here. He would have deserved a lead actor Oscar nomination as well, over Cumberbatch for example. The new \"Fantastic Four\" makers seem to agree. And Simmons is just a force of nature in this film. He also appeared in Chazelle's short film that this is based on, so great choice for him back then and good job on Chazelle for not giving the part to anybody else. Not many out there who would have been as good. And with said short story background, this project was a true success story that goes way back to a stroke of genius by Chazelle.Now, if you are interested in drumming, let me suggest you Richard Jenkins' \"The Visitor\", a more silent approach on the issue. Or you could maybe also call \"Whiplash\" a \"Black Swan\" for males. Or Fletcher could be categorized as a more radical Dr. House. Anyway, back to this one here. It's my number one or two of the year right now (against Cotillard's Oscar-nominated film) and I cannot recommend enough watching it. You will not be disappointed. It's been a while since I had a theater that applauded after the end of the film, but this one did and it was oh so deserving. Each scene a winner and this movie is the perfect example of how a great script is much much more important than a cast that includes the best actors on the planet."},{"username":"Prismark10","userUrl":"https://www.imdb.com/user/ur4569900","reviewLink":"https://www.imdb.com/review/rw3377148","warningSpoilers":false,"date":"21 December 2015","rate":"5","helpful":"15 out of 34 found this helpful.","title":"I like to teach the world to play","content":"Good Job are the key words for Whiplash. J K Simmons psycho jazz teacher, Terence Fletcher recounts a story about Charlie Parker and how doing a good job was not enough to uncover a genius. There are no two words in the English language more harmful than 'good job' according to Fletcher.The trouble is Fletcher would not recognise a genius if it crashed into him head on. Simmons creates a monster of a teacher which to be truthful is not unknown in coaching circles in sports and the arts. However a good educator he is not, something his prestigious school seems not to have noticed.Miles Teller plays Andrew Neiman the put upon jazz drummer in the Shaffer Conservatory in New York. Eager to impress Fletcher and confounded that nothing he does can satisfy Fletcher. Neiman literally is driven to the edge.However there is only ever going to be one winner, Fletcher does not give an inch. J K Simmons won a best supporting actor Oscar for his mean and blustering performance. There was very little shade to his performance and even in his subdued moments his character was calculating. A man with little ethical core.It is left to Teller to bring soul to the film. The young student whose zest and passion for learning and improvement is fast fading away as he becomes the victim of intense bullying.The film never addresses the bullying by Fletcher. There is a sub plot about this later in the movie but notice how the other students just stay quiet and let the abuse unfurl. Given that cooperating with each other in music is so important, these students hardly talked to each other. They were reaaly a dysfunctional band who certainly did not give a shoulder to lean on which came across as unrealistic. Surely the students would mutter to each other in the canteen as to how horrible Fletcher was?As to the competition which causes Neiman problems as he has trouble getting there. Again you would have thought the Conservatory would had provided transport rather than rely on the students to make their own way.I did not think the film succeeded. The performances were intense but the screenplay had problems because the I never could buy into the band members as functioning students."},{"username":"nogodnomasters","userUrl":"https://www.imdb.com/user/ur77881167","reviewLink":"https://www.imdb.com/review/rw4070755","warningSpoilers":true,"date":"22 February 2018","rate":"10","helpful":"9 out of 12 found this helpful.","title":"Good Job","content":"Andrew (Miles Teller) wants to be a drummer. Not just any drummer, but the best. One that will be remembered. He attends a music conservatory which features an instructor (J.K. Simmons) that makes most drill sergeants look like a wet-nurse. Andrew worships this man and wants to play for him. At home he has successful brothers at college and must compete for attention at the dinner table in spite of any accomplishment doing the \"drumming thing.\"It is an odd film where the instructor is the antagonist. It takes an hour and 10 minutes to build character and take us to the point where the plot suddenly turns into what seems to be a different film.The film has a great climax which supplies us with no closure. The acting jobs were great which took a story about a kid who wants to slap sticks against mylar into an Oscar winner.Guide: F-bomb. No sex or nudity."},{"username":"kosmasp","userUrl":"https://www.imdb.com/user/ur5876717","reviewLink":"https://www.imdb.com/review/rw3262693","warningSpoilers":false,"date":"22 June 2015","rate":"10","helpful":"5 out of 7 found this helpful.","title":"Carrot and stick","content":"What a performance or better performances. It was about the time JK Simmons got recognized (read won an award)! And it couldn't have been a more rewarding role than this. If you are used to your typical musician against all odds film, be aware that this is anything but this blueprint you are used to.We're talking about a power performance (no pun intended) that has been already spoofed a lot, only to show the love for the passion this project had. It is so draining watching some of the stuff, you can only begin to imagine how stressful it must have been for those involved. There is not much light in this, but there doesn't need to be - it's perfect just the way it is (or is it?)"},{"username":"classicsoncall","userUrl":"https://www.imdb.com/user/ur2707735","reviewLink":"https://www.imdb.com/review/rw3376205","warningSpoilers":true,"date":"20 December 2015","rate":"8","helpful":"2 out of 4 found this helpful.","title":"\"You're done.\"","content":"With this picture coming out about a year ago as I write this, and the last few months demonstrating how more and more college campuses are clamoring for 'safety zones' and students finding even the slightest uncomfortable situation offensive, I have to wonder how someone like Fletcher would survive as an instructor today. As Fletcher, J.K. Simmons manages to demonstrate all the worst characteristics of, forget about teachers, but of human beings altogether, on a par with someone like North Korean dictator Kim Jong-un, and he had family members executed when they couldn't keep a beat.Seriously, even though I don't have a musical ear per se, how can one tell if a drummer is drumming too fast or too slow after two seconds, maybe less? That poor schmuck in the orchestra who got tossed when the other guy was the culprit probably went and committed suicide too if the story had followed him out the door. Fletcher's rants about perfection went beyond summoning inspiration and degenerated into nothing less than physical and emotional abuse. That Andrew put up with it and devised his own revenge may not have been the best way to deal with a monster like Fletcher, but at least he came away with a shred of dignity.This is an intense film and if you're not expecting the drama that goes with the story you'll be taken aback by the characters, situations and language that emanates from the players. I think it's a worthwhile film to see if one can keep a perspective on what it takes to achieve mastery of a subject without falling victim to abuse and risking one's health and sanity to do it. Both of the principal players are dynamic and excellent in their roles, and I couldn't help noticing that in certain scenes, Miles Teller had just the right look for the lead role in a movie about the Elvis Presley story."},{"username":"lee_eisenberg","userUrl":"https://www.imdb.com/user/ur4888011","reviewLink":"https://www.imdb.com/review/rw3295042","warningSpoilers":false,"date":"10 August 2015","rate":"10","helpful":"4 out of 5 found this helpful.","title":"music and obsession","content":"J. K. Simmons has played a number of stern, demanding characters during his career. But he gets the role of a lifetime in Damien Chazelle's \"Whiplash\". He plays the brutal instructor of a college jazz band. This man resorts to methods that lapse into abuse. In showing these overly aggressive teaching methods, the movie poses the question of what is the right thing to do when encouraging students to succeed. Brutality is understood to be the only choice when readying cadets for a war zone, but when teaching college students how to play jazz? Simmons won a well deserved Oscar for his performance. Although it was for Best Supporting Actor, the movie belongs to him. Miles Teller's performance as the student is truly secondary to Simmons. His character is one of only a few movie characters in history who made me feel as if I was walking on eggshells."},{"username":"gavin6942","userUrl":"https://www.imdb.com/user/ur1234929","reviewLink":"https://www.imdb.com/review/rw3176363","warningSpoilers":false,"date":"3 February 2015","rate":"8","helpful":"2 out of 5 found this helpful.","title":"An Emotional Punch to the Gut","content":"A promising young drummer (Miles Teller) enrolls at a cut-throat music conservatory where his dreams of greatness are mentored by an instructor (J. K. Simmons) who will stop at nothing to realize a student's potential.This film will take people by surprise. Few viewers likely care about drumming or jazz music today. And they may think this film, therefore, will have no bearing on them. But it is so much more than that, an emotional punch to the gut that hits hard.Holding this together is the interaction of Miles Teller (who seems to be getting less credit than he deserves) and J. K. Simmons (who is getting the praise he ought to be). So intense, and quite the power struggle.Some have disliked the film for its message. But do they really know what its message is?"},{"username":"jboothmillard","userUrl":"https://www.imdb.com/user/ur4248714","reviewLink":"https://www.imdb.com/review/rw3169113","warningSpoilers":true,"date":"24 January 2015","rate":"10","helpful":"2 out of 9 found this helpful.","title":"Whiplash","content":"I saw the trailer for this film and thought it looked good and unusually dark, I liked the fact that the supporting star of Spider-Man was getting a bigger role also, and with award nominations and high praise from critics for it, I knew it was a must see. Basically 19-year-old Andrew Neiman (Rabbit Hole's Miles Teller) attends the prestigious Shaffer Conservatory music school as a first-year jazz student, his skill is drumming, he inspires to be a great drummer like Buddy Rich, and one day he gains the attention of respected professor and conductor Terrence Fletcher (Oscar, BAFTA and Golden Globe winning J.K. Simmons), only for him leave the room with no word. Andrew elsewhere olives with his father Jim (Aliens' Paul Reiser) and they often go to the cinema, it is there he is often served by college student Nicole (Melissa Benoist), and he asks her out and they start dating, and not long later Andrew is approached by Fletcher, he is accepted into his band as an alternative for core drummer Carl Tanner (Nate Lang). Andrew arrives early to his first session, Fletcher arrives and the class practise the Hank Levy piece \"Whiplash\", it is during this that Andrew sees what he is getting himself, as Fletcher is abusive towards the students, mocking and insulting, and when he hears instruments off tune or rhythm off tempo he will hurl a chair, slap and berate. Andrew is determined to impress Fletcher, so he practises constantly at home with his drum kit, to the point where his hands bleed due to sores from the drumsticks, and he breaks up with Nicole thinking she will distract him, and next Andrew attends a local jazz competition, with a misplaced music sheet he claims he can play \"Whiplash\" from memory and he is promoted to main drummer, however core drummer Ryan (Austin Stowell) from a former class replaces him and he is demoted to alternative. In a following class session Fletcher tearfully talks about talented former student Sean Casey who has died in a car accident, after this the band rehearses Juan Tizol piece \"Caravan\", but Carl struggles with tempo, so Fletcher keeps him, Andrew and Ryan in the classroom for several hours until they can perfect their playing, Fletcher finally gives core drummer position to Andrew. Andrew makes his way to a competition, but problems arise as first the bus he is on breaks down, so he rents a car determined to make the performance, arriving late he is kicked out by Fletcher for forgetting his drumsticks, Andrew drives back to the car rental office to retrieve them, speeding back his car is hit by a truck, he survives the accident and crawls from the wreckage badly injured covered in spots of blood, he arrives on stage but is unable to play properly, Fletcher tells him he is \"done\", and Andre attacks him in front of the audience. Andrew is expelled from Shaffer Conservatory music school, a lawyer representing the parents of Sean Casey contacts and explains that Sean hanged himself after suffering severe anxiety and depression, Fletcher's abusive methods are being blamed, Sean's parents want to stop him teaching, Andrew testifies and Fletcher is fired. Months later Andrew sees Fletcher performing in a club, they drink together and Fletcher explains his behaviour, he wants to achieve greatness which is why he pushes his students beyond expectations, he invites Andrew to join his band to perform at a festival concert, Andrew agrees and wants to invite Nicole, but she reveals she has a new boyfriend and cannot come. On stage before the performance, Fletcher tells Andrew he knows he testified against him, the band then begin playing a piece Andrew does not have the music sheet of, leaving him humiliated on stage as he tries to keep up with the tempo. But as Fletcher makes a speech Andrew interrupts with his drumming and he begins playing \"Caravan\", he cues the rest of the band to play along and Fletcher follows suit, Andrew continues an extravagant drum solo, playing non-stop, Fletcher is first angry, but during the play slowly supports him. As the solo ends, they share a smile and Fletcher cues the the finale. Also starring Chris Mulkey as Uncle Frank and Damon Gupton as Mr. Kramer. Teller proves a fantastic newcomer as the student who will not give up on his dreams of becoming a \"great\" and making an impression to his teacher, but the film absolutely belongs to Simmons who is a sensational tour de force as the foul-mouthed maestro who thinks nothing of bringing his students to literal bloodshed to make perfect music. I agree Reiser perhaps could have had a bit more to do, but he cannot stand up against the storming performances of Teller and Simmons. This gives the often made \"inspirational teacher\" plot a good kick in the face, it's like a cross between School of Rock and Full Metal Jacket, with a drillmaster-like composer getting the head of the hero drummer, it is a great combination of terrific music pieces, bad language and blistering mind games, with a marvellous script, it will keep you gripped all the way to the showy ending, I cannot say enough how much I loved this film, an exceptional music drama. It won the Oscars for Best Film Editing and Best Sound Mixing, and it was nominated for Best Motion Picture of the Year and Best Writing, Adapted Screenplay Damien Chazelle, and it won the BAFTA for Best Editing and Best Sound, and it was nominated for Best Original Screenplay and the David Lean Award for Direction for Damien Chazelle. Outstanding!"},{"username":"rmax304823","userUrl":"https://www.imdb.com/user/ur0819382","reviewLink":"https://www.imdb.com/review/rw3502511","warningSpoilers":true,"date":"11 July 2016","rate":"6","helpful":"3 out of 10 found this helpful.","title":"Drum Boogie.","content":"Damien Chazelle directed this story of a talented young drummer (Miles Teller) at an elite music school in New York who is browbeaten mercilessly by his instructor (Dr. Emil Skoda, I mean J. K. Simmons). As unpromising as the material sounds, and as autobiographical, it's better than I'd expected.In the third act, Hamlet has this to say: \"So again good night. I must be cruel only to be kind. Thus bad begins and worse remains behind.\"It applies, not just here but in all training camp films, whether it's the Marine Corps, the Army, the Coast Guard, Navy Flight School, or Harvard Law School. It answers the question: What torture did you go through in order to be successful. It's not often we see a drummer boy put through the wringer. And, man, does Simmons put Teller through the wringer, one organ at a time. Teller practices until he bleeds over the snare drum. And THAT'S not good enough.The typical arc of a story like this has the resentful tyro becoming more mature, tempered like steel, proud and manly, winding up with both the admiration of his mentor and the pretty girl he's been diddling on the side. Sometimes the mentor must die, as John Wayne did in \"Sands of Iwo Jima.\" Not here, though. It's the Big Night, the finale, at Carnegie Hall or the Hippodrome or La Scale or someplace. Teller proves his worth -- MORE than proves it -- and Simmons finally gives him the okay, a big French kiss on the lips. No, no, just kidding. Simmons only smiles at Teller after the drummer's stunning performance.One of the best things about the movie is Teller's relationship with his girl, the earnest and sweet Melissa Benoist, a student at Fordham. They get along quite well, but then Teller calls it off because in his pursuit of perfection there is no room in his life for a woman's demands. What an ass. Yet it's an original touch, because when he's achieved success (or given up) he calls her to renew the relationship but she has to check with her boyfriend. Teller's default position is \"put upon.\" He looks doubtful, sad, mournful even, without a real ability to project anger -- and the script gives him plenty of opportunity. J. K. Simmons makes the picture. He seems to have taken lessons from R. Lee Ermey in \"Full Metal Jacket.\" He's abrasive throughout, foul mouthed and in your face. Nothing you do satisfied him. \"That's not my tempo!\" After he's booted out of Julliard or whatever it's called here, he bumps into Teller and explains why he was so nasty. He claims he was always looking for the next Charlie Parker, a legendary alto saxophonist, somebody who could absorb insults and humiliation and keep on charging ahead, just like Bird did when he started out. You can be pushed beyond your limits and become a genius or you can settle for having done satisfactory work, says Simmons over drinks. \"The worst words in the world are 'Good job.'\" The climax proves him right.Yet, what a dumb perspective, a hubristic paean to Narcissus. As the proverb says, the perfect is the enemy of the good enough. How much should be sacrificed in the search for perfection? Charlie Parker died of drink and drugs at an early age, and for every Charlie Parker there are one hundred thousand guys who are good enough at their jobs.The music we hear isn't classical or pop. Otherwise we'd constantly be hearing \"O, Fortuna\" (Ka-boom). Since drums are the featured instrument it must be jazz. And the jazz isn't really inspired either, I hate to say. It's certainly fast and LOUD enough but it's as if every member of the school band were aiming for Maynard Ferguson's excess. I don't claim to know much about music. I'm less familiar with diminished sevenths than I am with diminished fifths, but I know what I like."},{"username":"Tweekums","userUrl":"https://www.imdb.com/user/ur13977076","reviewLink":"https://www.imdb.com/review/rw3376068","warningSpoilers":true,"date":"20 December 2015","rate":"10","helpful":"1 out of 2 found this helpful.","title":"Blood, sweat and jazz","content":"Protagonist Andrew Neiman is a student at New York's prestigious Shaffer Conservatory. He plays the drums and dreams of being one of the great jazz drummers. The next step to greatness is getting into conductor Terence Fletcher's studio band; Fletcher invites him to attend but when Neiman has difficulty with the tempo of 'Whiplash', Fletcher tears into him at one point he even hurls a chair at him! It is clear that Fletcher expects perfection and will bully and cajole his students to get it. Neiman refuses to back down and practises till his hands bleed will this be enough to impress Fletcher though? Every student knows that they are replaceable as despite his reputation everybody wants to be in Fletcher's band.Before watching this film I'd seen a few clips and thought I probably wouldn't enjoy it as Fletcher appeared to be such an overbearing character who wants to watch somebody being bullied for an hour and a half? Thankfully when I watched it I realised it was far more than that; Fletcher be one of the most intense teachers depicted on film but thanks to J. K. Simmons's brilliant performance he isn't unlikable his methods may be questionable but it is clear that he wants to help his students discover their inner greatness even if only a few will have what it takes. Miles Teller is also great as the equally intense Neiman the student who will do what it takes to be the number one drummer even playing minutes after a car crash that leaves him battered and bloody! The intensity of the music matched that of the situation. The rest of the cast are impressive enough but it is these two that the viewers will remember. Overall I'd highly recommend this although it is an intense experience and won't be for everybody."},{"username":"TxMike","userUrl":"https://www.imdb.com/user/ur0438066","reviewLink":"https://www.imdb.com/review/rw3210563","warningSpoilers":true,"date":"29 March 2015","rate":"","helpful":"4 out of 7 found this helpful.","title":"Best Picture nominee, features a young college drummer with ambitions of greatness.","content":"The movie starts with a drummer in action in a band room at the end of a long, dark hallway. It is the first encounter between student Miles Teller as Andrew and teacher J.K. Simmons as Fletcher. Andrew is a student of great drummers, in a pizza joint with a girl he names the 1930s song playing and the drummer in the band. Attending this prestigious private music school in NYC is to be his springboard to greatness.But while he knew of Fletcher he didn't know what a wild man Fletcher was. Seemingly out of control in his over-the-top criticism of musicians who may be off just a little. And using ethnic and gender slurs to berate them. Such behavior probably would never be tolerated in a real school but it is necessary for the resolution of this story.Paul Reiser is good as the dad, Jim Neimann and cute Melissa Benoist (of Glee and the next Supergirl on TV) is Nicole, a girl Andrew starts dating but stops because he says it will not be compatible with his drive to be the best.JK Simmons won the Oscar for Best Supporting actor and the movie itself was in the running for Best Picture. Many fans think it should have won over \"Birdman.\" The movie is hard to watch at times but it all pays off in the final couple of scenes. SPOILERS: After weeks of on-again, off-again verbal abuse Andrew snaps after failing to perform well after an automobile accident right before the performance. He rushes Fletcher on stage, tackles him, both are bloody, Andrew is kicked out of school. But a family representative of a former student who hanged himself convinced Andrew to witness to Fletcher's behavior, and he was terminated. But in an accidental meeting Fletcher asks Andrew to play drums for a gig, actually setting him up for failure by opening with a number Andrew did not know and didn't have the music for. However next Andrew began to play a hot number, stood up to Fletcher, had the other musicians come in, maybe Fletcher finally had his star."},{"username":"blanche-2","userUrl":"https://www.imdb.com/user/ur0342623","reviewLink":"https://www.imdb.com/review/rw3366051","warningSpoilers":false,"date":"3 December 2015","rate":"10","helpful":"1 out of 2 found this helpful.","title":"who knew","content":"Many of us have watched J.K. Simmons sail through film and television for years. And to think, all this time he had this kind of ability. It reminds me of Melvyn Douglas, second banana in dozens and dozens of films, playing similar roles, and then suddenly becoming one of the greatest actors of our time with Hud and I Never Sang for My Father.Miles Teller and Simmons star in \"Whiplash,\" from 2014 and, no surprise to anyone, Simmons took home the Best Supporting Actor Oscar. He plays Fletcher, a sociopathic, manipulative instructor in a music conservatory who abuses his students psychologically. Teller plays a young man. Andrew, who wants to be a great percussionist, better than any of them, including Buddy Rich and Charlie Parker. He tolerates the abuse and becomes arrogant with success, only to be humiliated by Fletcher. It is a deep psychological battle of wills.If you haven't seen the film, you will not believe the lengths that Andrew goes to in order to be on stage as first drummer.There's a nice turn here by Paul Reiser as Andrew's father.Having been a musician myself and having been psychologically abused by several teachers, I can tell you that this kind of torture is terribly destructive. The only survivors are people who are driven and willing to give everything they have to their music at the expense of everything and everybody else. Is Andrew one of them? You'll have to decide for yourself.Great soundtrack, powerful acting from Teller and Simmons -- this low- grossing film proved to be a real winner."},{"username":"tavm","userUrl":"https://www.imdb.com/user/ur11228318","reviewLink":"https://www.imdb.com/review/rw3231089","warningSpoilers":false,"date":"2 May 2015","rate":"9","helpful":"1 out of 4 found this helpful.","title":"J.K. Simmons deserved his Oscar for his performance in Whiplash","content":"Just watched this on Netflix disc with my mom. She was perhaps puzzled by many scenes especially the ending. She certainly wasn't in love with J.K. Simmons' pretty sadistic music teacher character. Simmons' Oscar-winning role does show quite the range of emotions concerning his wanting his students showing how much excellence-according to him-he wants to get from them. His recounting the story of Charlie Parker and of a former student who died-which he says happened one way but we find out later it was in a much different way-does humanize him in a way that one would feel for him. And Miles Teller is great as the one student who seems obsessed with this teacher in trying to achieve greatness. I also liked his scenes with Paul Reiser as his father. The one question one should probably ask is if the ends of the way the movie goes on justify the means that it achieved when it got there. So on that note, I highly recommend Whiplash."},{"username":"Gordon-11","userUrl":"https://www.imdb.com/user/ur0035842","reviewLink":"https://www.imdb.com/review/rw3161446","warningSpoilers":false,"date":"13 January 2015","rate":"","helpful":"20 out of 32 found this helpful.","title":"Great music, but the plot angers me","content":"This film tells the story of a young drummer who us accepted into the most prestigious music school in New York. The teacher there is very strict, even abusive physically and psychologically. The story then tells how the enmeshed relationship between the two evolve.The music in \"Whiplash\" is great. It's like going to a jazz concert, especially the finale performance at the end. For the plot itself, however, I did not like it at all. The teacher is very abusive, and dies everything he could to stir up rivalry and hatred among his students. The worst thing is that the film gives him time to justify his abuse. Abuse is not right, and the film allows abusers to give twisted reasons to justify something wrong. That really angers me. Coupled with the fact that his students keep on receiving the abuse, it evoked a lot of anger in me."},{"username":"Theo Robertson","userUrl":"https://www.imdb.com/user/ur1532177","reviewLink":"https://www.imdb.com/review/rw3209234","warningSpoilers":false,"date":"27 March 2015","rate":"7","helpful":"34 out of 62 found this helpful.","title":"Intense But The Hype And Awards Possibly Work Against It","content":"Do you know who I am ? \" asks the film's protagonist as the audience are introduced to him Yeah you're that Nazi dude who enjoys raping all the new arrivals at the Oswald State penitentiary . Yes JK Simmons is back playing an Oscar winning role which isn't all that different from the role OZ fans know him for . It's nice to see that this years Oscar nominations were heavily in favour of indie cinema . It's even nicer to know that this is the film my fellow members of this site was the pick of the crop from 2014 film releases so sat back hoping to get blown away by itSo is it any good ? Yes but I should quickly qualify this by stating it's not really the masterwork some people might claim it to be . One criticism THE HURT LOCKER received was that you could easily rework the story as someone who has become addicted to adrenaline . Instead of a bomb disposal man you could have the story involve a fireman who takes more and more risks and so it's the same with WHIPLASH . How about a brutal drill instructor trying to turn weak civvies in to efficient killing machines ? That's already been done a hundred times before and so here we've a reworking of a familiar story in a slightly unfamiliar setting of a music school . It's a slightly predictable story and in order for it not to be so predictable there's a few plot turns involving situations that become rather contrived and unlikely to say the least What stops it all falling apart is director Damien Chazelle using all the tools at his disposal involving editing , sound mix and cinematography to disguise the flaws in the story telling . Certainly many directors nowadays think editing revolves around taking as much cocaine as possible while mutilating any coherent on screen action . The editing style of WHIPLASH is some what showy but is genuinely admirable at the same time . It's nice to actually watch a film and notice the editing while never being irritated by it WHIPLASH is one of the better films of 2014 but it's probably a film that's easier to admire than to like . I did like it but didn't love it and I'm not in a great hurray to watch it again"},{"username":"LeonLouisRicci","userUrl":"https://www.imdb.com/user/ur33374263","reviewLink":"https://www.imdb.com/review/rw3229512","warningSpoilers":false,"date":"30 April 2015","rate":"9","helpful":"1 out of 3 found this helpful.","title":"The Suffering Artist","content":"Unconventional for a Film about Musicians, but Not Uncommon for a Sports or Military Movie, this is a Unique Take on the Disciplined Disciples of an American Art-Form. Miles Teller and J.K. Simmons Play a Student and Teacher Relationship that is the Stuff of Legend but mostly Mythological Methods of Honing Raw Talent into Greatness. The Film is Ripe with Overstated but Eloquent Dialog and Snazzy Musical Accompaniment (when things finally conclude). It is a Rather Rich Display of Impromptu Talent as the Student Drummer has His well Deserved Moment in the Spotlight and makes the most of it.The Film's Detractors are want to Point Out that it is a Dehumanizing Display of a Sadistic Fascist Overlord. But what makes the Film Work is its Off Toned Setting in the Elite Musical Education School that is on the Surface Less than Believable. But what does Surface is the Real Competitive World among Artists and the Sacrifices Needed to Excel. The Movie Never displays Verisimilitude concerning the Methods of Cruel Behavior by the Instructor or wants them to be Authentic but more of a Surreal Statement on the Reality. It is Hyper-Fiction and its Disguise is Evident throughout and Not to be taken Literally.It's a Fresh Film Experience that is Thought-Provoking Inspiring Conversations and Debate. Overall, It's Better than just a \"Good Job\"."},{"username":"writers_reign","userUrl":"https://www.imdb.com/user/ur2567136","reviewLink":"https://www.imdb.com/review/rw3167982","warningSpoilers":true,"date":"17 January 2015","rate":"10","helpful":"3 out of 8 found this helpful.","title":"Sticks And Stones ...","content":"I'm going to aim for a little perspective here. If you click on my user name you'll see that this, when posted, will be the 2650 th film that I've reviewed on IMDb; a little over two and a half thousand movies may seem a fair amount but it's really a drop in the ocean. I joined IMDb in 2003 and became active more or less immediately so now we can factor in another figure, two and a half thousand films in eleven years. but we're still miles off because I was already an adult when I joined IMDb. I was probably carried into my first cinema by one or both of my parents around the age of three and by age five I was able to distinguish genres, actors, etc. By ten I had - for a layman - a pretty good working knowledge of how the things worked. I watched most stuff and good distinguish between Warners, Fox, Metro, Columbia, Paramount, RKO etc, with the best of them. I had little taste for horror, sci-fi. didn't mind the occasional Western but was more at home with mellers, straight drama, comedies, musicals, bio-pics if they dealt with songwriters (Night And Day), performers, (The Jolson Story) or , peripherally, jazz (The Benny Goodman Story, High Society). By the time I penned my first review for IMDb in 2003 I had seen, conservatively, some 5,000 films; and yet I've still only reviewed barely half that number. That's because of a self-imposed rule: I don't trust my memory so any and all films I say PRIOR to 2003 are off limits UNLESS they turn up on television, on DVD, or at a Revival House. Here's where perspective comes in: Whiplash is, no contest, the BEST film with Jazz as a background I have ever seen! Immediately, I sense, I am in trouble with some of you; you, in the second row, the lady with the green scarf. You are, I feel, itching to set me straight and cry \"But Whiplash isn't about Jazz, it' s about Power, it's about Control, it's about Will Success Spoil Rock Hunter ... Stop right there, did I actually say that Whiplash was ABOUT Jazz? No, I did not. I was careful NOT to say so: What I said was 'the best film with jazz as a background'. And I'm happy to stand by that. What we have here are two exceptional acting performances, one merely brilliant and one - in the words of Duke Ellington - beyond excellence, praise, category, any and ev'rything (Okay, Duke, you didn't actually say that back in the day, but you WOULDDA if you'd see Mr. J.K. Simmons, you wouldda, believe me. See, what we have here is a young, sullen-looking Elvis lookalike locking horns with a Col Tom Parker mentor/controller and all we have to do is stand well back. Seems those naysayers were right after all, it's not about jazz."},{"username":"grantss","userUrl":"https://www.imdb.com/user/ur2860723","reviewLink":"https://www.imdb.com/review/rw3201439","warningSpoilers":false,"date":"14 March 2015","rate":"8","helpful":"1 out of 2 found this helpful.","title":"Enthralling story","content":"An enthralling story, set against the backdrop of a prestigious music school. It covers one young man's attempts to reach the top of the musical industry, and the band leader who may be his ticket, or his nemesis.A deeply psychological drama, it explores issues like ambition, obsession and power.Has a few interesting twists too, especially towards the end.Not perfect: some of the twists aren't consistent, character-wise. The final scene overplays the conclusion and is too neat in some ways. Despite this, it missed having a final word on one or two of the themes, leaving these as secondary considerations in favour of a more Hollywoodesque ending.Decent performance by Miles Teller in the lead role. Superb performance by JK Simmons as Fletcher, the band leader. He well deserved his Best Supporting Actor Oscar for a performance that is searingly intense and perfect for the character."}],"errorMessage":""}