{"imDbId":"tt7286456","title":"Joker","fullTitle":"Joker (2019)","type":"Movie","year":"2019","items":[{"username":"Leofwine_draca","userUrl":"https://www.imdb.com/user/ur0482513","reviewLink":"https://www.imdb.com/review/rw6212825","warningSpoilers":true,"date":"28 October 2020","rate":"8","helpful":"35 out of 71 found this helpful.","title":"Good, if derivative","content":"A pretty good movie; not quite the masterpiece that some would have you believe, it's too derivative for that, but it's still worth a watch and there's no denying that Joaquin Phoenix delivers an excellent performance in the title role. My main bone of contention with this film is that it really doesn't need to be tied up to the whole superhero genre, setting up the rivalry with Batman for at least half the running time; it's a better film than that and would have served better as a stand-alone psychological portrait of mental breakdown. Films this seems to have been inspired by include THE MECHANIC, THE KING OF COMEDY and of course TAXI DRIVER."},{"username":"SnoopyStyle","userUrl":"https://www.imdb.com/user/ur2898520","reviewLink":"https://www.imdb.com/review/rw5281316","warningSpoilers":false,"date":"26 November 2019","rate":"8","helpful":"24 out of 42 found this helpful.","title":"great character work","content":"Gotham is in dire difficulties like New York City back in the 70's. Arthur Fleck (Joaquin Phoenix) is a mentally unstable clown. He laughs uncontrollably in stressful times. He gets beaten and robbed by a group of youths. He gets fired from his job. He lives with his unstable sick mom (Frances Conroy) who worked for Thomas Wayne and claims him to be her ex-lover and Arthur's biological father. When Arthur is attacked by three drunken suits in the subway, he shoots them dead. Thomas Wayne is outraged by the killing of these three well-educated pillars of society and announces his campaign for the mayor's office. Arthur has a relationship with his single-mom neighbor Sophie Dumond (Zazie Beetz) and admires talk show host Murray Franklin (Robert De Niro).This is great character work from Joaquin Phoenix. He is one of the great actors working today. Director Todd Phillips is pounding his chest a lot and deserves some praise. I do have a couple of problems with his work. The smaller problem is the continuous shooting of Thomas Wayne and Martha Wayne with her pearls. That scene has been done so many times in the past three decades. It may be better to simply suggest it with a clown walking into the alley with a gun. Don't show the shooting. Just do the sound of the shot and leave. It's all been done before and Phillips should know this. The bigger issue is setting up this world. I think Phillips expected that the audience knows this world as a given. The streets have lots of garbage. There are news reports. Phillips fails to spell it out especially if income inequality is such a big theme in the movie. It needs a Wall Street protest or two. At least, there should be a protest in front of Wayne Tower. The first clown protest against Wayne seems to come out of nowhere. The hatred of the rich needs some background. Overall, this is a great new needed voice in the comic book superhero genre which presents ground to build a new franchise on."},{"username":"Hitchcoc","userUrl":"https://www.imdb.com/user/ur0278527","reviewLink":"https://www.imdb.com/review/rw5531830","warningSpoilers":false,"date":"7 March 2020","rate":"10","helpful":"63 out of 85 found this helpful.","title":"It's About a Man","content":"While I've watched many of the superhero movies that have come down the pike, they are often the same. So the compensation for sensational plots involves great special effects and non-stop action. They are fun and I don't mean to dis them. What is missing is a truly psychological drama. We don't get into the heads of the characters. This film is incredible as we watch a man confront his demons. We see him made fun of, attacked, and beaten. When he responds, he is seen as crazy. He also find that he is diminished in the eye of a counselor, and his mother has kept a secret. I thought it gave us a foundation for the Batman mythos without getting to deeply into it. Acting, atmosphere, and a sophisticated plot makes this a really excellent film."},{"username":"Kirpianuscus","userUrl":"https://www.imdb.com/user/ur61197531","reviewLink":"https://www.imdb.com/review/rw5323387","warningSpoilers":false,"date":"15 December 2019","rate":"","helpful":"22 out of 42 found this helpful.","title":"a mirror","content":"In many aspects, it is a mirror. For society, for viewer, for the way of development of society. Its basic virtues - the splendid performance of Joaquin Phoenix and the beautiful cinematography. And, sure, the ignore of comic book character for feel the film not as portrait but as large cry. The sins - maybe too much \"Taxi Driver\" and the ambition to explain and show everything. The angry, the frustrations, the refuges, the falls of mind and soul are only suggested for be, in real sense, credible. Short, a form of manifesto. Or only a sort of mirror for each of its viewers."},{"username":"boblipton","userUrl":"https://www.imdb.com/user/ur1617546","reviewLink":"https://www.imdb.com/review/rw7410882","warningSpoilers":false,"date":"4 October 2021","rate":"7","helpful":"7 out of 18 found this helpful.","title":"Attention Must Be Paid","content":"In a crumbling Gotham City, where the government has simply given up, failed clown Joaquin Phoenix goes from loser to an acclaimed clown vigilante.This movie is about the creation and rise of Batman villain The Joker. It draws on the societal collapse of the 1970s and 1980s, with references to Bernie Goetz, Robert De Niro present to make the audience think of TAXI DRIVER and his failed and insane comic in THE KING OF COMEDY. It could have been a reference to lend a veneer of cinematic respectability to this movie. Comic books arose, lazily repurposing shards of popular culture for an audience too young to recognize them for what they were, during the depths of the Depression. It was a time that led people to believe that society was in inevitable collapse; large swaths of the 2019 audience believed the same. It could have been obvious and cheap, except for all the trash in the street and Phoenix's committed performance. As it is, with the 1980s standing in for society today, society in the 1930s... Batman is not even present, just his father (who might be Phoenix's father also; emphasizing the duality that keeps being imposed on the relationship), who, it is implied, could do something, but doesn't.... well, it's a thoroughly unlikable and well made movie. Just because I don't like the message, I don't insist on shooting the messenger, even though I've heard this message many times. So the implication is that it's been ignored, and will keep being repeated until attention is paid.If only it didn't glory in the dirt and destruction."},{"username":"Horst_In_Translation","userUrl":"https://www.imdb.com/user/ur3914439","reviewLink":"https://www.imdb.com/review/rw5237364","warningSpoilers":true,"date":"5 November 2019","rate":"6","helpful":"56 out of 107 found this helpful.","title":"Okay movie elevated considerably by its lead performance","content":"This is \"Joker\", a 2019 movie and the title is really telling what/who it is about. But first things first: The director is Todd Phillips and he is also one of several writers working on the screenplay for this 2-hour movie. Phillips is still mostly known for his Hangover films probably and in general for his collaborations with Zach Galifianakis. So gently-speaking, the filmmaker's career is not exactly filled with projects that were received greatly by critics. This one here is no exception either. General movie-goers apparently really loved it, but critics not so much. A bit like Bohemian Rhapsody not too long ago. That one I really adored though, this one here not so much. Still I am a big Joaquin Phoenix fan and as such, it is impossible to give the film a thumbs-down overall. He is the movie. And I am really glad he plays the title character because otherwise I maybe would not have liked it at all. Not just because of personal preference, but also because Phoenix really is that good from beginning to end and he is in almost every scene. Not too long ago, Jared Leto played the Joker (Batman's nemesis) and there was a lot of hype surrounding his turn that quickly vanished because he really did not have too much screen time at all and stayed pale in comparison to Margot Robbie's Harley Quinn. But let's not drift away from this film here now. For Phoenix, all the hype is justified and well-deserved. I think he is still up there and a potential contender for the Oscar win this year with his nomination pretty much a safe deal and I read that it could be between him and Adam Driver and I like both for being slightly oddball, so I certainly approve. Of course with stuff like Her, The Master and my personal favorite Walk the Line under his belt, it is arguable if this one here should be the movie for which he gets a golden statuette, but I still hope he does. If we consider Daniel Day-Lewis retired now, he is probably the best actor working right now and as he is still under 50, that is quite impressive. At least in my opinion, but he is just so consistent and constantly adds depth to his characters in a way where you feel nobody else could have done it this well. He does so much with his eyes. Okay you get the message, I thought he was an amazing Joker.Sadly I cannot say the same about the film itself really. There are good moments here and there, no denying at all, but I was still not satisfied with the script I must say. It felt to me that, most of all, they were taking the safe route basically and going the way where it would obviously be a crowd pleaser, but somehow I must say that the film felt zero daring to me. Even the interactions with the Wayne family that could easily really have been goosebump material, felt a bit shoddy and for the sake of it all. I did like, however, that the way things seemed to turn out we thought it would definitely be the Joker who kills Bruce's father in the end because of the personal connection, but it was just one of his \"army\" eventually and it does not matter who did it. Joker is not really getting his hands dirty at that point anymore, he has others who do so for him. Also pay attention to how everybody who means something to him early on (his mother, De Niro's character most of all) are killed by him. I must say I did wonder though how they did not try to catch him after he strangles his mother. I mean as for the colleague at his apartment, it made more sense because the time between that and the show appearance was perhaps too short. But still the cops were following him and that was accurate. There, however, Clownmania was already going on in full force you could say. Big enough though for police not to go to the studio and arrest him right away? I would say I disagree.In general, this is a film where you can never really be sure how much of it is real and how much just happens in the protagonist's head. Like his relationship with the neighbor, but that is just the obvious one where we know it is fake, even if I did not see it coming. Of course also the relationship between his mother and Mr. Wayne (okay that seemed fairly far-fetched from the beginning, I mean Joker cannot be Batman's half-brother can he?) or the medical condition he has in terms of laughing or the idea about De Niro's character early on almost acting like a father figure to him in front of the camera, which most likely was fake too because there were no references later on that it was not his first time on the show. So this is a film that will certainly play with your head continuously because the only moments you can be 100% sure they are real and actually happening are those that include a great deal of violence, such as the killing of the three young men on the subway. Or the talk show host murder. Or the killing of his mother? Or maybe is that fake too? I mean it is a big step, even if she did invent the relationship with Bruce's dad. He really really cares for her. And he won't kill the colleague who always treated him well. I thought it was a psycho trick that he left the door closed and the guy is too small to reach the knob/key, but no he really just forgot it and lets him go eventually. He is a psychopath yes, but with his very own unpredictable style. Of course, there are aside from that these moments with all the over-the-top laughing, most notably when he visits the comedy show and laughs each and every time everybody else stays quiet and stays quiet himself when they are laughing at the punch lines. Now that was kinda hilarious because of how awkward it felt and also very telling because we saw how he totally did not fit in with everybody else, the average people.Okay, I think this would be pretty much all then. I mentioned some of the scenes that stayed most memorable to me. Maybe, most likely, you have different scenes that fit the description for you and that is perfectly fine because there are so many to pick from. There is hardly one that is really weak and I think the running time was accurate too and I don't say that too often about 2-hour movies that they should not have kept it a bit shorter on some occasions, so you can see it as a compliment. But like I mentioned previously already, those scenes that did stand out mostly did so because of Phoenix giving it his best and not really because of great writing. I think the dialogue writing was still a bit better than the writing of the action and what the characters were doing compared to saying, which sometimes made me forgot about the relatively weak ways in which the story was progressing. This also applies especially to the idea of everybody getting more and more crazy out there somehow. There is a fairly memorable quote from Fleck (Joker in his \"human form\") about that that they really could have made a lot with (also they included it in the trailer) story-wise, but the way they included the clown army for example felt really out of nowhere and it did not make too much sense to me. Okay we get it. Gotham is not at a good place to be right now, but with such a movement you just have to come up with a better explanation and elaboration and lead us there more convincingly. Okay that would be all then I liked and disliked about this film. It certainly won't make it into my top10 movies of the year and if it gets in at the Oscars for Best Picture, that is too much I think, but I wish Phoenix all the luck he can have for upcoming awards season because his turn here can really be described as greatness. There was always a lot of arguing about who's the best Joker. Nicholson? Ledger? Hamill? Romero? There is definitely a new name that can be added to the discussion now. All in all, the film gets a thumbs-up from me."},{"username":"Prismark10","userUrl":"https://www.imdb.com/user/ur4569900","reviewLink":"https://www.imdb.com/review/rw5175849","warningSpoilers":false,"date":"10 October 2019","rate":"6","helpful":"57 out of 151 found this helpful.","title":"Joker","content":"What kind of Joker is this? The kind that cries on the inside.This is a Gotham Horror. Director and co-writer Todd Phillips has gone through Martin Scorsese's filmography ranging from Taxi Driver, The King of Comedy, Bringing Out the Dead to Shutter Island. Robert De Niro appears as a chat show host just to drive home the Scorsese connections.The Joker delivers a bravura performance from Joaquin Phoenix as Arthur Fleck. He is one of life's losers. Unable to hold down a job as a clown and on seven different kinds of medications but he is still a manic depressive.Set in the early 1980s, Gotham City is in the sewers and there are sightings of giant rats. Social services funding cuts means that Fleck is on his own. The social worker who does not even listen to him is not going to be there for him any more.Like Travis Bickle, Fleck snaps and is then reborn as the Joker. The Joker is not political but this nihilistic slow burn drama takes aim at wealthy Democrat and Republican politicians alike.Thomas Wayne might not be painted as a Trump, but he is a rich tycoon who thinks the 'have nots' are clowns. Watch out for the scene when the moguls dressed in tuxedos are watching a screening of Chaplin's Modern Times. A movie that commented on the desperate conditions many people faced during the 1930s Depression.Joker is a bold comic strip adaptation but it is a low wattage film with no plot. It is a tribute act because of the Scorsese movies that inspired it."},{"username":"claudio_carvalho","userUrl":"https://www.imdb.com/user/ur2488512","reviewLink":"https://www.imdb.com/review/rw5350102","warningSpoilers":false,"date":"24 December 2019","rate":"7","helpful":"30 out of 52 found this helpful.","title":"Dark and Depressive","content":"In Gotham City, the clown and aspirant comedian Arthur Fleck (Joaquin Phoenix) is an outcast mentally disturbed man that lives with his deranged mother Penny Fleck (Frances Conroy). When the social service office that attends him is shutdown, Arthur stops his medication and the abusive society drives him crazier to a criminal life.\"Joker\" is a dark and depressive film that discloses a dramatic version of the Joker´s origin. Joaquin Phoenix has a top-notch performance in the role of a mentally disturbed man disregarded by the society with a nervous twitch. His acting makes the viewer recalls and compares with Heath Ledger in \"The Dark Knight\", the best so far. The dark and gruesome cinematography shows a dirty Gotham City with the garbage collector strike. The music score is also spectacular with hits from the 70´s and 80´s. My vote is seven.Title (Brazil): \"Coringa\" (\"Joker\")"},{"username":"bob the moo","userUrl":"https://www.imdb.com/user/ur1002035","reviewLink":"https://www.imdb.com/review/rw6001154","warningSpoilers":true,"date":"16 August 2020","rate":"","helpful":"9 out of 11 found this helpful.","title":"Timely and driven by a great lead performance and cinematic reference, even if it is not as smart as some would have you believe (SPOILER)","content":"Low expectations and subverted expectations play a big part in this film's success, although not the biggest part. The levels of expectation on a DC 'universe' film is now pretty low - to the point that someone with film OCD like myself has not bothered to even dip a toe in recent years; likewise what one expects from a superhero genre origin story is not something like this. The sense of pleasant surprise certainly helped the success of the film, but it is not the main thing.The main reason is the central performance of Phoenix. He is totally committed to selling his character throughout, and even in the weakest moments of narrative, you believe his character in terms of its roots, development, and actions. It is not a film that would normally be associated with awards, but it would be a significant failure were he not to be recognized for how much he delivered and how much he made the film. A secondary reason the film works is its cinematic heritage in the films of Scorsese in so much as it falls between Taxi Driver and King of Comedy. This is not accidental, and the casting deserve a lot of credit of getting actors of the quality of Phoenix and de Niro (although the latter does more as a reference than an actor). With these elements working well, the film produces an engaging origin story that feels responsible but yet fitting the character. I could have done with it stopping just a few seconds earlier than it did, because I'm not sure that the \"maybe it was all imagined\" bit at the end was a good idea.Otherwise, it is enjoyably dark and deliberate, and is driven by Phoenix, even if the film is not as brilliant as some would have you believe."},{"username":"nogodnomasters","userUrl":"https://www.imdb.com/user/ur77881167","reviewLink":"https://www.imdb.com/review/rw5190978","warningSpoilers":true,"date":"16 October 2019","rate":"8","helpful":"10 out of 24 found this helpful.","title":"You get what you deserve.","content":"This film is strictly a character development of Arthur Fleck (Joaquin Phoenix) and how he transformed into The Joker. They could have done this in a number of different ways. In this film, he is a deranged vigilante in the battle of haves vs have nots. We do see Bruce Wayne as a child with Arthur many years his senior. It takes about 90 minutes until the big action happens. I was a bit disappointed when they made Joker brain-damaged rather than a criminal mastermind. The production takes place during the time span of about a month or so. His childhood is discussed, but not shown.Guide: F-word. No sex or nudity. No Batman. No Harley Quinn."},{"username":"Sleepin_Dragon","userUrl":"https://www.imdb.com/user/ur15311310","reviewLink":"https://www.imdb.com/review/rw5389152","warningSpoilers":false,"date":"7 January 2020","rate":"10","helpful":"31 out of 53 found this helpful.","title":"Believe the hype!","content":"The origins of a Monster.If you see one film this year, please see The Joker. It does seem that we are getting constant remakes and origins films, but this is remarkable, I think people are fed up of both mentioned categories because many of the movies we're presented with haven't come up to scratch. The Joker however is phenomenal, the best film I've seen in the cinema for quite some time. I was enthralled from start to finish. The story is fantastic, the writing thoughtful and intelligent.Joaquin Phoenix, what can you say, it's a master class performance from him, he injects everything needed into the part, to make it chilling, sad and menacing. No wonder the awards are flowing.I genuinely cannot remember the last time I left a cinema feeling so rewarded by a film.Incredible. 10/10"},{"username":"kosmasp","userUrl":"https://www.imdb.com/user/ur5876717","reviewLink":"https://www.imdb.com/review/rw5409828","warningSpoilers":false,"date":"15 January 2020","rate":"10","helpful":"19 out of 35 found this helpful.","title":"Not joking ...","content":"Mental health issues are a problem in our society. Or how they are viewed upon and how they are handled. The depiction of a deteriorating mind in this not really comic book movie, is quite something. Even Scorsese would approve I reckon. We're talking about a performance too, that really surprised me. I never thought I'd see another Joker character/actor coming close to what Heath Ledger did over a decade ago.But here we are (or are we? A question for a different time I guess), with a new Joker. But a movie or rather a story that will keep you on your feet. Joaquin is so mesmerizing that I would not be surprised if he got the Oscar. Since the nominations came out, we know this is a possibility, but everyone who watched it, was expecting him getting nominated. That the movie would get 11 nods though ... that was quite unexpected.Not all is as it seems, as with this movie being a drama rather than a \"thrill park ride\". Now that doesn't mean you have to have one thing and not the other. As a big fan of the MCU, I can admit really liking this. Then again, this is not even near the DCU ... don't compare this to something other (be it comic books or like a friend to Parasite, another favorite of mine of 2019) - enjoy it for what it is! A great movie"},{"username":"classicsoncall","userUrl":"https://www.imdb.com/user/ur2707735","reviewLink":"https://www.imdb.com/review/rw5221838","warningSpoilers":true,"date":"29 October 2019","rate":"10","helpful":"22 out of 41 found this helpful.","title":"\"My life is nothing but a comedy.\"","content":"Right out of the gate you can forget about considering this a comic book movie. It may be based on a comic book character, but the character development and story line can be taken right from the pages of modern day horrors brought about by poverty, abusive parents, disrespect for authority, the distance between the haves and the have-nots, and an uncaring society at large. With a plot often times structured on ambiguity, the film explores the troubled mind of one Arthur Fleck, brilliantly portrayed by Joaquin Phoenix in what may eventually go down as the crowning achievement of his acting career. No offense intended to Jokers who have gone before, but Phoenix's take on the character now becomes the standard for others to follow, but virtually impossible to match. I must say, the hype engendered by the film prior to it's release relative to the amount of violence portrayed appears to be seriously overstated. Yes, there is violence on Arthur Fleck's part, all of it gruesome, but it virtually pales in comparison to what one might experience in any chapter of the 'Saw' series for example, or any number of slasher/gore flicks that rely on buckets of blood to 'entertain' fans of that persuasion. Together, director Todd Phillips and Joaquin Phoenix have created a complex character and a complex film dealing with the horrific and sordid side of mental illness that finds it's release in savage, sociopathic behavior. Though he may be called the Joker, as Arthur Fleck himself would surely attest, \"...no one's laughing now\"."},{"username":"lee_eisenberg","userUrl":"https://www.imdb.com/user/ur4888011","reviewLink":"https://www.imdb.com/review/rw5442418","warningSpoilers":true,"date":"28 January 2020","rate":"10","helpful":"11 out of 23 found this helpful.","title":"a new look at the Batman universe","content":"One of the key tenets of superhero franchises is that there are well defined good guys and bad guys. But what if it weren't as simple as that? Todd Phillips's \"Joker\" subverts the genre, casting Batman's nemesis as the protagonist, portraying him as an abused, mentally unstable man at the end of his rope in a socially stratified Gotham City. We also get a different look at the Waynes: far from the upstanding citizen whom we expect, the dad is a heartless creep (servant Alfred isn't much better). It's one of the most intense movies that I've ever seen. Not at all like the comic book adaptations to which we're accustomed. It deserved its Golden Globe wins, and I'd say that it deserves at least one of the Oscars for which it's nominated.In addition to Joaquin Phoenix as the title character, there's also Robert DeNiro as a mean-spirited comic, Frances Conroy (of \"Six Feet Under\" and \"American Horror Story\") as the Joker's infirm mother, and a number of other people."},{"username":"jboothmillard","userUrl":"https://www.imdb.com/user/ur4248714","reviewLink":"https://www.imdb.com/review/rw5188999","warningSpoilers":true,"date":"15 October 2019","rate":"9","helpful":"8 out of 20 found this helpful.","title":"Joker","content":"From the likes of Caesar Romero, Jack Nicholson, Mark Hamill, Heath Ledger, Jared Leto and Zach Galifianakis, the iconic Batman/CD Comics character remains a highly distinctive and challenging role, and this stand-alone (not part of the DC Extended Universe, and no sequel planned, yet) explores his origins, from Oscar, BAFTA and Golden Globe nominated director Todd Phillips (Road Trip, The Hangover, War Dogs). Basically, set in 1981, Gotham City, socially inept and mentally troubled Arthur Fleck (Oscar, BAFTA and Golden Globe winning Joaquin Phoenix) works as a clown-for-hire for a company called Ha-Ha's. He aspires to be a stand-up comedian, like his television hero, comic and talk show host Murray Franklin (Robert De Niro). Arthur lives with his mother, Penny (Frances Conroy) in a place rife with crime and unemployment, with much of the population disenfranchised and impoverished. Arthur suffers from a disorder that causes him to laugh at inappropriate times, he depends on social services for medication, and he is disregarded and mistreated by society. After being attacked in an alley by a gang Arthur's co-worker, Randall (Glenn Fleshler), lends him a gun. Arthur invites his neighbour, single mother Sophie Dumond (Zazie Beetz), to his debut stand-up comedy performance, and they begin dating. While entertaining at a children's hospital, Arthur's gun falls out of his pocket. Randall lies that Arthur bought the gun himself and Arthur is fired. On the subway, still in clown makeup, Arthur is beaten by three drunken Wayne Enterprises businessmen. He takes out the gun and shoots two of the men in self-defence and executes the third. The murders are condemned by billionaire Thomas Wayne (Brett Cullen), a candidate to become mayor of the city. He labels those envious of more successful people as \"clowns\". Demonstrations against Gotham's rich begin, with protesters donning clown masks. The social service program is hit by funding cuts, leaving Arthur without medication. Arthur's comedy show goes poorly; he laughs uncontrollably and has difficulty delivering his jokes. Murray Franklin mocks Arthur by showing clips from the routine on his show. Arthur berates his mother when she reveals the truth, as seen written in a letter to Thomas Wayne, alleging that he may be Thomas' illegitimate son. At Wayne Manor, Arthur talks to Thomas' young son, Bruce (Dante Pereira-Olson), but gets into a scuffle with family butler Alfred Pennyworth (Douglas Hodge) and flees. Following a visit from Gotham Police Detective Burke (Shea Whigham) and Detective Garrity (Bill Camp) who are investigating Arthur's involvement in the train murders, Penny suffers a stroke and is taken to hospital. At a public event, Arthur confronts Thomas, who tells him that Penny is delusional and not his biological mother. In denial, Arthur visits Arkham State Hospital and steals Penny's case file; it reveals that he was adopted as a baby and Penny allowed her abusive boyfriend to harm them both. Penny alleged that Thomas used his influence to fabricate the adoption and commit her to the asylum to hide their affair. Distraught, Arthur goes to the hospital and kills Penny, smothering her with a pillow. He enters Sophie's apartment unannounced; a frightened Sophie tells him to leave; their previous encounters were Arthur's delusions. Arthur is surprised to receive an invitation to appear on Murray's show due to the unexpected popularity of his routine clips. As he prepares, Arthur is visited by Randall and fellow ex-colleague Gary (Celebrity Juice's Leigh Gill). Arthur murders Randall in retaliation for getting him fired but allows Gary to leave unharmed for treating him well in the past. Arthur dyes his hair green, paints his face, and dons a new red suit ready for his performance. On the way to the studio, he is pursued by the two detectives onto a train filled with clown protesters. One accidentally shoots a protester and incites a riot, allowing Arthur to escape in the chaos. Before the show goes live, Arthur requests that Murray introduce him as Joker, a reference to Murray's previous mockery. Arthur walks out to a warm reception but tells morbid jokes. With nothing to lose, he admits that he killed the men on the train, and rants about how society abandons the disenfranchised and how Murray mocked him. Arthur kills Murray and is arrested as riots break out across Gotham. One rioter follows the Wayne family into an alley and murders Thomas and his wife Martha (Carrie Louise Putrello), sparing a traumatized Bruce. Rioters in an ambulance crash into the police car carrying Arthur and free him. He dances to the cheers of the crowd, satisfied that his dedication has finally been achieved. At Arkham, Arthur laughs to himself and tells his psychiatrist she would not understand the joke. He runs from orderlies, leaving a trail of bloody footprints. Also starring Brian Tyree Henry as Carl the Arkham Clerk and Hannah Gross as Young Penny. Phoenix delivers a chilling and compelling as the man who slowly loses his sanity and turns to a life of crime, and De Niro does well with his time onscreen as the man the luckless loner admires and one of the men (along Wayne) he obsesses over. This works well as a character study showing how monsters are made, an origins story about the Dark Knight's arch-nemesis, and a nod to the Martin Scorsese film The King of Comedy (and not just casting De Niro), and it makes room to take a swipe against at healthcare cuts and poverty. It is very controversial and very dark, with its crime elements, moments of violence and brutality, and featuring the song \"Rock and Roll Part 2\" by Gary Glitter (with what we know about the singer, it may be wrong to find this song catchy, but I don't care), and it is at times depressing and uncomfortable, but what else would you expect (?), a gritty and great psychological thriller. It won the Oscar for Best Original Score for Hildur Guðnadóttir, and it was nominated for Best Motion Picture of the Year, Best Adapted Screenplay for Todd Phillips and Scott Silver, Best Cinematography, Best Costume Design, Best Makeup and Hairstyling, Best Film Editing, Best Sound Mixing, and Best Sound Editing, it won the BAFTAs for Original Music, and Best Casting, and it was nominated for Best Film, Best Adapted Screenplay, Best Cinematography, Best Editing, Best Production Design, Best Make Up/Hair, and Best Sound, and it won the Golden Globe for Best Original Score, and it was nominated for Best Motion Picture - Drama. Very good!"},{"username":"Tweekums","userUrl":"https://www.imdb.com/user/ur13977076","reviewLink":"https://www.imdb.com/review/rw7432503","warningSpoilers":false,"date":"11 October 2021","rate":"10","helpful":"8 out of 19 found this helpful.","title":"The definitive Joker","content":"Arthur Fleck is a clown living in Gotham City who isn't doing well. He is employed to hold an advertising banner outside a store but end up being beaten by a bunch of young thugs. His dream is of becoming a professional stand-up comedian. Whenever he gets stressed he can't help laughing. This leads to a confrontation on the subway which as fatal consequences for a trio of Wall Street types. Now the cops are looking for a killer clown. Some Gotham residents feel the victims got what they deserved leading to mayoral candidate billionaire Thomas Wayne describing the people of the city as clowns. Arthur's life becomes increasingly difficult; he learns his mother has been keeping secrets from him, cutbacks mean he loses his access to medication and talk show host Murray Franklin mocks a video of Arthur performing a stand-up routine on his show. It is only a matter of time before Arthur and the city lose control.If you go into this hoping for a fun film with a comically villainous lead you are in for quite a shock. It may be centred on a famous DC comic creation but a few name changes would lead most viewers thinking this was completely unrelated to the world of Batman. The film has a very gritty feel. We may not be told when it is set but everything we see suggests that Gotham is '70s New York. From the use of the old Warner Brothers' logo to the graffiti covered subway train, cars, TVs, indoor smoking and general decor. Joaquin Phoenix is on top form as Fleck; reminding us of De Niro at his 'Taxi Driver' best... a film that clearly helped inspire this. Another clear inspiration is another De Niro film, 'The King of Comedy'... so much so that Robert De Niro himself plays Murray Franklin, he is on fine form here. There are no super-villains (or heroes) here, just a man who is becoming increasingly dangerous and out of control. There isn't a large amount of violence but what there is is brutal, shocking and feels very real. Overall I'd definitely recommend this to anybody wanting a gritty character study; do not be put off if you aren't a fan of 'comic book films' as this is about as far from a typical example as it is possible to be."},{"username":"paul_haakonsen","userUrl":"https://www.imdb.com/user/ur22654354","reviewLink":"https://www.imdb.com/review/rw5248818","warningSpoilers":false,"date":"10 November 2019","rate":"4","helpful":"58 out of 107 found this helpful.","title":"Well, it wasn't my cup of tea...","content":"Right, with all the praise and hype that the 2019 movie \"Joker\" from director Todd Phillips have been getting, this is very much a movie that you'd eventually find your way to watching.I did so too, and let me just say that expectations were high when I sat down to watch \"Joker\". Expectations that the movie didn't live up to. Man, this movie was definitely not my cup of tea.First of all, the pacing of the movie. Talk about being prolonged and dragging on, without nothing much of any real worth happening. Sure Joaquin Phoenix did a great job in his acting performance as Arthur Fleck and the gradual downward sloping trip towards becoming the Joker.But the storyline wasn't really one that did much to get me worked up. Director Todd Phillips took quite his time to get from A to B, and without dishing out much in terms of phenomenal storytelling and movie presentation along the way.There was one scene, a single scene, that was glorious, and it was when Arthur Fleck was on the Murray Franklin show and what happened to Murray Franklin on live TV. That scene actually had me laughing. But the rest of the movie was somewhat of a slow-paced drag to sit through. Sure, it was somewhat entertaining, but awfully slow paced. However, this is hardly a movie that I will be watching a second time around.Aside from Joaquin Phoenix in the lead, the movie also bolstered performances from the likes of Robert De Niro and Frances Conroy, whom individually were adding something good to the movie, just a shame that they didn't have more screen time.I don't understand why critics are so worked up about this movie, I honestly don't. It wasn't all that particularly outstanding or entertaining. Sure, it is a movie about an iconic villain in the DC universe, but that is about as far as it goes.I am rating this overhyped and overrated movie a less than mediocre four out of ten stars."},{"username":"BA_Harrison","userUrl":"https://www.imdb.com/user/ur0945066","reviewLink":"https://www.imdb.com/review/rw5192715","warningSpoilers":true,"date":"16 October 2019","rate":"9","helpful":"11 out of 53 found this helpful.","title":"Heath who?","content":"One in four people will experience mental illness in their lifetime, but only a very small percentage of those will pose any sort of danger to anyone other than themselves. Hopefully, as more people talk about openly about mental health, stigma will decrease, and all those in need of help will get the treatment they require.There will, of course, always be cases that slip through the net with tragic results, people like Arthur Fleck (Joaquin Phoenix), whose fragile psyche is the result of a lifetime of hurt: a victim of child abuse, a victim of violence, a victim of intolerance, a victim of circumstance, a victim of inequality, and a victim of a society that doesn't care. No longer functioning as a rational human being (his access to meds having been taken away), Fleck confuses reality and fantasy, is prone to outbursts of extreme violence, and dances wildly to inappropriate pop music from the '70s.With a tour-de-force performance from Phoenix, whose turn as the green-haired villain is both sympathetic and terrifying, plus stylish direction from Todd Phillips, and an intelligent script that is, by turns, funny, sad, exciting, and horrific, Joker is a refreshingly bold attempt to do something with a well known comic-book character that doesn't involve expensive CGI-laden battles.9/10. The only part that I didn't like was where it is revealed that Arthur's relationship with his pretty neighbour has been a figment of his imagination. I think most people would have got this without the need to spell it out for them."},{"username":"TxMike","userUrl":"https://www.imdb.com/user/ur0438066","reviewLink":"https://www.imdb.com/review/rw5992444","warningSpoilers":false,"date":"14 August 2020","rate":"","helpful":"2 out of 6 found this helpful.","title":"The role that finally won the Oscar for Joaquin Phoenix.","content":"With sections of New York and New Jersey standing in for Gotham City this movie depicts the origin story of The Joker. Joaquin Phoenix is Arthur Fleck, still living in a small apartment with his mother, working menial jobs he can get with the ambition to be a successful stand up comic. But life often deals us hard knocks for no reason at all and Arthur, with his own mental illness driving him, has increasing difficulty handling them. It all comes to a head when on the subway, dressed in his clown suit after a job, when he gets accosted by three Wall Street types.The thing about the actor Phoenix, he always puts himself out there totally, he always has. He is just perfect here, his demeanor, his body language, his facial expressions, even the awkward way he runs. He deserves his Best Actor Oscar.This is set at the time when Bruce Wayne was a young boy, the time that he witnessed his parents being killed in the alley after a theater performance. There is a brief encounter at the gates of the Wayne home, of the eventual Batman and the eventual Joker.I really didn't think I'd like this movie but it really is a fine one, even though fiction of course it shows how mental illness greatly influences the trajectory of one's life. It was also fun to see Robert De Niro as late night show host Murray Franklin, patterned after the old Johnny Carson show, even with a trumpeter as the band leader.I watched it at home on BluRay from my public library, my wife skipped. The disc has a number of worthwhile \"extras.\""},{"username":"BandSAboutMovies","userUrl":"https://www.imdb.com/user/ur69172350","reviewLink":"https://www.imdb.com/review/rw5271469","warningSpoilers":true,"date":"21 November 2019","rate":"3","helpful":"54 out of 111 found this helpful.","title":"Signifying nothing","content":"Why does this movie exist? Who does it exist for? Why do people love it so much?These questions reverberated inside my head as it played in front of me. I was waiting for a moment where I would be awestruck, blasted by its sublime genius that so many people had trumped up or maybe even worried by the philosophy that so many people were worried about.I felt absolutely nothing.Joker might seem like a good movie if you've never seen Taxi Driver or The King of Comedy. But here's my struggle. Those movies have something to say. Something to prove. They aspire to be art when this film is simply commerce.If you think this is a good film, tell me what it has to say. Tell me the meaning of it and why it exists other than, \"The Joker is cool\" or \"This is the Joker's origin story.\" What is the purpose of watching a man's horrible life that never gets better and only gets worse and then the lives he touches get destroyed along the way.I mean, is it a cliche to use that sound and fury signifying nothing quote when this movie is so rote that it uses the song \"White Room\" in perhaps the most obvious of ways? Nothing is unexpected. Nothing is unique. This movie is the definition of wallpaper, albeit wallpaper bought by a tween at Hot Topic because they desperately yearn for something, anything, to make them seem different than the herd while mooing their way through the fields of utter boredom.Director Todd Phillips started his career by directing Hated: GG Allin and the Murder Junkies while he was still a junior at NYU. His second film, Frat House, won the Grand Jury Prize at Sundance before HBO bought it. It never aired, as many of the film's participants claimed they were paid to enact the scenes in the movie.A third film, the Phish-following Bittersweet Motel, was his last documentary before making the movies Road Trip and Old School for producer Ivan Reitman. His career since has been a series of successes, like Starsky & Hutch, School for Scoundrels, Due Date and The Hangover series.Which brings us to this movie.It's written by Scott Silver, who wrote 8 Mile - good - and X-Men Origins: Wolverine - bad. He also wrote The Fighter, which won him an Oscar nomination.I always feel like you should say something nice first.So here's goes.Joaquin Phoenix's performance is great. It's acting desperately searching for a better movie to be in. His goal was to play a character that audiences couldn't identify with - that seems odd for the main role in a movie - studying assassins instead of people who had played the Joker before.He plays Arthur Fleck, who starts out the film as a party clown and aspiring stand-up comedian who lives with his mother Penny (Francis Conroy, every season of American Horror Story). A disorder causes him to laugh out loud for no reason and he depends on the government for his meds.An attack while working as a clown leaves him needing a gun, a gun that falls out of his pocket while working in a children's hospital. He also begins dating his neighbor Sophie (Zazie Beats, who was in Deadpool 2 and Slice) and finds that a video of him on stage has gone viral, ending up on his favorite TV program, The Murray Franklin Show.The fact that Robert DeNiro is inversing his The King of Comedy role, playing Jerry Langford instead of Rupert Pumpkin, is the type of creativity normally reserved for college freshmen who believe they are the first people to ever read Herman Hesse.Arthur is beaten up by three drunken Wayne Enterprises businessmen. He shoots two of them in self-defense before feeling so good about himself that he kills the third. This leads to Thomas Wayne - who Arthur's mother believes is her son's father - denouncing whoever did this killing as a clown.Soon, people are rioting in the streets wearing clown masks and Arthur is finally feeling like his life has meaning. However, two Gotham cops visit his mother, looking for the killer of the businessmen, and she has a stroke. This causes Arthur to either go off the deep end or become sane, as his meds have run out. He realizes that he has no girlfriend and that everything in his mind has been a lie.This brings him to The Murray Franklin Show, where he embraces the name The Joker, inciting another riot that also leads to Joe Chill killing the Waynes inside Crime Alley after a showing of Zorro The Gay Blade. Yes, that really happens.Another potentially crazy person was angered by this movie. Jared Leto, who portrayed the Joker in Suicide Squad and reportedly sent used condoms and dead rats to his co-stars, was alienated and upset by the fact that Warner Brothers was making a Joker movie without him. He even left his agents over this and attempted to get people to cancel this movie.I've heard words like groundbreaking and Oscar being thrown about because of this movie. As a society, we've really devalued those two words, huh?This is a movie that may not even be about the real Joker. It might not even connect to anything. And it's a movie about a man forgotten and thrown away that becomes somebody before being nobody. It's also a waste of two hours of your time.Man, I should work in some other nice things. The cinematography feels large in scope, when so many other films seem small these days. I also loved seeing the old Warner Brothers logo.I mean, this won the Gold Lion at the Venice Film Festival. It also had an eight-minute long standing ovation.I sat there waiting, hoping, struggling to find one moment of entertainment and relevance and walked away saying, \"That was a movie.\" It should be something more.Instead, I'll have to see people wearing this costume and thinking it has some significance. These are the same people who think naming the comedy club \"Pogo's Comedy Club\" is daring because it references John Wayne Gacy instead of hammer soft irony.We deserve better and have become so mired in the dross that we think that movies like this are worth something. I'm not being an elitist - I love popcorn films and if you read this site you know I have a soft spot for Italian horror and 80's slashers - but when I see something that is s***, I have to call it the purest s*** I've seen in years."},{"username":"Gordon-11","userUrl":"https://www.imdb.com/user/ur0035842","reviewLink":"https://www.imdb.com/review/rw5178060","warningSpoilers":false,"date":"11 October 2019","rate":"","helpful":"8 out of 26 found this helpful.","title":"Batman's gonna have a problem","content":"This film tells how the Joker comes to be the villain he is. The problem is that it is so effective and compelling, that I really empathise with the Joker and his horrible life experiences. Batman's father is portrayed as the villain, and the Joker is the victim. It juxtaposes good and bad. How is the next Batman film going to work, when Batman's now the son of the bad guy?"},{"username":"michaelRokeefe","userUrl":"https://www.imdb.com/user/ur0449021","reviewLink":"https://www.imdb.com/review/rw5208994","warningSpoilers":true,"date":"24 October 2019","rate":"9","helpful":"10 out of 26 found this helpful.","title":"More outstanding than the hype!","content":"A masterpiece! Arthur Fleck (Joaquin Phoenix) is a pathetic loser in Gotham's fractured society circa early 1980s. By day a clown-for-hire and by night an aspiring stand-up comic Being a successful comedian he could better care for his sick elderly mother living in a rundown apartment. Arthur has a neurological malady that has him breaking out in screeching laughter at inopportune situations. Suffering humiliation and raw despair, his comedy is flat and tends to lead to violence. When the dysfunctional comic gets his hands on a gun discovers what talent he possess is not for comedy. One bad decision after another brings Fleck to the center of a chain reaction of chaos giving a new origin myth of Batman's notable supervillain opponent...The Joker!.Phoenix's performance is pure brilliance. Also featured are: Robert De Niro, Zazie Beetz, Bill Camp, Shea Willingham, Frances Conroy and Brett Cullen."},{"username":"bevo-13678","userUrl":"https://www.imdb.com/user/ur76062573","reviewLink":"https://www.imdb.com/review/rw5897058","warningSpoilers":false,"date":"11 July 2020","rate":"10","helpful":"9 out of 29 found this helpful.","title":"Funny","content":"A movie about stand up comedy. I like the bit where he accidentally shot the gun"},{"username":"LeonLouisRicci","userUrl":"https://www.imdb.com/user/ur33374263","reviewLink":"https://www.imdb.com/review/rw7324083","warningSpoilers":false,"date":"9 September 2021","rate":"10","helpful":"8 out of 14 found this helpful.","title":"DEPRESSING...DIRE...DEMENTED...DESCRIPTIVE JOKER...DEFINITELY DEFINED","content":"You Asked for Joker...So here He is.A Murderous Monster in Grease-Paint with an Uncontrollable Laugh and Psychosis.This is the Story that Spawned Batman's Arch-Nemesis and the Pit of Hell where He came from.You thought \"The Dark Knight\" was Dark...Get a Load of Joker.Yes, it's a \"Modern\" Incarnation of Man's Dark Side and an Attempt to Explain what Caused this Unfortunate to become A Devil in Disguise.The Film has All the Ingredients of the Macabre, Nightmarish, Horror and Mental Illness that make for a Disturbing Detour to the Mind of a Maniac and What Made Him.Joaquin Phoenix Delivers an Unforgettable Portrayal of the \"Clown Prince of Crime\". In the Performance He Invokes Pathos and the Viewer does Feel the Pangs of Empathy.Someone Said...\"Hate the Sin...Love the Sinner\".The Movie is the Darkest Comic-Book Movie Yet. It's Not Unprecedented in its Paper Origins. There have been Many a Dark Tales in the Batman Universe.The Joker is a Murderer and Batman has Told Him that to His Grinning Face.The Disturbing part here is that We Witness the Suffering and Abuse of the Character and Cannot be Unsympathetic.Many Critics Hate this Unrelenting Trip to the Depths of Despair for Arthur, and seem Upset that the Film has the Audacity to Lay Bare a Soul of Constant Sorrow...\"I have never been happy one minute in my whole life\"...Arthur Fleck/JokerThe Film is an Experience of an Existence of Extremes. It's an Ugly, Dirty Place Gotham. It Reeks of Garbage and is Inhabited by \"Super Rats\".This is the Antithesis of a Marvel Movie and We Deserve it.It's a Dual Universe."},{"username":"writers_reign","userUrl":"https://www.imdb.com/user/ur2567136","reviewLink":"https://www.imdb.com/review/rw5174693","warningSpoilers":true,"date":"9 October 2019","rate":"5","helpful":"28 out of 95 found this helpful.","title":"What The Fleck","content":"For me the best thing about this movie was that finally someone put a bullet where it did the most good - right in the heart of De Niro. Apart from that this was what amounted to a Case study of a sociopath who wasn't playing with a full deck with aspects of so many previous films - Death Wish, Taxi Driver - that it was difficult to locate any 'original' element. Clearly it has its admirers; good luck to them."}],"errorMessage":""}